
&НаКлиенте
Процедура ТаблицаИнтеграцийВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	SystemId = Неопределено;
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("Число") Тогда
		ТаблицаИнтеграций.НайтиПоИдентификатору(ВыбраннаяСтрока).Свойство("SystemId", SystemId);	
	Иначе
		SystemId = ВыбраннаяСтрока.SystemId;	
	КонецЕсли;	
	Оповестить("ВыбранаИнтеграция", SystemId);
	Если ЭтаФорма.Открыта() Тогда
		Закрыть();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии()
	ЗаполнитьТаблицуИнтеграций(МассивИнтеграций);
КонецПроцедуры

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_БазовыеКомпоненты_Form_ВыборИнтеграции_ОсобенностиПлатформы
#КонецОбласти

&НаКлиенте
Процедура НоваяИнтеграция(Элемент)
	Оповестить("ВыбранаИнтеграция", Строка(Новый УникальныйИдентификатор));
	Если ЭтаФорма.Открыта() Тогда
		Закрыть();		
	КонецЕсли;	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("context_params") Тогда
		ЭтаФорма.context_params = Параметры.context_params;	
    КонецЕсли;
   	Если Параметры.Свойство("МассивИнтеграций") Тогда
		ЭтаФорма.МассивИнтеграций = Новый Структура("Значение", Параметры.МассивИнтеграций);	
    КонецЕсли;
КонецПроцедуры

Функция ПредставлениеВерсии1С(ПереданнаяВерсия)
	ЗначениеВерсии = Число(ПереданнаяВерсия);	
	Результат = "";
	Пока ЗначениеВерсии > 0 Цикл 
		ЧастьВерсии = ЗначениеВерсии%10000;
		Если Результат <> "" Тогда
			Результат = "." + Результат;
		КонецЕсли;
		Результат = Строка(ЧастьВерсии) + Результат; 
		ЗначениеВерсии = Цел(ЗначениеВерсии/10000);
	КонецЦикла;	
	Возврат Результат;
КонецФункции	

Процедура ЗаполнитьТаблицуИнтеграций(МассивИнтеграций)
	ТаблицаИнтеграций.Очистить();   
	ЗначениеМассивИнтеграций = get_prop(МассивИнтеграций, "Значение", Новый Массив);
	Для Каждого Запись Из ЗначениеМассивИнтеграций Цикл 
		Если ЗначениеЗаполнено(get_prop(Запись, "parent")) Тогда 
			Продолжить;
		КонецЕсли;  
		Если ТипЗнч(ТаблицаИнтеграций) = Тип("ДанныеФормыКоллекция") Тогда  
			КолонкиТЗ = ТаблицаИнтеграций.Выгрузить().Колонки; 
		Иначе
			КолонкиТЗ = ТаблицаИнтеграций.Колонки;
		КонецЕсли;	
		НоваяЗапись = ТаблицаИнтеграций.Добавить();
		Для Каждого Колонка Из КолонкиТЗ Цикл
			ИмяКолонки = Колонка.Имя; 
			Если ИмяКолонки = "version" Тогда 
				НоваяЗапись[ИмяКолонки] = ПредставлениеВерсии1С(get_prop(Запись, ИмяКолонки));	
			Иначе	
				НоваяЗапись[ИмяКолонки] = get_prop(Запись, ИмяКолонки);
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;		
КонецПроцедуры

