

#Область include_BlocklyExecutor_base_Variables //&НаКлиенте
#КонецОбласти

#Область include_BlocklyExecutor_base_VariableSABYHTTPClient //&НаКлиенте
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_BlocklyExecutor_base_Action //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Транспорт_ВидТранспорта //&НаКлиенте
#КонецОбласти

#Область include_core_base_Helpers //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_КодироватьСтроку
#КонецОбласти

#Область include_BlocklyExecutor_base_Workspace //&НаКлиенте
#КонецОбласти

#Область include_BlocklyExecutor_base_BlockTemplates_SimpleBlock //&НаКлиенте
#КонецОбласти

#Область include_BlocklyExecutor_base_Block //&НаКлиенте
#КонецОбласти

#Область include_IntegrationBlockly_base_BlocksOnClient //&НаКлиенте
#КонецОбласти

#Область include_BlocklyExecutor_base_Helper //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_BlocklyExecutor_base_Helper_GetPropOnServer //&НаСервереБезКонтекста
#КонецОбласти

#Область include_BlocklyExecutor_base_Executor //&НаКлиенте
#КонецОбласти
 
#Область include_BlocklyExecutor_base_Helper_ArrayHelper //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти     

#Область include_core_base_ExtException //&НаСервереБезКонтекста
#КонецОбласти 

#Область include_IntegrationBlockly_base_Blocks //&НаКлиенте
#КонецОбласти

#Область include_BlocklyExecutor_base_Blocks //&НаКлиенте
#КонецОбласти

#Область include_BlocklyExecutor_base_Context //&НаКлиенте
#КонецОбласти 

#Область include_core_base_Helpers_ОбновитьСтруктуру //&НаКлиенте
#КонецОбласти

#Область include_core_base_Helpers_ПреобразованиеТиповТаблицаМассив
#КонецОбласти

#Область include_core_base_Helpers_ПреобразованиеТиповСБИСАПИ3 //&НаКлиенте
#КонецОбласти

#Область include_BlocklyExecutor_base_ЗагрузитьФайлыНаДиск //&НаКлиенте
#КонецОбласти

#Область include_BlocklyExecutor_base_СконвертироватьВПДФА3 //&НаКлиенте
#КонецОбласти   

#Область include_core_base_ОсобенностиПлатформы_МодульОбъекта
#КонецОбласти

#Область include_core_base_Helpers_ПреобразованиеТипов
#КонецОбласти

#Область include_BlocklyExecutor_base_INIOperation //&НаКлиенте
#КонецОбласти 

#Область include_BlocklyExecutor_base_Report //&НаКлиенте
#КонецОбласти

#Область include_BlocklyExecutor_base_Отладка //&НаКлиенте
#КонецОбласти

#Область include_core_base_Helpers_ПрикрепленныеФайлы
#КонецОбласти

#Область include_core_base_Helpers_ПрикрепленныеФайлыЭДО
#КонецОбласти      

#Область include_core_base_ОбщийМодульКонфигурации
#КонецОбласти  

#Область include_core_base_Helpers_ОпределениеТиповКонтента
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключения //&НаКлиенте
#КонецОбласти     

#Область include_core_base_ПроверкаВерсии_ПолучитьИмяФайлаИНомерТекущейВерсии
#КонецОбласти

#Область include_base_НазваниеПродукта
#КонецОбласти  

#Область include_core_base_СтатусыДокументов_МодульОбработки //&НаКлиенте
#КонецОбласти

#Область include_IntegrationBlockly_base_Blocks_Api3Objects //&НаКлиенте
#КонецОбласти

#Область include_core_base_Криптография_БазовыеМеханизмы //&НаКлиенте
#КонецОбласти

#Область include_core_base_Криптография_НаСервере1С   
#КонецОбласти

#Область include_core_base_Криптография_НаКлиенте1С
#КонецОбласти

#Область include_core_base_Криптография_НаКлиенте1С_СинхронныеМетодыНаКлиенте //&НаКлиенте
#КонецОбласти

#Область include_core_base_Криптография_МенеджерКриптографииБазовый //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Криптография_Дистанционная //&НаКлиенте
#КонецОбласти

#Область include_core_base_Криптография_ЛокальнаяНаФорме //&НаКлиенте
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПрогрессОперации //&НаКлиенте
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСерверСКлиента
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_КомандаВыполнитьАвтоматическиеОперации 
#КонецОбласти

#Область include_BlocklyExecutor_base_APIClient //&НаКлиенте
#КонецОбласти

#Область include_BlocklyExecutor_base_Robots //&НаКлиенте
#КонецОбласти

#Область include_core_base_ЗапускМодуля_ПриСозданииНовойИнтеграции //&НаКлиенте
#КонецОбласти

#Область include_BlocklyExecutor_base_API //&НаКлиенте
#КонецОбласти

#Область include_core_base_Helpers_ОбщиеНастройки
#КонецОбласти

#Область include_base_ОбработчикиСобытий_ПриОбновленииСБИС
#КонецОбласти

#Область include_core_base_Helpers_FormGetters //&НаКлиенте
#КонецОбласти

#Область include_core_base_ДлительныеОперации_Модуль //&НаКлиенте
#КонецОбласти

#Область include_core_base_ЭДО_МодульОбработки //&НаКлиенте
#КонецОбласти

#Область include_BlocklyExecutor_base_Commands
#КонецОбласти

#Область include_core_base_Helpers_ДвоичныеДанныеПрикрепленногоФайла
#КонецОбласти

#Область include_core_base_Helpers_ВерсияБСП
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСоСтроками //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_LocalHelper_Session //&НаКлиенте
#КонецОбласти

#Область include_core_base_Helpers_ПоказатьОповещениеПользователя
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ЗапускДлительнойОперации 
#КонецОбласти

&НаКлиенте
Процедура ЗапуститьINIФоновымЗаданием(Контекст) Экспорт
	МодульФоновогоЗаданияКлиент().ЗапуститьINIФоновымЗаданием(Контекст.algorithm, Контекст.ПараметрыВызова,
		Контекст.context_params, ЭтаФорма.ВладелецФормы, Контекст.НазваниеОперации, get_prop(Контекст, "ОповещениеОЗавершении"));
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьINI(Контекст) Экспорт 
	ТипТранспортаСервер = ТранспортИнтеграции.ЭтоСервер();
	Если ТипТранспортаСервер = Истина Тогда
		ЗапуститьINIФоновымЗаданием(Контекст); 
		Возврат;
	КонецЕсли;	
		
	context_param = НастройкиПодключенияПрочитать();

	ПараметрыВызова = ПодготовитьПараметрыЗапускINIФоновымЗаданием(Контекст.algorithm, Контекст.ПараметрыВызова, context_param);
	Результат = API_BLOCKLY_RUN(ПараметрыВызова);
	СтатусВыполнения = get_prop(Результат, "Status", "");
	ТекстОповещения = "";
	Если СтатусВыполнения = "run" Тогда
		Контекст.ПараметрыВызова.Вставить("CurrentBlock", get_prop(Результат, "CurrentBlock",""));
		ОбработчикСледующегоШага = Новый ОписаниеОповещения("ЗапуститьINI", ЭтаФорма, Контекст); 
		ВыполнитьКоманды_Клиент(ОбработчикСледующегоШага, Результат.commands, Результат.commands_data);
		Возврат;
	КонецЕсли;	
	РезультатВыгрузки = get_prop(Результат, "Result");
	Если СтатусВыполнения = "error" Тогда
		КартинкаОповещения = "Ошибка32";
		ТекстОповещения = СокрЛП(РезультатВыгрузки.message) + ". ";
		Если ТипЗнч(РезультатВыгрузки.detail) = Тип("Строка") Тогда
			ТекстОповещения = ТекстОповещения +  СокрЛП(РезультатВыгрузки.detail);
		КонецЕсли;
		// 
		ExtExceptionToJournal(РезультатВыгрузки);
	КонецЕсли;	
	Если СтатусВыполнения = "complete" Тогда
		ТекстОповещения = "Выполнено";		
		КартинкаОповещения = get_prop(РезультатВыгрузки, "Картинка","");
		Если ПустаяСтрока(КартинкаОповещения) Тогда
			КартинкаОповещения = "ЗеленаяГалка";
		КонецЕсли;
		КоличествоОбработано	= get_prop(РезультатВыгрузки, "CountConfirmed", 0);
		ВсегоОбъектов			= get_prop(РезультатВыгрузки, "CountObjects", 0);
		КоличествоОшибок		= get_prop(РезультатВыгрузки, "CountErrors", 0);
		КоличествоИгнорировано	= get_prop(РезультатВыгрузки, "CountIgnored", 0);
		Если	КоличествоОшибок > 0
			ИЛИ КоличествоОшибок + КоличествоОбработано + КоличествоИгнорировано <> ВсегоОбъектов Тогда
			СтатусВыполнения = "error";  
			ТекстОповещения = "Выполнено " + КоличествоОбработано + " из " + ВсегоОбъектов;
			КартинкаОповещения = "Ошибка32";
		КонецЕсли;	
	КонецЕсли;   
	НавигационнаяСсылкаОповещения = Неопределено; 
	МассивОперацийСНавигационнойСсылкой = Новый Массив;
	МассивОперацийСНавигационнойСсылкой.Добавить("Загрузка в " + ЛокализацияНазваниеПродукта());
	МассивОперацийСНавигационнойСсылкой.Добавить("Выгрузка в 1С");
	Если МассивОперацийСНавигационнойСсылкой.Найти(Контекст.НазваниеОперации) <> Неопределено Тогда
		НавигационнаяСсылкаОповещения = АдресСтраницыОтчетОЗагрузке(ПараметрыВызова["params"]["api_url"],
			get_prop(Результат,"ContextId", ""));
        НавигационнаяСсылкаОповещения = ПолучитьПрямуюССылку(НавигационнаяСсылкаОповещения);
	КонецЕсли;
	мСообщений = get_prop(РезультатВыгрузки, "detail", Неопределено);
	Если ТипЗнч(мСообщений) = Тип("Массив") Тогда
		ТекстОповещения_ = ТекстОповещения;
		Для Каждого ДанныеСообщения Из мСообщений Цикл
			ТекстОповещения		= get_prop(ДанныеСообщения, "message") + " " + get_prop(ДанныеСообщения, "detail");
			ПоказатьОповещениеПользователя(ТекстОповещения, НавигационнаяСсылкаОповещения,
				ТекстОповещения,БиблиотекаКартинок[КартинкаОповещения]);
		КонецЦикла;
		ТекстОповещения = ТекстОповещения_;
		Результат.Result.Вставить("detail", "");
	КонецЕсли;
	//Итоговое
	ПоказатьВажноеОповещениеПользователя(Контекст.НазваниеОперации, НавигационнаяСсылкаОповещения,
		ТекстОповещения, БиблиотекаКартинок[КартинкаОповещения]);
КонецПроцедуры

&НаКлиенте
Функция АдресСтраницыОтчетОЗагрузке(URL, extSyncDocId) 
	Возврат URL+"/ext-sync-doc/page/?extSyncDocId="+extSyncDocId; 	 	
КонецФункции

Функция СообщениеПрогресса()
	Возврат "";
КонецФункции 

&НаКлиенте
Процедура ИнициироватьТранспорт(ТранспортПерем = Неопределено) Экспорт
	Если ТранспортПерем <> Неопределено Тогда 
		// BSLLS:UnusedLocalVariable-off
		ТранспортИнтеграции = ТранспортПерем;
		// BSLLS:UnusedLocalVariable-on
	Иначе
		context_param = НастройкиПодключенияПрочитать();
		ТранспортИнтеграции = ПолучитьФормуТранспорта(context_param);
	КонецЕсли	
КонецПроцедуры

Функция ЭтотОбъектНаСервере()
	Возврат ЭтаФорма;
КонецФункции

&НаКлиенте
Функция ЭтотОбъектНаКлиенте() 
	Возврат ЭтаФорма;
КонецФункции

&НаКлиенте 
Функция ЭтоСервер() Экспорт
	context_params = НастройкиПодключенияПрочитать();
	ВидТранспорта = ВидТранспорта(context_params);
	Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда 
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

#Область include_core_base_Helpers_ПолучитьПрямуюСсылку
#КонецОбласти

#Область include_core_base_СтатусыДокументов_КодХраненияСтатусов
#КонецОбласти 

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_Helpers_РаботаСМетаданными //&НаСервереБезКонтекста
#КонецОбласти
