&НаКлиенте
Перем ДокументСБИС, ТранспортИнтеграции, BlocklyExecutor;

#Область include_core_base_ПросмотрДокумента_УстановитьЛокализацию
#КонецОбласти

#Область include_core_base_Задачи_СопоставлениеТиповОбъектов
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Идентификатор 	= Параметры.Идентификатор;
	Документ1С 		= Параметры.Документ1С;
	ИдСБИС			= Параметры.ИдСБИС;
	СсылкаСБИС	 	= Параметры.СсылкаСБИС;
	Сотрудник	 	= СтрЗаменить(Параметры.Сотрудник,Символы.ПС,"; ");
	Название		= Параметры.Название;
	Сотрудник	 	= СтрЗаменить(Параметры.Сотрудник,Символы.ПС,"; ");
	Подразделение	= СтрЗаменить(Параметры.Подразделение,Символы.ПС,"; ");	
	Регламент		= "";
	Примечание      = СтрЗаменить(Параметры.Примечание,Символы.ПС,"; ");
	
	ОбработкаМодуль = МодульОбъекта();
	context_params	= ОбработкаМодуль.ПроверитьНаличиеПараметровПодключения();
	
	УстановитьЛокализацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_param);
	BlocklyExecutor = ПолучитьФормуBlockly();

	Попытка
		ДокументСБИС = ПрочитатьДокумент();
		ДанныеДокументаРегламент = get_prop(ДокументСБИС,"Регламент");
		ЭтаФорма.Название = Тип1СПоТипуБЛ(get_prop(ДокументСБИС,"Тип"), get_prop(ДокументСБИС,"Примечание",""));
		ЭтаФорма.Регламент = get_prop(ДанныеДокументаРегламент,"Название");
		Если не ЗначениеЗаполнено(Подразделение) Тогда
			ПодразделениеВрем = get_prop(ДокументСБИС,"Подразделение");
			ДанныеДокументаПодразделение = get_prop(ДокументСБИС,"ПодразделениеСотрудника", ПодразделениеВрем);
			ЭтаФорма.Подразделение = get_prop(ДанныеДокументаПодразделение,"Название");
		КонецЕсли;
	Исключение
	КонецПопытки;
	ЗаполнитьОсновныеРеквизиты();
	ЗаполнитьДанныеВложенныхФайлов();
	УстановитьДоступностьРеквизитовФормы();
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьДокумент()
	context_param = ПроверитьНаличиеПараметровПодключенияНаСервере(); 
	Документ = Новый Структура("Идентификатор, ПервичныйКлюч, ДопПоля", Идентификатор, ИдСБИС, "Расширение");
	Возврат ТранспортИнтеграции.ПрочитатьДокумент(context_param, Документ);	
КонецФункции

&НаКлиенте
Процедура СообщениеПользователю(ТекстСообщения) Экспорт 

	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = ТекстСообщения;
	СообщениеПользователю.Сообщить();	
	
КонецПроцедуры

//&НаСервере
//Функция ДоступныеДействия(ДокументСБИС)

//	МассивЭтапов = ДокументСБИС.Получить("Этап");
//	
//	Если МассивЭтапов = Неопределено Тогда 
//		Возврат Неопределено;	
//	КонецЕсли;

//	МассивВсехДействий = Новый Массив;
//	
//	Для Каждого ЭлементМассива Из МассивЭтапов Цикл 
//		
//		МассивДействий = ЭлементМассива.Получить("Действие");	
//		Для Каждого ЭлементДействия Из МассивДействий Цикл 	
//			МассивВсехДействий.Добавить(ЭлементДействия);	
//		КонецЦикла;	
//		
//		Возврат МассивВсехДействий;
//		
//	КонецЦикла;
//	
//КонецФункции 

&НаКлиенте
Процедура ЗаполнитьОсновныеРеквизиты()
	_Дата           = ДокументСБИС.Получить("Дата");
	Дата 			= Дата( _Дата + " 00:00:00"); 
	Организация 	= ПолучитьДанныеСтроныДокумента("НашаОрганизация");
	Примечание 		= ?(ЗначениеЗаполнено(Примечание), Примечание, ДокументСБИС.Получить("Примечание"));
	Номер 			= ДокументСБИС.Получить("Номер");
	Тип 			= ДокументСБИС.Получить("Тип");	
	ЭтаФорма.Заголовок = ДокументСБИС.Получить("Название");
	Документ1С = ПолучитьДокумент1С(ДокументСБИС["Идентификатор"]);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРеквизитовФормы()
	Элементы.ОбновитьВСБИС.Доступность = ЗначениеЗаполнено(Документ1С);
КонецПроцедуры


Функция ПолучитьДокумент1С(ИдентификаторВИ)
	ТаблицаИдентификаторов = Новый ТаблицаЗначений;
	ТаблицаИдентификаторов.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка") );
	НовСтрока = ТаблицаИдентификаторов.Добавить();
	НовСтрока.UID = Формат(ИдентификаторВИ, "ЧГ=0");
	МодульОбъекта = МодульОбъекта();
	Идентификаторы = МодульОбъекта.СтатусыДокументовПолучитьСостоянияОбъектов(ТаблицаИдентификаторов);
	Если Идентификаторы.Количество() > 0 Тогда
		Возврат Идентификаторы[0]["LINK"];
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьДанныеВложенныхФайлов()
	
	ПрикрепленныеФайлы.Очистить();
	
	МассивВложений = ДокументСБИС.Получить("Вложение");
	
	Если ТипЗнч(МассивВложений) = Тип("Массив") Тогда 	
		Если МассивВложений.Количество() Тогда 
			
			Для Каждого СтрВложения Из МассивВложений Цикл 
				
				СтрокаФайл = ПрикрепленныеФайлы.Добавить();
				СтрокаФайл.НаименованиеФайла 	= СтрВложения.Получить("Название");
				СтрокаФайл.СсылкаНаHTML 		= СтрВложения.Получить("СсылкаНаHTML"); 
				СтрокаФайл.СсылкаВКабинет 		= СтрВложения.Получить("СсылкаВКабинет");
				СтрокаФайл.СсылкаНаPDF 			= СтрВложения.Получить("СсылкаНаPDF");
					
			КонецЦикла;
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

//&НаКлиенте
//Функция ПолучитьТекущийЭтап()
//	
//	МассивЗначений = get_prop(ДокументСБИС, "Этап");
//	
//	Если МассивЗначений = Неопределено Тогда 
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	Для Каждого ЭлементМассива Из МассивЗначений Цикл 	
//		Возврат get_prop(ЭлементМассива, "Название");	
//	КонецЦикла;

//	Возврат Неопределено;
//	
//КонецФункции

&НаКлиенте
Функция ПолучитьДанныеСтроныДокумента(Название)
    Сторона = get_prop(ДокументСБИС, Название);
	Св = get_prop(Сторона, "СвЮЛ");
	Если Св <> Неопределено Тогда
		Возврат get_prop(Св, "Название");
	КонецЕсли;
	Св = get_prop(Сторона, "СвФл");
	Возврат get_prop(Св, "Название");
КонецФункции

&НаКлиенте
Процедура КомандаДействиеВСБИС(Команда)
	
	СписокДокументовСБИС = Новый Массив();
	СписокДокументов1С = Новый Массив();

	_ДокументСБИС = Новый Структура("Идентификатор, ПервичныйКлюч, Документ1С, ДокументСБИС", 
	Идентификатор, ИдСБИС, Документ1С, ДокументСБИС);	
	СписокДокументовСБИС.Добавить(_ДокументСБИС);

	Если Документ1С <> Неопределено Тогда
		СписокДокументов1С.Добавить(Документ1С);
	КонецЕсли;

	ПараметрыВФорму = Новый Структура("СписокДокументовСБИС, СписокДокументов1С, МожноПереотправитьВСБИС, МожноОбновитьВСБИС", 
	СписокДокументовСБИС, СписокДокументов1С, СписокДокументов1С.Количество() > 0, Истина);
	ОткрытьФорму("Обработка.SABY.Форма.ВыполнитьДействие", ПараметрыВФорму, ЭтаФорма, Новый УникальныйИдентификатор());
		
КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаОповещенияВыбораКнопки(ЗначениеВыбора, ДопПараметры) Экспорт
//	
//	Если ЗначениеВыбора = Неопределено Тогда 
//		Возврат;
//	КонецЕсли;
//	
//	СтруктураТекущегоДействия(ЗначениеВыбора);
//	
//КонецПроцедуры 

//&НаКлиенте
//Процедура СтруктураТекущегоДействия(ЗначениеВыбора)
//	
//	ДанныеДействия = ДействияЗадачи.Получить(ЗначениеВыбора.Значение);	
//	
//	СтруктураДействия = Новый Структура;
//	СтруктураДействия.Вставить("ТребуетРасшифровки", 	ДанныеДействия.ТребуетРасшифровки);
//	СтруктураДействия.Вставить("ТребуетПодписания", 	ДанныеДействия.ТребуетПодписания);
//	СтруктураДействия.Вставить("ТребуетКомментария", 	ДанныеДействия.ТребуетКомментария);
//	СтруктураДействия.Вставить("ТребуетИсполнителя", 	ДанныеДействия.ТребуетИсполнителя);
//	СтруктураДействия.Вставить("ТипПодписи", 	ДанныеДействия.ТипПодписи);
//	СтруктураДействия.Вставить("Название", 		ДанныеДействия.Название);
//	СтруктураДействия.Вставить("Комментарий", 	ДанныеДействия.Комментарий);
//	СтруктураДействия.Вставить("Идентификатор", ДанныеДействия.Идентификатор);
//	СтруктураДействия.Вставить("ИД", Идентификатор);
//	СтруктураДействия.Вставить("Этап", Этап);
//	
//	ОткрытьФорму("ОбщаяФорма.Saby_ВыполнениеДействия", СтруктураДействия, ЭтаФорма);
//		
//КонецПроцедуры
//	 
//&НаКлиенте
//Процедура ЗаполнитьДоступныеДействия()

//	МассивЭтапов = ДокументСБИС.Получить("Этап");
//	
//	Если МассивЭтапов = Неопределено Тогда 
//		Возврат;	
//	КонецЕсли;
//	
//	Для Каждого ЭлементМассива Из МассивЭтапов Цикл 
//		
//		МассивДействий = ЭлементМассива.Получить("Действие");	
//		Для Каждого ЭлементДействия Из МассивДействий Цикл 	
//			
//			СтрокаТаблицыДействий = ДействияЗадачи.Добавить(); 
//			
//			СтрокаТаблицыДействий.Идентификатор = ЭлементДействия.Получить("Идентификатор");
//			СтрокаТаблицыДействий.Комментарий 	= ЭлементДействия.Получить("Комментарий"); 
//			СтрокаТаблицыДействий.Название 		= ЭлементДействия.Получить("Название");
//			СтрокаТаблицыДействий.ТипПодписи = ЭлементДействия.Получить("ТипПодписи");
//			СтрокаТаблицыДействий.ТребуетИсполнителя 	= ЭлементДействия.Получить("ТребуетИсполнителя");
//			СтрокаТаблицыДействий.ТребуетКомментария 	= ЭлементДействия.Получить("ТребуетКомментария");
//			СтрокаТаблицыДействий.ТребуетПодписания 	= ЭлементДействия.Получить("ТребуетПодписания");
//			СтрокаТаблицыДействий.ТребуетРасшифровки 	= ЭлементДействия.Получить("ТребуетРасшифровки");
//			
//		КонецЦикла;	
//		Возврат;	
//	КонецЦикла;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВ1С(Команда)

	СписокКнопок = Новый СписокЗначений();	
    СписокКнопок.Добавить(0, "Выгрузить в 1С");
    СписокКнопок.Добавить(1, "Выгрузить в 1С вложения");
		
	ОписаниеОповещения = Новый ОписаниеОповещения("МенюВыгрузитьВ1СОбработкаОповещения", ЭтаФорма);
	ПоказатьВыборИзМеню(ОписаниеОповещения, СписокКнопок, Элементы.ВыгрузитьВ1С);
	
КонецПроцедуры

&НаКлиенте
Процедура МенюВыгрузитьВ1СОбработкаОповещения(ЗначениеВыбора, ДопПараметры) Экспорт
	
	Если ЗначениеВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеВыбора.Значение = 0 Тогда 	
		ВыгрузитьОбъектВ1С();		
	ИначеЕсли ЗначениеВыбора.Значение = 1 Тогда 	
		ВыгрузитьВложенияНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбъектВ1С()
	ОбрабатываемыеОбъекты = Новый Массив();
	context_params	= Saby_Core.ПроверитьНаличиеПараметровПодключения();	
	мИсполнители = Новый Массив;
	
	ИмяСБИС = get_prop(ДокументСБИС,"Тип");
	ПримечаниеСБИС = get_prop(ДокументСБИС, "Примечание");
	ИдентификаторДокумента = get_prop(ДокументСБИС, "Идентификатор");
	ИмяИзСБИСвАПИ3(ИмяСБИС, ПримечаниеСБИС, ИдентификаторДокумента);
	
	
	API3_ref = Новый Структура; 
	API3_ref.Вставить("SbisId",		ИдСБИС);
	API3_ref.Вставить("SbisType",	ИмяСБИС);
	API3_ref.Вставить("Type",		ИмяСБИС);
	API3_ref.Вставить("Title",		ДокументСБИС.Получить("Название"));
	
	
	ОбрабатываемыеОбъекты.Добавить(API3_ref);
	
	Контекст = Новый Структура;
	Контекст.Вставить("algorithm", "Документы_update");
	Контекст.Вставить("ПараметрыВызова", ОбрабатываемыеОбъекты);
	Контекст.Вставить("context_params", context_params);
	Контекст.Вставить("НазваниеОперации", "Выгрузка в 1С");
	BlocklyExecutor.ЗапуститьINI(Контекст);
	
	//МодульФоновогоЗаданияКлиент().ЗапуститьINIФоновымЗаданием("Документы_update", ОбрабатываемыеОбъекты, context_params, ЭтаФорма.ВладелецФормы, "Выгрузка в 1С");
КонецПроцедуры

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

&НаКлиенте
Процедура ВыгрузитьВложенияНаКлиенте()
	Если Не ЗначениеЗаполнено(Документ1С) Тогда 
		ПоказатьОповещениеПользователя(
			"",,"Данный документ отсутствует в 1С"
			,КартинкаОшибка()
			,СтатусОповещенияПользователя.Важное);
		Возврат; 
	КонецЕсли;//Значит выгрузка не увенчалась успехом
	ВыгружаемыеДокументы	= Новый Массив;
	ВыгружаемыеДокументы.Добавить(Документ1С);
	ПроверкаОбмена = Saby_ВстраиваниеВСтандартныеФормы.ПроисходилЛиОбменДокументов(ВыгружаемыеДокументы);
	Saby_КомандыОбменаДляФормыКлиент.ВыгрузитьВложенияИзСБИС( ПроверкаОбмена.БылОбмен, Новый Структура("Форма", Неопределено) );
КонецПроцедуры

#Область include_core_base_Helpers_ИмяИзСБИСвАПИ3
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьПрямуюСсылку
#КонецОбласти

&НаКлиенте
Процедура ОткрытьВСБИС(Команда)
	СсылкаСБИС = ПолучитьПрямуюССылку(ДокументСБИС["СсылкаДляНашаОрганизация"]);
	#Если ТолстыйКлиентОбычноеПриложение Тогда 
	ЗапуститьПриложение(СсылкаСБИС); 
	#Иначе	
	ПерейтиПоНавигационнойСсылке(СсылкаСБИС);	
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "SabySignOut" Тогда
		Закрыть();
	ИначеЕсли ИмяСобытия <> "Saby_ЗавершениеДлительнойОперации" И ИмяСобытия <> "Saby_ЗавершениеВыполнитьДействие" Тогда
		Возврат; 
	КонецЕсли;
	Документ1С = ПолучитьДокумент1С(ДокументСБИС["Идентификатор"]);
	УстановитьДоступностьРеквизитовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВложения(Команда)
	Если Не ЗначениеЗаполнено(Документ1С) Тогда Возврат; КонецЕсли;
	
	ДокументПереотправить = Новый Массив();
	ДокументПереотправить.Добавить(СтруктураВыгрузкиДокумента(Документ1С));
	ПараметрыВФорму = Новый Структура("Источник", ДокументПереотправить);
	ОткрытьФорму("Обработка.SABY.Форма.ЗагрузкаДокументов",ПараметрыВФорму,ЭтаФорма.ВладелецФормы, Новый УникальныйИдентификатор());
КонецПроцедуры

&НаСервере
Функция СтруктураВыгрузкиДокумента(Документ1С)
	Возврат Новый Структура("Ссылка,UID,ТипМетаданных,ТипОбъекта,ИмяИни", 
							Документ1С.Ссылка,
							Неопределено,
							Документ1С.Ссылка.Метаданные().Имя,
							Неопределено,
							Неопределено); 	
КонецФункции	

#Область include_core_base_Helpers_FormGetters
#КонецОбласти


#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_ExtException
#КонецОбласти

#Область include_base_НазваниеПродукта
#КонецОбласти
                             
#Область include_core_base_ЭДО_Form_ПросмотрДокументаСБИС_ОсобенностиПриложения
#КонецОбласти


#Область include_core_base_ПроверкаВерсии_ПолучитьИмяФайлаИНомерТекущейВерсии
#КонецОбласти

#Область include_core_base_ПроверкаВерсии_НаФорме
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти

#Область include_core_base_ЭДО_Form_ПросмотрДокументаСБИС_ПоказатьВложение
#КонецОбласти


#Область include_core_base_БазовыеКомпоненты_Формы_Browser_BrowserEventsHandler
#КонецОбласти

#Область include_core_base_БазовыеКомпоненты_Формы_Browser_ProductEventsHandler
#КонецОбласти


#Область include_core_base_Helpers
#КонецОбласти


#Область include_core_base_Helpers_XDTO
#КонецОбласти
