
&НаКлиенте
Функция ТекущиеДанныеВложений()
	Возврат Элементы.ПрикрепленныеФайлы.ТекущиеДанные;
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = ТекущиеДанныеВложений();
	ПоказатьВложение(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВложение(ТекущиеДанные)
	ЭтаФорма.АдресСтраницы = "";
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьВложениеНаСервере(ТекущиеДанные.СсылкаВКабинет);
		Элементы.ПолеHTMLдокумента.Заголовок = ТекущиеДанные.НаименованиеФайла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьВложениеНаСервере(Знач АдресСтраницыПредпросмотра)
	// Тикет получаем при открытии формы если нет других открытых форм браузера
	Если context_params <> Неопределено Тогда
		Тикет = "";
		МодульОбъекта = МодульОбъекта();
		Попытка
		   Тикет = МодульОбъекта.ТикетТекущейСессии( context_params ); // если сессия не живая, значит пользователь получит окно аунтентификации
		Исключение
			// ИнфоОбОшибке = ИнформацияОбОшибке();
			// СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
			Возврат;
		КонецПопытки;
		ЭтаФорма.АдресСтраницы = АдресСтраницыПредпросмотра + ?(ЗначениеЗаполнено(Тикет), "&ticket=" + Тикет, "");
		//Обновим время обращения за тикетом
		context_params.Вставить("last_token_time", ТекущаяДатаСеанса());
		МодульОбъекта.НастройкиПодключенияЗаписать(context_params);
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура ОткрытьПросмотрВложения(Команда)
	ТекущиеДанные = ТекущиеДанныеВложений();
	ПоказатьВложение(ТекущиеДанные);
КонецПроцедуры
