
&НаКлиенте
Функция ТекущиеДанныеВложений()
	Возврат Элементы.ПрикрепленныеФайлы.ТекущиеДанные;
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = ТекущиеДанныеВложений();
	ПоказатьВложение(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВложение(ТекущиеДанные)
	АдресВложения = "";
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ТекущиеДанные.СсылкаНаPDF) Тогда
		Возврат;
	КонецЕсли;
	Строка64 = "";
	Попытка
		АдресВложения = ПолучитьВложениеНаСервере(ТекущиеДанные.СсылкаНаPDF);
		ДВДанные = ПолучитьИзВременногоХранилища(АдресВложения);
		УдалитьИзВременногоХранилища(АдресВложения);
		ВременныйФайл = ПолучитьИмяВременногоФайла("pdf");
		ДВДанные.Записать(ВременныйФайл);
		ЗапуститьПриложение(ВременныйФайл);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьВложениеНаСервере(СсылкаНаВложение)
	МодульОбъекта = МодульОбъекта();
	context_param = МодульОбъекта.НастройкиПодключенияПрочитать(); 
	res = МодульОбъекта.local_helper_download_from_link(context_param, СсылкаНаВложение);
	АдресВложения = ПоместитьВоВременноеХранилище(res);
	Возврат АдресВложения;
КонецФункции

&НаКлиенте
Процедура ОткрытьПросмотрВложения(Команда)
	ТекущиеДанные = ТекущиеДанныеВложений();
	ПоказатьВложение(ТекущиеДанные);
КонецПроцедуры

