
&НаКлиенте
Функция ТекущиеДанныеВложений()
	Возврат Элементы.ПрикрепленныеФайлы.ТекущиеДанные;
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = ТекущиеДанныеВложений();
	ПоказатьВложение(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВложение(ТекущиеДанные)
	// Заглушка
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПросмотрВложения(Команда)
	ТекущиеДанные = ТекущиеДанныеВложений();
	ПоказатьВложение(ТекущиеДанные);
КонецПроцедуры
