
&НаКлиенте
Функция ТекущиеДанныеВложений()
	Возврат Элементы.ПрикрепленныеФайлы.ТекущиеДанные;
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = ТекущиеДанныеВложений();
	ПоказатьВложение(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВложение(ТекущиеДанные)
	АдресСтраницы = "";
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьВложениеНаСервере(ТекущиеДанные.СсылкаВКабинет);
		Элементы.ПолеHTMLдокумента.Заголовок = ТекущиеДанные.НаименованиеФайла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьВложениеНаСервере(АдресСтраницыПредпросмотра)
	//Тикет получаем при открытии формы если нет других открытых форм браузера
	Если context_param <> Неопределено Тогда
		Тикет = "";
		МодульОбъекта = МодульОбъекта();
		Попытка
		   Тикет = МодульОбъекта.ПолучитьТикетТекущейСессии( context_param ); // если сессия не живая, значит пользователь получит окно аунтентификации
		Исключение
			ИнфоОбОшибке = ИнформацияОбОшибке();
			СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
			Возврат;
		КонецПопытки;
		АдресСтраницы = АдресСтраницыПредпросмотра + ?(ЗначениеЗаполнено(Тикет), "&ticket=" + Тикет, "");
		//Обновим время обращения за тикетом
		context_param.Вставить("last_token_time", ТекущаяДата());
		МодульОбъекта.НастройкиПодключенияЗаписать(context_param);
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура ОткрытьПросмотрВложения(Команда)
	ТекущиеДанные = ТекущиеДанныеВложений();
	ПоказатьВложение(ТекущиеДанные);
КонецПроцедуры
