
&НаКлиенте
Функция ТекущиеДанныеВложений()
	Возврат Элементы.ПрикрепленныеФайлы.ТекущиеДанные;
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.АдресСтраницы = "";   
	ТекущиеДанные = ТекущиеДанныеВложений(); 
	Если ТекущиеДанные <> Неопределено Тогда 
		Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаHTML) Тогда 
			ТекстHTML = ТранспортИнтеграции.local_helper_download_from_link(context_params, ТекущиеДанные.СсылкаНаHTML, "text");
		Иначе
			ПредставлениеДокумента = "<HTML><BODY scroll=no><table cellspacing=0 cellpadding=0 WIDTH=100% >
															|<tr><td id=Открыть><ins id=Открыть style=""cursor: pointer;"">Открыть в другой программе</ins>
															|</td></tr></table></BODY></HTML>";
			ТекстHTML = ПредставлениеДокумента;
		КонецЕсли;	
		УстановитьHTML("АдресСтраницы", ТекстHTML);
		Элементы.ПолеHTMLдокумента.Заголовок = ТекущиеДанные.НаименованиеФайла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьВложение(ТекущиеДанные)
	ЭтаФорма.АдресСтраницы = "";
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если context_params = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Тикет = "";
	Попытка
	   Тикет = ТранспортИнтеграции.ТикетТекущейСессии( context_params ); // если сессия не живая, значит пользователь получит окно аунтентификации
	Исключение
		Возврат;
	КонецПопытки; 
	АдресСтраницыПредпросмотра = ТекущиеДанные.СсылкаВКабинет;
	АдресСтраницыПредпросмотра = ПолучитьПрямуюССылку(АдресСтраницыПредпросмотра);
	ЭтаФорма.АдресСтраницы = АдресСтраницыПредпросмотра + ?(ЗначениеЗаполнено(Тикет), "&ticket=" + Тикет, "");
	// BSLLS:DeprecatedCurrentDate-off - Вызов на клиенте
	context_params.Вставить("last_token_time", ТекущаяДата());
	// BSLLS:DeprecatedCurrentDate-on
	ТранспортИнтеграции.НастройкиПодключенияЗаписать(context_params);
	Элементы.ПолеHTMLдокумента.Заголовок = ТекущиеДанные.НаименованиеФайла;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПросмотрВложения(Команда)
	ТекущиеДанные = ТекущиеДанныеВложений();
	ПоказатьВложение(ТекущиеДанные);
КонецПроцедуры
