
Процедура ПрогрессФЗСброс(Параметры = Неопределено) Экспорт
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	ПараметрыФЗ	= Новый Структура;
	ПараметрыФЗ.Вставить("Параметры", Параметры);
	ПараметрыФЗ.Вставить("ДополнительныеПараметры", Новый Структура);
	ПараметрыФЗ.Вставить("Статус", "");
	ПараметрыФЗ.Вставить("ИдентификаторЗадания", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ПараметрыФЗ.Вставить("ИнтервалОжидания", 1);
	ПараметрыФЗ.Вставить("КартинкаОповещения", "");
	ПараметрыФЗ.Вставить("ТекстОповещения", "");
	ПрогрессФЗЗаписатьЗначения(ПараметрыФЗ);
КонецПроцедуры

Процедура ПрогрессФЗУстановитьИнтервалОжидания(Интервал) Экспорт
	ПараметрыФЗ = ПрогрессФЗПрочитатьЗначения();
	ПараметрыФЗ.Вставить("ИнтервалОжидания", Интервал);
	ПрогрессФЗЗаписатьЗначения(ПараметрыФЗ);
КонецПроцедуры

Процедура ПрогрессФЗУстановитьСтатус(Статус) Экспорт
	ПараметрыФЗ = ПрогрессФЗПрочитатьЗначения();
	ПараметрыФЗ.Вставить("Статус", Статус);
	ПрогрессФЗЗаписатьЗначения(ПараметрыФЗ);
КонецПроцедуры

Процедура ПрогрессФЗУстановитьПараметры(Параметры) Экспорт
	ПараметрыФЗ = ПрогрессФЗПрочитатьЗначения();
	ПараметрыФЗ.Вставить("Параметры", Параметры);
	ПрогрессФЗЗаписатьЗначения(ПараметрыФЗ);
КонецПроцедуры

Процедура ПрогрессФЗУстановитьДополнительныеПараметры(ДополнительныеПараметры) Экспорт
	ПараметрыФЗ = ПрогрессФЗПрочитатьЗначения();
	ПараметрыФЗ.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ПрогрессФЗЗаписатьЗначения(ПараметрыФЗ);
КонецПроцедуры

Процедура ПрогрессФЗУстановитьИдентификаторЗадания(ИдентификаторЗадания) Экспорт
	ПараметрыФЗ = ПрогрессФЗПрочитатьЗначения();
	ПараметрыФЗ.Вставить("ИдентификаторЗадания", ИдентификаторЗадания);
	ПрогрессФЗЗаписатьЗначения(ПараметрыФЗ);
КонецПроцедуры

Процедура ПрогрессФЗУстановитьКартинкуОповещения(ИмяКартинки) Экспорт
	ПараметрыФЗ = ПрогрессФЗПрочитатьЗначения();
	ПараметрыФЗ.Вставить("КартинкаОповещения", ИмяКартинки);
	ПрогрессФЗЗаписатьЗначения(ПараметрыФЗ);
КонецПроцедуры

Процедура ПрогрессФЗУстановитьТекстОповещения(ТекстОповещения) Экспорт
	ПараметрыФЗ = ПрогрессФЗПрочитатьЗначения();
	ПараметрыФЗ.Вставить("ТекстОповещения", ТекстОповещения);
	ПрогрессФЗЗаписатьЗначения(ПараметрыФЗ);
КонецПроцедуры

Процедура ПрогрессФЗЗаписатьЗначения(Прогресс) Экспорт
	ХранилищеОбщихНастроек.Сохранить("e59a539f-8fa7-49c0-8814-d96dd83a6b3b", "ПрогрессФЗ", Прогресс);
КонецПроцедуры

Функция ПрогрессФЗПрочитатьЗначения() Экспорт
	ПрогрессФЗ = ХранилищеОбщихНастроек.Загрузить("e59a539f-8fa7-49c0-8814-d96dd83a6b3b", "ПрогрессФЗ");
	Если ПрогрессФЗ = Неопределено Тогда
		ПрогрессФЗСброс(Неопределено);
	КонецЕсли;
	Возврат ПрогрессФЗ;
КонецФункции

