#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область include_core_base_Helpers_ЛокализацияНазваниеПродукта
#КонецОбласти
	
Функция ОпределитьТипМетаданных(ОбъектСсылка) Экспорт
	//Так быстрее чем поиск по метаданным всех типов
	МетаданныеФормы = ОбъектСсылка.Метаданные().Формы;
	Если МетаданныеФормы.Найти("ФормаДокумента") <> Неопределено Тогда
		Возврат "Документы";
	ИначеЕсли МетаданныеФормы.Найти("ФормаЭлемента") <> Неопределено Тогда
		Возврат "Справочники";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ОтобратьПоСпискуОбъектов(мОбъекты, Сервис = "", Аккаунт = "") Экспорт
	
	тОбъекты =	Новый ТаблицаЗначений;
	тОбъекты.Колонки.Добавить("Объект", Новый ОписаниеТипов(Метаданные.РегистрыСведений[ПрефиксПродукта() + "Состояние"].Измерения.Объект.Тип.Типы()));
	
	Для Каждого ДокументСсылка Из мОбъекты Цикл
		НовСтрока = тОбъекты.Добавить();
		Если Найти(СокрЛП(ТипЗнч(ДокументСсылка)), "Регистр сведений ключ записи") > 0 Тогда 
			//В корп версии с формы списка сотрудников приходят не ссылки а строки регистра сведений 
			Попытка
				НовСтрока.Объект	= ДокументСсылка.Сотрудник;
			Исключение
				Если НЕ ДокументСсылка = Неопределено Тогда
					НовСтрока.Объект	= ДокументСсылка.Ссылка;
				КонецЕсли;
			КонецПопытки;
		Иначе
			НовСтрока.Объект	= ДокументСсылка;
		КонецЕСли;
	КонецЦикла;

	УстановитьПривилегированныйРежим (Истина);
	Запрос = Новый Запрос;
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	ТЗДок.Объект КАК Объект
		|ПОМЕСТИТЬ ВР_
		|ИЗ
		|	&тОбъекты КАК ТЗДок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_Состояние.Объект КАК Объект,
		|	_Состояние.UID КАК UID,
		|	МАКСИМУМ(_Состояние.Сервис) КАК Сервис,
		|	МАКСИМУМ(_Состояние.Аккаунт) КАК Аккаунт
		|ПОМЕСТИТЬ втСостояние
		|ИЗ
		|	РегистрСведений.Saby_Состояние КАК _Состояние
		|ГДЕ
		|	_Состояние.Сервис В(&Сервисы)
		|	И _Состояние.Аккаунт В(&Аккаунты)
		|
		|СГРУППИРОВАТЬ ПО
		|	_Состояние.Объект,
		|	_Состояние.UID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_.Объект КАК Объект,
		|	ВЫБОР
		|		КОГДА втСостояние.Объект ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОбменСоСбис,
		|	ЕСТЬNULL(втСостояние.UID,Неопределено) КАК UID,
		|	рег_Состояние.Сервис КАК Сервис,
		|	рег_Состояние.Аккаунт КАК Аккаунт,
		|	рег_Состояние.Состояние КАК Состояние,
		|	рег_Состояние.Состояние.ИдентификаторСБИС КАК СостояниеИдСБИС,
		|	рег_Состояние.SbisId КАК SbisId
		|ИЗ
		|	ВР_ КАК ВР_
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСостояние КАК втСостояние
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Saby_Состояние КАК рег_Состояние
		|			ПО втСостояние.Объект = рег_Состояние.Объект
		|				И втСостояние.Сервис = рег_Состояние.Сервис
		|				И втСостояние.Аккаунт = рег_Состояние.Аккаунт
		|		ПО ВР_.Объект = втСостояние.Объект";
	
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "Saby_", ПрефиксПродукта());
	Запрос.Текст = ЗапросТекст;
	Запрос.УстановитьПараметр("тОбъекты", тОбъекты);
	Сервисы = Новый Массив;
	Сервисы.Добавить(Сервис);
	Если ЗначениеЗаполнено(Сервис) Тогда
		Сервисы.Добавить("");
	КонецЕсли;
	Запрос.УстановитьПараметр("Сервисы", Сервисы);
	Аккаунты = Новый Массив;
	Аккаунты.Добавить(Аккаунт);
	Если ЗначениеЗаполнено(Аккаунт) Тогда
		Аккаунты.Добавить("");
	КонецЕсли;
	Запрос.УстановитьПараметр("Аккаунты", Аккаунты);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	//На недалёкое будущее
	//РезультатЗапроса.Колонки.Добавить("ТипМетаданных", Новый ОписаниеТипов("Строка") );
	//РезультатЗапроса.Колонки.Добавить("ТипОбъекта", Новый ОписаниеТипов("Строка") );
	//Для Каждого СтрокаРЗ ИЗ РезультатЗапроса Цикл
	//	СтрокаРЗ.ТипМетаданных	= ОпределитьТипМетаданных(СтрокаРЗ.Объект) ;
	//	СтрокаРЗ.ТипОбъекта		= СтрокаРЗ.Объект.Метаданные().Имя;
	//КонецЦикла;
	
	Возврат РезультатЗапроса;
КонецФункции	
	
Функция ПолучитьСостоянияОбъектов(tUID, Сервис = "", Аккаунт = "") Экспорт

	// входящие параметры - таблица значений ИдСБИС, ИмяСБИС
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	ЗапросТекст =
		"ВЫБРАТЬ
		|	UIDs.UID КАК UID,
		|	ВЫРАЗИТЬ(UIDs.UID КАК СТРОКА(36)) КАК КлючДляСвязи
		|ПОМЕСТИТЬ ВР_UID
		|ИЗ
		|	&мUID КАК UIDs
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_Состояние.Объект КАК Объект,
		|	_Состояние.UID КАК UID,
		|	_Состояние.Сервис КАК Сервис,
		|	_Состояние.Аккаунт КАК Аккаунт,
		|	_Состояние.SbisId КАК SbisId,
		|	ВЫБОР
		|		КОГДА _Состояние.Сервис <> """"
		|				И _Состояние.Аккаунт <> """"
		|			ТОГДА 20
		|		КОГДА _Состояние.Сервис <> """"
		|			ТОГДА 10
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приоритет
		|ПОМЕСТИТЬ втСостояниеCПриоритетом
		|ИЗ
		|	РегистрСведений.Saby_Состояние КАК _Состояние
		|ГДЕ
		|	_Состояние.Сервис В(&Сервисы)
		|	И _Состояние.Аккаунт В(&Аккаунты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСостояниеCПриоритетом.Объект КАК Объект,
		|	втСостояниеCПриоритетом.UID КАК UID,
		|	МАКСИМУМ(втСостояниеCПриоритетом.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ втСостояниеМаксимальныйПриоритет
		|ИЗ
		|	втСостояниеCПриоритетом КАК втСостояниеCПриоритетом
		|
		|СГРУППИРОВАТЬ ПО
		|	втСостояниеCПриоритетом.Объект,
		|	втСостояниеCПриоритетом.UID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСостояниеCПриоритетом.Объект КАК Объект,
		|	втСостояниеCПриоритетом.UID КАК UID,
		|	втСостояниеCПриоритетом.Сервис КАК Сервис,
		|	втСостояниеCПриоритетом.Аккаунт КАК Аккаунт,
		|	втСостояниеCПриоритетом.SbisId КАК SbisId
		|ПОМЕСТИТЬ втСостояниеМаксимум
		|ИЗ
		|	втСостояниеCПриоритетом КАК втСостояниеCПриоритетом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСостояниеМаксимальныйПриоритет КАК втСостояниеМаксимальныйПриоритет
		|		ПО втСостояниеCПриоритетом.Объект = втСостояниеМаксимальныйПриоритет.Объект
		|			И втСостояниеCПриоритетом.UID = втСостояниеМаксимальныйПриоритет.UID
		|			И втСостояниеCПриоритетом.Приоритет = втСостояниеМаксимальныйПриоритет.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСостояниеМаксимум.Объект КАК Объект,
		|	втСостояниеМаксимум.UID КАК UID,
		|	МАКСИМУМ(втСостояниеМаксимум.Сервис) КАК Сервис,
		|	МАКСИМУМ(втСостояниеМаксимум.Аккаунт) КАК Аккаунт,
		|	МАКСИМУМ(втСостояниеМаксимум.SbisId) КАК SbisId
		|ПОМЕСТИТЬ втСостояние
		|ИЗ
		|	втСостояниеМаксимум КАК втСостояниеМаксимум
		|
		|СГРУППИРОВАТЬ ПО
		|	втСостояниеМаксимум.Объект,
		|	втСостояниеМаксимум.UID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_UID.UID КАК UID,
		|	ЕСТЬNULL(втСостояние.Объект, НЕОПРЕДЕЛЕНО) КАК Объект
		|ИЗ
		|	ВР_UID КАК ВР_UID
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСостояние КАК втСостояние
		|		ПО (ВР_UID.КлючДляСвязи = втСостояние.SbisId
		|				ИЛИ ВР_UID.КлючДляСвязи = втСостояние.UID)";

	ЗапросТекст = СтрЗаменить(ЗапросТекст, "Saby_", ПрефиксПродукта());
	Запрос.Текст = ЗапросТекст;
	Запрос.Параметры.Вставить("мUID", tUID);
	Сервисы = Новый Массив;
	Сервисы.Добавить(Сервис);
	Если ЗначениеЗаполнено(Сервис) Тогда
		Сервисы.Добавить("");
	КонецЕсли;
	Запрос.УстановитьПараметр("Сервисы", Сервисы);
	Аккаунты = Новый Массив;
	Аккаунты.Добавить(Аккаунт);
	Если ЗначениеЗаполнено(Аккаунт) Тогда
		Аккаунты.Добавить("");
	КонецЕсли;
	Запрос.УстановитьПараметр("Аккаунты", Аккаунты);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат =  Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Uuid", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Link");
	Результат.Колонки.Добавить("Approved", Новый ОписаниеТипов("Булево, Null"));
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтрока = Результат.Добавить();
		НовСтрока.Uuid = ВыборкаДетальныеЗаписи.UID;
		Если ВыборкаДетальныеЗаписи.Объект = Неопределено
			Или Не ОбщегоНазначения.ЭтоДокумент(ВыборкаДетальныеЗаписи.Объект.Метаданные()) Тогда 
			
			НовСтрока.Approved = Null;
		Иначе 
			НовСтрока.Approved = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Объект, "Проведен");
		КонецЕсли;
		НовСтрока.Link = ВыборкаДетальныеЗаписи.Объект;
	КонецЦикла;

	Возврат Результат;
КонецФункции

Функция ПрочитатьПоРеквизиту(ИмяРеквизита, ЗначениеРеквизита, Сервис = "", Аккаунт = "")
	Запрос = Новый Запрос;
	ЗапросТекст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Состояние.*
		|ИЗ
		|	РегистрСведений.Saby_Состояние КАК _Состояние
		|ГДЕ
		|	1 = 1
		|	И _Состояние.Сервис = &Сервис
		|	И _Состояние.Аккаунт В (&Аккаунты)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Аккаунт УБЫВ
		|";

	ЗапросТекст = СтрЗаменить(ЗапросТекст, "Saby_", ПрефиксПродукта());
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "1 = 1", "_Состояние." + ИмяРеквизита + " = &ЗначениеРеквизита");
	
	Запрос.Текст = ЗапросТекст;
	Запрос.УстановитьПараметр("ЗначениеРеквизита", ЗначениеРеквизита);
	Запрос.УстановитьПараметр("Сервис", Сервис);
	Аккаунты = Новый Массив;
	Аккаунты.Добавить(Аккаунт);
	Если ЗначениеЗаполнено(Аккаунт) Тогда
		Аккаунты.Добавить("");
	КонецЕсли;
	Запрос.УстановитьПараметр("Аккаунты", Аккаунты);
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция ПрочитатьПоОбъекту(ОбъектИС, Сервис = "", Аккаунт = "") Экспорт
	Выборка = ПрочитатьПоРеквизиту("Объект", ОбъектИС, Сервис, Аккаунт);
	Пока Выборка.Следующий() Цикл
		Возврат Выборка;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

Функция Удалить(Объект, Сервис = "", Аккаунт = "") Экспорт
	НаборЗаписей = РегистрыСведений[ПрефиксПродукта() + "Состояние"].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.Сервис.Установить(Сервис);
	НаборЗаписей.Отбор.Аккаунт.Установить(Аккаунт);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);
	Возврат Истина;
КонецФункции

Процедура УдалитьПоUID(UID, Сервис = "", Аккаунт = "", АктивныйЭтап = "", Состояние = Неопределено,
		Объект = Неопределено, ИмяИС = Неопределено, ИдИС = Неопределено) Экспорт
	
	Если Объект = Неопределено Тогда
		Если ИмяИС <> Неопределено и ИдИС <> Неопределено Тогда
			Объект = ПолучитьСсылкуПоИдИС(ИмяИС, ИдИС);
			Удалить(Объект, Сервис, Аккаунт);
		Иначе
			// Удаление нескольких Объектов с одинаковым - UID
			Выборка = ПрочитатьПоUID(UID, Сервис, Аккаунт);
			Пока Выборка.Следующий() Цикл
				Удалить(Выборка.Объект, Сервис, Аккаунт);
			КонецЦикла;
		КонецЕсли;
	Иначе 	
		Удалить(Объект, Сервис, Аккаунт);
	КонецЕсли;
КонецПроцедуры

Функция ПрочитатьПоUID(UID, Сервис = "", Аккаунт = "") Экспорт
	Выборка = ПрочитатьПоРеквизиту("UID", UID, Сервис, Аккаунт);
	Возврат Выборка;
КонецФункции

Процедура ОбновитьПоUID(UID, Сервис = "", Аккаунт = "", АктивныйЭтап = "", Состояние = Неопределено,
		Объект = Неопределено, ИмяИС = Неопределено, ИдИС = Неопределено, СбисИд = Неопределено) Экспорт
		
	Если Объект = Неопределено Тогда
		Если ИмяИС <> Неопределено и ИдИС <> Неопределено Тогда
			Объект = ПолучитьСсылкуПоИдИС(ИмяИС, ИдИС);
			Обновить(UID, Объект, СбисИд, Сервис, Аккаунт, АктивныйЭтап, Состояние);
		Иначе
			// Обновление нескольких Объектов с одинаковым - UID			
			Выборка = ПрочитатьПоUID(UID, Сервис, Аккаунт);
			Пока Выборка.Следующий() Цикл
				
				Если Не ЗначениеЗаполнено(Выборка.Аккаунт) Тогда
					// удаляем предыдущую запись с пустым аккаунтом
					УдалитьПоUID(UID, Сервис);
				Иначе	
					Обновить(UID, Выборка.Объект, СбисИд, Сервис, Аккаунт, АктивныйЭтап, Состояние); 
				КонецЕсли;
			
			КонецЦикла;
		КонецЕсли;
	Иначе 	
		Обновить(UID, Объект, СбисИд, Сервис, Аккаунт, АктивныйЭтап, Состояние);
	КонецЕсли;
КонецПроцедуры

Процедура Обновить(UID, Объект, СбисИд, Сервис = "", Аккаунт = "", АктивныйЭтап = "", Состояние = Неопределено) Экспорт
	
	Если Состояние = Неопределено Тогда
		
		СостояниеСсылка = Справочники[ПрефиксПродукта() + "СостоянияОбъектов"].ПустаяСсылка();
		
	ИначеЕсли ТипЗнч(Состояние) = Тип("СправочникСсылка." + ПрефиксПродукта() + "СостоянияОбъектов") Тогда 	
		
		СостояниеСсылка = Состояние;
		
	Иначе 
	
		СостояниеСсылка = Справочники[ПрефиксПродукта() + "СостоянияОбъектов"].НайтиПоРеквизиту("ИдентификаторСБИС", Число(Состояние));
		
	КонецЕсли;
		
	НаборЗаписей = РегистрыСведений[ПрефиксПродукта() + "Состояние"].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.Сервис.Установить(Сервис);
	НаборЗаписей.Отбор.Аккаунт.Установить(Аккаунт);
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() Тогда
		ЗаписьНабораЗаписей = НаборЗаписей[0];
	Иначе
		ЗаписьНабораЗаписей = НаборЗаписей.Добавить();
		ЗаписьНабораЗаписей.Объект  = Объект;
		ЗаписьНабораЗаписей.Сервис  = Сервис;
		ЗаписьНабораЗаписей.Аккаунт = Аккаунт;
	КонецЕсли;

	ЗаписьНабораЗаписей.АктивныйЭтап = АктивныйЭтап;
	ЗаписьНабораЗаписей.Состояние    = СостояниеСсылка;
	ЗаписьНабораЗаписей.SbisId       = СбисИд;

	Если ЗначениеЗаполнено(UID) Тогда
		ЗаписьНабораЗаписей.UID = UID;
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		// При отсутствии переданного типа в поле регистра "Объект" выводим более понятное сообщение об ошибке
		Если НЕ ЗначениеЗаполнено(ЗаписьНабораЗаписей.Объект) И ЗначениеЗаполнено(Объект) Тогда
			СтруктураИсключенияСтр = NewExtExceptionСтрока(
				ИнфОбОшибке,
				"Ошибка записи в регистр.",
				"Данная версия расширения " + ЛокализацияНазваниеПродукта() + " не поддерживает тип данных: '" 
				+ ТипЗнч(Объект) + "'",
				"Обновление статуса.");
		// Остальные ошибки обрабатываем стандартно
		Иначе
			СтруктураИсключенияСтр = NewExtExceptionСтрока(ИнфОбОшибке, , , "Обновление статуса");
		КонецЕсли;
		ВызватьИсключение СтруктураИсключенияСтр;
	КонецПопытки;
	
КонецПроцедуры

#Область include_core_base_Helpers
#КонецОбласти

#Область include_core_base_Helpers_СоздатьДополнительноеСвойствоСтатусФизЛица
#КонецОбласти

#Область include_core_base_Helpers_СоздатьДополнительноеСвойствоКЭДО
#КонецОбласти

#Область include_base_ОбработчикиСобытий_ПриПервомЗапускеКЭДО
#КонецОбласти

#Область include_base_ОбработчикиСобытий_ПриПервомЗапускеЕТРН
#КонецОбласти

#Область include_base_ОбработчикиСобытий_ПриПервомЗапускеБольничные
#КонецОбласти

#Область include_base_НазваниеПродукта
#КонецОбласти

#Область include_core_base_ЗапускМодуля_ПроверкаВерсии_ПолучитьИмяФайлаИНомерТекущейВерсии
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_Helpers_ExtException
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСоСтроками
#КонецОбласти

#КонецЕсли

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти