#Область include_core_base_Классы_Компоненты_БазовыйКомпонент_БазовыйКомпонент
#КонецОбласти

Функция НовыйКомпонентГрадусник(ЦепочкаДокументов, ИмяНаФорме)

	градусник = НовыйБазовыйКомпонент(ИмяНаФорме);
	ОбъектSABY_УстановитьТип(градусник, "КомпонентГрадусник");

	градусник.Вставить("СписокЭтапов", Новый Массив);

	// Отберем только корректные этапы                                    
	Для Каждого Этап Из get_prop(ЦепочкаДокументов, "Этапы", Новый Массив) Цикл
		Если Не ЗначениеЗаполнено(Этап["Название"])
				Или get_prop(Этап, "СкрытаяФаза") = "Да" Тогда
			Продолжить;
		КонецЕсли;
		градусник.СписокЭтапов.Добавить(Этап);
	КонецЦикла;

	Методы = Новый Структура();
    Методы.Вставить("СформироватьИнтерфейс", "КомпонентГрадусник");
    ОбъектSABY_ЗарегистрироватьМетоды(градусник, Методы);

	Возврат градусник; 

КонецФункции

Функция КомпонентГрадусник_Очистить(градусник)                                       
	
	Элементы.Удалить(ЭтаФорма.Элементы.Найти(градусник.Имя));
	
	Возврат Неопределено;	
	
КонецФункции

Функция КомпонентГрадусник_СформироватьИнтерфейс(градусник, Форма, Родитель, ЭлементПеред)

	Имя = ОбъектSABY_Получить(градусник, "Имя");
	
	Если градусник.СписокЭтапов.Количество() > 0 Тогда
		Контейнер = БазовыйКомпонент_СоздатьКонтейнер(Имя, Форма, Родитель, ЭлементПеред);
		
		Очередность = "ПервыйЭтап";
		Последний_Этап = Неопределено;

		Для Каждого Этап Из градусник.СписокЭтапов Цикл
			
			Если Не Последний_Этап = Неопределено Тогда
				КомпонентГрадусник_СоздатьЭтап(Контейнер, Последний_Этап, Очередность);
				Очередность = "СреднийЭтап";
			КонецЕсли;

			Последний_Этап = Этап;
		КонецЦикла;

		КомпонентГрадусник_СоздатьЭтап(Контейнер, Последний_Этап, "ПоследнийЭтап");

	КонецЕсли;

	Возврат градусник; 

КонецФункции

Функция КомпонентГрадусник_ПараметрыЭтапа(Этап)
	
	// Получаем название безопасно v02 - Структура, vo3 - Соответствие
	НазваниеЭтапа = get_prop(Этап, "Название", "");
	
	// BSLLS:StyleElementConstructors-off для указания конкретного цвета, а не элемента стиля
	
	Если has_prop(Этап, "ДатаНачала") Тогда 
		
		СтатусЭтапа = "Запущен"; 
		ФонГруппы = Новый Цвет(204, 228, 255);
		
	Иначе
		
		СтатусЭтапа = "НеЗапущен"; 
		ФонГруппы = Новый Цвет(234, 234, 234);
		
	КонецЕсли; 
	
	// BSLLS:StyleElementConstructors-on
	
	Если НазваниеЭтапа = "Подписание" Тогда
		
		АктивностьЭтапа = "Завершение";
	
	ИначеЕсли has_prop(Этап, "ДатаКонца")
		Или Не has_prop(Этап, "ДатаНачала") Тогда 
		
		АктивностьЭтапа = ""; 
				
	Иначе
		
		АктивностьЭтапа = "Текущий"; 
		
	КонецЕсли;
	
	ПараметрыЭтапа = Новый Структура;
	ПараметрыЭтапа.Вставить("НазваниеЭтапа", НазваниеЭтапа);
	ПараметрыЭтапа.Вставить("СтатусЭтапа", СтатусЭтапа);
	ПараметрыЭтапа.Вставить("АктивностьЭтапа", АктивностьЭтапа);
	ПараметрыЭтапа.Вставить("ФонГруппы", ФонГруппы);
	
	Возврат ПараметрыЭтапа;
	
КонецФункции

&НаСервере
Процедура КомпонентГрадусник_СоздатьЭтап(Контейнер, Этап, Очередность)  
	
	НазваниеЭтапа = get_prop(Этап, "Название");
	ПараметрыЭтапа = КомпонентГрадусник_ПараметрыЭтапа(Этап);

	// Создаем хвост
	доп_параметры_группы = Новый Структура;
	доп_параметры_группы.Вставить("Высота", 2);

	ГруппаХвост = БазовыйКомпонент_СоздатьКонтейнер("ГруппаХвост_" + НазваниеЭтапа, ЭтаФорма, Контейнер, 
	                                                Неопределено, доп_параметры_группы);
	картинка_хвост = ЭтаФорма.Элементы.Найти("Хвост_" + ПараметрыЭтапа.СтатусЭтапа).КартинкаЗначений;
	БазовыйКомпонент_СоздатьИзображение("Хвост_" + НазваниеЭтапа, ЭтаФорма, 
	                                                        ГруппаХвост, картинка_хвост);
	
	доп_параметры_группы_надпись = Новый Структура;
	доп_параметры_группы_надпись.Вставить("Высота", 2);
	доп_параметры_группы_надпись.Вставить("ЦветФона", ПараметрыЭтапа.ФонГруппы);
	
	ГруппаНадпись = БазовыйКомпонент_СоздатьКонтейнер("ГруппаНадпись_" + НазваниеЭтапа, ЭтаФорма, Контейнер, 
	                                                  Неопределено, доп_параметры_группы_надпись);
	
	доп_параметры_надпись = Новый Структура;  
	доп_параметры_надпись.Вставить("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеЭлемента.Центр);
	доп_параметры_надпись.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложениеЭлемента.Центр); 
	доп_параметры_надпись.Вставить("ВертикальноеПоложение", ВертикальноеПоложениеЭлемента.Центр);
	доп_параметры_надпись.Вставить("ВертикальноеПоложениеВГруппе", ВертикальноеПоложениеЭлемента.Центр);
	
	БазовыйКомпонент_СоздатьНадпись("Надпись_" + НазваниеЭтапа, ЭтаФорма, ГруппаНадпись, 
	                                                      НазваниеЭтапа, Неопределено, доп_параметры_надпись);

	ГруппаОстрие = БазовыйКомпонент_СоздатьКонтейнер("ГруппаОстрие_" + НазваниеЭтапа, ЭтаФорма, Контейнер, 
	                                                 Неопределено, доп_параметры_группы);
	картинка_острие = ЭтаФорма.Элементы.Найти("Острие_" + ПараметрыЭтапа.СтатусЭтапа).КартинкаЗначений;
	БазовыйКомпонент_СоздатьИзображение("Острие_" + НазваниеЭтапа, ЭтаФорма, 
	                                                         ГруппаОстрие, картинка_острие);
	
КонецПроцедуры
