
#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСервер
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщие
#КонецОбласти

#Область include_base_CommonModule_ИменаМодулейСервер
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_ФоновыеЗаданияКлиент_ПроверитьВыполнениеЗадания
#КонецОбласти
	
#Область include_core_base_ДлительныеОперации_ПрогрессОперации
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОсобенностиПродукта
#КонецОбласти

#Область include_BlocklyExecutor_base_Commands
#КонецОбласти

#Область include_core_base_Криптография_НаКлиенте1С_МодульФункции
#КонецОбласти

#Область include_core_base_Криптография_НаКлиенте1С
#КонецОбласти

#Область include_core_base_Криптография_НаКлиенте1С_СинхронныеМетодыНаКлиенте //&НаКлиенте
#КонецОбласти

#Область include_core_base_Криптография_МенеджерКриптографииБазовый //&НаКлиенте
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьПрямуюСсылку
#КонецОбласти

#Область include_core_base_Helpers_КартинкиУспешноОшибка
#КонецОбласти

#Область include_base_CommonModule_ИменаМодулейКлиент
#КонецОбласти

&НаКлиенте
Функция ЭтотОбъектНаКлиенте() 
    Возврат МодульФоновыеЗаданияКлиент();
КонецФункции

Процедура ПереносСтатусовSABY() Экспорт 
	Если Не МодульCore().НеобходимПереносСтатусов() Тогда
		Возврат;
	КонецЕсли;
	ВыполняемыйМетод = "Saby_ФоновыеЗаданияСервер.ПереносСтатусовSABYНаСервере"; 
	ЗаголовокФормы = "Перенос статусов SABY";
	ПараметрыЗадания = Новый Массив();
	ОповещениеОЗакрытииФормыФоновогоЗадания = "ПереносСтатусовSABY";
	
	МодульФоновогоЗаданияКлиент().ОткрытьФормуДлительнойОперации(ВыполняемыйМетод, ПараметрыЗадания, ЗаголовокФормы, 
																	Неопределено, ОповещениеОЗакрытииФормыФоновогоЗадания);	

КонецПроцедуры

#Область include_base_ИмяОбработки
#КонецОбласти
