
#Область Подключаемый_ПроверитьВыполнениеЗадания

&НаКлиенте
Процедура ОбработатьСтатусВыполненияСomplete(ДополнительныеПараметры, ТекстОповещения, КартинкаОповещения)
	Если Не ЗначениеЗаполнено(ТекстОповещения) Тогда
		ТекстОповещения = "Выполнено";
	КонецЕсли;
	
	ДопПараметрыДата = get_prop(ДополнительныеПараметры, "Result");
	КартинкаИмя = get_prop(ДопПараметрыДата, "Картинка");
	Если Не ПустаяСтрока(КартинкаИмя) Тогда
		КартинкаОповещения = БиблиотекаКартинок[КартинкаИмя];
	Иначе
		КартинкаОповещения = КартинкаУспешно();
	КонецЕсли;
	КоличествоОбработано	= get_prop(ДопПараметрыДата, "CountConfirmed", 0);
	ВсегоОбъектов			= get_prop(ДопПараметрыДата, "CountObjects", 0);
	КоличествоОшибок		= get_prop(ДопПараметрыДата, "CountErrors", 0);
	КоличествоИгнорировано	= get_prop(ДопПараметрыДата, "CountIgnored", 0);
	Если	КоличествоОшибок > 0
		ИЛИ КоличествоОшибок + КоличествоОбработано + КоличествоИгнорировано <> ВсегоОбъектов Тогда
		КартинкаОповещения = КартинкаОшибка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтатусВыполнено(ДополнительныеПараметры, ТекстОповещения, КартинкаОповещения)
	СтатусВыполнения = get_prop(ДополнительныеПараметры, "Status");
	
	Если СтатусВыполнения = "run" Тогда
		// Выполняем команду через оповещение
		Контекст = Новый Структура;
		Контекст.Вставить("CurrentBlock", ДополнительныеПараметры.CurrentBlock);
		Контекст.Вставить("ContextId", ДополнительныеПараметры.ContextId);
	
		ВыполнитьКоманды_Клиент(
		Новый ОписаниеОповещения("Подключаемый_ПроверитьВыполнениеЗаданияПослеВыполненияКоманды", ЭтотОбъектНаКлиенте(), Контекст),
		ДополнительныеПараметры.Commands,
		ДополнительныеПараметры.CommandsData);
		
		Возврат;
	КонецЕсли;	
	
	Если СтатусВыполнения = "error" Тогда
		//TODO отвратительно
		РезультатВыгрузки = ДополнительныеПараметры.Result;
		КартинкаОповещения = КартинкаОшибка();
		
		Если ТипЗнч(РезультатВыгрузки.detail) = Тип("Строка") Тогда
			ТекстОповещения = СокрЛП(РезультатВыгрузки.message) + ". " +  СокрЛП(РезультатВыгрузки.detail);
		Иначе	
			ТекстОповещения = СокрЛП(РезультатВыгрузки.message) + ". ";
		КонецЕсли;
		МодульCore().ExtExceptionToJournal(РезультатВыгрузки);   
	КонецЕсли;
	
	Если СтатусВыполнения = "complete" Тогда
		ОбработатьСтатусВыполненияСomplete(ДополнительныеПараметры, ТекстОповещения, КартинкаОповещения);		
	КонецЕсли;
	
	//Сообщений об ошибке может быть несколько
	СообщенияДата = get_prop(ДополнительныеПараметры, "Result");
	мСообщений = Неопределено;
	Если ТипЗнч(СообщенияДата) = Тип("Структура") или ТипЗнч(СообщенияДата) = Тип("Соответствие") Тогда
		мСообщений = get_prop(СообщенияДата, "detail");
	КонецЕсли;
	Если ТипЗнч(мСообщений) = Тип("Массив") Тогда
		ТекстОповещения_ = ТекстОповещения;
		Для Каждого ДанныеСообщения Из мСообщений Цикл
			ТекстОповещения		= get_prop(ДанныеСообщения, "message") + " " + get_prop(ДанныеСообщения, "detail");
		КонецЦикла;
		ТекстОповещения = ТекстОповещения_;
		ДополнительныеПараметры.data.Вставить("detail", "");
	КонецЕсли;
	МодульФоновогоЗаданияСервер().ПрогрессФЗУстановитьКартинкуОповещения(КартинкаОповещения);
	МодульФоновогоЗаданияСервер().ПрогрессФЗУстановитьТекстОповещения(ТекстОповещения);
	ПоказатьОповещение(ДополнительныеПараметры);

КонецПроцедуры
&НаКлиенте
Процедура ОбработатьПрочиеСтатусы(Параметры, ТекстОповещения, ИнтервалОжидания)
	МодульФоновогоЗаданияСервер().ПрогрессФЗУстановитьТекстОповещения(ТекстОповещения);
	Если Параметры.ВыводитьОкноОжидания Тогда
		ИнтервалОжидания15Секунд = 15;
		КоэффициентУвеличенияИнтервалаОжидания = 1.4;
		Если Параметры.Интервал = 0 Тогда
			ИнтервалОжидания = ИнтервалОжидания * КоэффициентУвеличенияИнтервалаОжидания;
			Если ИнтервалОжидания > ИнтервалОжидания15Секунд Тогда
				ИнтервалОжидания = ИнтервалОжидания15Секунд;
			КонецЕсли;
		КонецЕсли;
		ПодключитьОбработчикОжидания(ИмяОбработчкикаФЗ(), ИнтервалОжидания, Истина);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПроверитьВыполнениеЗаданияСтатусОшибка(_Параметры, КраткоеПредставлениеОшибки)
	// Как передавать параметр обратно???
	ОповещениеОЗакрытииФормы = get_prop(_Параметры, "ОповещениеОЗакрытииФормы");
	Если ТипЗнч(ОповещениеОЗакрытииФормы) = Тип("Строка") Тогда
			Оповестить(ОповещениеОЗакрытииФормы);
	КонецЕсли;
	Если ВозвращатьРезультатВОбработкуВыбора() Тогда
		ВызватьИсключение КраткоеПредставлениеОшибки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗадание(Задание)
	ТипСтруктура = Тип("Структура");
	ПараметрыСеансаРасширения = МодульФоновогоЗаданияСервер().ПрогрессФЗПрочитатьЗначения();
	_Параметры				= ПараметрыСеансаРасширения.Параметры;
	ДополнительныеПараметры	= ПараметрыСеансаРасширения.ДополнительныеПараметры;
	ИнтервалОжидания		= ПараметрыСеансаРасширения.ИнтервалОжидания;
	КартинкаОповещения		= ПараметрыСеансаРасширения.КартинкаОповещения;
	ТекстОповещения			= ПараметрыСеансаРасширения.ТекстОповещения;
	Статус = Задание.Статус;
	
	ДополнительныеПараметры_ = get_prop(Задание.Прогресс, "ДополнительныеПараметры");
	Если ТипЗнч(ДополнительныеПараметры) <> ТипСтруктура Тогда
		ДополнительныеПараметры = Новый Структура();
	КонецЕсли;
	
	Если Задание.Прогресс <> Неопределено Тогда
		Если ТипЗнч(ДополнительныеПараметры_) = ТипСтруктура Тогда
			Для Каждого ЗнчКлюч Из ДополнительныеПараметры_ Цикл
				ДополнительныеПараметры.Вставить(ЗнчКлюч.Ключ, ЗнчКлюч.Значение);
			КонецЦикла;
		КонецЕсли;
		ПрогрессСтрокой = ПрогрессСтрокой(Задание.Прогресс);
		Если Не ПустаяСтрока(ПрогрессСтрокой) Тогда
			ТекстОповещения = Задание.Прогресс.Текст;
		КонецЕсли;
	КонецЕсли;
	
	МодульФоновогоЗаданияСервер().ПрогрессФЗУстановитьДополнительныеПараметры(ДополнительныеПараметры);
	
	Если Статус = "Выполнено" Тогда
        ОбработатьСтатусВыполнено(ДополнительныеПараметры, ТекстОповещения, КартинкаОповещения);
		//Итоговое
		Если ВозвращатьРезультатВОбработкуВыбора() Тогда
			Возврат;
		КонецЕсли;
		ПодключитьЗавершающееСообщениеПрогресса(_Параметры, ТекстОповещения, ИнтервалОжидания);
		Возврат;
	ИначеЕсли Статус = "Ошибка" Тогда
		ПроверитьВыполнениеЗаданияСтатусОшибка(_Параметры, Задание.КраткоеПредставлениеОшибки);
		ПодключитьЗавершающееСообщениеПрогресса(_Параметры, ТекстОповещения, ИнтервалОжидания);
		Возврат;
	Иначе
		ОбработатьПрочиеСтатусы(_Параметры, ТекстОповещения, ИнтервалОжидания);	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодключитьПроверкуВыполненияЗадания(_Параметры, ТекстОповещения, ИнтервалОжидания = 1)
	КоэффициентУвеличенияИнтервалаОжидания = 1.4;
	ИнтервалОжидания15Секунд = 15;
	МодульФоновогоЗаданияСервер().ПрогрессФЗУстановитьТекстОповещения(ТекстОповещения);
	Если _Параметры.ВыводитьОкноОжидания Тогда
		Если _Параметры.Интервал = 0 Тогда
			ИнтервалОжидания = ИнтервалОжидания * КоэффициентУвеличенияИнтервалаОжидания;
			Если ИнтервалОжидания > ИнтервалОжидания15Секунд Тогда
				ИнтервалОжидания = ИнтервалОжидания15Секунд;
			КонецЕсли;
			МодульФоновогоЗаданияСервер().ПрогрессФЗУстановитьИнтервалОжидания(ИнтервалОжидания);
		КонецЕсли;
		ПодключитьОбработчикОжидания(ИмяОбработчкикаФЗ(), ИнтервалОжидания, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте          
Процедура ПодключитьЗавершающееСообщениеПрогресса(_Параметры, ТекстОповещения, ИнтервалОжидания = 1)
	МодульФоновогоЗаданияСервер().ПрогрессФЗУстановитьТекстОповещения(ТекстОповещения);
	Если _Параметры.ВыводитьОкноОжидания Тогда
		ИнтервалОжидания15Секунд = 15;
		КоэффициентУвеличенияИнтервалаОжидания = 1.4;
		Если _Параметры.Интервал = 0 Тогда
			ИнтервалОжидания = ИнтервалОжидания * КоэффициентУвеличенияИнтервалаОжидания;
			Если ИнтервалОжидания > ИнтервалОжидания15Секунд Тогда
				ИнтервалОжидания = ИнтервалОжидания15Секунд;
			КонецЕсли;
			МодульФоновогоЗаданияСервер().ПрогрессФЗУстановитьИнтервалОжидания(ИнтервалОжидания);
		КонецЕсли;
		ПодключитьОбработчикОжидания(ИмяОбработчикаЗавершающееСообщениеПрогресса(), ИнтервалОжидания, Истина);
	КонецЕсли;
	Если _Параметры.Свойство("ОповещениеОЗакрытииФормы") Тогда
		Оповестить(_Параметры.ОповещениеОЗакрытииФормы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания() Экспорт
	ФормаЗакрывается = Ложь;
	
	Задание = МодульФоновогоЗаданияСервер().ПроверитьЗаданиеВыполнено(ФормаЗакрывается);
	Статус = Задание.Статус;
	МодульФоновогоЗаданияСервер().ПрогрессФЗУстановитьСтатус(Статус);
	
	Подключаемый_ОбработатьЗадание(Задание);
					
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗаданияПослеВыполненияКоманды(commands_result, Контекст) Экспорт
	
	_Параметры = МодульФоновогоЗаданияСервер().ПрогрессФЗПрочитатьЗначения().Параметры;
	
	_Параметры.ФоновоеЗаданиеПараметры[0].ПараметрыВыполнения["CommandsResult"] = commands_result;
	_Параметры.ФоновоеЗаданиеПараметры[0].ПараметрыВыполнения.Вставить("CurrentBlock", Контекст.CurrentBlock);
	_Параметры.ФоновоеЗаданиеПараметры[0].ПараметрыВыполнения.Вставить("ContextId", Контекст.ContextId);
	МодульФоновогоЗаданияСервер().ПрогрессФЗУстановитьПараметры(_Параметры);
	
	МодульФоновогоЗаданияСервер().ПерезапуститьФоновоеЗадание();
	Если _Параметры.ВыводитьОкноОжидания Тогда
		ИнтервалОжидания15Секунд = 15;
		КоэффициентУвеличенияИнтервалаОжидания = 1.4;
		ИнтервалОжидания = _Параметры.Интервал;
		Если _Параметры.Интервал = 0 Тогда
			ИнтервалОжидания = ИнтервалОжидания * КоэффициентУвеличенияИнтервалаОжидания;
			Если ИнтервалОжидания > ИнтервалОжидания15Секунд Тогда
				ИнтервалОжидания = ИнтервалОжидания15Секунд;
			КонецЕсли;
		КонецЕсли;
		ПодключитьОбработчикОжидания(ИмяОбработчкикаФЗ(), ИнтервалОжидания, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Функция ПрогрессСтрокой(Прогресс)
	
	Результат = "";
	Если Прогресс = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Процент = 0;
	Если Процент = get_prop(Прогресс, "Процент", Процент) Тогда
		Результат = Строка(Процент) + "%";
	КонецЕсли;
	Текст = 0;
	Если Текст <> get_prop(Прогресс, "Текст", Текст) Тогда
		Если Не ПустаяСтрока(Результат) Тогда
			Результат = Результат + " (" + Текст + ")";
		Иначе
			Результат = Текст;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьОповещение(ДополнительныеПараметры)
	
	ПараметрыСеансаРасширения = МодульФоновогоЗаданияСервер().ПрогрессФЗПрочитатьЗначения();
	_Параметры	= ПараметрыСеансаРасширения.Параметры;
	
	Если _Параметры.ОповещениеПользователя = Неопределено Или Не _Параметры.ОповещениеПользователя.Показать Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = _Параметры.ОповещениеПользователя;
	
	НавигационнаяСсылкаОповещения = Оповещение.НавигационнаяСсылка;
	ВладелецФормы = Неопределено; // В контексте формы, в модуле отсутствует
	Если НавигационнаяСсылкаОповещения = Неопределено И ВладелецФормы <> Неопределено И ВладелецФормы.Окно <> Неопределено Тогда
		НавигационнаяСсылкаОповещения = ВладелецФормы.Окно.ПолучитьНавигационнуюСсылку();
	КонецЕсли;
	ПояснениеОповещения = Оповещение.Пояснение;
	Если ПояснениеОповещения = Неопределено И ВладелецФормы <> Неопределено И ВладелецФормы.Окно <> Неопределено Тогда
		ПояснениеОповещения = ВладелецФормы.Окно.Заголовок;
	КонецЕсли;
	
	ИменаЗаданийОтображенияОбмена = Новый Массив;
	ИменаЗаданийОтображенияОбмена.Добавить("Загрузка в " + ЛокализацияНазваниеПродукта());
	ИменаЗаданийОтображенияОбмена.Добавить("Выгрузка в 1С");
	ИменаЗаданийОтображенияОбмена.Добавить("Выгрузка вложений из " + ЛокализацияНазваниеПродукта());
	ИменаЗаданийОтображенияОбмена.Добавить("Запись вложения в " + ЛокализацияНазваниеПродукта());

	Если ДополнительныеПараметры.Свойство("ContextId") 
		И ИменаЗаданийОтображенияОбмена.Найти(_Параметры.ФоновоеЗаданиеНаименование) <> Неопределено	Тогда
	
		ПараметрыЗагрузки = get_prop(_Параметры.ФоновоеЗаданиеПараметры[0], "ПараметрыВыполнения", Неопределено);
		
		НавигационнаяСсылкаОповещения = АдресСтраницыОтчетОЗагрузке(
			ПараметрыЗагрузки["params"]["api_url"],
			ДополнительныеПараметры["ContextId"]);
        НавигационнаяСсылкаОповещения = ПолучитьПрямуюССылку(НавигационнаяСсылкаОповещения);
	КонецЕсли;
	Оповестить("Saby_ЗавершениеДлительнойОперации");
	
	Пояснение = НСтр("ru = 'Действие выполнено'");
	Если Оповещение.Текст <> Неопределено Тогда
		Пояснение = Оповещение.Текст;
	КонецЕсли;
	Если НЕ ПустаяСтрока(ПараметрыСеансаРасширения.ТекстОповещения) Тогда
		Пояснение = ПараметрыСеансаРасширения.ТекстОповещения;
	КонецЕсли;
	КартинкаОповещения = ПараметрыСеансаРасширения.КартинкаОповещения;
	Если ТипЗнч(КартинкаОповещения) = Тип("Строка") Тогда
		КартинкаОповещения = БиблиотекаКартинок[ПараметрыСеансаРасширения.КартинкаОповещения];
	КонецЕсли;	
	ПоказатьВажноеОповещениеПользователя(
		ПояснениеОповещения,
		НавигационнаяСсылкаОповещения, 
		Пояснение,
		КартинкаОповещения);

КонецПроцедуры

&НаКлиенте
Функция АдресСтраницыОтчетОЗагрузке(URL, extSyncDocId) 
	Возврат URL + "/ext-sync-doc/page/?extSyncDocId=" + extSyncDocId; 	 	
КонецФункции

#Область include_core_base_Helpers_ПоказатьОповещениеПользователя
#КонецОбласти

