
&НаСервере
Процедура ЗагрузитьСопоставленияНаСервере(Параметры, АдресРезультата = Неопределено) Экспорт
	connection_info = Неопределено;
	//Дополнительная первоначальная ручная инициализация элементов справочника

	СообщитьПрогрессОперации(,"Инициализация справочников",Новый Структура("Прогресс, status", 100, "run"));
	Справочники.Saby_СостоянияОбъектов.НачальнаяИнициализация(); // TODO Обработка

	СообщитьПрогрессОперации(,"Инициализация подключения",Новый Структура("Прогресс", 100));
	Модуль = Обработки.SABY.Создать(); //  TODO Обработка
	context_param = Модуль.НастройкиПодключенияПрочитать();
	system_info = Модуль.API_ADDON_READSYSTEMINFO(Неопределено);
	system_info.Вставить("ConnectionStateEvents", Новый Массив);
	system_info["ConnectionStateEvents"].Добавить("NewSystem");
	connection_info = Модуль.local_helper_init_connection(context_param, system_info);
	
	СообщитьПрогрессОперации(,"Синхронизация объектов",Новый Структура("Прогресс", 0));
	Модуль.ПриСозданииНовогоПодключения(connection_info);
КонецПроцедуры

