
&НаСервере
Процедура ЗагрузитьСопоставленияНаСервере(Параметры, АдресРезультата = Неопределено) Экспорт
	connection_info = Неопределено;
	//Дополнительная первоначальная ручная инициализация элементов справочника
	СообщитьПрогрессОперации(,"Инициализация подключения",Новый Структура("Прогресс", 0));
	context_param = НастройкиПодключенияПрочитать();
	system_info = API_ADDON_READSYSTEMINFO(Неопределено);
	system_info.Вставить("ConnectionStateEvents", Новый Массив);
	system_info["ConnectionStateEvents"].Добавить("NewSystem");
	connection_info = local_helper_init_connection(context_param, system_info);
	
	СообщитьПрогрессОперации(,"Синхронизация объектов",Новый Структура("Прогресс", 0));
	ПриСозданииНовогоПодключения(connection_info);
КонецПроцедуры

