
Функция ЗапуститьФоновоеЗаданиеСервер(Параметры) Экспорт
	Если ЗначениеЗаполнено(Параметры.ИдентификаторЗадания) Тогда
		ИдентификаторЗадания = Параметры.ИдентификаторЗадания;
	Иначе
		ИдентификаторЗадания = Новый УникальныйИдентификатор;
	КонецЕсли;
	Если Параметры.ФоновоеЗаданиеПараметры[0].Свойство("ПараметрыВыполнения") 
		И ТипЗнч(Параметры.ФоновоеЗаданиеПараметры[0].ПараметрыВыполнения) = Тип("Соответствие") Тогда
		ВложенияАдресВХранилище = ПоместитьВоВременноеХранилище("", Параметры.УникальныйИдентификатор);
		Параметры.ФоновоеЗаданиеПараметры[0].ПараметрыВыполнения.Вставить("ВложенияАдресВХранилище", ВложенияАдресВХранилище);
	КонецЕсли;
	
	ФоновоеЗадание = ФоновыеЗадания.Выполнить(Параметры.ФоновоеЗаданиеИмяМетода, Параметры.ФоновоеЗаданиеПараметры, Строка(ИдентификаторЗадания),Параметры.ФоновоеЗаданиеНаименование);
	ИдентификаторЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	
	// Онли для расширения ++
	ПараметрыСеансаСброс(Параметры);
	ПараметрыСеансаУстановитьИдентификаторЗадания(ИдентификаторЗадания);
	// Онли для расширения --
	Возврат ИдентификаторЗадания;
КонецФункции

Процедура ПроверитьСостояниеФоновогоЗаданияСервер() Экспорт
	
КонецПроцедуры

