
// Определяет захвачен ли объект метаданных в расширении
//
// Параметры:
//  Контекст - Произвольный - контекст
//
// Возвращаемое значение:
//  Булево - Истина, если объект захвачен, Ложь - если нет
//
Функция ЭтоВстраиваемыйОбъектМетаданных(Контекст) Экспорт
	InjectObject = ПолучитьОбъектОбработки().ПрочитатьВстраиваемыеОбъекты();
	Если InjectObject = Неопределено Тогда
	 	Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ТипИсточника Из Контекст.ТипыИсточников Цикл 
		ИмяПоиска = Метаданные.НайтиПоТипу(ТипИсточника).ПолноеИмя(); 
		ИмяПоиска = СтрЗаменить(ИмяПоиска, "Документ.", "Документы.");
		ИмяПоиска = СтрЗаменить(ИмяПоиска, "Справочник.", "Справочники.");
		ИмяПоиска = СтрЗаменить(ИмяПоиска, "Журнал.", "Журналы.");
		ИмяПоиска = СтрЗаменить(ИмяПоиска, "Перечисление.", "Перечисления.");
		ЗначениеInjectObject = get_prop(InjectObject, ИмяПоиска, Неопределено);
		Если ЗначениеInjectObject = Неопределено Тогда
			Продолжить;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции


