
&НаКлиенте
Процедура ВыгрузитьВложенияИзСБИС(Источник, ПараметрКоманды) Экспорт
	
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	
	BlocklyExecutor = ПолучитьФормуBlockly();
		
	ОбрабатываемыеОбъекты = Новый Массив();
	Для Каждого ВыгружаемыйДокумент Из Источник Цикл
		_ref = Новый Структура;
		_ref.Вставить("Объект", ВыгружаемыйДокумент.Ссылка);
		_ref.Вставить("UID", ВыгружаемыйДокумент.UID);
		ОбрабатываемыеОбъекты.Добавить(_ref);
	КонецЦикла;    
	
	Если ОбрабатываемыеОбъекты.Количество() > 0 Тогда
		Контекст = Новый Структура;
		Контекст.Вставить("algorithm", "ЗагрузитьВложения_1");
		Контекст.Вставить("ПараметрыВызова", ОбрабатываемыеОбъекты);
		Контекст.Вставить("context_params", context_params);
		Контекст.Вставить("НазваниеОперации", "Загрузка вложения из "+ЛокализацияНазваниеПродукта());
		BlocklyExecutor.ЗапуститьINI(Контекст);

	КонецЕсли;
	
КонецПроцедуры

