
&НаКлиенте
Процедура ВыгрузитьВложенияИзСБИС(Источник, ПараметрКоманды, ОповещениеОЗавершении = Неопределено) Экспорт
	
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	
	BlocklyExecutor = ПолучитьФормуBlockly();
		
	ОбрабатываемыеОбъекты = Новый Массив();
	Для Каждого ВыгружаемыйДокумент Из Источник Цикл
		_ref = Новый Структура;
		_ref.Вставить("Объект", ВыгружаемыйДокумент.Ссылка);
		_ref.Вставить("UID", ВыгружаемыйДокумент.UID);
		ОбрабатываемыеОбъекты.Добавить(_ref);
	КонецЦикла;    
	
	Если ОбрабатываемыеОбъекты.Количество() > 0 Тогда
		Контекст = Новый Структура;
		Контекст.Вставить("algorithm", "ЗагрузитьВложения_1");
		EndpointArgs = Новый Структура;
		EndpointArgs.Вставить("МассивСсылок", ОбрабатываемыеОбъекты);
		ПараметрыВызова = Новый Структура;
		ПараметрыВызова.Вставить("EndpointArgs", EndpointArgs);
		Контекст.Вставить("ПараметрыВызова", ПараметрыВызова);
		Контекст.Вставить("context_params", context_params);
		Контекст.Вставить("НазваниеОперации", "Выгрузка вложений из "+ЛокализацияНазваниеПродукта());
		Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
		BlocklyExecutor.ЗапуститьINI(Контекст);

	КонецЕсли;
	
КонецПроцедуры

