
&НаКлиенте
Процедура ВыгрузитьВложенияИзСБИС(Источник, ПараметрКоманды) Экспорт
	
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();

	ОбрабатываемыеОбъекты = Новый Массив();
	Для Каждого ВыгружаемыйДокумент Из Источник Цикл
		_ref = Новый Структура;
		_ref.Вставить("Объект", ВыгружаемыйДокумент.Ссылка);
		_ref.Вставить("UID", ВыгружаемыйДокумент.UID);
		ОбрабатываемыеОбъекты.Добавить(_ref);
	КонецЦикла;    
	
	Если ОбрабатываемыеОбъекты.Количество() > 0 Тогда
		ЗапуститьINIФоновымЗаданием(
			"ЗагрузитьВложения_1", 
			ОбрабатываемыеОбъекты, 
			context_params, 
			ПараметрКоманды.Форма, 
			"Загрузка вложения из "+ЛокализацияНазваниеПродукта());
	КонецЕсли;
	
КонецПроцедуры

