
//**** МЕТАДАННЫЕ *****

// Определяет захвачен ли объект метаданных в расширении
//
// Параметры:
//  Контекст - Произвольный - контекст
//
// Возвращаемое значение:
//  Булево - Истина, если объект захвачен, Ложь - если нет
//
Функция ЭтотОбъектМетаданныхЗахвачен(Контекст) Экспорт
	//Присутствует хоть один из обрабатываемых типов
	ИмяРегистра = ИмяРегистраСостояние(); 
	МассивДоступныхТипов = Метаданные.РегистрыСведений[ИмяРегистра].Измерения.Объект.Тип.Типы();

	Для Каждого ТипИсточника Из Контекст.ТипыИсточников Цикл
		НайденПоддерживаемыйДокументОбмена = Метаданные.РегистрыСведений[ИмяРегистра].Измерения.Объект.Тип.СодержитТип(ТипИсточника);
		Если НЕ НайденПоддерживаемыйДокументОбмена Тогда
			Продолжить;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

