
&НаКлиенте
Процедура ПриНажатииОткрытьВСБИСПолучитьUID( Команда, ПараметрКоманды ) Экспорт  
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере(); 
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	ДопПараметры = Новый Структура("Команда, ПараметрКоманды", Команда, ПараметрКоманды);
	ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ОткрытьВСБИСПолучитьUIDПослеАвторизации", ЭтотМодуль(), ДопПараметры);
	ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции,  ОбработчикПослеАвторизации);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВСБИСПолучитьUIDПослеАвторизации(Результат, ДопПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	ПараметрКоманды = ДопПараметры.ПараметрКоманды;
	
	мСсылок = ПолучитьСписокСсылокНаОбъектыКоманды( ПараметрКоманды );
	ПроверкаОбмена = ПроисходилЛиОбменДокументов( мСсылок.Источник);
	Если ПроверкаОбмена.ОбменаНебыло.Количество()  > 0 Тогда
		ДопПараметры		= Новый Структура("Данные, Форма", ПроверкаОбмена, ПараметрКоманды.Форма );
		ДействиеВопроса = Новый ОписаниеОповещения("ОтветНаВопросОтправитьДокументыВСБИС", ЭтотМодуль(), ДопПараметры);
		ПоказатьВопрос(ДействиеВопроса, 
			"Среди выбранных для открытия документов есть "+
			Формат(ПроверкаОбмена.ОбменаНебыло.Количество(), "ЧГ=0")+
			" которые в "+ЛокализацияНазваниеПродукта()+" не загружались. Загрузить их?",
			РежимДиалогаВопрос.ДаНетОтмена,0,КодВозвратаДиалога.Да,"Документ не найден в "+ЛокализацияНазваниеПродукта());	
	Иначе
		ОткрытьВСБИС_ПолучитьURL( ПроверкаОбмена.БылОбмен, ПараметрКоманды );
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОтправитьДокументыВСБИС(Результат, Параметры) Экспорт // здесь, думаю, комм
	Если Результат = КодВозвратаДиалога.Да Тогда
		мСсылок = ПолучитьСписокСсылокНаОбъектыКоманды(Параметры.Данные.ОбменаНебыло);
		ОткрытьФормуОбработки("ЗагрузкаДокументов",мСсылок,Параметры.Форма); 
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		//Получим ссылки на обработанные документы и откроем их в окнах
		ОткрытьВСБИС_ПолучитьURL( Параметры.Данные.БылОбмен, Параметры );
	Иначе
		//При отмене как и полагается не будем ни чего делать
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОтправитьВложенияВСБИС(Результат, Параметры) Экспорт // здесь, думаю, комм
	Если Результат = КодВозвратаДиалога.Да Тогда
		мСсылок = ПолучитьСписокСсылокНаОбъектыКоманды(Параметры.Данные.ОбменаНебыло);  
		ОткрытьФормуОбработки("ЗагрузкаДокументов",мСсылок,Параметры.Форма); 
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		//Получим ссылки на обработанные документы и откроем их в окнах
		ВыгрузитьВложенияИзСБИС(Параметры.Данные.БылОбмен, Параметры, Параметры.ОповещениеОЗавершении);
	Иначе
		//При отмене как и полагается не будем ни чего делать
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВСБИС_ПолучитьURL( Источник, ПараметрКоманды ) Экспорт 
	ОшибкаВыполнения	= Ложь;
	Попытка
		context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере(); 
		ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
		СсылкиНаДокументыВСБИС = ТранспортИнтеграции.ПолучитьСсылкиНаДокументыВИнтеграции( Источник );
	Исключение
		ОшибкаВыполнения	= Истина;
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		ПоказатьОповещениеПользователя("Ошибка",,СтруктураОшибки.message,БиблиотекаКартинок["Ошибка32"]);
	КонецПопытки;
	
	Если	Не ОшибкаВыполнения И СсылкиНаДокументыВСБИС.ОбработаноСОшибкой.Количество()  > 0 Тогда
		ДопПараметры		= Новый Структура("Данные, Форма", СсылкиНаДокументыВСБИС.ОбработаноСОшибкой, ПараметрКоманды.Форма );
		ПоказатьОповещениеПользователя(
			"Удалены документы в "+ЛокализацияНазваниеПродукта(),
			, 
			"Среди выбранных для открытия документов есть "+
			Формат(СсылкиНаДокументыВСБИС.ОбработаноСОшибкой.Количество(), "ЧГ=0")+
			" которые были удалены в "+ЛокализацияНазваниеПродукта()+". Информация о статусах этих документов была удалена.",
			КартинкаОшибка());
		ДопПараметры = Новый Структура("ПараметрКоманды", ПараметрКоманды);
		ОбновитьТабличнуюЧастьФормы( Неопределено, ДопПараметры );
	ИначеЕсли Не ОшибкаВыполнения Тогда
		ОткрытьВСБИС( СсылкиНаДокументыВСБИС.ОбработаноУспешно, ПараметрКоманды.Форма );
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВСБИС( МассивДокументовКОтправке, Форма ) Экспорт 
	Для Каждого СсылкаНаДокумент Из МассивДокументовКОтправке Цикл
		ПарамФормы = Новый Структура( "Заголовок, АдресСтраницы");
		ЗаполнитьЗначенияСвойств(ПарамФормы, СсылкаНаДокумент);
		АдресДокумента = get_prop(СсылкаНаДокумент,"АдресСтраницы");
		АдресДокумента = ПолучитьПрямуюССылку(АдресДокумента);
		#Если ТолстыйКлиентОбычноеПриложение Тогда 
		// BSLLS:UsingSynchronousCalls-off
		ЗапуститьПриложение(АдресДокумента); 
		// BSLLS:UsingSynchronousCalls-on
		#Иначе	
		ПерейтиПоНавигационнойСсылке(АдресДокумента);	
		#КонецЕсли
	КонецЦикла;
КонецПроцедуры

