
&НаКлиенте
Процедура ПриНажатииОбновитьСтатусы( Команда, ПараметрКоманды ) Экспорт 
	
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	Если ТребуетсяАутентификация(context_params, Команда, ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;	
	BlocklyExecutor = ПолучитьФормуBlockly();
		
    ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено;
    Если ПараметрКоманды = Неопределено Или Не ПараметрКоманды.ЭтоФормаОбъекта Тогда
        ОповещениеОЗакрытииФормыФоновогоЗадания = ПолучитьОповещениеОбновлнияТаблицыФормы(Команда, ПараметрКоманды);
        context_params.Вставить("ОповещениеОЗакрытииФормыФоновогоЗадания", ОповещениеОЗакрытииФормыФоновогоЗадания);
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("algorithm", "ОбновитьСтатусы_send");
	Контекст.Вставить("ПараметрыВызова", "");
	Контекст.Вставить("context_params", context_params);
	Контекст.Вставить("НазваниеОперации", "Обновление статусов");
	BlocklyExecutor.ЗапуститьINI(Контекст);
	ДопПараметры = Новый Структура("ПараметрКоманды", ПараметрКоманды);
	ОбновитьТабличнуюЧастьФормы( Неопределено, ДопПараметры );
КонецПроцедуры
