
&НаКлиенте
Процедура ВыгрузитьВ1СНажатие(Команда)
	
	СписокКнопок = Новый СписокЗначений();	
    СписокКнопок.Добавить(0, "Выгрузить в 1С");
    СписокКнопок.Добавить(1, "Выгрузить вложения из "+ЛокализацияНазваниеПродукта());
		
	ПоказатьМенюВыгрузитьВ1С(СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура МенюВыгрузитьВ1СОбработкаОповещения(ЗначениеВыбора, ДопПараметры) Экспорт
	
	Если ЗначениеВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеВыбора.Значение = 0 Тогда 	
		ВыгрузитьОбъектВ1СНаКлиенте();		
	ИначеЕсли ЗначениеВыбора.Значение = 1 Тогда 	
		ВыгрузитьВложенияНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбъектВ1СНаКлиенте()

	ВыгружаемыеДокументы = СформироватьМассивВыгружаемыхДокументов();

	Если ВыгружаемыеДокументы.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя(
			"Не выбрано ни одного документа.",,"",
			КартинкаОшибка(),
			СтатусОповещенияПользователя.Важное, Новый УникальныйИдентификатор);
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОбъектВ1С(ВыгружаемыеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбъектВ1С(ВыгружаемыеДокументы)
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	ЗапуститьINIФоновымЗаданием("Документы_update", ВыгружаемыеДокументы, context_params, ЭтаФорма.ВладелецФормы, "Выгрузка в 1С");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВложенияНаКлиенте()
	ВыгружаемыеДокументы = СформироватьМассивВыгружаемыхДокументов1С();

	Если ВыгружаемыеДокументы.Количество() Тогда
		ПроверкаОбмена = ПроисходилЛиОбменДокументов(ВыгружаемыеДокументы);
		ВыгрузитьВложенияИзСБИС( ПроверкаОбмена.БылОбмен, Новый Структура("Форма", Неопределено) );
	Иначе
		ПоказатьОповещениеПользователя(
			"",,"Данный документ отсутствует в 1С"
			,КартинкаОшибка()
			,СтатусОповещенияПользователя.Важное,);
	КонецЕсли;
КонецПроцедуры

Процедура ИмяИзСБИСвАПИ3(ИмяСБИС, ПримечаниеСБИС, ИдентификаторДокумента)
	Если ИмяСБИС = "СлужЗап" Тогда
		ИмяСБИС = "Задача";	
	ИначеЕсли ИмяСБИС = "АвансОтчёт" Тогда
		ИмяСБИС = "АвансовыйОтчёт";    
	ИначеЕсли ИмяСБИС = "АвансОтчет" Тогда
		ИмяСБИС = "АвансовыйОтчет";
	ИначеЕсли ИмяСБИС = "ВнутрПрм" Тогда
		ИмяСБИС = "ВнутреннееПеремещение";
	ИначеЕсли ИмяСБИС = "PayoutDoc" Тогда
		ИмяСБИС = "ВыдачаЗарплаты";
	ИначеЕсли ИмяСБИС = "ДоговорДок" Тогда
		ИмяСБИС = "Договор";
	ИначеЕсли ИмяСБИС = "PriceChange" Тогда
		ИмяСБИС = "ИзменениеЦен";
	ИначеЕсли ИмяСБИС = "Allowance" Тогда
		Если Найти(ПримечаниеСБИС, "уход") > 0 Тогда
			МодульОбъекта = ПолучитьМодульОбъекта();
			context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
			ДокументСБИС = МодульОбъекта.local_helper_read_document(context_params, Новый Структура("Идентификатор", ИдентификаторДокумента));
			Если Найти(ДокументСБИС["Регламент"]["Название"], "уход") > 0 И Найти(ДокументСБИС["Регламент"]["Название"], "Больничный") = 0 Тогда 
				ИмяСБИС = "ОтпускПоУходу";
			Иначе
				ИмяСБИС = "Больничный";        
			КонецЕсли;
		Иначе
			ИмяСБИС = "Больничный";   
		КонецЕсли;
	ИначеЕсли ИмяСБИС = "Номенклатура" Тогда
		ИмяСБИС = "ПоказательОстатокНаСкладе";
	ИначеЕсли ИмяСБИС = "ДокОтгрВх" Тогда
		ИмяСБИС = "Поступление";
	ИначеЕсли ИмяСБИС = "Прайсы" Тогда
		ИмяСБИС = "Прайс";
	ИначеЕсли ИмяСБИС = "ДокОтгрИсх" Тогда
		ИмяСБИС = "Реализация";
	ИначеЕсли ИмяСБИС = "СчетИсх" Тогда
		ИмяСБИС = "СчетНаОплату";
	ИначеЕсли ИмяСБИС = "УдержанияПоЗарплате" Тогда
		ИмяСБИС = "УдержаниеПоЗарплате";
	ИначеЕсли ИмяСБИС = "ШтатнаяДолжность" Тогда
		ИмяСБИС = "ШтатноеРасписание";
	ИначеЕсли ИмяСБИС = "Согласование" Тогда
		ИмяСБИС = "ГрафикОтпусков";
	ИначеЕсли ИмяСБИС = "CadresOther" Тогда
		ИмяСБИС = "ПрочийКадровыйДокумент";
	ИначеЕсли ИмяСБИС = "НачисленияПоЗарплате" Тогда
		ИмяСБИС = "НачислениеПоЗарплате";
	ИначеЕсли ИмяСБИС = "PlanVacationScheduleChange" Тогда
		ИмяСБИС = "ПереносОтпусков";
	ИначеЕсли ИмяСБИС = "ТабельДокумент" Тогда
		ИмяСБИС = "Табель";
	ИначеЕсли ИмяСБИС = "ИзмененияОклада" Тогда
		ИмяСБИС = "ИзменениеУсловийОплаты";
	ИначеЕсли ИмяСБИС = "Indexation" Тогда
		ИмяСБИС = "ИндексацияЗаработка";
	ИначеЕсли ИмяСБИС = "GphAct" Тогда
		ИмяСБИС = "АктПриемки";	
	ИначеЕсли ИмяСБИС = "CombinationPositions" Тогда
		ИмяСБИС = "СовмещениеДолжностей";
	ИначеЕсли ИмяСБИС = "BusinessTrip" Тогда
		ИмяСБИС = "СписочнаяКомандировка";
	ИначеЕсли ИмяСБИС = "GphContract" Тогда
		ИмяСБИС = "ПриемНаРаботуГПХ";
	ИначеЕсли ИмяСБИС = "CombinationCancel" Тогда
		ИмяСБИС = "ОтменаСовмещенияДолжностей";
	ИначеЕсли ИмяСБИС = "BTCorrection" Тогда
		ИмяСБИС = "КорректировкаСписочнойКомандировки";
	ИначеЕсли ИмяСБИС = "TimesheetCorrection" Тогда 
		ИмяСБИС = "КорректировкаТабеля";
	ИначеЕсли ИмяСБИС = "РеалВх" Тогда 
		ИмяСБИС = "Поступление";
	ИначеЕсли ИмяСБИС = "StaffStatements" Тогда 
		ИмяСБИС = "Заявление";
	КонецЕсли;	
КонецПроцедуры


