
&НаКлиенте
Процедура ПриНажатииВыгрузитьВложенияИзСБИС( Команда, ПараметрКоманды ) Экспорт 
	
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	Если ТребуетсяАутентификация(context_params, Команда, ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;

    Если Не ПараметрКоманды.ЭтоФормаОбъекта Тогда
        ОповещениеОЗакрытииФормыФоновогоЗадания = ПолучитьОповещениеОбновлнияТаблицыФормы(Команда, ПараметрКоманды);
        context_params.Вставить("ОповещениеОЗакрытииФормыФоновогоЗадания", ОповещениеОЗакрытииФормыФоновогоЗадания);
	КонецЕсли;
	
	мСсылок = ПолучитьСписокСсылокНаОбъектыКоманды(ПараметрКоманды );
	ПроверкаОбмена = ПроисходилЛиОбменДокументов(мСсылок.Источник);
	
	Если ПроверкаОбмена.ОбменаНебыло.Количество()  = 0 И ПроверкаОбмена.БылОбмен.Количество() > 0 Тогда
		ВыгрузитьВложенияИзСБИС(ПроверкаОбмена.БылОбмен, ПараметрКоманды);
	ИначеЕсли ПроверкаОбмена.ОбменаНебыло.Количество()  > 0 Тогда
		ДопПараметры	= Новый Структура("Данные, Форма", ПроверкаОбмена, ПараметрКоманды.Форма );
		ДействиеВопроса = Новый ОписаниеОповещения("ОтветНаВопросОтправитьВложенияВСБИС", ЭтотМодуль(), ДопПараметры);
		ПоказатьВопрос(ДействиеВопроса, 
			"Среди выбранных для выгрузки вложений документов есть "+
			Формат(ПроверкаОбмена.ОбменаНебыло.Количество(), "ЧГ=0")+
			" которые в СБИС не загружались. Загрузить их?",
			РежимДиалогаВопрос.ДаНетОтмена,0,КодВозвратаДиалога.Да,"Документ не найден в "+ЛокализацияНазваниеПродукта());
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#Область include_core_base_ВстраиваниеВФормы_ВыгрузитьВложенияИзСБИСОбщее
#КонецОбласти


