
// Функция ПривестиДанныеКСсылочномуВиду
//
// Параметры:
// ВхДанные - Массив - Входящие данные
//
// Возвращаемое значение:
//  Массив - Результат выполения функции
//
Функция ПривестиДанныеКСсылочномуВиду(ВхДанные) Экспорт
	МассивСсылок = Новый Массив;
	Для Каждого ЗаписьСсылка Из ВхДанные Цикл
		СсылкаДанные = get_prop(ЗаписьСсылка, "Ссылка");
		Если СсылкаДанные = Неопределено Тогда
			СсылкаДанные = get_prop(ЗаписьСсылка, "Сотрудник");
		КонецЕсли;
		Если СсылкаДанные <> Неопределено Тогда
			МассивСсылок.Добавить(СсылкаДанные);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивСсылок;
КонецФункции

