
&НаКлиенте
Процедура ПечатьСсылкаНаPDF( Команда, ПараметрКоманды ) Экспорт 
	СсылкаНаPDF = ПолучитьДанныеПоРеквизитуСписка("СсылкаНаPDF");  
	Если СсылкаНаPDF = Неопределено Тогда
		Возврат;
	КонецЕсли;
	context_params = ПроверитьНаличиеПараметровПодключенияНаСервере();
	ДвоичныеДанныеФайла = ТранспортИнтеграции.local_helper_download_from_link(context_params, СсылкаНаPDF);
	Если ТипЗнч(ДвоичныеДанныеФайла) <> Тип("ДвоичныеДанные") Тогда
		Возврат;
	КонецЕсли;
    #Если ВебКлиент Тогда
		// BSLLS:TempFilesDir-off
		// BSLLS:UsingSynchronousCalls-off
        ИмяВременногоФайла = КаталогВременныхФайлов() + "sbis_" + Строка(Новый УникальныйИдентификатор())+".pdf";
		// BSLLS:UsingSynchronousCalls-on
		// BSLLS:TempFilesDir-on
    #Иначе
		// BSLLS:MissingTemporaryFileDeletion-off
        ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
		// BSLLS:MissingTemporaryFileDeletion-on
    #КонецЕсли
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	// BSLLS:UsingSynchronousCalls-off
	ЗапуститьПриложение(ИмяВременногоФайла);
	// BSLLS:UsingSynchronousCalls-on
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеПоРеквизитуСписка(ИмяРеквизита)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	ТабПоле = ЭлемФормы[ИмяТаблицы];
	ТекущиеДанные = ТабПоле.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Возврат ТекущиеДанные[ИмяРеквизита];	
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
