
&НаКлиенте
Процедура ПриНажатииОбновитьСтатусы( Команда, ПараметрКоманды ) Экспорт 
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	ДопПараметры = Новый Структура("Команда, ПараметрКоманды", Команда, ПараметрКоманды);
	ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ОбновитьСтатусыПослеАвторизации", ЭтотМодуль(), ДопПараметры);
	ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции,  ОбработчикПослеАвторизации);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыПослеАвторизации(Результат, ДопПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	context_params = Результат;
	ПараметрКоманды = ДопПараметры.ПараметрКоманды;
	
	BlocklyExecutor = ПолучитьФормуBlockly();
		
	//ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено;
	//Если ПараметрКоманды = Неопределено Или Не ПараметрКоманды.ЭтоФормаОбъекта Тогда
	//    ОповещениеОЗакрытииФормыФоновогоЗадания = ПолучитьОповещениеОбновлнияТаблицыФормы(Команда, ПараметрКоманды);
	//КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("algorithm", "ОбновитьСтатусы_send");
	Контекст.Вставить("ПараметрыВызова", Новый Структура);
	Контекст.Вставить("context_params", context_params);
	Контекст.Вставить("НазваниеОперации", "Обновление статусов");
	BlocklyExecutor.ЗапуститьINI(Контекст);
	ДопПараметры = Новый Структура("ПараметрКоманды", ПараметрКоманды);
	ОбновитьТабличнуюЧастьФормы( Неопределено, ДопПараметры );
КонецПроцедуры
