
&НаКлиенте
Процедура ПриНажатииОбновитьСтатусы( Команда, ПараметрКоманды ) Экспорт 
	
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	Если ТребуетсяАутентификация(context_params, Команда, ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;	
	
    ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено;
    Если Не ПараметрКоманды.ЭтоФормаОбъекта Тогда
        ОповещениеОЗакрытииФормыФоновогоЗадания = ПолучитьОповещениеОбновлнияТаблицыФормы(Команда, ПараметрКоманды);
        context_params.Вставить("ОповещениеОЗакрытииФормыФоновогоЗадания", ОповещениеОЗакрытииФормыФоновогоЗадания);
	КонецЕсли;
	
	ЗапуститьINIФоновымЗаданием(
		"ОбновитьСтатусы_send",
		,
		context_params,
		ПараметрКоманды.Форма, 
		"Обновление статусов"); 
	
КонецПроцедуры


