
&НаКлиенте
Процедура ВыгрузитьВ1СНажатие(Команда)
	
	СписокКнопок = Новый СписокЗначений();	
    СписокКнопок.Добавить(0, "Выгрузить в 1С");
    СписокКнопок.Добавить(1, "Выгрузить вложения из "+ЛокализацияНазваниеПродукта());
		
	ПоказатьМенюВыгрузитьВ1С(СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура МенюВыгрузитьВ1СОбработкаОповещения(ЗначениеВыбора, ДопПараметры) Экспорт
	
	Если ЗначениеВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеВыбора.Значение = 0 Тогда 	
		ВыгрузитьОбъектВ1СНаКлиенте();		
	ИначеЕсли ЗначениеВыбора.Значение = 1 Тогда 	
		ВыгрузитьВложенияНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбъектВ1СНаКлиенте()

	ВыгружаемыеДокументы = СформироватьМассивВыгружаемыхДокументов();

	Если ВыгружаемыеДокументы.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя(
			"Не выбрано ни одного документа.",,"",
			КартинкаОшибка(),
			СтатусОповещенияПользователя.Важное, Новый УникальныйИдентификатор);
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОбъектВ1С(ВыгружаемыеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбъектВ1С(ВыгружаемыеДокументы)
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	Контекст = Новый Структура;
	Контекст.Вставить("algorithm", "Документы_update");
	Контекст.Вставить("ПараметрыВызова", ВыгружаемыеДокументы);
	Контекст.Вставить("context_params", context_params);
	Контекст.Вставить("НазваниеОперации", "Выгрузка в 1С");
	BlocklyExecutor.ЗапуститьINI(Контекст);

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВложенияНаКлиенте()
	ВыгружаемыеДокументы = СформироватьМассивВыгружаемыхДокументов1С();

	Если ВыгружаемыеДокументы.Количество() Тогда
		ПроверкаОбмена = ПроисходилЛиОбменДокументов(ВыгружаемыеДокументы);
		ВыгрузитьВложенияИзСБИС( ПроверкаОбмена.БылОбмен, Новый Структура("Форма", Неопределено) );
	Иначе
		ПоказатьОповещениеПользователя(
			"",,"Данный документ отсутствует в 1С"
			,КартинкаОшибка()
			,СтатусОповещенияПользователя.Важное);
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_Helpers_ИмяИзСБИСвАПИ3
#КонецОбласти
