
// Функция ПривестиДанныеКСсылочномуВиду
//
// Параметры:
// ВхДанные - Массив - Входящие данные
//
// Возвращаемое значение:
//  Массив - Результат выполения функции
//
Функция ПривестиДанныеКСсылочномуВиду( ВхДанные ) Экспорт
	МассивСсылок = Новый Массив;
	Для Каждого ЗаписьСсылка Из ВхДанные Цикл
		ОбъектМетаданных = ЗаписьСсылка.Метаданные();
		Если ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) 
			ИЛИ ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
			МассивСсылок.Добавить(ЗаписьСсылка);
		Иначе
			// Записи регистра сведений и прочее
			СсылкаДанные = get_prop(ЗаписьСсылка, "Ссылка");
			Если СсылкаДанные = Неопределено Тогда
				СсылкаДанные = get_prop(ЗаписьСсылка, "Сотрудник");
				МассивСсылок.Добавить(СсылкаДанные);
			Иначе
				МассивСсылок.Добавить(СсылкаДанные);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат МассивСсылок;
КонецФункции

