
&НаКлиенте
Процедура ВыгрузитьВ1СНажатие(Команда)
	
	СписокКнопок = Новый СписокЗначений();	
    СписокКнопок.Добавить(0, "Выгрузить в 1С",, БиблиотекаКартинок.СохранитьФайл);
    СписокКнопок.Добавить(1, "Выгрузить вложения из "+ЛокализацияНазваниеПродукта(),, БиблиотекаКартинок.Прикрепить);
		
	ПоказатьМенюВыгрузитьВ1С(СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура МенюВыгрузитьВ1СОбработкаОповещения(ЗначениеВыбора, ДопПараметры) Экспорт
	
	Если ЗначениеВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеВыбора.Значение = 0 Тогда 	
		ВыгрузитьОбъектВ1СНаКлиенте(Неопределено);		
	ИначеЕсли ЗначениеВыбора.Значение = 1 Тогда 	
		ВыгрузитьВложенияНаКлиенте(Неопределено);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбъектВ1СНаКлиенте(Команда)

	ВыгружаемыеДокументы = СформироватьМассивВыгружаемыхДокументов();

	Если ВыгружаемыеДокументы.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя(
			"Не выбрано ни одного документа.",,"",
			КартинкаОшибка());
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОбъектВ1С(ВыгружаемыеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбъектВ1С(ВыгружаемыеДокументы)
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	Контекст = Новый Структура;
	Контекст.Вставить("algorithm", "Документы_update");
	EndpointArgs = Новый Структура;
	EndpointArgs.Вставить("list_doc_ref", ВыгружаемыеДокументы);
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("EndpointArgs", EndpointArgs);
	Контекст.Вставить("ПараметрыВызова", ПараметрыВызова);
	Контекст.Вставить("context_params", context_params);
	Контекст.Вставить("НазваниеОперации", "Выгрузка в 1С");
	BlocklyExecutor.ЗапуститьINI(Контекст);

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВложенияНаКлиенте(Команда)
	ВыгружаемыеДокументы = СформироватьМассивВыгружаемыхДокументов1С();

	Если ВыгружаемыеДокументы.Количество() Тогда
		ПроверкаОбмена = ПроисходилЛиОбменДокументов(ВыгружаемыеДокументы);
		ВыгрузитьВложенияИзСБИС( ПроверкаОбмена.БылОбмен, Новый Структура("Форма", Неопределено) );
	Иначе
		ПоказатьОповещениеПользователя(
			"",,"Данный документ отсутствует в 1С"
			,КартинкаОшибка());
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_Helpers_ПреобразованиеТиповСБИСАПИ3 //&НаКлиенте
#КонецОбласти

