
&НаКлиенте
Процедура ВыполнитьВSABYНажатие(Команда)
	
	СписокДокументовСБИС = Новый Массив();
	СписокДокументов1С = Новый Массив();
	СформироватьМассивыДокументов(СписокДокументовСБИС, СписокДокументов1С);
	
	Если СписокДокументовСБИС.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя(
			"Не выбрано ни одного документа.",,"",
			БиблиотекаКартинок["Ошибка32"],
			СтатусОповещенияПользователя.Важное, Новый УникальныйИдентификатор);
		Возврат;
	КонецЕсли;

	ПараметрыВФорму = Новый Структура("СписокДокументовСБИС, СписокДокументов1С, МожноПереотправитьВСБИС, МожноОбновитьВСБИС", 
	СписокДокументовСБИС, СписокДокументов1С, СписокДокументов1С.Количество() > 0, Истина);
	Попытка
		ОткрытьФормуОбработки("ВыполнитьДействие",ПараметрыВФорму, ЭтаФорма, Новый УникальныйИдентификатор()); 
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ПоказатьОповещениеПользователя(
			"Ошибка при открытии формы.",
			,ОшибкаСтруктура.message +" "+ ОшибкаСтруктура.detail,
			БиблиотекаКартинок["Ошибка32"],
			СтатусОповещенияПользователя.Важное, Новый УникальныйИдентификатор);
		Возврат;
	КонецПопытки;
КонецПроцедуры

