
&НаКлиенте
Процедура ПоискНажатие(Элемент)
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	ЭлемФормы = ПолучитьЭлементыФормы();
	Элем = ЭлемФормы.Найти("ФильтрМаска");
	Если Элем = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеФильтра.Значения.Вставить("ФильтрМаска", СтрЗаменить(ЭтаФорма.ФильтрМаска, """", """"""));
	ДанныеФильтра.Значения.Вставить("Search", СтрЗаменить(ЭтаФорма.ФильтрМаска, """", """"""));
	ЭтаФорма.Страница = 0;
	ЭтаФорма.СтраницыПоРодителям = Неопределено;
	Если ИмяТаблицы = "ПлоскийСписок" Тогда
		ПлоскийСписок.Очистить();
	Иначе
		ИерархическийСписок.ПолучитьЭлементы().Очистить();
	КонецЕсли;	
	ОбновитьСписок(ДанныеФильтра.Значения);
КонецПроцедуры

