
&НаКлиенте
Функция ПолучитьДействияОбъекта(ПроверкаОбмена, context_params, Команда, ПараметрКоманды) 
	//Переданные документы
	ДействияОбъекта = Неопределено;
	Если ПроверкаОбмена.БылОбмен.Количество() Тогда
		//Проверим возможность получения действий для первого элемента массива
		//Проверка для большого массива займёт уйму времени, поэтому только 0й элемент
		Попытка    
			ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
			ДействияОбъекта = ТранспортИнтеграции.ПолучитьДействияДляОбъекта(ПроверкаОбмена.БылОбмен[0].Ссылка, context_params);
		Исключение                  
			ИнфоОбОшибке = ИнформацияОбОшибке();
			СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
			НеобходимаНеобходимоВвестиКод = НеобходимоВвестиКодПодтверждения(СтруктураОшибки);
			Если СтруктураОшибки.type = "Unauthorized" или НеобходимаНеобходимоВвестиКод Тогда
				ВходяшиеПараметры	= Новый Структура("Команда, ПараметрКоманды", Команда, ПараметрКоманды);
				ПроверкаВведенныхДанныхАутентификации = Новый ОписаниеОповещения("_ПослеАутентификации", ЭтотМодуль(), ВходяшиеПараметры);
				ОткрытьФормуОбработки("Вход", , , , ПроверкаВведенныхДанныхАутентификации);
				Возврат "Необходима авторизация";
			КонецЕсли;
		КонецПопытки;
	КонецЕсли;  
	
	Если ТипЗнч(ДействияОбъекта) <> Тип("Массив") 
		И get_prop(ДействияОбъекта, "message2user") <> Неопределено Тогда
		СообщениеПользователю = get_prop(ДействияОбъекта, "message2user");
		СтатусОперации = get_prop(ДействияОбъекта, "status");
		КартинкаОповещения = КартинкаУспешно();
		ЗаголовокОповещения = "Внимание";
		СообщениеПользователю = СообщениеПользователю + " " + Символы.ПС + СокрЛП(ПроверкаОбмена.БылОбмен[0].Ссылка);
		Если СтатусОперации = "error" Тогда
			ЗаголовокОповещения = "Ошибка";
			КартинкаОповещения = КартинкаОшибка();
		КонецЕсли;
		ПоказатьОповещениеПользователя(
			ЗаголовокОповещения,
			,СообщениеПользователю
			,КартинкаОповещения
			,СтатусОповещенияПользователя.Важное
			, Новый УникальныйИдентификатор
		);
	КонецЕсли;

	Возврат ДействияОбъекта; 
КонецФункции

// ОбщегоНазначенияКлиентСервер.ДополнитьМассив

&НаКлиенте
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь) Экспорт
	
	Если ТолькоУникальныеЗначения Тогда
		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверкаПередаваемыхДокументов(ПроверкаОбмена, ВопросыПользователю)
	СтатусЧерновик = 0;
	СтатусЗавершено = 7;
	СтатусОшибка = 9;
	
	КоличествоСОшибками = 0;
	КоличествоЗавершенных = 0;
	КоличествоЧерновиков = 0;
	КоличествоСПометкойУдаления = 0;
	
	Если ТипЗнч(get_prop(ПроверкаОбмена, "Удаленные", Неопределено)) = Тип("Массив") Тогда
		КоличествоСПометкойУдаления = ПроверкаОбмена.Удаленные.Количество();	
	КонецЕсли;
	
	МассивБылОбмен = Новый Массив;
	МассивЧерновики = Новый Массив;
	МассивЗавершено = Новый Массив;
	МассивСОшибками = Новый Массив;
	
	Для Каждого ЗаписьОбъекта Из ПроверкаОбмена.БылОбмен Цикл
		// Состчитаем статусы, разнесём по разным массивам
		Если ЗаписьОбъекта.СостояниеИдСБИС = СтатусЧерновик Тогда
			КоличествоЧерновиков = КоличествоЧерновиков + 1;
			МассивЧерновики.Добавить(ЗаписьОбъекта);	
		ИначеЕсли ЗаписьОбъекта.СостояниеИдСБИС = СтатусЗавершено Тогда
			КоличествоЗавершенных = КоличествоЗавершенных + 1;
			МассивЗавершено.Добавить(ЗаписьОбъекта);	
		ИначеЕсли ЗаписьОбъекта.СостояниеИдСБИС = СтатусОшибка Тогда
			КоличествоСОшибками = КоличествоСОшибками + 1;
			МассивСОшибками.Добавить(ЗаписьОбъекта);	
		Иначе
			МассивБылОбмен.Добавить(ЗаписьОбъекта);	
		КонецЕСли;
	КонецЦикла;
	
	// Установим новые значения
	ПроверкаОбмена.БылОбмен = МассивБылОбмен;
	ДополнитьМассив(ПроверкаОбмена.БылОбмен, МассивЗавершено, Истина);
	ДополнитьМассив(ПроверкаОбмена.БылОбмен, МассивЧерновики, Истина);
	
	ДополнитьМассив(ПроверкаОбмена.ОбменаНебыло, МассивСОшибками, Истина);
	
	Если КоличествоЗавершенных > 0 Тогда
		ВопросКПользователю = "Один или несколько документов уже отправлены, и в "
			+ ЛокализацияНазваниеПродукта() + " по ним завершен документооборот. Загрузить их повторно?";
		ВопросыПользователю.Добавить( Новый Структура("ТекстВопроса, КодСтатуса", ВопросКПользователю, СтатусЗавершено) );
	КонецЕсли;
	
	// Один объект с пометкой, сообщим в единственном числе
	Если КоличествоСПометкойУдаления = 1 Тогда
		ПоказатьОповещениеПользователя(
			"Внимание",
			,
			"Объект помечен на удаление в 1С. Он исключен из отправки в " + ЛокализацияНазваниеПродукта(),
			КартинкаИнформация(),
			СтатусОповещенияПользователя.Важное, 
			Новый УникальныйИдентификатор);
	КонецЕсли;
	
	// Несколько объектов с пометкой, сообщим во множественном числе
	Если КоличествоСПометкойУдаления > 1 Тогда
		ПоказатьОповещениеПользователя(
			"Внимание",
			,
			"Часть объектов ("+Формат(КоличествоСПометкойУдаления, "ЧГ=0") 
				+ ") помечены на удаление в 1С. Они были исключены из отправки в " + ЛокализацияНазваниеПродукта(),
			КартинкаИнформация(),
			СтатусОповещенияПользователя.Важное, 
			Новый УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры	


&НаКлиенте
Процедура ЗагрузитьВСБИС( Команда, ПараметрКоманды ) Экспорт 

	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	Если ТребуетсяАутентификация(context_params, Команда, ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;	
	
	мСсылок = ПолучитьСписокСсылокНаОбъектыКоманды( ПараметрКоманды );
	ДопПараметры = Новый Структура("ИмяИни,УдаленныеВОтдельныйМассив", ПараметрКоманды.ОписаниеКоманды.ПараметрыФормы.ИмяИни, Истина);
	ПроверкаОбмена = ПроисходилЛиОбменДокументов(мСсылок.Источник, ДопПараметры);
	
	//Вначале отсортирем документы по был небыл отправлен
	ВопросыПользователю = Новый Массив;
	ПроверкаПередаваемыхДокументов(ПроверкаОбмена, ВопросыПользователю);
	
	ДопПараметры		= Новый Структура();
	ДопПараметры.Вставить("ПроверкаОбмена", ПроверкаОбмена);
	ДопПараметры.Вставить("ПараметрКоманды", ПараметрКоманды);
	ДопПараметры.Вставить("Команда", Команда);
	ДопПараметры.Вставить("ВопросыПользователю", ВопросыПользователю);
	ДопПараметры.Вставить("context_params", context_params);
	
	Если ВопросыПользователю.Количество() = 0 Тогда
		ЗагрузитьВСБИСДействие(Команда, ДопПараметры);
	Иначе
		ВопросКПользователю = ВопросыПользователю[0].ТекстВопроса;
		
		ДействиеВопроса = Новый ОписаниеОповещения(
			"ЗагрузитьВСБИСОбработкаОтветаНаВопрос", 
			ЭтотМодуль(),
			ДопПараметры
		);
		ПоказатьВопрос(ДействиеВопроса,
			ВопросКПользователю,
			РежимДиалогаВопрос.ДаНет,
			0,
			КодВозвратаДиалога.Да,
			"Загрузить повторно?");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВСБИСОбработкаОтветаНаВопрос(ОтветПользователя, ПараметрКоманды ) Экспорт 
	ВопросКПользователю = Неопределено;
	ВопросыПользователю = Неопределено;
	ПараметрКоманды.Свойство("ТекстВопроса", ВопросКПользователю);
	ПараметрКоманды.Свойство("ВопросыПользователю", ВопросыПользователю);
	КодСтатуса	= ВопросыПользователю[0].КодСтатуса;
	ВопросыПользователю.Удалить(0);

	ПроверкаОбмена	= Неопределено;
	ПараметрКоманды.Свойство("ПроверкаОбмена", ПроверкаОбмена);
	
	// Ответ на вопрос - Загрузить их повторно?
	Если ОтветПользователя  = КодВозвратаДиалога.Нет Тогда
		НовыйМассивДокументов = Новый Массив;
		Для Каждого ЗаписьДокумента Из ПроверкаОбмена.БылОбмен Цикл
			Если ЗаписьДокумента.СостояниеИдСБИС <> КодСтатуса Тогда
				НовыйМассивДокументов.Добавить(ЗаписьДокумента);
			КонецЕсли;
		КонецЦикла;
		// Обновить значение массива, удалили из списка документы раз уж пользователь отказался их загружать
		ПроверкаОбмена.Вставить("БылОбмен", НовыйМассивДокументов);
		// Обновить значение реквизита ПроверкаОбмена
		ПараметрКоманды.Вставить("ПроверкаОбмена", ПроверкаОбмена);
	КонецЕсли;
	Если ОтветПользователя  = КодВозвратаДиалога.Да Тогда
		НовыйМассивДокументовБыл = Новый Массив;
		НовыйМассивДокументовНебыл = Новый Массив;
		Для Каждого ЗаписьДокумента Из ПроверкаОбмена.БылОбмен Цикл
			Если ЗаписьДокумента.СостояниеИдСБИС <> КодСтатуса Тогда
				НовыйМассивДокументовБыл.Добавить(ЗаписьДокумента);
			Иначе
				НовыйМассивДокументовНебыл.Добавить(ЗаписьДокумента);
			КонецЕсли;
		КонецЦикла;
		// Обновить значение массивов объектов
		ПроверкаОбмена.Вставить("БылОбмен", НовыйМассивДокументовБыл);
		//Добавим новые значения в массив
		ДополнитьМассив(ПроверкаОбмена.ОбменаНебыло, НовыйМассивДокументовНебыл, Истина);
		ПроверкаОбмена.Вставить("ОбменаНебыло", НовыйМассивДокументовНебыл);
		// Обновить значение реквизита ПроверкаОбмена
		ПараметрКоманды.Вставить("ПроверкаОбмена", ПроверкаОбмена);
	КонецЕсли;
	
	Если ВопросыПользователю.Количество() > 0 Тогда
		ВопросКПользователю = ВопросыПользователю[0].ТекстВопроса;
		ДействиеВопроса = Новый ОписаниеОповещения("ЗагрузитьВСБИСОбработкаОтветаНаВопрос", ЭтотМодуль(), ПараметрКоманды);
		ПоказатьВопрос(ДействиеВопроса,
			ВопросКПользователю,
			РежимДиалогаВопрос.ДаНет,
			0,
			КодВозвратаДиалога.Да,
			"Загрузить повторно?");
		Возврат;
	КонецЕсли;
		
	ЗагрузитьВСБИСДействие(Неопределено, ПараметрКоманды);
КонецПроцедуры

// BSLLS:CognitiveComplexity-off
&НаКлиенте
Процедура ЗагрузитьВСБИСДействие( Команда, ВхПараметры ) Экспорт 
	
	ПроверкаОбмена = Неопределено;
	ВхПараметры.Свойство("ПроверкаОбмена", ПроверкаОбмена);
	ПараметрКоманды = Неопределено;
	ВхПараметры.Свойство("ПараметрКоманды", ПараметрКоманды);

	context_params = Неопределено;
	ВхПараметры.Свойство("context_params", context_params);
	
	ДействияОбъекта = ПолучитьДействияОбъекта(ПроверкаОбмена, context_params, Команда, ПараметрКоманды);
	Если ДействияОбъекта = "Необходима авторизация" Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("ПараметрКоманды", ПараметрКоманды);
	ОповешениеОЗакрытии = Новый ОписаниеОповещения("ПослеОтправитьВСБИС", ЭтотМодуль(), ДопПараметры);

	//Обработанные
	ОткрытьФормуДДЗ = Ложь;
	ПараметрыВФормуДДЗ = Новый Структура; 
	Если ДействияОбъекта = Неопределено Или ТипЗнч(ДействияОбъекта)	<> Тип("Массив") Тогда
		//Действий для объекта нет, либо объект/документ удален на стороне сервера, и требуется переотправка
		Для Каждого ДанныеПоДокументу Из ПроверкаОбмена.БылОбмен Цикл
			//Перенесем объекты в список не обработаных     
			ПроверкаОбмена.ОбменаНебыло.Добавить(ДанныеПоДокументу);
		КонецЦикла;
	Иначе
		СписокДокументовСБИС = Новый Массив();
		СписокДокументов1С = Новый Массив();
		Для Каждого СтрокаСпискаЗадач Из ПроверкаОбмена.БылОбмен Цикл 
			ДокументСБИС = Новый Структура("Идентификатор, ПервичныйКлюч, Документ1С", 
				СтрокаСпискаЗадач.UID,
				"",
				СтрокаСпискаЗадач.Ссылка);	
			СписокДокументовСБИС.Добавить(ДокументСБИС);

			СписокДокументов1С.Добавить(СтрокаСпискаЗадач.Ссылка);
		КонецЦикла;

		ПараметрыВФормуДДЗ = Новый Структура("СписокДокументовСБИС, СписокДокументов1С, МожноПереотправитьВСБИС, МожноОбновитьВСБИС", 
		СписокДокументовСБИС, СписокДокументов1С, СписокДокументов1С.Количество() > 0, Истина);
		ОткрытьФормуДДЗ = Истина;
	КонецЕсли;
	// todo Удалить по 88221034752179
	ПроверкаОбмена.Вставить("ОбменСразу", Новый Массив);
	СуществуетОбъектКонфигурации = Ложь;
	МассивОбменаНеБыло = Новый Массив();
	МодульCore = МодульCore();
	Если ТипЗнч(МодульCore) <> Тип("ФормаКлиентскогоПриложения") Тогда
		Попытка
			СуществуетОбъектКонфигурации = МодульCore.СбисСуществуетОбъектКонфигурацииСервер("ДокументСсылка.РеализацияТоваровУслуг", 
			Новый Структура("КлассМетаданных", "Документы"));
		Исключение       
			СуществуетОбъектКонфигурации = Ложь;
		КонецПопытки;
	КонецЕсли;
	Если СуществуетОбъектКонфигурации Тогда
		Для ИндексМассива = 0 По ПроверкаОбмена.ОбменаНебыло.Количество() - 1 Цикл
			Если ТипЗнч(ПроверкаОбмена.ОбменаНебыло.Получить(ИндексМассива).Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда   
				ПроверкаОбмена.ОбменСразу.Добавить(ПроверкаОбмена.ОбменаНебыло.Получить(ИндексМассива));   
			Иначе
				МассивОбменаНеБыло.Добавить(ПроверкаОбмена.ОбменаНебыло.Получить(ИндексМассива));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	Если ПроверкаОбмена.ОбменСразу.Количество() Тогда
	
		  ПроверкаОбмена.ОбменаНебыло.Очистить();
		  ПроверкаОбмена.ОбменаНебыло = МассивОбменаНеБыло;
	
	КонецЕсли;
	
	Если ПроверкаОбмена.ОбменСразу.Количество() Тогда
		 ПараметрыВФормуЗД = Новый Структура("Источник", ПроверкаОбмена.ОбменСразу);
		 ФормаЗагрузкаДокументов = ПолучитьФормуОбработки("ЗагрузкаДокументов", ПутьКФормамОбработки(), ПараметрыВФормуЗД); 
		 ФормаЗагрузкаДокументов.ЗагрузитьВСБИССразу();
	КонецЕсли;  
	 
	//Еще не обработанные
	Если ПроверкаОбмена.ОбменаНебыло.Количество() Тогда
		ПараметрыВФормуЗД = Новый Структура("Источник", ПроверкаОбмена.ОбменаНебыло);
		ОткрытьФормуОбработки(
		"ЗагрузкаДокументов",
		ПараметрыВФормуЗД,
		ПараметрКоманды.Форма,
		Новый УникальныйИдентификатор(),
		ОповешениеОЗакрытии);
	КонецЕсли;  

	
	//Формы выполнить действие должна быть активной, поэтому открывается последней
	Если ОткрытьФормуДДЗ Тогда 
		Попытка
			ОткрытьФормуОбработки("ВыполнитьДействие",
			ПараметрыВФормуДДЗ,
			ПараметрКоманды.Форма,
			Новый УникальныйИдентификатор(),
			ОповешениеОЗакрытии);
		Исключение
			ИнфоОбОшибке = ИнформацияОбОшибке();
			СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
			ОписаниеОшибки = get_prop(СтруктураОшибки, "detail", Новый Структура);
			ПоказатьОповещениеПользователя(
			"Ошибка",
			,
			ОписаниеОшибки,
			КартинкаОшибка(),
			СтатусОповещенияПользователя.Важное,
			Новый УникальныйИдентификатор
			);
		КонецПопытки; 
	КонецЕсли;
	
	//Обновим табличную часть. т.к. могли быть удалены записи из регистра
	ДопПараметры = Новый Структура("ПараметрКоманды", ПараметрКоманды);
	ОбновитьТабличнуюЧастьФормы(Неопределено, ДопПараметры);
КонецПроцедуры
// BSLLS:CognitiveComplexity-on

