
&НаКлиенте
Процедура ПриНажатииВыгрузитьВложенияИзСБИС( Команда, ПараметрКоманды ) Экспорт 
	
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	ДопПараметры = Новый Структура("Команда, ПараметрКоманды", Команда, ПараметрКоманды);
	ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ВыгрузитьВложенияИзСБИСПослеАвторизации", ЭтотМодуль(), ДопПараметры);
	ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции,  ОбработчикПослеАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВложенияИзСБИСПослеАвторизации(Результат, ДопПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	Команда = ДопПараметры.Команда;
	ПараметрКоманды = ДопПараметры.ПараметрКоманды;

	ОповещениеОЗавершении = Неопределено;
	Если Не ПараметрКоманды.ЭтоФормаОбъекта Тогда
        ОповещениеОЗавершении = ПолучитьОповещениеОбновлнияТаблицыФормы(Команда, ПараметрКоманды);
	КонецЕсли;
	
	мСсылок = ПолучитьСписокСсылокНаОбъектыКоманды(ПараметрКоманды );
	ПроверкаОбмена = ПроисходилЛиОбменДокументов(мСсылок.Источник);
	
	Если ПроверкаОбмена.ОбменаНебыло.Количество()  = 0 И ПроверкаОбмена.БылОбмен.Количество() > 0 Тогда
		ВыгрузитьВложенияИзСБИС(ПроверкаОбмена.БылОбмен, ПараметрКоманды, ОповещениеОЗавершении);
	ИначеЕсли ПроверкаОбмена.ОбменаНебыло.Количество()  > 0 Тогда
		ДопПараметры	= Новый Структура("Данные, Форма, ОповещениеОЗавершении", ПроверкаОбмена, ПараметрКоманды.Форма, ОповещениеОЗавершении);
		ДействиеВопроса = Новый ОписаниеОповещения("ОтветНаВопросОтправитьВложенияВСБИС", ЭтотМодуль(), ДопПараметры);
		ПоказатьВопрос(ДействиеВопроса, 
			"Среди выбранных для выгрузки вложений документов есть " +
			Формат(ПроверкаОбмена.ОбменаНебыло.Количество(), "ЧГ=0") +
			" которые в СБИС не загружались. Загрузить их?",
			РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да, "Документ не найден в " + ЛокализацияНазваниеПродукта());
		Возврат;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#Область include_core_base_ВстраиваниеВФормы_ВыгрузитьВложенияИзСБИСОбщее
#КонецОбласти


