
Функция ПроисходилЛиОбменДокументовСоСБИС(Источник, ДопПараметры=Неопределено) Экспорт
	МодульОбъекта = ПолучитьМодульОбъекта();
	Возврат МодульОбъекта.ПроисходилЛиОбменДокументовСоСБИС(Источник, );
КонецФункции

Функция ПолучитьСсылкиНаДокументыВСБИС(Источник, ПолучитьТикет = Ложь) Экспорт
	МодульОбъекта = ПолучитьМодульОбъекта();
	Возврат МодульОбъекта.ПолучитьСсылкиНаДокументыВСБИС(Источник, ПолучитьТикет);
КонецФункции

Функция ПолучитьДействияДляОбъекта(СсылкаНаОбъект, context_params) Экспорт
	МодульОбъекта = ПолучитьМодульОбъекта();
	Возврат МодульОбъекта.ПолучитьДействияДляОбъекта(СсылкаНаОбъект, context_params);
КонецФункции

