
Функция ПроисходилЛиОбменДокументов(Источник, ДопПараметры=Неопределено) Экспорт
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.ПроисходилЛиОбменДокументов(Источник);
КонецФункции

Функция ПолучитьСсылкиНаДокументыВИнтеграции(Источник, ПолучитьТикет = Ложь) Экспорт
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.ПолучитьСсылкиНаДокументыВИнтеграции(Источник, ПолучитьТикет);
КонецФункции

Функция ПолучитьДействияДляОбъекта(СсылкаНаОбъект, context_params) Экспорт
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.ПолучитьДействияДляОбъекта(СсылкаНаОбъект, context_params);
КонецФункции

