
Процедура ЛокализацияДействиеПриОткрытии()
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	// BSLLS:UnusedLocalVariable-off интерфейсные переменные
	Saby_ИспользоватьЭЛН	= Ложь;
	exchange_method = "API";
	// BSLLS:UnusedLocalVariable-on
	ЭлементыФормочки.ГруппаПереключательТранспорта.Видимость = Ложь;
	ЭлементыФормочки.РоботОперации.Видимость = Ложь;
	ЭлементыФормочки.Saby_ИспользоватьЭЛН.Видимость = Ложь;
	ЭлементыФормочки.send_type.СписокВыбора.Очистить();
	ЭлементыФормочки.send_type.СписокВыбора.Добавить("Email", "Email");
	
	ЭлементыФормочки.ОткрытьКадровыеДокументы.Подсказка = "Открыть реестр " + ЛокализацияНазваниеПродукта() + " ""Кадровые документы"" в браузере";
	ЭлементыФормочки.ОткрытьЗадачи.Подсказка = "Открыть реестр " + ЛокализацияНазваниеПродукта() + " ""Задачи"" в браузере";
	ЭлементыФормочки.ОткрытьЖурналДокументов.Подсказка = "Открыть реестр всех синхронизированных с " + ЛокализацияНазваниеПродукта() + " документов";
	ЭлементыФормочки.Выйти.Подсказка = "Закрыть сессию " + ЛокализацияНазваниеПродукта();
КонецПроцедуры

