Процедура ЗаписатьСтатистикуПриОбновленииМодуля(ВерсияПродукта)
	context_params = НастройкиПодключенияПрочитать();
	МассивСтатистики = Новый Массив;
	НаименованиеДействия = "UpdateProduct";
	КонтекстДействия = ВерсияПродукта;
	
	ЭлементСтатистики = ТранспортИнтеграции.local_helper_element_action(НаименованиеДействия, КонтекстДействия, Новый Структура(), 1);
	МассивСтатистики.Добавить(ЭлементСтатистики);
	ТранспортИнтеграции.local_helper_register_actions(context_params, МассивСтатистики);
КонецПроцедуры	

