
// НазваниеОбъекта
//
// Параметры:
// 	ИмяИни - Строка - Имя Ини
// 	connection_info - Структура - Информация о соединении
//
// Возвращаемое значение:
//  - Строка - Название ини
//
//DynamicDirective
Функция НазваниеОбъекта(ИмяИни, connection_info)

	_data = "Result";
	Результат = Неопределено;
	ПараметрыВызова = Новый Структура();
	ПараметрыВызова.Вставить("Algorithm", ИмяИни);
	ПараметрыВызова.Вставить("object", Новый Структура("object", Неопределено));
	ПараметрыВызова.Вставить("Endpoint", "info"); 
	ПараметрыВызова.Вставить("EndpointArgs", Неопределено); 
	ПараметрыВызова.Вставить("ContextId", Неопределено); 
	ПараметрыВызова.Вставить("ConnectionId", connection_info["ConnectionId"]); 
	ПараметрыВызова.Вставить("ReadPublicParam", Ложь);
	result	= ПолучитьФормуBlockly().API_BLOCKLY_RUN(ПараметрыВызова);
	Если get_prop(result, "Status", Неопределено) = "complete" Тогда 
		data = get_prop(result, _data, Неопределено);
		Результат = get_prop(data, "ext_sys_obj_title");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Результат) Тогда
		ИмяИниВМассив = СтрРазделитьПодстрокой(ИмяИни, "_", Ложь); 
		Если ИмяИниВМассив.Количество() > 0 Тогда
			Результат = ИмяИниВМассив[0];	
		КонецЕсли;	
	КонецЕсли;
	Возврат Результат;
КонецФункции	

// ДобавитьПунктВстраиваемогоМеню
//
// Параметры:
// 	ИмяИни - Строка - Имя Ини
// 	connection_info - Структура - Информация о соединении
// 	ВстраиваемоеМеню - Структура - Встраиваемое Меню
// 	НазваниеОбъекта- Строка - Название Объекта
//
//DynamicDirective
Процедура ДобавитьПунктВстраиваемогоМеню(ИмяИни, connection_info, ВстраиваемоеМеню, НазваниеОбъекта)
	_data = "Result";
	Если Не ЗначениеЗаполнено(НазваниеОбъекта) Тогда
		Возврат;
	КонецЕсли;	
	ПараметрыВызова = Новый Структура();
	ПараметрыВызова.Вставить("Algorithm", ИмяИни);
	ПараметрыВызова.Вставить("EndpointArgs", Неопределено);
	ПараметрыВызова.Вставить("Endpoint", "toolbar"); 
	ПараметрыВызова.Вставить("params", Неопределено); 
	ПараметрыВызова.Вставить("ContextId", Неопределено); 
	ПараметрыВызова.Вставить("ConnectionId", connection_info["ConnectionId"]);
	ПараметрыВызова.Вставить("ReadPublicParam", Ложь);
	result	= ПолучитьФормуBlockly().API_BLOCKLY_RUN(ПараметрыВызова);
	Если get_prop(result, "Status", Неопределено) = "complete" Тогда
		data = get_prop(result, _data, Неопределено);
		Если ЗначениеЗаполнено(data) Тогда
			ВстраиваемоеМеню.Вставить(НазваниеОбъекта, data);
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	ПараметрыВызова.Вставить("Endpoint", "view"); 
	result	= ПолучитьФормуBlockly().API_BLOCKLY_RUN(ПараметрыВызова);
	Если get_prop(result, "Status", Неопределено) = "complete" Тогда
		data = get_prop(result, _data, Неопределено);
		toolbar = get_prop(result, "Toolbar", Неопределено);
		Если ЗначениеЗаполнено(toolbar) Тогда
			ВстраиваемоеМеню.Вставить(НазваниеОбъекта, data);
			Возврат; 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

// ЗагрузитьПредопределенныеОбъекты
//
// Параметры:
// 	Элем - Структура - Элемент массива ини
// 	СчетОбъектов - Число - Номер текушего элемента
// 	ВсегоОбъектов - Число - Всего элементов массива
//
// Возвращаемое значение:
//  - Число - Процент прогресса
//
//DynamicDirective
Функция ОтобразитьПрогресс(Элем, СчетОбъектов, ВсегоОбъектов)
	СтоПроцентов = 100;
	ПроцентПрогресса = Окр(СчетОбъектов / ВсегоОбъектов * СтоПроцентов, 0);
	ИмяОбъектаСинхронизации = Элем.Ключ;
	ИмяОбъектаСинхронизации = get_prop(Элем.Значение, "data", Элем.Ключ);
	ИмяОбъектаСинхронизации = get_prop(ИмяОбъектаСинхронизации, "КрасивоеНазвание", Элем.Ключ);
	ИмяОбъектаСинхронизации = get_prop(ИмяОбъектаСинхронизации, "Значение", Элем.Ключ);
	СообщитьПрогрессОперации(, "Синхронизация " + ИмяОбъектаСинхронизации, Новый Структура("Прогресс", ПроцентПрогресса));
	Возврат ПроцентПрогресса;
КонецФункции

// ЗагрузитьПредопределенныеОбъекты
//
// Параметры:
// 	connection_info - Структура - Информация о соединении
//
//DynamicDirective
Процедура ЗагрузитьПредопределенныеОбъекты(connection_info)  Экспорт
	СчетОбъектов = 1;
	ПроцентПрогресса = 0;
	
	ВсегоОбъектов = connection_info["ExtSysSettings"].Количество();
	СтоПроцентов = 100;
	Для каждого Элем Из connection_info["ExtSysSettings"] Цикл
		ПроцентПрогресса = ОтобразитьПрогресс(Элем, СчетОбъектов, ВсегоОбъектов);
		СчетОбъектов = СчетОбъектов + 1;
		
		ИмяИни = СтрЗаменить(Элем.Ключ, "Blockly_", "");
		Если Найти(ИмяИни, "predefine") > 0 Тогда
			Попытка
				ПараметрыВызова = Новый Структура();
				ПараметрыВызова.Вставить("Algorithm", ИмяИни);
				ПараметрыВызова.Вставить("EndpointArgs", Неопределено);
				ПараметрыВызова.Вставить("Endpoint", Неопределено);
				ПараметрыВызова.Вставить("params", Неопределено);
				ПараметрыВызова.Вставить("ContextId", Неопределено);
				ПараметрыВызова.Вставить("ConnectionId", connection_info["ConnectionId"]);
				ПараметрыВызова.Вставить("integration_id", connection_info["IntegrationId"]);
				result	= ПолучитьФормуBlockly().API_BLOCKLY_RUN(ПараметрыВызова);
				Если result["Status"] = "complete" Тогда
					ТранспортИнтеграции.ЗаписатьМаппингПредопределенных(context, result);
					Продолжить;
				КонецЕсли;
				Если result["Status"] = "error" Тогда
					ВызватьИсключение NewExtExceptionСтрока(, "Не удалось загрузить предопределенные данные - " + ИмяИни,
						"command_processpredefineobject");	
				КонецЕсли;	
				
			Исключение
				ИнфОбОшибке = ИнформацияОбОшибке();
				ДанныеПрогресса = Новый Структура("Прогресс, status", ПроцентПрогресса, "error");
				СообщитьПрогрессОперации(, "Синхронизация завершена с ошибкой", ДанныеПрогресса);
				ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, "Объект не содержит необходимый параметр"));
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;
	

	Если ВсегоОбъектов > 0 Тогда
		ДанныеПрогресса = Новый Структура("Прогресс, status", СтоПроцентов, "complete");
		СообщитьПрогрессОперации(, "Синхронизация завершена", ДанныеПрогресса);
	КонецЕсли;

КонецПроцедуры

// ПриСозданииНовогоПодключения
//
// Параметры:
// 	connection_info - Структура - Информация о соединении
//
// Возвращаемое значение:
//  - Булево - Успешное выполнение метода
//
//DynamicDirective
Функция ПриСозданииНовойИнтеграции(connection_info) Экспорт
	
	ЗагрузитьПредопределенныеОбъекты(connection_info);
	
	Возврат Истина;
КонецФункции
