
#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_Helpers_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_base_CommonModule_ИменаМодулейСервер
#КонецОбласти

#Область include_base_CommonModule_ИменаМодулейКлиент
#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандыОбщее
#КонецОбласти

&НаКлиенте
Функция ПолучитьОповещениеОбновлнияТаблицыФормы( Команда, ПараметрКоманды ) Экспорт 
	
	ДопПараметры = Новый Структура("ПараметрКоманды", ПараметрКоманды);
    ОповешениеОЗакрытии = Новый ОписаниеОповещения("ОбновитьТабличнуюЧастьФормы", МодульКомандыОбменаДляФормыКлиент(), ДопПараметры);
    Возврат ОповешениеОЗакрытии; 
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТабличнуюЧастьФормы( Действие, ДополнительныеПараметры ) Экспорт 
	
	ПараметрКоманды    = ДополнительныеПараметры.ПараметрКоманды;
    Если ТипЗнч(ПараметрКоманды.Источник) = Тип("ТаблицаФормы") Тогда
        ТблСписок = ПараметрКоманды.Форма.Элементы.Найти(ПараметрКоманды.Источник.Имя);
        ТблСписок.Обновить();    
	КонецЕсли;
	
КонецПроцедуры

#Область include_core_base_ВстраиваниеВФормы_КомандаВыгрузитьВложенияИзСБИС
#КонецОбласти

&НаКлиенте
Процедура ЗапускПроверкиНаличияПлагина() Экспорт
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере(); 
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	ТранспортИнтеграции.УстановитьВариантВебИнтерфейса(context_params);
КонецПроцедуры

Функция ПроверитьНаличиеПараметровПодключенияНаСервере() Экспорт
	Возврат МодульCore().ПроверитьНаличиеПараметровПодключения();
КонецФункции

Функция ПроисходилЛиОбменДокументов(Источник, ДопПараметры=Неопределено) Экспорт
	Возврат МодульВстраиваниеВСтандартныеФормы().ПроисходилЛиОбменДокументов(Источник, ДопПараметры);
КонецФункции

Функция ПолучитьСсылкиНаДокументыВИнтеграции(Источник, ПолучитьТикет = Ложь) Экспорт
	Возврат МодульВстраиваниеВСтандартныеФормы().ПолучитьСсылкиНаДокументыВИнтеграции(Источник, ПолучитьТикет);
КонецФункции

Функция ПолучитьДействияДляОбъекта(СсылкаНаОбъект, context_params) Экспорт
	Возврат МодульВстраиваниеВСтандартныеФормы().ПолучитьДействияДляОбъекта(СсылкаНаОбъект, context_params);
КонецФункции

Процедура ЗапуститьINIФоновымЗаданием(ini_name, ПараметрыВызоваИни, context_params = Неопределено,
		ФормаВладелец = Неопределено, ЗаголовокФормы="", ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено) Экспорт
	МодульФоновогоЗаданияКлиент().ЗапуститьINIФоновымЗаданием(
			ini_name, 
			ПараметрыВызоваИни, 
			context_params, 
			ФормаВладелец, 
			ЗаголовокФормы,
			ОповещениеОЗакрытииФормыФоновогоЗадания);
КонецПроцедуры

Функция ExtExceptionAnalyse(parent)
	Возврат МодульCore().ExtExceptionAnalyse(parent);
КонецФункции

Функция NewExtExceptionСтрока(parent = Неопределено, message = Неопределено, detail = Неопределено, action = Неопределено, dump = Неопределено, type = Неопределено) Экспорт
	Возврат МодульCore().NewExtExceptionСтрока(parent, message, detail, action, dump, type);
КонецФункции

Функция ExtExceptionToMessage(error) Экспорт 
	Возврат МодульCore().ExtExceptionToMessage(error);
КонецФункции


#Область include_core_base_ВстраиваниеВФормы_КомандаОткрытьСБИС
#КонецОбласти

&НаКлиенте
Процедура ПослеОтправитьВСБИС( Действие, ДополнительныеПараметры ) Экспорт 
	
	ПараметрКоманды	= ДополнительныеПараметры.ПараметрКоманды;
	Если ТипЗнч(ПараметрКоманды.Источник) = Тип("ТаблицаФормы") Тогда
		ТблСписок = ПараметрКоманды.Форма.Элементы.Найти(ПараметрКоманды.Источник.Имя);
		ТблСписок.Обновить();
	КонецЕсли;  
	
КонецПроцедуры

#Область include_core_base_Авторизация_Form_Вход_НеобходимоВвестиКодПодтверждения
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаЗагрузитьВСБИС
#КонецОбласти


&НаКлиенте
Процедура ПереоткрытиеФормыОтправки( Результат, Параметры ) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ПараметрКоманды", Новый Структура("Источник", Параметры.ОбъектыОтправки));
	ОповешениеОЗакрытии = Новый ОписаниеОповещения("ПослеОтправитьВСБИС", МодульКомандыОбменаДляФормыКлиент(), Параметры);  
	ПараметрыВФорму = Новый Структура("Источник", Параметры.ОбъектыОтправки);
	Filter = get_prop(Параметры, "Фильтр", Неопределено);
	Если ЗначениеЗаполнено(Filter) Тогда
		ПараметрыВФорму.Вставить("Filter", Filter);
	КонецЕсли;	
	ОткрытьФормуОбработки("ЗагрузкаДокументов",ПараметрыВФорму,Параметры.ВладелецФормы, Новый УникальныйИдентификатор(),ОповешениеОЗакрытии);
КонецПроцедуры

#Область include_core_base_ВстраиваниеВФормы_КомандаОбновитьСтатусы
#КонецОбласти

&НаКлиенте
Процедура ОткрытьОтчетОЗагрузке(context_param, ПараметрыФормы) Экспорт
	АдресСтраницы = context_param.ApiUrl+"/integration_config/ext-sync-doc-list/page/?extSyncDocId="+ПараметрыФормы.extSyncDocId;
	ПараметрыФормы.Вставить("Заголовок", "Отчет об отправке");
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормы.Вставить("context_param", context_param);
	ОткрытьФормуОбработки("Browser", ПараметрыФормы,,"Отчет об отправке");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуПодключения(context_param, ПараметрыФормы) Экспорт
	АдресСтраницы = context_param.ApiUrl + "/connection-card/page?connectionId=" + context_param.ConnectionUuid;
	ПараметрыФормы.Вставить("Заголовок", "Настройки интеграции");
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормы.Вставить("context_param", context_param);
	ОткрытьФормуОбработки("Browser", ПараметрыФормы,,"Страница подключения");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтпуска(context_param, ПараметрыФормы) Экспорт
	АдресСтраницы = context_param.ApiUrl+"/page/holidays?";
	ПараметрыФормы.Вставить("Заголовок", "Отпуска");
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормы.Вставить("context_param", context_param);
	ОткрытьФормуОбработки("Browser", ПараметрыФормы,,"Отпуска");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьБольничные(context_param, ПараметрыФормы) Экспорт
	АдресСтраницы = context_param.ApiUrl+"/page/allowance?";
	ПараметрыФормы.Вставить("Заголовок", "Больничные");
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормы.Вставить("context_param", context_param);
	ОткрытьФормуОбработки("Browser", ПараметрыФормы,,"Больничные");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачи(Параметр, ДопПараметры) Экспорт
	context_param	= МодульCore().НастройкиПодключенияПрочитать();
	Если get_prop(context_param, "session") <> Неопределено Тогда
		АдресСтраницы = context_param.ApiUrl+"/page/tasks-in-work"; //integration-tasks?connector=1C
	ИначеЕсли get_prop(context_param, "ApiUrl") <> Неопределено Тогда
		АдресСтраницы = context_param.ApiUrl+"/auth/";
	Иначе
		АдресСтраницы = "https://ie-1c.saby.ru/auth/";	
	КонецЕсли;	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок", "Задачи");
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормы.Вставить("context_param", context_param);
	ОткрытьФормуОбработки("Browser", ПараметрыФормы,,"Задачи");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКадровыеДокументы(Параметр, ДопПараметры) Экспорт
	context_param	= МодульCore().НастройкиПодключенияПрочитать();
	Если get_prop(context_param, "session") <> Неопределено Тогда
		АдресСтраницы = context_param.ApiUrl+"/page/tasks-in-work"; //integration-tasks?connector=1C
	ИначеЕсли get_prop(context_param, "ApiUrl") <> Неопределено Тогда
		АдресСтраницы = context_param.ApiUrl+"/auth/";
	Иначе
		АдресСтраницы = "https://ie-1c.saby.ru/auth/";	
	КонецЕсли;	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок", "Задачи");
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормы.Вставить("context_param", context_param);
	ОткрытьФормуОбработки("Browser", ПараметрыФормы,,"Кадровые документы");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуБраузера(Заголовок, АдресСтраницы, Уникальность=Неопределено) Экспорт
	ПараметрыФормы = Новый Структура( "Заголовок, АдресСтраницы",Заголовок, АдресСтраницы);
	ОткрытьФормуОбработки("Browser", ПараметрыФормы,,Уникальность );
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчетаОЗагрузке(ПараметрыЗагрузки) Экспорт
	АдресСтраницы = ПараметрыЗагрузки["params"]["ApiUrl"]+
	"/ext-sync-doc/page/?extSyncDocId="+
	ПараметрыЗагрузки["operation_uuid"];
	ОткрытьФормуБраузера("Отчет об отправке", АдресСтраницы, АдресСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьРасчетныйЛистокВСБИС(ПараметрыВызова, context_params) Экспорт	
	ПараметрыВызоваИни = Новый Структура("EndpointArgs", ПараметрыВызова);
	МодульФоновогоЗаданияКлиент().ЗапуститьINIФоновымЗаданием("РасчетныйЛисток_send", ПараметрыВызоваИни, context_params, Неопределено, "Загрузка в "+ЛокализацияНазваниеПродукта());	
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьПроизвольныйИНИ(ИмяИНИФайла, ПараметрыОповещения) Экспорт	
	context_params = get_prop(ПараметрыОповещения, "context_params");
	EndpointArgs = get_prop(ПараметрыОповещения, "ПараметрыВызова");
	ПараметрыВызова = Новый Структура("EndpointArgs", EndpointArgs);
	МодульФоновогоЗаданияКлиент().ЗапуститьINIФоновымЗаданием(ИмяИНИФайла, ПараметрыВызова, context_params, Неопределено, "Загрузка в "+ЛокализацияНазваниеПродукта());	
КонецПроцедуры 

&НаКлиенте
Функция ПроверитьПолнотуДанныхОтбораДляВызоваИНИ(ПараметрыВызова)
	Если ПараметрыВызова.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя(
		"Нет данных для отбора по расчётным листкам.",,
		"Ошибка подготовки данных"
		,БиблиотекаКартинок["Ошибка32"]
		,СтатусОповещенияПользователя.Важное);
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОтправитьСокращенныйРасчетныйЛистокВСБИС(ПараметрыВызова, context_params) Экспорт
	ПараметрыВызова = МодульВстраиваниеВСтандартныеФормы().ПодготовитьДанныеПрочийКадровыйРасчетныйЛисток(ПараметрыВызова);
	Если  НЕ ПроверитьПолнотуДанныхОтбораДляВызоваИНИ(ПараметрыВызова) Тогда
		Возврат;
	КонецЕсли;
	ПараметрыВызоваИни = Новый Структура("EndpointArgs", ПараметрыВызова);
	МодульФоновогоЗаданияКлиент().ЗапуститьINIФоновымЗаданием("СокращенныйРасчетныйЛисток_send", ПараметрыВызоваИни, context_params, Неопределено, "Загрузка в "+ЛокализацияНазваниеПродукта());
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПрочийКадровыйРасчетныйЛистокВСБИС(ПараметрыОповещения) Экспорт
	context_params = get_prop(ПараметрыОповещения, "context_params");
	ПараметрыВызова = get_prop(ПараметрыОповещения, "ПараметрыВызова");
	ПараметрыВызова = МодульВстраиваниеВСтандартныеФормы().ПодготовитьДанныеПрочийКадровыйРасчетныйЛисток(ПараметрыВызова);
	Если  НЕ ПроверитьПолнотуДанныхОтбораДляВызоваИНИ(ПараметрыВызова) Тогда
		Возврат;
	КонецЕсли;
	ПараметрыВызоваИни = Новый Структура("EndpointArgs", ПараметрыВызова);
	МодульФоновогоЗаданияКлиент().ЗапуститьINIФоновымЗаданием("ПрочийКадровыйРасчетныйЛисток_send", ПараметрыВызоваИни, context_params, Неопределено, "Загрузка в "+ЛокализацияНазваниеПродукта());
КонецПроцедуры


#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

&НаКлиенте
Процедура УстановитьПризнакУчаствуетВКЭДО(Команда, ПараметрКоманды ) Экспорт
	мСсылок = ПолучитьСписокСсылокНаОбъектыКоманды( ПараметрКоманды );
	Для Каждого СсылкаСотрудник Из мСсылок.Источник Цикл
		ПредЗначение = МодульCore().ПолучитьЗначениеСвойства(СсылкаСотрудник, "КЭДО", Ложь);
		МодульCore().УстановитьЗначениеСвойства(СсылкаСотрудник, "КЭДО", НЕ ПредЗначение);
	КонецЦикла;

	Если ТипЗнч(ПараметрКоманды.Источник) = Тип("ТаблицаФормы") Тогда
		ТблСписок = ПараметрКоманды.Форма.Элементы.Найти(ПараметрКоманды.Источник.Имя);
		ТблСписок.Обновить();
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПризнакУчаствуетВКЭДО(Команда, ПараметрКоманды ) Экспорт
	мСсылок = ПолучитьСписокСсылокНаОбъектыКоманды( ПараметрКоманды );
	
	Для Каждого СсылкаСотрудник Из мСсылок.Источник Цикл
		ПредЗначение = МодульCore().ДанныеПоСотруднику(СсылкаСотрудник);
		Если Тип("Булево") = ТипЗнч(ПредЗначение) Тогда
			МодульCore().УстановитьЗначениеСвойства(СсылкаСотрудник, "КЭДО", ПредЗначение);
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(ПараметрКоманды.Источник) = Тип("ТаблицаФормы") Тогда
		ТблСписок = ПараметрКоманды.Форма.Элементы.Найти(ПараметрКоманды.Источник.Имя);
		ТблСписок.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналДокументовКЭДОСФильтромПоОбъектам(Команда, ПараметрКоманды ) Экспорт
	мСсылок = ПолучитьСписокСсылокНаОбъектыКоманды( ПараметрКоманды );
	
	ФильтрСписка	= Новый Массив;
	ФильтрСписка.Добавить( 
		Новый Структура(
			"Поле, ПравоеЗначение, ВидСравнения",
			"Сотрудник",
			мСсылок.Источник,
			ВидСравненияКомпоновкиДанных.ВСписке)
	);

	ДопПараметры	= Новый Структура();
	ДопПараметры.Вставить("Фильтр", ФильтрСписка);

	ФормыИсключенияСервисаАккаунта = Новый Массив;
	ФормыИсключенияСервисаАккаунта.Добавить("Обработка.СписокСотрудников.Форма.ФормаСпискаСотрудников"); // КОРП
	ФормыИсключенияСервисаАккаунта.Добавить("Справочник.Сотрудники.Форма.ФормаСписка"); // ПРОФ
	ФормыИсключенияСервисаАккаунта.Добавить("Справочник.Сотрудники.Форма.ФормаСпискаРасширенная"); // КАМИН
	ФормыИсключенияСервисаАккаунта.Добавить("Справочник.Сотрудники.Форма.ФормаЭлемента"); // Общая
	Если ФормыИсключенияСервисаАккаунта.Найти(ПараметрКоманды.Форма.ИмяФормы) <> Неопределено Тогда
		//На формах исключения не должно быть авто фильтра по сервису и аккаунту
		context_param = Новый Структура();
		ДопПараметры.Вставить("context_param", context_param);
	КонецЕсли;
	ОткрытьФормуОбработки("ДокументыКЭДО", ДопПараметры, ПараметрКоманды.Форма, "ДокументыКЭДО"); 
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтатусКандидата(Команда, ПараметрКоманды ) Экспорт
	// Заглушка
КонецПроцедуры

&НаКлиенте
Функция ПутьКФормамОбработки()
	ИмяОбработки = ИмяОбработки();
 	ПутьКФормам = "Обработка."+ИмяОбработки+".Форма.";
	Возврат ПутьКФормам;
КонецФункции     

&НаКлиенте
Процедура ОткрытьФормуОбработки(ИмяФормы, ПараметрыФормы = Неопределено, ВладелецФормы = Неопределено, Уникальность=Неопределено, ОписаниеОповещения = Неопределено, РежимОткрытияОкна= Неопределено)
	ОткрытьФорму(ПутьКФормамОбработки() + ИмяФормы, ПараметрыФормы, ВладелецФормы, Уникальность,,, ОписаниеОповещения, РежимОткрытияОкна);
КонецПроцедуры

&НаКлиенте
Функция ЭтотМодуль()
	Возврат МодульКомандыОбменаДляФормыКлиент();
КонецФункции

#Область include_core_base_Helpers_ПолучитьРеквизитГлавнойФормыОбщийМодуль
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСоСтроками
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьФункциональныеФормы
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьФормуОбработки
#КонецОбласти

#Область include_core_base_Helpers_КартинкиУспешноОшибка
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьПрямуюСсылку
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_Авторизация_ОткрытьФормуАвторизацииПриОтсутствииСессии
#КонецОбласти

#Область include_core_base_Helpers_ОписаниеОповещения
#КонецОбласти

Процедура ПоказатьИнформационноеОкно() Экспорт  
	ОткрытьФормуОбработки("ИнформационноеОкно");	
КонецПроцедуры
