#Область include_core_base_Helpers_НастройкиПодключения
#КонецОбласти

#Область include_base_ОбработчикиСобытий_ПриПервомЗапускеКЭДО
#КонецОбласти

#Область include_base_ОбработчикиСобытий_ПриПервомЗапускеЕТРН
#КонецОбласти

#Область include_base_ОбработчикиСобытий_ПриПервомЗапускеБольничные
#КонецОбласти

#Область include_base_ОбработчикиСобытий_ПриПервомЗапуске
#КонецОбласти

#Область include_base_НазваниеПродукта
#КонецОбласти

#Область include_base_FunctionalOption_ИмяФункциональнойОпцииКЭДО
#КонецОбласти

#Область include_base_Role_ИмяОсновнойРолиРасширения
#КонецОбласти

#Область include_core_base_Helpers_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_core_base_ЗапускМодуля_ПроверкаВерсии_ПолучитьИмяФайлаИНомерТекущейВерсии
#КонецОбласти

#Область include_core_base_Helpers_ОбщиеНастройки
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_Helpers_ExtException
#КонецОбласти

#Область include_core_base_Helpers_ПриНачалеРаботыСистемы
#КонецОбласти

#Область include_core_base_Helpers_ДопСведенияИСвойства
#КонецОбласти

#Область include_core_base_Helpers_ПослеОбновления
#КонецОбласти

#Область include_core_base_Транспорт_ВидТранспорта
#КонецОбласти

#Область include_core_base_Helpers
#КонецОбласти

#Область include_core_base_Транспорт_LocalHelper_Session
#КонецОбласти

Функция ЕстьПрофилиСПравамиРасширения()
	// BSLLS:SetPrivilegedMode-off Повысить права для выполнения запроса по ПрофилиГруппДоступа
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	// На Казахстане БСП имя формирует из синонима + " (Роль)" и нам ни когда не найти роль - ИмяОсновнойРоли()
	// поэтому першли на запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИОР.Ссылка КАК Ссылка,
		|	ИОР.Имя КАК Имя
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовРасширений КАК ИОР
		|ГДЕ
		|	ИОР.Имя = &ИмяОбъектаРасширения";
	Запрос.УстановитьПараметр("ИмяОбъектаРасширения", ИмяОсновнойРоли());
	ВДЗ = Запрос.Выполнить().Выбрать();
	РольIntegration = Неопределено;
	Пока ВДЗ.Следующий() Цикл
		РольIntegration = ВДЗ.Ссылка;
	КонецЦикла;
	
	Если РольIntegration = Неопределено ИЛИ РольIntegration.Пустая() Тогда
		РезультатЗапроса = Ложь;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ПГД.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ПрофилиГруппДоступа.Роли КАК ПГД
			|ГДЕ
			|	ПГД.Роль = &РольIntegration";
		Запрос.УстановитьПараметр("РольIntegration", РольIntegration);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить().Количество() > 0;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат РезультатЗапроса;
КонецФункции

Функция ТекущемуПользователюМожноРаботатьСРасширением() Экспорт
	СписокРолей = РолиДляДоступаКФункционалу();
	
	РольНайдена = Ложь;
	Для Каждого ИмяРоли Из СписокРолей Цикл
		Если РольДоступна(ИмяРоли) ИЛИ ПривилегированныйРежим()  Тогда
			РольНайдена = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РольНайдена;
КонецФункции

Функция ВключеноИспользованиеПодсистемыКЕДО() Экспорт
	ИспользованиеПодсистемыКЕДО = Ложь;
	ИмяФункциональнойОпцииКЭДО = ИмяФункциональнойОпцииКЭДО();
	Если Метаданные.ФункциональныеОпции.Найти(ИмяФункциональнойОпцииКЭДО) <> Неопределено Тогда
		ИспользованиеПодсистемыКЕДО = ПолучитьФункциональнуюОпцию(ИмяФункциональнойОпцииКЭДО);
	КонецЕсли;
	Возврат ИспользованиеПодсистемыКЕДО;
КонецФункции

Функция ОтправитьПриглашение(СписокСотрудников) Экспорт
	МодульОбъекта = ПолучитьОбъектОбработки();
	Возврат МодульОбъекта.ОтправитьПриглашение(СписокСотрудников);
КонецФункции

Функция ДанныеПоСотруднику(Сотрудник) Экспорт
	МодульОбъекта = ПолучитьОбъектОбработки();
	Возврат МодульОбъекта.ДанныеПоСотруднику(Сотрудник);	
КонецФункции	

#Область include_base_src_ПроверкаДоступа_ВызовПолучитьРолиДоступа
#КонецОбласти

#Область include_base_src_ПроверкаДоступа_ПолучитьРолиДляДоступа
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСоСтроками
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСервер
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_РегламентныеЗадания
#КонецОбласти

#Область include_base_CommonModule_ИменаМодулейСервер
#КонецОбласти

Функция МодульОбъекта()
	Возврат МодульCore();
КонецФункции

Функция ОбъектПомеченНаУдаление(ОбъектСсылка) Экспорт
	Возврат ОбъектСсылка.ПометкаУдаления
КонецФункции

Функция НеобходимПереносСтатусов() Экспорт 
	Если ТекущемуПользователюМожноРаботатьСРасширением() Тогда
		Обработка = ПолучитьОбъектОбработки();
		Если Обработка = Неопределено Тогда 
			Возврат Ложь;
		КонецЕсли;	
		Возврат Обработка.НеобходимЗапускПереносаСтатусов();
	КонецЕсли;
	Возврат Ложь;	
КонецФункции

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандыОбщееНаСервере
#КонецОбласти
