Процедура ВызватьИсключениеВводаПароляСертификата(context, cert, block_context, СтатусВводаПароля) 
	__deferred = Новый УникальныйИдентификатор(); 
	block_context.Вставить("__deferred", Строка(__deferred)); //кладем новый уид в   __deferred
	param = Новый Структура;
	param.Вставить("ИмяСертификата", get_prop(cert.Субъект, "CN"));
	param.Вставить("Действие", "Подписание");
	param.Вставить("Отпечаток", cert.Отпечаток);
	command = Новый Структура("name, params, uuid, data", "ВвестиПарольСертификата", param, block_context["__deferred"], Неопределено); //формируем структуру command, в которую кладем "name, params, uid"
	context.commands.Добавить(command);
	// BSLLS:UnusedLocalVariable-off Переменная объявлена в шапке модуля
	Currentblock_context = block_context;
	// BSLLS:UnusedLocalVariable-on
	Если СтатусВводаПароля <> "ВвестиПароль" Тогда
		ПарольСертификата = Новый Структура;
		ПарольСертификата.Вставить("password", ""); 
		ПарольСертификата.Вставить("InputStatus", "ВвестиПароль"); 
		context_report = get_prop(context, "report"); 
		Если context_report = Неопределено Тогда
			Возврат;
		КонецЕсли;	
		ПаролиСертификатов = get_prop(context_report, "pass_cert");
		Если ПаролиСертификатов = Неопределено Тогда
			ПаролиСертификатов = Новый Соответствие;
		КонецЕсли;
	    ПаролиСертификатов.Вставить(cert.Отпечаток, ПарольСертификата);
		context.report.Вставить("pass_cert", ПаролиСертификатов);
	КонецЕсли;
	ВызватьИсключение NewExtExceptionСтрока(,"DeferredOperation",,,Новый Структура("context, block_context", context, block_context),"DeferredOperation");	
	
КонецПроцедуры	

Процедура ОбработатьСтатусВводаПароляСертификата(context, Серт, block_context, СтатусВводаПароля, ИнфОбОшибке)  
	ТребуетсяВвестиПароль = Ложь;  
	Если СтатусВводаПароля = "ВвестиПароль" Тогда
		ВызватьИсключениеВводаПароляСертификата(context, Серт, block_context, СтатусВводаПароля);		
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(СтатусВводаПароля) Или СтатусВводаПароля = "ВведенПароль" Тогда
		ТребуетсяВвестиПароль = Истина;
	КонецЕсли;	                       
	
	message = ИнфОбОшибке.Причина.Описание; 
	ПричинаПарольЗакрытогоКлюча = "указан неправильный пароль доступа к закрытому ключу";
	Причина0x80090022 = "0x80090022"; // Для Крипто-Про 5.0
	Если ТребуетсяВвестиПароль = Истина И (Найти(message, ПричинаПарольЗакрытогоКлюча) = 0 Или Найти(message, Причина0x80090022) = 0) Тогда 
		ВызватьИсключениеВводаПароляСертификата(context, Серт, block_context, СтатусВводаПароля);		
	КонецЕсли;	
КонецПроцедуры

Процедура ПодписатьНаСервере(context, attachmentList, cert, block_context = Неопределено) Экспорт
	Попытка    
		Если get_prop(block_context, "__deferred") <> Неопределено Тогда 
			command_result = get_prop(context.command_result, block_context.__deferred);
			Если command_result.status = "complete" Тогда
				context_report = get_prop(context, "report"); 
				ПаролиСертификатов = get_prop(context_report, "pass_cert", Новый Соответствие);
				ПаролиСертификатов.Вставить(cert.Отпечаток, command_result.result); 
				context_report.Вставить("pass_cert", ПаролиСертификатов);
			КонецЕсли;	
		КонецЕсли;	
		ПарольСертификата = Неопределено;
		ЗначениеПароляСертификата = Неопределено;
		context_report = get_prop(context, "report"); 
		ПаролиСертификатов = get_prop(context_report, "pass_cert");
		Если ТипЗнч(ПаролиСертификатов) = Тип("Соответствие") Тогда
			ПарольСертификата = get_prop(ПаролиСертификатов, cert.Отпечаток);
			ЗначениеПароляСертификата = get_prop(ПарольСертификата, "password");
		КонецЕсли;	
		МенеджерКриптографии = НайтиМенеджерКриптографииНаСервере(cert.Алгоритм); 
		ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
		Серт = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(cert.Отпечаток);
		Если ЗначениеЗаполнено(ЗначениеПароляСертификата) Тогда  
			МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ЗначениеПароляСертификата; 
		КонецЕсли;	
		Для каждого attach из attachmentList Цикл
			ДвоичныеДанные = attach["Файл"]["ДвоичныеДанные"]; 
			Если ТипЗнч(ДвоичныеДанные) = Тип("Строка") Тогда
				ДвоичныеДанные = Base64Значение(ДвоичныеДанные);
			КонецЕсли;	 
		  	Подпись = МенеджерКриптографии.Подписать(ДвоичныеДанные, Серт);
			Файлы = Новый Структура("Файл", Новый Структура("ДвоичныеДанные", СтрЗаменить(СтрЗаменить(Base64Строка(Подпись),Символы.ПС,""),Символы.ВК,"")));
			мФайлы = Новый Массив;
			мФайлы.Добавить(Файлы);
			attach.Вставить("Подпись", мФайлы);
		КонецЦикла
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке(); 
		СтатусВводаПароля = get_prop(ПарольСертификата, "InputStatus");
		ОбработатьСтатусВводаПароляСертификата(context, Серт, block_context, СтатусВводаПароля, ИнфОбОшибке);
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,,,"ПодписатьНаСервере");	
	КонецПопытки;
КонецПроцедуры


Функция сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм, Алгоритм = Неопределено) Экспорт
	
	Возврат МенеджерКриптографииБазовый(ОписанияПрограмм);
	
КонецФункции 

Функция НайтиМенеджерКриптографииНаСервере(Алгоритм = Неопределено)
	Если МенеджерыКриптографии = Неопределено Тогда
		МенеджерыКриптографии = СоздатьМенеджерыКриптографииНаСервере(ПрограммыКриптографии());
	КонецЕсли;
	Если Алгоритм = Неопределено Тогда
		Для Каждого Элем Из МенеджерыКриптографии Цикл
			Возврат Элем.Значение;
		КонецЦикла
	Иначе
		Возврат get_prop(МенеджерыКриптографии, Алгоритм);
	КонецЕсли
КонецФункции

Функция СоздатьМенеджерыКриптографииНаСервере(ПрограммыКриптографии, Алгоритм = Неопределено)
	Менеджеры = Новый Соответствие;
	Для Каждого СвойстваПрограммы Из ПрограммыКриптографии Цикл
		
		Попытка
			ИнформацияМодуля = СредстваКриптографии.ПолучитьИнформациюМодуляКриптографии(
				СвойстваПрограммы.ИмяПрограммы,
				СвойстваПрограммы.ПутьКПрограмме,
				СвойстваПрограммы.ТипПрограммы);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если ИнформацияМодуля = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Менеджер = Новый МенеджерКриптографии(СвойстваПрограммы.ИмяПрограммы, СвойстваПрограммы.ПутьКПрограмме, СвойстваПрограммы.ТипПрограммы);
		Исключение
			Продолжить;
		КонецПопытки;
		АлгоритмМодуляКриптографии = АлгоритмМодуляКриптографииНаСервере(ИнформацияМодуля, Алгоритм);
		Если АлгоритмМодуляКриптографии <> Неопределено Тогда 
			Менеджеры.Вставить(АлгоритмМодуляКриптографии,Менеджер); 
		КонецЕсли;		
	КонецЦикла;
	Возврат Менеджеры;
	
КонецФункции

Функция АлгоритмМодуляКриптографииНаСервере(ИнформацияМодуля, Алгоритм = Неопределено)
	АлгоритмМодуля = Неопределено;
	Для Каждого АлгоритмМодуляКриптографии Из ИнформацияМодуля.АлгоритмыПодписи Цикл  
		Если Алгоритм = Неопределено Тогда 
			АлгоритмМодуля = АлгоритмМодуляКриптографии;
			Продолжить;
		КонецЕсли;	
		Если АлгоритмМодуляКриптографии = Алгоритм Тогда
			АлгоритмМодуля = АлгоритмМодуляКриптографии;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	Возврат АлгоритмМодуля;
КонецФункции	

Функция сбисСписокЛокальныхСертификатовНаСервере() Экспорт
	ЛокальныеСертификатыНаСервере = Новый Структура("Отпечатки, Алгоритмы",Новый Массив(), Новый Соответствие());
	МенеджерКриптографии = НайтиМенеджерКриптографииНаСервере();
	Если МенеджерКриптографии = Неопределено Тогда
		Возврат ЛокальныеСертификатыНаСервере;
	КонецЕсли;
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе();
	Для Каждого Серт из Сертификаты Цикл
		ЛокальныеСертификатыНаСервере["Отпечатки"].Добавить(Серт.Отпечаток);
	КонецЦикла; 
	Для Каждого Менеджер Из МенеджерыКриптографии Цикл
		ЛокальныеСертификатыНаСервере["Алгоритмы"].Вставить(Менеджер.Ключ);
	КонецЦикла; 
	
	Возврат ЛокальныеСертификатыНаСервере;

КонецФункции

Функция сбисСписокСертификатовДляАвторизацииНаСервере(ОписанияПрограмм) Экспорт
	СертификатыДляАвторизации = Новый Массив();
	Попытка
		МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	Исключение    
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,,,"СписокСертификатовДляАвторизацииНаСервере");
	КонецПопытки;
	
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	ЛокальныеСертификатыНаСервере = ХранилищеСертификатовКриптографии.ПолучитьВсе(); 
	Для Каждого Серт из ЛокальныеСертификатыНаСервере Цикл
		Попытка
			СертДвоичныеДанные = СтрЗаменить(СтрЗаменить(Base64Строка(Серт.Выгрузить()),Символы.ПС,""),Символы.ВК,"");
			СертОтпечаток = СтрЗаменить(Строка(Серт.Отпечаток), " ", "");
			СертификатыДляАвторизации.Добавить(Новый Структура("ДвоичныеДанные,Отпечаток,Название,ФИО,Должность,ДействителенПо",
																СертДвоичныеДанные, 
																СертОтпечаток,
																Серт.Субъект.CN, 
																Серт.Субъект.SN+" "+Серт.Субъект.GN,
																get_prop(Серт.Субъект, "T", ""),
																Серт.ДатаОкончания));
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	Возврат СертификатыДляАвторизации;

КонецФункции

Функция сбисДвоичныеДанныеСертификатаПоОтпечаткуНаСервере(ОписанияПрограмм, Отпечаток) Экспорт
	МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе(); 
	Для Каждого Серт из Сертификаты Цикл
		Если СтрЗаменить(Строка(Серт.Отпечаток), " ", "") = Отпечаток Тогда
			Возврат СтрЗаменить(СтрЗаменить(Base64Строка(Серт.Выгрузить()),Символы.ПС,""),Символы.ВК,"");
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция сбисПодписатьФайлНаСервере(ОписанияПрограмм, ДвоичныеДанные, Сертификат, Алгоритм) Экспорт
	Попытка
		МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм, Алгоритм);
	Исключение    
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,,,"ПодписатьФайлНаСервере");
	КонецПопытки;
	Серт = Новый СертификатКриптографии(Base64Значение(Сертификат));
	Подпись = МенеджерКриптографии.Подписать(Base64Значение(ДвоичныеДанные), Серт);
	Возврат СтрЗаменить(СтрЗаменить(Base64Строка(Подпись),Символы.ПС,""),Символы.ВК,"");
КонецФункции

Функция сбисРасшифроватьНаСервере(ОписанияПрограмм, ДвоичныеДанные, ПарольЗакрытогоКлюча = Неопределено) Экспорт
	МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	Если ЗначениеЗаполнено(ПарольЗакрытогоКлюча) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольЗакрытогоКлюча;
	КонецЕсли;
	ДвоичныеДанныеРашифрованные = МенеджерКриптографии.Расшифровать(Base64Значение(ДвоичныеДанные));
	НедопустимыеСимволы = Новый Массив;
	НедопустимыеСимволы.Добавить(Символы.ПС);
	НедопустимыеСимволы.Добавить(Символы.ВК);
	ДанныеВозврат = Base64Строка(ДвоичныеДанныеРашифрованные);
	Для Каждого НедопустимыйСимвол Из НедопустимыеСимволы Цикл
		ДанныеВозврат = СтрЗаменить(ДанныеВозврат, НедопустимыйСимвол, "");
	КонецЦикла;
	Возврат ДанныеВозврат;
КонецФункции  

// BSLLS:TooManyReturns-off

Функция ВыбратьНаборАлгоритмовДляСозданияПодписи(Алгоритм) Экспорт
	
	Алгоритмы = сбисИменаАлгоритмовПодписиГОСТ_34_10_2012_256();
	Если Алгоритмы.Найти(Алгоритм)<>Неопределено Тогда
		Возврат Алгоритмы;
	КонецЕсли; 
	Алгоритмы = сбисИменаАлгоритмовПодписиГОСТ_34_10_2012_512();
	Если Алгоритмы.Найти(Алгоритм)<>Неопределено Тогда
		Возврат Алгоритмы;
	КонецЕсли;
	Алгоритмы = сбисИменаАлгоритмовПодписиГОСТ_34_10_2001();
	Если Алгоритмы.Найти(Алгоритм)<>Неопределено Тогда
		Возврат Алгоритмы;
	КонецЕсли;
	Алгоритмы = сбисИменаАлгоритмовПодписиГОСТ_34_10_94();
	Если Алгоритмы.Найти(Алгоритм)<>Неопределено Тогда
		Возврат Алгоритмы;
	КонецЕсли;
	Алгоритмы = Новый Массив;
	Алгоритмы.Добавить("RSA_SIGN");
	Алгоритмы.Добавить("SHA1RSA");     // приходит от СБИС
	Алгоритмы.Добавить("SHA1WithRSASignature");    // приходит от СБИС
	Алгоритмы.Добавить("SHA256RS");   // приходит от СБИС
	Если Алгоритмы.Найти(Алгоритм)<>Неопределено Тогда
		Возврат Алгоритмы;
	КонецЕсли;
	
	Возврат сбисИменаАлгоритмовПодписиГОСТ_34_10_2012_256();
	
КонецФункции
// BSLLS:TooManyReturns-on

Функция сбисИменаАлгоритмовПодписиГОСТ_34_10_94()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ 34.10-94"); // Представление.
	Имена.Добавить("GOST R 34.10-94");
	
	Возврат Имена;
	
КонецФункции

Функция сбисИменаАлгоритмовПодписиГОСТ_34_10_2001()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ 34.10-2001"); // Представление.
	Имена.Добавить("ГОСТ Р 34.10-2001");  // приходит от СБИС
	Имена.Добавить("GOST R 34.10-2001");
	Имена.Добавить("ECR3410-CP");
	
	Возврат Имена;
	
КонецФункции

Функция сбисИменаАлгоритмовПодписиГОСТ_34_10_2012_256()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ 34.10-2012 256"); // Представление.
	Имена.Добавить("ГОСТ Р 34.10-2012 256");   // приходит от СБИС
	Имена.Добавить("GR 34.10-2012 256");
	Имена.Добавить("GOST 34.10-2012 256");
	Имена.Добавить("GOST R 34.10-12 256");
	Имена.Добавить("GOST3410-12-256");
	
	Возврат Имена;
	
КонецФункции

Функция сбисИменаАлгоритмовПодписиГОСТ_34_10_2012_512()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ 34.10-2012 512"); // Представление. 
	Имена.Добавить("ГОСТ Р 34.10-2012 512");   // приходит от СБИС
	Имена.Добавить("GR 34.10-2012 512");
	Имена.Добавить("GOST 34.10-2012 512");
	
	Возврат Имена;
	
КонецФункции
