
&НаКлиенте
Процедура ПолеHTMLдокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЭлементСобытия = ДанныеСобытия.srcElement;
	#Иначе
		ЭлементСобытия = ДанныеСобытия.Element;
	#КонецЕсли
	Если ЭлементСобытия["id"] = "toExtSys" Тогда
		Попытка
			ИмяДействия	= ЭлементСобытия.getAttribute("action");
			Параметр	= ЭлементСобытия.textContext; //Иногда можно брать из ЭлементСобытия.innerHTML;
			ДобавитьВЛог(2, ИмяДействия, Параметр);
			Результат = ОбработатьДействиеНаКлиенте(ИмяДействия, Параметр);
			ДобавитьВЛог(6, ИмяДействия, Результат);
			Если Результат <> Неопределено Тогда
				ВернутьРезультат(Результат);
			КонецЕсли;
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьРезультат(Результат)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	#Если ВебКлиент Тогда
		ЭлементыФормочки.ПолеHTMLдокумента.Документ.domConnector.resolve(Результат);
	#Иначе
		ЭлементыФормочки.ПолеHTMLдокумента.Документ.defaultView.domConnector.resolve(Результат);
	#КонецЕсли 			
КонецПроцедуры

&НаКлиенте
Процедура ВернутьОшибку(Ошибка)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	#Если ВебКлиент Тогда
		ЭлементыФормочки.ПолеHTMLдокумента.Документ.domConnector.reject(Ошибка);
	#Иначе
		ЭлементыФормочки.ПолеHTMLдокумента.Документ.defaultView.domConnector.reject(Ошибка);
	#КонецЕсли 
КонецПроцедуры

&НаСервере
Функция ПодготовитьРезультат(Результат)
	Возврат EncodeXdtoXml(Результат);
КонецФункции

&НаКлиенте
Процедура ОтправитьЗапрос(UID, Action, Запрос) Экспорт
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ДобавитьВЛог(2, Action, Запрос);
	#Если ВебКлиент Тогда
		ЭлементыФормочки.ПолеHTMLдокумента.Документ.domConnector.sendRequest(UID, Action, Запрос);
	#Иначе
		ЭлементыФормочки.ПолеHTMLдокумента.Документ.defaultView.domConnector.sendRequest(UID, Action, Запрос);
	#КонецЕсли 			
КонецПроцедуры



