
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// только для обработки
	МодульОбъекта = МодульОбъекта();
	context_params = МодульОбъекта.НастройкиПодключенияПрочитать();
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	
	ДобавитьИнформациюОВерсии(ЭлемФормы.ВерсияПродукта);
	Заголовок = "";
	Параметры.Свойство("Заголовок", Заголовок);
	Заголовок = Заголовок +" "+ ЛокализацияНазваниеПродукта();
	АдресСтраницы	= "";
	Параметры.Свойство("АдресСтраницы", АдресСтраницы);
	Если ПустаяСтрока(АдресСтраницы) Тогда
		СформироватьАдресАддона();
	КонецЕсли;
	
	АдресСтраницыССлужебнымиПараметрами = get_prop(context_params, "api_url");
	АдресСтраницыССлужебнымиПараметрами = СтрЗаменить(АдресСтраницыССлужебнымиПараметрами, "https://", "http://");
	
	Если Параметры.Свойство("context_param") Тогда
		// При авторизхации НастройкиПодключенияПрочитать может вернуть НЕОПРЕДЕЛЕНО, да и выбранный домен на форме авторизации отличается
		ЭтаФорма.context_params = Параметры.context_param;
	КонецЕсли;
	web_interface = get_prop(get_prop(context_params, "public"), "web_interface"); 
	Если web_interface = "BrowserSabyPlugin" Тогда
		Префикс = "http://localhost:9100/?pool=ExtLongPollingProxy&method=ExtLongPollingProxy.UI&id=0&protocol=6&params=eyJwYXRoIjogImluZGV4MUMuaHRtbCJ9&target=";  
		СформироватьАдресLPP(АдресСтраницы, "online-lpp1c.", "saby");
	ИначеЕсли web_interface = "BrowserSaby" Тогда
		service = get_prop(context_params, "service");
		Если ЗначениеЗаполнено(service) Тогда
			service = service + "-";
		Иначе
			service = "";
		КонецЕсли;
		Префикс = "https://" + service + "online.saby.ru/long_polling_proxy/service/?pool=ExtLongPollingProxy&method=LongPollingProxy.UI&id=0&protocol=6&params=eyJwYXRoIjogImluZGV4MUMuaHRtbCJ9&target=";
		СформироватьАдресLPP(АдресСтраницы, "online-lppbl1c.", "saby");
	Иначе
		Префикс = "";
	КонецЕсли;
	АдресСтраницы = Префикс + АдресСтраницы;
КонецПроцедуры

Процедура СформироватьАдресLPP(Адрес, Префикс, Домен)
	Адрес = СтрЗаменить(Адрес, "ie-1c.saby", Префикс + Домен);
	Адрес = СтрЗаменить(Адрес, "ieg-1c.sbis", Префикс + Домен);
	Адрес = СтрЗаменить(Адрес, "ie-1c.setty", Префикс + "setty");
	Адрес = СтрЗаменить(Адрес, "online.saby", Префикс + Домен);
	Адрес = СтрЗаменить(Адрес, "online.sbis", Префикс + Домен);
КонецПроцедуры

&НаСервере
Процедура СформироватьАдресАддона()
	МодульОбъекта = МодульОбъекта();
	api_url = get_prop(context_params, "api_url", МодульОбъекта.ПолучитьСервисПоУмолчанию());
	ЭтаФорма.АдресСтраницы = api_url + "/addon2/page/";
КонецПроцедуры

Функция УрлСКорректнымиСимволамиПеременных(Знач ИсходныйУРЛ)
	ИсходныйУРЛ = СтрЗаменить(ИсходныйУРЛ, "?&", "?");
	ИсходныйУРЛ = СтрЗаменить(ИсходныйУРЛ, "??", "?");
	ИсходныйУРЛ = СтрЗаменить(ИсходныйУРЛ, "&&", "&");
	Результат = ИсходныйУРЛ;
	НовыйУРЛМассивом = Новый Массив;
	
	// Привести URL к корректному виду, Первый перефикс параметров в URL должен быть "?"
	мУРЛ1гоУровня = СтрРазделитьПодстрокой(ИсходныйУРЛ, "://");
	
	Для Каждого СтрокаАдреса Из мУРЛ1гоУровня Цикл
		СтрокаАдреса = СтрЗаменить(СтрокаАдреса, "?", "&");
		НомерПервогоЗнВопр = Найти(СтрокаАдреса, "&");
		Если НомерПервогоЗнВопр > 0 Тогда
			СтрокаАдреса = Лев(СтрокаАдреса, НомерПервогоЗнВопр-1) +
							"?" + Сред(СтрокаАдреса, НомерПервогоЗнВопр+1);
		КонецЕсли;
		НовыйУРЛМассивом.Добавить(СтрокаАдреса);
	КонецЦикла;
	Результат = СтрСоединить82(НовыйУРЛМассивом, "://");
	Возврат Результат;
КонецФункции

&НаСервере
Процедура СформироватьАдресСоСлужебнымиПараметрамиНаСервере(Знач Тикет=Неопределено)
	//МодульОбъекта = МодульОбъекта();
	
	АдресСтраницыССлужебнымиПараметрами = АдресСтраницы;
	Если Не ЭтоАдресСБИС(АдресСтраницы) Тогда
		Возврат;
	КонецЕсли;
	ЭтаФорма.РазрешитьЗакрытиеФормы = Истина;//Установить в лож когда будет открыт редактор BLOKLY
	Если Найти(АдресСтраницыССлужебнымиПараметрами,"?") = 0 Тогда
		АдресСтраницыССлужебнымиПараметрами = АдресСтраницыССлужебнымиПараметрами + "?";
	КонецЕсли;
	АдресСтраницыССлужебнымиПараметрами = АдресСтраницыССлужебнымиПараметрами + "&nocheck=1";
	// Тикет был необходим только во встроенном браузере
	// Для LPP тикет не нужен, кабинет определяется настройками внешнего браузера
	// Если ЗначениеЗаполнено(Тикет) Тогда  
		// АдресСтраницыССлужебнымиПараметрами = АдресСтраницыССлужебнымиПараметрами + ?(ЗначениеЗаполнено(Тикет), "&ticket=" + Тикет, "");
		// ВремяПредыдущегоЗапросаТокена = ТекущаяДатаСеанса();
		// context_params.Вставить("last_token_time", ВремяПредыдущегоЗапросаТокена);
		// МодульОбъекта.НастройкиПодключенияЗаписать(context_params);	
	// КонецЕсли;		
	АдресСтраницыССлужебнымиПараметрами = УрлСКорректнымиСимволамиПеременных(АдресСтраницыССлужебнымиПараметрами);
	ПолучитьЭлементыФормыНаСервере().АдресСтраницы.Подсказка = АдресСтраницыССлужебнымиПараметрами;
   	
КонецПроцедуры	

&НаКлиенте
Процедура СформироватьАдресСоСлужебнымиПараметрами()
	//60 секнд * 30 минут
	//ПериодМеждуЗапрсамиТокенов = 60*15;
    Тикет=Неопределено;
	//Тикет получаем при открытии формы если нет других открытых форм браузера
	//Если context_params <> Неопределено Тогда
	//	ВремяПредыдущегоЗапросаТокена = get_prop(context_params, "last_token_time");
	//	НеобходимТикет = Ложь;
	//	// BSLLS:DeprecatedCurrentDate-off
	//	Если ВремяПредыдущегоЗапросаТокена = Неопределено Тогда
	//		НеобходимТикет = Истина;
	//		ВремяПредыдущегоЗапросаТокена = ТекущаяДата();
	//	КонецЕсли;
	//	Если ТекущаяДата() - ВремяПредыдущегоЗапросаТокена >= ПериодМеждуЗапрсамиТокенов  Тогда
	//		НеобходимТикет = Истина;
	//	КонецЕсли;
	//	// BSLLS:DeprecatedCurrentDate-on
	//	
	//	Если НеобходимТикет Тогда
	//		Попытка
	//		   Тикет = ТранспортИнтеграции.ТикетТекущейСессии( context_params ); // если сессия не живая, значит пользователь получит окно аунтентификации
	//		Исключение 
	//		КонецПопытки;
	//	КонецЕсли;
	//	//Обновим время обращения за тикетом
	//КонецЕсли;
	СформироватьАдресСоСлужебнымиПараметрамиНаСервере(Тикет);
КонецПроцедуры


&НаСервере
Функция ЭтоАдресСБИС(Адрес)
	Если Найти(Адрес, ".sbis.ru") > 0 ИЛИ  Найти(Адрес, ".saby.ru") > 0 ИЛИ  Найти(Адрес, ".setty.kz") > 0 ИЛИ  Лев(Адрес, 16) = "http://localhost" Тогда
		Возврат Истина;
	Иначе
		Сообщить("Браузер открывает только сервера "+ЛокализацияНазваниеПродукта()+" или localhost (" + Адрес + ")");
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "SabySignOut" Тогда
		Закрыть();
	ИначеЕсли ИмяСобытия = "Saby_ЗавершениеДлительнойОперации" Тогда
		Результат = ПодготовитьРезультат(Параметр);
		ВернутьРезультат(Результат);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// BSLLS:UnusedLocalVariable-off Переменные формы
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();
	// BSLLS:UnusedLocalVariable-on
	
	ПодключитьОбработчикОжидания("ПриОткрытииПродолжение", 2, Истина);	
КонецПроцедуры
