
#Область include_core_base_ЭДО_РаботаСДокументами_ПроверкиМетаданных
#КонецОбласти

// Функция - Заполняет соглашение с клиентом на УТ11, ERP, КА
//
// Параметры:
//  Контекст	 - Структура	 - Содержит структуру обрабатываемого документа       
// Возвращаемое значение:
//   Ссылка - содержит ссылку на Справочник.СоглашенияСКлиентами 
//
Функция ЗаполнитьСоглашениеСКлиентомУТ11(Контекст) Экспорт
	// Функция заполняет соглашение в загружаемых заказах для конфигурации УТ11	
	сбисКонтекстСервер = Новый Структура("Контрагент", Контекст.Документ.Контрагент);
	Возврат сбисПолучитьСоглашениеСКлиентомУТ11_Сервер(сбисКонтекстСервер);
КонецФункции  

// Функция - Возвращает структуру условий продаж по партнеру.
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// Возвращаемое значение:
//   СправочникСсылка.СоглашенияСКлиентами - соглашение с клиентом 
//
Функция сбисПолучитьСоглашениеСКлиентомУТ11_Сервер(Знач Контекст)
	СправочникСоглашение = Неопределено;
	
	Попытка
		ОбщийМодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения");
		МетаданныйСоглашениеСКлиентами = СбисСуществуетОбъектКонфигурацииСервер("СоглашенияСКлиентами", 
												Новый Структура("КлассМетаданных", "Справочники")); 
		МетаданныеЗаказКлиента = СбисСуществуетОбъектКонфигурацииСервер("ЗаказКлиента", 
												Новый Структура("КлассМетаданных", "Документы")); 
			
		Если МетаданныйСоглашениеСКлиентами И МетаданныеЗаказКлиента И Не ОбщийМодульОбщегоНазначения = Неопределено Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("УчитыватьГруппыСкладов", Истина);
			ПараметрыОтбора.Вставить("ВыбранноеСоглашение", Справочники["СоглашенияСКлиентами"].ПустаяСсылка());
			ПараметрыОтбора.Вставить("ПустаяСсылкаДокумента", Документы["ЗаказКлиента"].ПустаяСсылка());    
			Параметры = Новый Структура;
			Параметры.Вставить("Партнер" , Контекст.Контрагент.Партнер); 
			Параметры.Вставить("ПараметрыОтбора" , ПараметрыОтбора);
			СправочникСоглашениеЗначение = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме(
					"ПродажиСервер.ПолучитьУсловияПродажПоУмолчанию(Параметры.Партнер, Параметры.ПараметрыОтбора)", Параметры);       
			СправочникСоглашение = СправочникСоглашениеЗначение.Соглашение;	
		Иначе
			СправочникСоглашение = Неопределено;
		КонецЕсли
	
	Исключение
		СправочникСоглашение = Неопределено;
	КонецПопытки;
	Возврат СправочникСоглашение;
КонецФункции  

// Функция - Выполняет поиск действующего договора с контрагентом по заданным реквизитам.
// Если найден один действующий договор, возвращает ссылку на него, в противном случае - пустую ссылку.
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// 
// Возвращаемое значение:
//   СправочникСсылка.ДоговорыКонтрагентов  - договор контрагента по умолчанию.
//
Функция ЗаполнитьДоговорСКлиентомУТ11(Контекст) Экспорт
	сбисКонтекстСервер = Новый Структура("Документ", Контекст.Документ);
	Возврат сбисПолучитьДоговорСКлиентомУТ11_Сервер(сбисКонтекстСервер);
КонецФункции

// Функция - Выполняет поиск действующего договора с контрагентом по заданным реквизитам.
// Если найден один действующий договор, возвращает ссылку на него, в противном случае - пустую ссылку.
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// 
// Возвращаемое значение:
//   СправочникСсылка.ДоговорыКонтрагентов  - договор контрагента по умолчанию.
//
Функция сбисПолучитьДоговорСКлиентомУТ11_Сервер(Контекст)
	ДоговорПоУмолчанию = Неопределено;
	Попытка
	    ОбщийМодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения");
		Если Не ОбщийМодульОбщегоНазначения = Неопределено Тогда       
			Параметры = Новый Структура;
			Параметры.Вставить("Документ", Контекст.Документ);
			Параметры.Вставить("ХОРеализацияКлиенту", Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
			   ДоговорПоУмолчанию = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме(
			"ПродажиСервер.ПолучитьДоговорПоУмолчанию(Параметры.Документ, Параметры.ХОРеализацияКлиенту)", Параметры);
		КонецЕсли;
	Исключение
		ДоговорПоУмолчанию = Неопределено;
	КонецПопытки;
	Возврат ДоговорПоУмолчанию;	
КонецФункции

// Функция  - Заполняет НалогообложениеНДС в загружаемых документах, если не заполнен договор для конфигураций УТ11, ERP, KA2   
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// Возвращаемое значение:
// 	 Структура - Параметры учета НДС по организации:
//
Функция ЗаполнитьНалогообложениеНДСБезДоговораУТ11(Контекст) Экспорт
	сбисКонтекстСервер = Новый Структура("Организация, Дата", Контекст.Документ.Организация, Контекст.Документ.Дата);
	Возврат сбисПолучитьНалогообложениеНДСБезДоговораУТ11_Сервер(сбисКонтекстСервер);
КонецФункции    

// Функция - Возвращает параметры учета НДС, установленные для организации в заданном периоде.
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// Возвращаемое значение:
// 	 Структура - Параметры учета НДС по организации:
//
Функция сбисПолучитьНалогообложениеНДСБезДоговораУТ11_Сервер(Знач Контекст) Экспорт
	НалогообложениеНДС = Неопределено;
	Попытка
		ОбщийМодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения");

		Если Не ОбщийМодульОбщегоНазначения = Неопределено Тогда    
			Параметры = Новый Структура;
			Параметры.Вставить("Организация", Контекст.Организация);
			Параметры.Вставить("Дата", Контекст.Дата);
			ПараметрыУчетаОрганизации = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме(
			"УчетНДСУП.ПараметрыУчетаПоОрганизации(Параметры.Организация, Параметры.Дата)", Параметры);    
		КонецЕсли;
		Если ПараметрыУчетаОрганизации.ПрименяетсяПСН Тогда
			НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаПоПатенту;
		ИначеЕсли ПараметрыУчетаОрганизации.НалогообложениеНДСРозничнойПродажи 
					= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД Тогда
			НалогообложениеНДС = ПараметрыУчетаОрганизации.НалогообложениеНДСРозничнойПродажи;
		Иначе
			НалогообложениеНДС = ПараметрыУчетаОрганизации.ОсновноеНалогообложениеНДСПродажи;
		КонецЕсли;
	Исключение
	    НалогообложениеНДС = Неопределено;
	КонецПопытки;
	Возврат НалогообложениеНДС;
КонецФункции 

// Функция - Выполняет поиск менеджера УТ11, ERP, KA2 
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// 
// Возвращаемое значение:
//   СправочникСсылка.Пользователи  - Пользователь ИБ
//
Функция ЗаполнитьМенеджераУТ11(Контекст) Экспорт
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "Справочники.Пользователи", "ТекущийПользовательИБ"); 
	сбисОписаниеОбъекта.Значение = сбисПолучитьМенеджераУТ11_Сервер();
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции    

// Функция - Выполняет поиск менеджера УТ11, ERP, KA2 
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// 
// Возвращаемое значение:
//   СправочникСсылка.Пользователи  - Пользователь ИБ
//
Функция сбисПолучитьМенеджераУТ11_Сервер(Знач Контекст = Неопределено)
	ИдПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	Возврат Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ИдПользователяИБ);
КонецФункции

// Функция - преобразует номер документа к стандарту 1С 
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
//   НастройкиНомера	- Структура	 - Содержит пользовательские параметры для формирования номера 
// 
// Возвращаемое значение:
//   Строка  - Номер документа
//
Функция ПолучитьНомерДокумента(Контекст, НастройкиНомера = Неопределено) Экспорт
	сбисНомерДокумента = Неопределено;
	Контекст.Свойство("НомерДокумента", сбисНомерДокумента);       
	
	Если Не Контекст.Свойство("Документ") Тогда
		ДокументКонтекст = Контекст;
		Контекст.Вставить("Документ", ДокументКонтекст);
	КонецЕсли;
	Если НастройкиНомера = Неопределено Тогда
		МестныйКэш = Новый Структура;
		МестныйКэш.Вставить("Парам", Новый Структура("УдалятьПрефиксИнформационнойБазы, УдалятьПользовательскийПрефикс", Ложь, Ложь));  
	Иначе
		МестныйКэш = Новый Структура;
		МестныйКэш.Вставить("Парам", НастройкиНомера);  
	КонецЕсли;
	Возврат сбисНомерДокументаНаПечатьСервер(сбисФункцияНомераНаПечать(МестныйКэш), Контекст.Документ, 
					сбисНомерДокумента, сбисДобавитьЗначениеПослеНомера(Контекст)); 
КонецФункции  

// Функция - преобразует номер документа к стандарту 1С
//
// Параметры:
//   Кэш           - Структура	 - Информация об удалениее префика ИБ и пользовательского
// 
// Возвращаемое значение:
//   Строка  - Номер документа
//
Функция сбисФункцияНомераНаПечать(Кэш)
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "ПользовательскиеЗначения.Функции", "НомерДокумента");
	сбисСтрокаФункцииКонец	=	"," + Формат(Кэш.Парам.УдалятьПрефиксИнформационнойБазы, "БЛ = Ложь; БИ = Истина") 
	+ "," + Формат(Кэш.Парам.УдалятьПользовательскийПрефикс,	"БЛ = Ложь; БИ = Истина") + ")";
	сбисНомерДокумента		= "001";   
	сбисДокумент = Неопределено;
	сбисСписокФункций		= Новый Массив;    
	Параметры = Новый Структура;
	Параметры.Вставить("сбисДокумент", сбисДокумент);
	Параметры.Вставить("сбисНомерДокумента", сбисНомерДокумента);
	Параметры.Вставить("сбисСтрокаФункцииКонец", сбисСтрокаФункцииКонец);
	
	сбисСписокФункций.Добавить("ОбщегоНазначения.ПолучитьНомерНаПечать(Параметры.сбисДокумент)");
	сбисСписокФункций.Добавить("ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Параметры.сбисНомерДокумента," 
																						+ Параметры.сбисСтрокаФункцииКонец);
	сбисСписокФункций.Добавить("ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Параметры.сбисНомерДокумента" 
																						+ Параметры.сбисСтрокаФункцииКонец);
	сбисСписокФункций.Добавить("СокрЛП(Параметры.сбисНомерДокумента)");
	ОбщийМодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения");   
	Если Не ОбщийМодульОбщегоНазначения = Неопределено Тогда
		Для Каждого сбисСтрокаФункции Из сбисСписокФункций Цикл 
			Попытка
				ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме(сбисСтрокаФункции, Параметры);
			Исключение
				Продолжить;
			КонецПопытки;
			Прервать;
		КонецЦикла;    
	КонецЕсли;
	сбисОписаниеОбъекта.Значение = сбисСтрокаФункции;
	Возврат сбисОписаниеОбъекта.Значение; 
КонецФункции

// Функция - преобразует номер документа к стандарту 1С. Добавление постфикса
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// 
// Возвращаемое значение:
//   Строка  - Номер документа
//
Функция сбисДобавитьЗначениеПослеНомера(Контекст)
	
	СтрокаВозврат = Неопределено;
	Если	Контекст.Свойство("ИндексОбособленногоПодразделения", СтрокаВозврат)
		И	ЗначениеЗаполнено(СтрокаВозврат) Тогда
		Если ТипЗнч(СтрокаВозврат) = Тип("Число") Тогда
			СтрокаВозврат = Формат(СтрокаВозврат, "ЧН=0; ЧГ=0");
		Иначе
			СтрокаВозврат = СокрЛП(Строка(СтрокаВозврат));
		КонецЕсли;
	Иначе
		СтрокаВозврат = "";
	КонецЕсли;
	// +++ МАИ 14.09.2021 поддержка дополнительного постфикса 
	Постфикс = "";
	Контекст.Свойство("НомДокПостфикс", Постфикс);
	Если ПустаяСтрока(СтрокаВозврат) И НЕ ПустаяСтрока(Постфикс) Тогда
		СтрокаВозврат = Постфикс;
	ИначеЕсли НЕ ПустаяСтрока(Постфикс) Тогда
		СтрокаВозврат = СтрокаВозврат + "/" + Постфикс;	
	Иначе 
		Постфикс = "";		
	КонецЕсли;
	// --- МАИ 14.09.2021 поддержка дополнительного постфикса
	
	Возврат	СтрокаВозврат;	
	
КонецФункции

// Функция - преобразует номер документа к стандарту 1С. Добавление постфикса
//
// Параметры:
//   сбисСтрокаФункции  - Строка -  Строка функции
//   сбисДокумент 		- Структура - Структура документа 
//   сбисОсновнойНомерДокумента - Строка - Основной номре документа
//   сбисПостфикс 				- Строка - Постфикс номера
// 
// Возвращаемое значение:
//   Строка  - Номер документа
//
Функция сбисНомерДокументаНаПечатьСервер(сбисСтрокаФункции, сбисДокумент, сбисОсновнойНомерДокумента = Неопределено, 
									сбисПостфикс = "")     
	ОбщийМодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения"); 
	// Не указан номер, тогда берем его из документа руками.
	Если сбисОсновнойНомерДокумента = Неопределено Тогда
		сбисНомерДокумента = сбисДокумент.Номер;
	Иначе
		сбисНомерДокумента = сбисОсновнойНомерДокумента;
	КонецЕсли;
	Попытка  
		Если Не ОбщийМодульОбщегоНазначения = Неопределено Тогда
			сбисРезультат = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме("сбисСтрокаФункции");  
		Иначе  
			сбисРезультат = Строка(сбисНомерДокумента);
		КонецЕсли;
	Исключение
		сбисРезультат = Строка(сбисНомерДокумента);
	КонецПопытки;
	// 1173125472 для добавления значения после номера документа.
	Если Не ПустаяСтрока(сбисПостфикс) Тогда
		сбисРезультат = Строка(сбисРезультат) + "/" + сбисПостфикс;
	КонецЕсли;
	
	Возврат сбисРезультат; 
КонецФункции

Функция сбисРассчитатьЦеныСтавкиИСуммыНДСДляСтрокТЧТоварыДокумента_УТ11(Документ, ПересчитыватьНДСПоДанным1С, 
																	ПересчитыватьЦеныПоДанным1С) Экспорт
	ОбщийМодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения"); 
	Если Не ОбщийМодульОбщегоНазначения = Неопределено Тогда
		СтруктураПересчетаСуммы = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме
					("ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Параметры)", Документ);
		КэшированныеЗначения 
			= ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме("ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения()");
	КонецЕсли;
	
	ТЧТоварыРеквизитыМетаданные = Документ.Метаданные().ТабличныеЧасти.Товары.Реквизиты;
	
	ДопПараметрыПроверки = Новый Структура("НаборОбъектов, Объект", "Реквизиты", Документ.Соглашение);
	ИменаВидаЦена = "ВидЦеныПоставщика
	|ВидЦеныКлиента
	|ВидЦены
	|ВидЦен";
	
	ВозможныеИменаРеквизитаЦен = Новый Структура;
	Для НомерИмени = 1 По СтрЧислоСтрок(ИменаВидаЦена) Цикл
		ИмяРеквизита = СтрПолучитьСтроку(ИменаВидаЦена, НомерИмени);
		ВозможныеИменаРеквизитаЦен.Вставить(ИмяРеквизита,
		СбисСуществуетОбъектКонфигурацииСервер(ИмяРеквизита, ДопПараметрыПроверки));
		Если ВозможныеИменаРеквизитаЦен[ИмяРеквизита] Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ИмяВидаЦеныТЧ = "";
	Для НомерИмени = 1 По СтрЧислоСтрок(ИменаВидаЦена) Цикл
		ИмяРеквизита = СтрПолучитьСтроку(ИменаВидаЦена, НомерИмени);
		Если ТЧТоварыРеквизитыМетаданные.Найти(ИмяРеквизита) <> Неопределено Тогда
			ИмяВидаЦеныТЧ = ИмяРеквизита;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЭтоПокупка = ТипЗнч(Документ.Соглашение) = Тип("СправочникСсылка.СоглашенияСПоставщиками");

	Для каждого СтрокаТабличнойЧасти Из Документ.Товары Цикл
		ПересчитатьНДСПоДанным1С = Ложь;
		ПересчитатьЦеныПоДанным1С = Ложь;  
		СтруктураЗначений = Новый Структура;
		СтруктураЗначений.Вставить("ПересчитыватьНДСПоДанным1С", ПересчитыватьНДСПоДанным1С);  
		СтруктураЗначений.Вставить("ПересчитыватьЦеныПоДанным1С", ПересчитыватьЦеныПоДанным1С);
		СтруктураЗначений.Вставить("ВозможныеИменаРеквизитаЦен", ВозможныеИменаРеквизитаЦен);

		СтруктураЗначений = сбисРассчитатьСтруктуруДействий(СтруктураЗначений, 
							 СтрокаТабличнойЧасти, Документ, СтруктураПересчетаСуммы, ЭтоПокупка, ИмяВидаЦеныТЧ);
		СтруктураДействий = СтруктураЗначений.СтруктураДействий;
		ПересчитатьНДСПоДанным1С = СтруктураЗначений.ПересчитатьНДСПоДанным1С;
		ПересчитатьЦеныПоДанным1С = СтруктураЗначений.ПересчитатьЦеныПоДанным1С;
		Если ПересчитатьНДСПоДанным1С ИЛИ ПересчитатьЦеныПоДанным1С Тогда
			
			ДополнитьСтруктуруДействий(СтруктураДействий, Документ, СтруктураПересчетаСуммы);
			Параметры = Новый Структура;
			Параметры.Вставить("СтрокаТабличнойЧасти", СтрокаТабличнойЧасти);	   
			Параметры.Вставить("СтруктураДействий", СтруктураДействий);	
			Параметры.Вставить("КэшированныеЗначения", КэшированныеЗначения);	

			ОбщийМодульОбщегоНазначения.ВыполнитьВБезопасномРежиме("ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ
				 |(Параметры.СтрокаТабличнойЧасти,Параметры.СтруктураДействий,Параметры.КэшированныеЗначения)", Параметры);
		КонецЕсли;
	КонецЦикла;
КонецФункции

Процедура ДополнитьСтруктуруДействий(СтруктураДействий, Документ, СтруктураПересчетаСуммы)
    ТЧТоварыРеквизитыМетаданные = Документ.Метаданные().ТабличныеЧасти.Товары.Реквизиты;
	ЕстьРучнаяСкидка		 = НЕ ТЧТоварыРеквизитыМетаданные.Найти("СуммаРучнойСкидки") = Неопределено;
	ЕстьАвтоматическаяСкидка = НЕ ТЧТоварыРеквизитыМетаданные.Найти("СуммаАвтоматическойСкидки") = Неопределено;    
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	Если ЕстьРучнаяСкидка Тогда
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	КонецЕсли;
	Если ЕстьАвтоматическаяСкидка Тогда
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	КонецЕсли;      

КонецПроцедуры

Процедура ДополнитьСтруктуруДействийОтЦены(СтруктураДействий, Документ)
	ЭтоПокупка = ТипЗнч(Документ.Соглашение) = Тип("СправочникСсылка.СоглашенияСПоставщиками");
	ЗаполнитьЦену = Новый Структура("Дата, Валюта", Документ.Дата, Документ.Валюта);
	Если ЭтоПокупка Тогда
		
		ЗаполнитьЦену.Вставить("ВернутьМногооборотнуюТару", Ложь);
		ЗаполнитьЦену.Вставить("НалогообложениеНДС", Документ.НалогообложениеНДС);
		ЗаполнитьЦену.Вставить("Организация", Документ.Организация);
		ЗаполнитьЦену.Вставить("Партнер", Документ.Партнер);
		ЗаполнитьЦену.Вставить("Соглашение", Документ.Соглашение);
		СтруктураДействий.Вставить("ЗаполнитьЦенуЗакупки", ЗаполнитьЦену);
	Иначе
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ЗаполнитьЦену);
	КонецЕсли;
	
КонецПроцедуры

Функция сбисРассчитатьСтруктуруДействий(СтруктураЗначений, СтрокаТабличнойЧасти, Документ, 
			СтруктураПересчетаСуммы, ЭтоПокупка, ИмяВидаЦеныТЧ)   
	ПересчитатьЦеныПоДанным1С = Ложь;  
	ПересчитатьНДСПоДанным1С = Ложь; 
	СтруктураДействий = Новый Структура;	
	Если СтруктураЗначений.ПересчитыватьНДСПоДанным1С = 1
				ИЛИ (СтруктураЗначений.ПересчитыватьНДСПоДанным1С = 0 
						И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СуммаНДС)
						И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС)) Тогда
		СтруктураИнформации = Новый Структура("НалогообложениеНДС, Дата, Организация", 
								Документ.НалогообложениеНДС, Документ.Дата, Документ.Организация);			
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", СтруктураИнформации);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		ПересчитатьНДСПоДанным1С = Истина;
	КонецЕсли;
		
	Если (СтруктураЗначений.ПересчитыватьЦеныПоДанным1С = 1
		ИЛИ (СтруктураЗначений.ПересчитыватьЦеныПоДанным1С = 0 
		И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Сумма)
		И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Цена)))
		И ЗначениеЗаполнено(Документ.Соглашение) Тогда
		
		Для каждого ИмяРеквизита Из СтруктураЗначений.ВозможныеИменаРеквизитаЦен Цикл
			Если ИмяРеквизита.Значение Тогда
				
				ЗаполнитьВидЦены = Новый Структура("ВидЦены, ИмяПоляВидЦены",
				Документ.Соглашение[ИмяРеквизита.Ключ],
				ИмяВидаЦеныТЧ);
				СтруктураДействий.Вставить("ЗаполнитьВидЦены", ЗаполнитьВидЦены);
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
		ДополнитьСтруктуруДействийОтЦены(СтруктураДействий, Документ);
				
		ПересчитатьЦеныПоДанным1С = Истина;
	КонецЕсли;
	СтруктураЗначенийВозврата = Новый Структура;
	СтруктураЗначенийВозврата.Вставить("ПересчитатьЦеныПоДанным1С", ПересчитатьЦеныПоДанным1С);
	СтруктураЗначенийВозврата.Вставить("ПересчитатьНДСПоДанным1С", ПересчитатьНДСПоДанным1С);
	СтруктураЗначенийВозврата.Вставить("СтруктураДействий", СтруктураДействий);
	Возврат СтруктураЗначенийВозврата;
	
КонецФункции
