
// Функция - Заполняет соглашение с клиентом на УТ11, ERP, КА
//
// Параметры:
//  Контекст	 - Структура	 - Содержит структуру обрабатываемого документа       
// Возвращаемое значение:
//   Ссылка - содержит ссылку на Справочник.СоглашенияСКлиентами 
//
Функция ЗаполнитьСоглашениеСКлиентомУТ11(Контекст) Экспорт
	// Функция заполняет соглашение в загружаемых заказах для конфигурации УТ11	
	сбисКонтекстСервер = Новый Структура("Контрагент", Контекст.Документ.Контрагент);
	Возврат сбисПолучитьСоглашениеСКлиентомУТ11_Сервер(сбисКонтекстСервер);
КонецФункции  

// Функция - Возвращает структуру условий продаж по партнеру.
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// Возвращаемое значение:
//   СправочникСсылка.СоглашенияСКлиентами - соглашение с клиентом 
//
Функция сбисПолучитьСоглашениеСКлиентомУТ11_Сервер(Знач Контекст)
	СправочникСоглашение = Неопределено;
	
	Попытка
		ОбщийМодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения");
		МетаданныйСоглашениеСКлиентами = СбисСуществуетОбъектКонфигурацииСервер("СоглашенияСКлиентами", 
												Новый Структура("КлассМетаданных", "Справочники")); 
		МетаданныеЗаказКлиента = СбисСуществуетОбъектКонфигурацииСервер("ЗаказКлиента", 
												Новый Структура("КлассМетаданных", "Документы")); 
			
		Если МетаданныйСоглашениеСКлиентами И МетаданныеЗаказКлиента И Не ОбщийМодульОбщегоНазначения = Неопределено Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("УчитыватьГруппыСкладов", Истина);
			ПараметрыОтбора.Вставить("ВыбранноеСоглашение", Справочники["СоглашенияСКлиентами"].ПустаяСсылка());
			ПараметрыОтбора.Вставить("ПустаяСсылкаДокумента", Документы["ЗаказКлиента"].ПустаяСсылка());    
			Параметры = Новый Структура;
			Параметры.Вставить("Партнер" , Контекст.Контрагент.Партнер); 
			Параметры.Вставить("ПараметрыОтбора" , ПараметрыОтбора);
			СправочникСоглашениеЗначение = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме(
					"ПродажиСервер.ПолучитьУсловияПродажПоУмолчанию(Параметры.Партнер, Параметры.ПараметрыОтбора)", Параметры);       
			СправочникСоглашение = СправочникСоглашениеЗначение.Соглашение;	
		Иначе
			СправочникСоглашение = Неопределено;
		КонецЕсли
	
	Исключение
		СправочникСоглашение = Неопределено;
	КонецПопытки;
	Возврат СправочникСоглашение;
КонецФункции  

// Функция - Выполняет поиск действующего договора с контрагентом по заданным реквизитам.
// Если найден один действующий договор, возвращает ссылку на него, в противном случае - пустую ссылку.
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// 
// Возвращаемое значение:
//   СправочникСсылка.ДоговорыКонтрагентов  - договор контрагента по умолчанию.
//
Функция ЗаполнитьДоговорСКлиентомУТ11(Контекст) Экспорт
	сбисКонтекстСервер = Новый Структура("Документ", Контекст.Документ);
	Возврат сбисПолучитьДоговорСКлиентомУТ11_Сервер(сбисКонтекстСервер);
КонецФункции

// Функция - Выполняет поиск действующего договора с контрагентом по заданным реквизитам.
// Если найден один действующий договор, возвращает ссылку на него, в противном случае - пустую ссылку.
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// 
// Возвращаемое значение:
//   СправочникСсылка.ДоговорыКонтрагентов  - договор контрагента по умолчанию.
//
Функция сбисПолучитьДоговорСКлиентомУТ11_Сервер(Контекст)
	ДоговорПоУмолчанию = Неопределено;
	Попытка
	    ОбщийМодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения");
		Если Не ОбщийМодульОбщегоНазначения = Неопределено Тогда       
			Параметры = Новый Структура;
			Параметры.Вставить("Документ", Контекст.Документ);
			Параметры.Вставить("ХОРеализацияКлиенту", Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
			   ДоговорПоУмолчанию = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме(
			"ПродажиСервер.ПолучитьДоговорПоУмолчанию(Параметры.Документ, Параметры.ХОРеализацияКлиенту)", Параметры);
		КонецЕсли;
	Исключение
		ДоговорПоУмолчанию = Неопределено;
	КонецПопытки;
	Возврат ДоговорПоУмолчанию;	
КонецФункции

// Функция  - Заполняет НалогообложениеНДС в загружаемых документах, если не заполнен договор для конфигураций УТ11, ERP, KA2   
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// Возвращаемое значение:
// 	 Структура - Параметры учета НДС по организации:
//
Функция ЗаполнитьНалогообложениеНДСБезДоговораУТ11(Контекст) Экспорт
	сбисКонтекстСервер = Новый Структура("Организация, Дата", Контекст.Документ.Организация, Контекст.Документ.Дата);
	Возврат сбисПолучитьНалогообложениеНДСБезДоговораУТ11_Сервер(сбисКонтекстСервер);
КонецФункции    

// Функция - Возвращает параметры учета НДС, установленные для организации в заданном периоде.
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// Возвращаемое значение:
// 	 Структура - Параметры учета НДС по организации:
//
Функция сбисПолучитьНалогообложениеНДСБезДоговораУТ11_Сервер(Знач Контекст) Экспорт
	НалогообложениеНДС = Неопределено;
	Попытка
		ОбщийМодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения");

		Если Не ОбщийМодульОбщегоНазначения = Неопределено Тогда    
			Параметры = Новый Структура;
			Параметры.Вставить("Организация", Контекст.Организация);
			Параметры.Вставить("Дата", Контекст.Дата);
			ПараметрыУчетаОрганизации = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме(
			"УчетНДСУП.ПараметрыУчетаПоОрганизации(Параметры.Организация, Параметры.Дата)", Параметры);    
		КонецЕсли;
		Если ПараметрыУчетаОрганизации.ПрименяетсяПСН Тогда
			НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаПоПатенту;
		ИначеЕсли ПараметрыУчетаОрганизации.НалогообложениеНДСРозничнойПродажи 
					= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД Тогда
			НалогообложениеНДС = ПараметрыУчетаОрганизации.НалогообложениеНДСРозничнойПродажи;
		Иначе
			НалогообложениеНДС = ПараметрыУчетаОрганизации.ОсновноеНалогообложениеНДСПродажи;
		КонецЕсли;
	Исключение
	    НалогообложениеНДС = Неопределено;
	КонецПопытки;
	Возврат НалогообложениеНДС;
КонецФункции 

// Функция - Выполняет поиск менеджера УТ11, ERP, KA2 
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// 
// Возвращаемое значение:
//   СправочникСсылка.Пользователи  - Пользователь ИБ
//
Функция ЗаполнитьМенеджераУТ11(Контекст) Экспорт
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "Справочники.Пользователи", "ТекущийПользовательИБ"); 
	сбисОписаниеОбъекта.Значение = сбисПолучитьМенеджераУТ11_Сервер();
	Возврат сбисОписаниеОбъекта.Значение;
КонецФункции    

// Функция - Выполняет поиск менеджера УТ11, ERP, KA2 
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// 
// Возвращаемое значение:
//   СправочникСсылка.Пользователи  - Пользователь ИБ
//
Функция сбисПолучитьМенеджераУТ11_Сервер(Знач Контекст = Неопределено)
	ИдПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	Возврат Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ИдПользователяИБ);
КонецФункции

// Функция - преобразует номер документа к стандарту 1С 
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
//   НастройкиНомера	- Структура	 - Содержит пользовательские параметры для формирования номера 
// 
// Возвращаемое значение:
//   Строка  - Номер документа
//
Функция ПолучитьНомерДокумента(Контекст, НастройкиНомера = Неопределено) Экспорт
	сбисНомерДокумента = Неопределено;
	Контекст.Свойство("НомерДокумента", сбисНомерДокумента);       
	
	Если Не Контекст.Свойство("Документ") Тогда
		ДокументКонтекст = Контекст;
		Контекст.Вставить("Документ", ДокументКонтекст);
	КонецЕсли;
	Если НастройкиНомера = Неопределено Тогда
		МестныйКэш = Новый Структура;
		МестныйКэш.Вставить("Парам", Новый Структура("УдалятьПрефиксИнформационнойБазы, УдалятьПользовательскийПрефикс", Ложь, Ложь));  
	Иначе
		МестныйКэш = Новый Структура;
		МестныйКэш.Вставить("Парам", НастройкиНомера);  
	КонецЕсли;
	Возврат сбисНомерДокументаНаПечатьСервер(сбисФункцияНомераНаПечать(МестныйКэш), Контекст.Документ, 
					сбисНомерДокумента, сбисДобавитьЗначениеПослеНомера(Контекст)); 
КонецФункции  

// Функция - преобразует номер документа к стандарту 1С
//
// Параметры:
//   Кэш           - Структура	 - Информация об удалениее префика ИБ и пользовательского
// 
// Возвращаемое значение:
//   Строка  - Номер документа
//
Функция сбисФункцияНомераНаПечать(Кэш)
	сбисОписаниеОбъекта = Новый Структура("Тип, Ключ, Значение", "ПользовательскиеЗначения.Функции", "НомерДокумента");
	сбисСтрокаФункцииКонец	=	"," + Формат(Кэш.Парам.УдалятьПрефиксИнформационнойБазы, "БЛ = Ложь; БИ = Истина") 
	+ "," + Формат(Кэш.Парам.УдалятьПользовательскийПрефикс,	"БЛ = Ложь; БИ = Истина") + ")";
	сбисНомерДокумента		= "001";   
	сбисДокумент = Неопределено;
	сбисСписокФункций		= Новый Массив;    
	Параметры = Новый Структура;
	Параметры.Вставить("сбисДокумент", сбисДокумент);
	Параметры.Вставить("сбисНомерДокумента", сбисНомерДокумента);
	Параметры.Вставить("сбисСтрокаФункцииКонец", сбисСтрокаФункцииКонец);
	
	сбисСписокФункций.Добавить("ОбщегоНазначения.ПолучитьНомерНаПечать(Параметры.сбисДокумент)");
	сбисСписокФункций.Добавить("ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Параметры.сбисНомерДокумента" 
																						+ Параметры.сбисСтрокаФункцииКонец);
	сбисСписокФункций.Добавить("ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Параметры.сбисНомерДокумента" 
																						+ Параметры.сбисСтрокаФункцииКонец);
	сбисСписокФункций.Добавить("СокрЛП(Параметры.сбисНомерДокумента)");
	ОбщийМодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения");   
	Если Не ОбщийМодульОбщегоНазначения = Неопределено Тогда
		Для Каждого сбисСтрокаФункции Из сбисСписокФункций Цикл 
			Попытка
				ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме(сбисСтрокаФункции, Параметры);
			Исключение
				Продолжить;
			КонецПопытки;
			Прервать;
		КонецЦикла;    
	КонецЕсли;
	ФункцияДляРасчета = Новый Структура("сбисСтрокаФункции, Параметры", сбисСтрокаФункции, Параметры);
	Возврат ФункцияДляРасчета;  
КонецФункции

// Функция - преобразует номер документа к стандарту 1С. Добавление постфикса
//
// Параметры:
//   Контекст           - Структура	 - Содержит структуру обрабатываемого документа
// 
// Возвращаемое значение:
//   Строка  - Номер документа
//
Функция сбисДобавитьЗначениеПослеНомера(Контекст)
	
	СтрокаВозврат = Неопределено;
	Если	Контекст.Свойство("ИндексОбособленногоПодразделения", СтрокаВозврат)
		И	ЗначениеЗаполнено(СтрокаВозврат) Тогда
		Если ТипЗнч(СтрокаВозврат) = Тип("Число") Тогда
			СтрокаВозврат = Формат(СтрокаВозврат, "ЧН=0; ЧГ=0");
		Иначе
			СтрокаВозврат = СокрЛП(Строка(СтрокаВозврат));
		КонецЕсли;
	Иначе
		СтрокаВозврат = "";
	КонецЕсли;
	// +++ МАИ 14.09.2021 поддержка дополнительного постфикса 
	Постфикс = "";
	Контекст.Свойство("НомДокПостфикс", Постфикс);
	Если ПустаяСтрока(СтрокаВозврат) И НЕ ПустаяСтрока(Постфикс) Тогда
		СтрокаВозврат = Постфикс;
	ИначеЕсли НЕ ПустаяСтрока(Постфикс) Тогда
		СтрокаВозврат = СтрокаВозврат + "/" + Постфикс;	
	Иначе 
		Постфикс = "";		
	КонецЕсли;
	// --- МАИ 14.09.2021 поддержка дополнительного постфикса
	
	Возврат	СтрокаВозврат;	
	
КонецФункции

// Функция - преобразует номер документа к стандарту 1С. Добавление постфикса
//
// Параметры:
//   ФункцияДляРасчета  - Структура -  Строка функции и параметры в ней
//   сбисДокумент 		- Структура - Структура документа 
//   сбисОсновнойНомерДокумента - Строка - Основной номре документа
//   сбисПостфикс 				- Строка - Постфикс номера
// 
// Возвращаемое значение:
//   Строка  - Номер документа
//
Функция сбисНомерДокументаНаПечатьСервер(ФункцияДляРасчета, сбисДокумент, сбисОсновнойНомерДокумента = Неопределено, 
									сбисПостфикс = "")     
	ОбщийМодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения"); 
	// Не указан номер, тогда берем его из документа руками.
	Если сбисОсновнойНомерДокумента = Неопределено Тогда
		сбисНомерДокумента = сбисДокумент.Номер;
	Иначе
		сбисНомерДокумента = сбисОсновнойНомерДокумента;
	КонецЕсли;
	ФункцияДляРасчета.Параметры.Вставить("сбисНомерДокумента", сбисНомерДокумента);
	Попытка  
		Если Не ОбщийМодульОбщегоНазначения = Неопределено Тогда
			сбисРезультат = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме(ФункцияДляРасчета.сбисСтрокаФункции, 
								ФункцияДляРасчета.Параметры);  
		Иначе  
			сбисРезультат = Строка(сбисНомерДокумента);
		КонецЕсли;
	Исключение
		сбисРезультат = Строка(сбисНомерДокумента);
	КонецПопытки;
	// 1173125472 для добавления значения после номера документа.
	Если Не ПустаяСтрока(сбисПостфикс) Тогда
		сбисРезультат = Строка(сбисРезультат) + "/" + сбисПостфикс;
	КонецЕсли;
	
	Возврат сбисРезультат; 
КонецФункции

Функция ВложениеСБИС_ПрочитатьДанные(ВложениеСБИС, ДопПараметры) Экспорт
	Перем Файл_Формат, Файл_ВерсияФормата;
	
	ВложениеСБИС.Вставить("XMLДокумента", "");
	
	XMLФайла            = ВложениеСБИС_Получить(ДопПараметры.ФайлВBase64);
	XMLИсходногоФайла	= XMLФайла;
	XMLФайла			= СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(XMLФайла
							, "xmlns=""SFAKT""",											"")
							, "xmlns=""OTORG12""",											"")
							, "xmlns=""IAKTPRM""",											"")
							, "xmlns:xs=""http://www.w3.org/2001/XMLSchema""",				"")
							, "xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""",	"")
							, "xmlns=""urn:schemas-microsoft-com:office:spreadsheet""",		"");
	
	Файл_Формат			= сбисЗаменитьНедопустимыеСимволы(ВложениеСБИС.Тип);
	Файл_ВерсияФормата	= сбисЗаменитьНедопустимыеСимволы(ВложениеСБИС.ВерсияФормата);		
	СтруктураФайла		= Новый Структура;
	
	Если ЗначениеЗаполнено(Файл_Формат) И ЗначениеЗаполнено(XMLФайла) Тогда   

		Если ЗначениеЗаполнено(Файл_ВерсияФормата) Тогда
			ВложениеСБИС.XMLДокумента = XMLИсходногоФайла;
		КонецЕсли;
		Если ЗначениеЗаполнено(XMLФайла) Тогда
			Попытка
				СтруктураФайла	= ЗаполнитьСтруктуруФайла(XMLФайла);
			Исключение
				// Возможна ошибка транспорта строки не XML вложений на УФ
				СтруктураФайла	= Новый Структура;
				XMLФайла		= "";
			КонецПопытки;
		КонецЕсли;
	Иначе
		XMLФайла = "";
	КонецЕсли;
	
	// Пробуем преобразовать XML только если он есть, дабы избежать лишних вызовов сервера
	ВложениеСБИС.Вставить("СтруктураФайла", СтруктураФайла);
	ВложениеСБИС.Вставить("ФорматДляЗагрузки",			Файл_Формат);
	ВложениеСБИС.Вставить("ВерсияФорматаДляЗагрузки",	Файл_ВерсияФормата);
	Возврат ВложениеСБИС;
КонецФункции

Функция ВложениеСБИС_Получить(Base64Файл) Экспорт  

	// BSLLS:UsingSynchronousCalls-off
	// BSLLS:TempFilesDir-off
	ИмяФайла = КаталогВременныхФайлов() + строка(Новый УникальныйИдентификатор()) + ".tmp";    
	// BSLLS:UsingSynchronousCalls-on
	// BSLLS:TempFilesDir-on

	// Выше 8.3.10 ПолучитьСтрокуИзДвоичныхДанных()
	
	ДвоичныеДанныеФайла = Base64Значение(Base64Файл);
	ДвоичныеДанныеФайла.Записать(ИмяФайла);
	
	Если ИмяФайла = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КодировкиЧтенияФайлов = Новый Структура();
	КодировкиЧтенияФайлов.Вставить("Определять", Новый Массив);
	КодировкиЧтенияФайлов.Вставить("ПоУмолчанию", Новый Структура("ДляВсех", "utf-8"));
	КодировкиЧтенияФайлов.Определять.Добавить("windows-1251");

	ТекстДок = Новый ЧтениеТекста(ИмяФайла);
	СтрокаТекст = СтрЗаменить(НРег(ТекстДок.ПрочитатьСтроку()), "'", """");
	СтрокаКодировка = КодировкиЧтенияФайлов.ПоУмолчанию.ДляВсех;
	// Проверим кодировки для принудительного чтения.	
	Для Каждого КодировкаДляЧтения Из КодировкиЧтенияФайлов.Определять Цикл
		ПозицияКодировки = Найти(СтрокаТекст, "encoding");
		Если ПозицияКодировки И Найти(Сред(СтрокаТекст, ПозицияКодировки), КодировкаДляЧтения) Тогда
			СтрокаКодировка = КодировкаДляЧтения;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	// Переоткрываем файл в найденной кодировке
	ТекстДок.Открыть(ИмяФайла, СтрокаКодировка);
	РезультатТекст = ТекстДок.Прочитать();
	Попытка
		// BSLLS:UsingSynchronousCalls-off - для совместимости со старыми платформами
		УдалитьФайлы(ИмяФайла);
		// BSLLS:UsingSynchronousCalls-on
	Исключение  
		РезультатТекст = Неопределено;
	КонецПопытки;
	
	Если	РезультатТекст = Неопределено
		Или	Лев(РезультатТекст, 4) = "%PDF" Тогда
		// для PDF-файла иногда возвращается крокозябра, которая потом вызывает ошибку передачи данных между 
		// клиентом и сервером, несмотря на то, что это строка
		РезультатТекст = "";
	КонецЕсли;
	
	Возврат РезультатТекст;
КонецФункции

Функция СбисЗаменитьНедопустимыеСимволы(СтрГдеЗаменить) Экспорт
	Возврат	СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(
	  СтрГдеЗаменить, ".", "_"), " ", ""), "-", "_"), "+", "_"), ",", "_");
КонецФункции 

Функция СбисФорматСтроки(СбисСтрока, Режим = "Убрать", ФорматнаяСтрока = "@/-?=\& ""'#№*(:|;).") Экспорт
	
	Возврат ПрименитьФорматКСтроке(СбисСтрока, ФорматнаяСтрока, Режим);

КонецФункции

Функция ЗаполнитьСтруктуруФайла(Знач СтрокаXML) Экспорт
	// Функция формирует структуру по XML	
	СтруктураФайла = Новый Структура;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	ПостроительDOM = Новый ПостроительDOM; 
	Попытка
		// UAA переделал заколоченные узлы на контекст сериализации.
		ДокументДОМ = ПостроительDOM.Прочитать(ЧтениеXML);
		КонтекстВыполнения = Новый Структура("УзелКакМассив", Новый Массив);
		КонтекстВыполнения.УзелКакМассив.Добавить("СтрТабл");
		КонтекстВыполнения.УзелКакМассив.Добавить("ИтогТабл");
		КонтекстВыполнения.УзелКакМассив.Добавить("Основание");
		КонтекстВыполнения.УзелКакМассив.Добавить("ДопСведения");
		КонтекстВыполнения.УзелКакМассив.Добавить("ДопАдрЭл");
		КонтекстВыполнения.УзелКакМассив.Добавить("НомСредИдентТов");
		КонтекстВыполнения.УзелКакМассив.Добавить("НомУпак");
		КонтекстВыполнения.УзелКакМассив.Добавить("КИЗ");
		КонтекстВыполнения.УзелКакМассив.Добавить("СведПрослеж");
		КонтекстВыполнения.УзелКакМассив.Добавить("НомерГТД");
		ПрочитатьУзелDOM(ДокументДОМ.ПервыйДочерний, СтруктураФайла, КонтекстВыполнения);
	Исключение
		ДокументДОМ = Неопределено;
	КонецПопытки;
	Возврат СтруктураФайла;
КонецФункции

// Функция - преобразует номер документа к стандарту 1С. Добавление постфикса
//
// Параметры:
//   УзелDOM  - ПостроительDOM - прочитанный xml
//   Узел 		- Структура - Структура файла
//   КонтекстВыполнения - Структура - параметры выполнения
// 
// Возвращаемое значение:
//   Структура - измененный файл
//
// BSLLS:CognitiveComplexity-off
// BSLLS:NestedStatements-off
// BSLLS:CyclomaticComplexity-off
Функция ПрочитатьУзелDOM(УзелDOM, Узел, КонтекстВыполнения) Экспорт  
	// Функция рекурсивно заполняет структуру из узла DOM	
	УзелПараметр = Узел;
	Уз = УзелDOM;
	Пока Уз <> Неопределено Цикл
		Если ТипЗнч(Уз) = Тип("ТекстDOM") Тогда
			Если УзелПараметр.Количество() = 0 Тогда
				УзелПараметр = Уз.ПолныйТекст;
			Иначе
				Если Не УзелПараметр.свойство("Параметр") Тогда
					УзелПараметр.Вставить("Параметр", Уз.ПолныйТекст); 
				КонецЕсли;					
			КонецЕсли;	
			Возврат УзелПараметр;
		Иначе	
			Если Уз.Атрибуты.Количество() <> 0 Или Уз.ПервыйДочерний <> Неопределено Тогда
				НоваяСтруктура = Новый Структура;
				Атрибуты = Уз.Атрибуты;
				Для каждого Атрибут Из Атрибуты Цикл
					Попытка
						НоваяСтруктура.Вставить(Атрибут.ИмяУзла, Атрибут.ЗначениеУзла);
					Исключение
						Атрибут = Неопределено;
					КонецПопытки;
				КонецЦикла;	
				Если Не КонтекстВыполнения.УзелКакМассив.Найти(Уз.ИмяУзла) = Неопределено Тогда
					Если Узел.Свойство(Уз.ИмяУзла) = Ложь Тогда
						МассивСтрок = Новый Массив;
					Иначе
						МассивСтрок = Узел[Уз.ИмяУзла];
					КонецЕсли;	
					МассивСтрок.Добавить(НоваяСтруктура);
					Узел.Вставить(Уз.ИмяУзла, МассивСтрок);
				ИначеЕсли Уз.ИмяУзла = "Параметр" Тогда
					Если Узел.Свойство("Параметр") = Ложь Тогда
						Параметр = Новый Структура;    
					Иначе
						Параметр = Узел.Параметр; // сбис Никифоров
					КонецЕсли;    
					Попытка
						Параметр.Вставить(СтрЗаменить(СтрЗаменить(НоваяСтруктура.Имя, "-", ""), " ", ""), НоваяСтруктура.Значение);
						Узел.Вставить(Уз.ИмяУзла, Параметр);
					Исключение
						Параметр = Неопределено;
					КонецПопытки;
				ИначеЕсли Лев(Уз.ИмяУзла, 6) = "Список" Тогда
					Если Уз.ПервыйДочерний <> Неопределено Тогда
						мУз = УЗ.ПервыйДочерний;
						ИмяУзла = мУз.ИмяУзла;
						Если		ИмяУзла = "Параметр" 
							Или	Не	КонтекстВыполнения.УзелКакМассив.Найти(ИмяУзла) = Неопределено Тогда
							Пока мУз <> Неопределено Цикл
								ПрочитатьУзелDOM(мУз, Узел, КонтекстВыполнения);
								мУз = мУз.СледующийСоседний;
							КонецЦикла;
						Иначе
							МассивСтрок = Новый Массив;
							Пока мУз <> Неопределено Цикл
								ДочУзел = Новый Структура;
								ВложениеУзла = Неопределено;
								ПрочитатьУзелDOM(мУз, ДочУзел, КонтекстВыполнения);
								Если ТипЗнч(ДочУзел) = Тип("Структура") Тогда
									Для Каждого Элемент Из ДочУзел Цикл
										ВложениеУзла = Элемент.Значение;
										Прервать;
									КонецЦикла; 
									Если ВложениеУзла <> Неопределено Тогда
										МассивСтрок.Добавить(ВложениеУзла);
									КонецЕсли;
								КонецЕсли;
								мУз = мУз.СледующийСоседний;
							КонецЦикла;
							Узел.Вставить(ИмяУзла, МассивСтрок);
						КонецЕсли;
					КонецЕсли;
				Иначе	
					Узел.Вставить(Уз.ИмяУзла, НоваяСтруктура);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		Если Уз.ПервыйДочерний <> Неопределено И Лев(Уз.ИмяУзла, 6) <> "Список" Тогда
			Уз				= УЗ.ПервыйДочерний;
			УзелНаОбработку	= Узел[УЗ.РодительскийУзел.ИмяУзла];
			ДочУзел			= сбисСкопироватьОбъект(УзелНаОбработку);
			// Если это массив, то обрабатываем последнюю строку
			Если ТипЗнч(ДочУзел) = Тип("Массив") Тогда
				УзелНаЗаполнение = ДочУзел[УзелНаОбработку.Количество() - 1];
				ПрочитатьУзелDOM(Уз, УзелНаЗаполнение, КонтекстВыполнения);
				ДочУзел[УзелНаОбработку.Количество() - 1] = УзелНаЗаполнение;
			Иначе
				ПрочитатьУзелDOM(Уз, ДочУзел, КонтекстВыполнения);
			КонецЕсли;
			Если ТипЗнч(ДочУзел) = Тип("Структура") 
				И	Не	КонтекстВыполнения.УзелКакМассив.Найти(УЗ.РодительскийУзел.ИмяУзла) = Неопределено Тогда
				сбисСкопироватьСтруктуру(УзелНаОбработку[УзелНаОбработку.Количество() - 1], ДочУзел);
			Иначе	
				Узел.Вставить(УЗ.РодительскийУзел.ИмяУзла, ДочУзел);
			КонецЕсли;	
			Уз = Уз.РодительскийУзел;
		КонецЕсли;
		Если Лев(Уз.РодительскийУзел.ИмяУзла, 6) = "Список" Тогда
			Прервать;
		КонецЕсли;
		Уз = Уз.СледующийСоседний;
	КонецЦикла;
	
	Возврат Узел;
КонецФункции
// BSLLS:CognitiveComplexity-on	
// BSLLS:NestedStatements-on
// BSLLS:CyclomaticComplexity-on

Процедура сбисСкопироватьСтруктуру(СтруктураКуда, Знач СтруктураОткуда)  Экспорт
	СбисСкопироватьСтруктуруСПараметрами(СтруктураКуда, СтруктураОткуда, Новый Структура("КлючиНеКопировать", Новый Массив));
КонецПроцедуры

// Процедура копирует структуру в контексте сервера. Использовать ТОЛЬКО для серверных функций и процедур
// Параметры:
//   СтруктураКуда  - Структура - Структура файла 
//   СтруктураОткуда - Структура - Структура файла
//   ДопПараметры - Структура - дополнительные параметры
// 
Процедура СбисСкопироватьСтруктуруСПараметрами(СтруктураКуда, Знач СтруктураОткуда, Знач ДопПараметры)
	Если НЕ ТипЗнч(СтруктураОткуда) =  Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Элемент Из СтруктураОткуда Цикл	
		Если Не ДопПараметры.КлючиНеКопировать.Найти(Элемент.Ключ) = Неопределено Тогда
			Если Не СтруктураКуда.Свойство(Элемент.Ключ) Тогда
				СтруктураКуда.Вставить(Элемент.Ключ, Элемент.Значение);
			Иначе
				СтруктураКуда[Элемент.Ключ] = Элемент.Значение;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			СтруктураКуда.Вставить(Элемент.Ключ, Новый Структура);
			сбисСкопироватьСтруктуру(СтруктураКуда[Элемент.Ключ], Элемент.Значение);
		ИначеЕсли ТипЗнч(Элемент.Значение) =  Тип("Массив") Тогда
			СтруктураКуда.Вставить(Элемент.Ключ, Новый Массив);
			Для Каждого ЭлементМассива Из Элемент.Значение Цикл
				ПромежуточнаяСтруктура = Новый Структура;
				сбисСкопироватьСтруктуру(ПромежуточнаяСтруктура, ЭлементМассива);
				СтруктураКуда[Элемент.Ключ].Добавить(ПромежуточнаяСтруктура);
			КонецЦикла;
		ИначеЕсли Не СтруктураКуда.Свойство(Элемент.Ключ) Тогда
			СтруктураКуда.Вставить(Элемент.Ключ, Элемент.Значение);
		Иначе
			СтруктураКуда[Элемент.Ключ] = Элемент.Значение;			
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Функция СбисСкопироватьОбъект(Знач ОбъектНаВход)  Экспорт
	Возврат СкопироватьОбъектСПараметрамиСервер(ОбъектНаВход);
КонецФункции

// Функция возвращает глубокую копию исходного объекта. Поддерживаемые составные типы: Структура, Массив.
//
// Параметры:
//   ОбъектНаВход  - Структура - исходный объект
// 
// Возвращаемое значение:
//   Структура - копия исходного объекта
//
Функция СбисСкопироватьОбъектНаКлиенте(ОбъектНаВход)  Экспорт
	Если ТипЗнч(ОбъектНаВход) = Тип("Структура") Тогда
		Результат = Новый Структура;
		Для Каждого КлючИЗначение Из ОбъектНаВход Цикл
			Результат.Вставить(КлючИЗначение.Ключ, сбисСкопироватьОбъектНаКлиенте(КлючИЗначение.Значение));
		КонецЦикла;
	ИначеЕсли ТипЗнч(ОбъектНаВход) = Тип("Массив") Тогда
		Результат = Новый Массив;
		Для Каждого ЭлементМассива Из ОбъектНаВход Цикл
			Результат.Добавить(сбисСкопироватьОбъектНаКлиенте(ЭлементМассива));
		КонецЦикла;
	Иначе
		Результат = ОбъектНаВход;
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Функция возвращает глубокую копию раздела ини без копии расчитанных значений. 
// Поддерживаемые составные типы: Структура, Массив.
// Параметры:	
// 		СбисОбъект - Структура - обьъект сбис
//		СбисКлючи - Массив - массив ключей
// 		ГлубокоеКопирование - Булево - степень копирования
//
// Возвращаемое значение:
//   Структура - копия раздела
//
// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off
Функция СкопироватьОбъектСПараметрамиСервер(Знач СбисОбъект, СбисКлючи = Неопределено, ГлубокоеКопирование = Истина) Экспорт
	Если ТипЗнч(СбисОбъект) = Тип("Структура") Тогда
		Если СбисКлючи = Неопределено Тогда
			Результат = Новый Структура;
			Для Каждого КлючИЗначение Из СбисОбъект Цикл
				Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
				Если ГлубокоеКопирование Тогда
					Результат[КлючИЗначение.Ключ] = СкопироватьОбъектСПараметрамиСервер(КлючИЗначение.Значение, , ГлубокоеКопирование);			
				КонецЕсли;
			КонецЦикла;
		Иначе
			Результат = Новый Структура(СбисКлючи);
			ЗаполнитьЗначенияСвойств(Результат, СбисОбъект);
			Если ГлубокоеКопирование Тогда
				Для Каждого КлючИЗначение Из Результат Цикл
					Результат[КлючИЗначение.Ключ] = СкопироватьОбъектСПараметрамиСервер(КлючИЗначение.Значение, , ГлубокоеКопирование);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(СбисОбъект) = Тип("Массив") Тогда
		Результат = Новый Массив;
		Если СбисКлючи = Неопределено Тогда
			Для Каждого ЭлементМассива Из СбисОбъект Цикл
				Результат.Добавить(?(ГлубокоеКопирование, СкопироватьОбъектСПараметрамиСервер(ЭлементМассива, , 
						ГлубокоеКопирование), ЭлементМассива));
			КонецЦикла;
		Иначе
			Для Счетчик = 0 По СбисОбъект.Количество() Цикл
				Если СбисКлючи.Найти(Счетчик) Тогда
					Результат.Добавить(?(ГлубокоеКопирование, СкопироватьОбъектСПараметрамиСервер(ЭлементМассива, , 
							ГлубокоеКопирование), ЭлементМассива));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Результат = СбисОбъект;
	КонецЕсли;
	Возврат Результат;
КонецФункции
// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on
