
Процедура сбисРассчитатьЦеныСтавкиИСуммыНДСДляСтрокТЧТоварыДокумента_УТ11(Документ, ПересчитыватьНДСПоДанным1С, 
																	ПересчитыватьЦеныПоДанным1С) Экспорт
	ОбщийМодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения"); 
	Если Не ОбщийМодульОбщегоНазначения = Неопределено Тогда
		СтруктураПересчетаСуммы = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме
					("ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Параметры)", Документ);
		КэшированныеЗначения 
			= ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме("ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения()");
	КонецЕсли;
	
	ТЧТоварыРеквизитыМетаданные = Документ.Метаданные().ТабличныеЧасти.Товары.Реквизиты;
	
	ДопПараметрыПроверки = Новый Структура("НаборОбъектов, Объект", "Реквизиты", Документ.Соглашение);
	ИменаВидаЦена = "ВидЦеныПоставщика
	|ВидЦеныКлиента
	|ВидЦены
	|ВидЦен";
	
	ВозможныеИменаРеквизитаЦен = Новый Структура;
	Для НомерИмени = 1 По СтрЧислоСтрок(ИменаВидаЦена) Цикл
		ИмяРеквизита = СтрПолучитьСтроку(ИменаВидаЦена, НомерИмени);
		ВозможныеИменаРеквизитаЦен.Вставить(ИмяРеквизита,
		СбисСуществуетОбъектКонфигурацииСервер(ИмяРеквизита, ДопПараметрыПроверки));
		Если ВозможныеИменаРеквизитаЦен[ИмяРеквизита] Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ИмяВидаЦеныТЧ = "";
	Для НомерИмени = 1 По СтрЧислоСтрок(ИменаВидаЦена) Цикл
		ИмяРеквизита = СтрПолучитьСтроку(ИменаВидаЦена, НомерИмени);
		Если ТЧТоварыРеквизитыМетаданные.Найти(ИмяРеквизита) <> Неопределено Тогда
			ИмяВидаЦеныТЧ = ИмяРеквизита;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЭтоПокупка = ТипЗнч(Документ.Соглашение) = Тип("СправочникСсылка.СоглашенияСПоставщиками");

	Для каждого СтрокаТабличнойЧасти Из Документ.Товары Цикл
		ПересчитатьНДСПоДанным1С = Ложь;
		ПересчитатьЦеныПоДанным1С = Ложь;  
		СтруктураЗначений = Новый Структура;
		СтруктураЗначений.Вставить("ПересчитыватьНДСПоДанным1С", ПересчитыватьНДСПоДанным1С);  
		СтруктураЗначений.Вставить("ПересчитыватьЦеныПоДанным1С", ПересчитыватьЦеныПоДанным1С);
		СтруктураЗначений.Вставить("ВозможныеИменаРеквизитаЦен", ВозможныеИменаРеквизитаЦен);

		СтруктураЗначений = сбисРассчитатьСтруктуруДействий(СтруктураЗначений, 
							 СтрокаТабличнойЧасти, Документ, СтруктураПересчетаСуммы, ЭтоПокупка, ИмяВидаЦеныТЧ);
		СтруктураДействий = СтруктураЗначений.СтруктураДействий;
		ПересчитатьНДСПоДанным1С = СтруктураЗначений.ПересчитатьНДСПоДанным1С;
		ПересчитатьЦеныПоДанным1С = СтруктураЗначений.ПересчитатьЦеныПоДанным1С;
		Если ПересчитатьНДСПоДанным1С ИЛИ ПересчитатьЦеныПоДанным1С Тогда
			
			ДополнитьСтруктуруДействий(СтруктураДействий, Документ, СтруктураПересчетаСуммы);
			Параметры = Новый Структура;
			Параметры.Вставить("СтрокаТабличнойЧасти", СтрокаТабличнойЧасти);	   
			Параметры.Вставить("СтруктураДействий", СтруктураДействий);	
			Параметры.Вставить("КэшированныеЗначения", КэшированныеЗначения);	

			ОбщийМодульОбщегоНазначения.ВыполнитьВБезопасномРежиме("ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ
				 |(Параметры.СтрокаТабличнойЧасти,Параметры.СтруктураДействий,Параметры.КэшированныеЗначения)", Параметры);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ДополнитьСтруктуруДействий(СтруктураДействий, Документ, СтруктураПересчетаСуммы)
    ТЧТоварыРеквизитыМетаданные = Документ.Метаданные().ТабличныеЧасти.Товары.Реквизиты;
	ЕстьРучнаяСкидка		 = НЕ ТЧТоварыРеквизитыМетаданные.Найти("СуммаРучнойСкидки") = Неопределено;
	ЕстьАвтоматическаяСкидка = НЕ ТЧТоварыРеквизитыМетаданные.Найти("СуммаАвтоматическойСкидки") = Неопределено;    
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	Если ЕстьРучнаяСкидка Тогда
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	КонецЕсли;
	Если ЕстьАвтоматическаяСкидка Тогда
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	КонецЕсли;      

КонецПроцедуры

Процедура ДополнитьСтруктуруДействийОтЦены(СтруктураДействий, Документ)
	ЭтоПокупка = ТипЗнч(Документ.Соглашение) = Тип("СправочникСсылка.СоглашенияСПоставщиками");
	ЗаполнитьЦену = Новый Структура("Дата, Валюта", Документ.Дата, Документ.Валюта);
	Если ЭтоПокупка Тогда
		
		ЗаполнитьЦену.Вставить("ВернутьМногооборотнуюТару", Ложь);
		ЗаполнитьЦену.Вставить("НалогообложениеНДС", Документ.НалогообложениеНДС);
		ЗаполнитьЦену.Вставить("Организация", Документ.Организация);
		ЗаполнитьЦену.Вставить("Партнер", Документ.Партнер);
		ЗаполнитьЦену.Вставить("Соглашение", Документ.Соглашение);
		СтруктураДействий.Вставить("ЗаполнитьЦенуЗакупки", ЗаполнитьЦену);
	Иначе
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ЗаполнитьЦену);
	КонецЕсли;
	
КонецПроцедуры

Функция сбисРассчитатьСтруктуруДействий(СтруктураЗначений, СтрокаТабличнойЧасти, Документ, 
			СтруктураПересчетаСуммы, ЭтоПокупка, ИмяВидаЦеныТЧ)   
	ПересчитатьЦеныПоДанным1С = Ложь;  
	ПересчитатьНДСПоДанным1С = Ложь; 
	СтруктураДействий = Новый Структура;	
	Если СтруктураЗначений.ПересчитыватьНДСПоДанным1С = 1
				ИЛИ (СтруктураЗначений.ПересчитыватьНДСПоДанным1С = 0 
						И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СуммаНДС)
						И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС)) Тогда
		СтруктураИнформации = Новый Структура("НалогообложениеНДС, Дата, Организация", 
								Документ.НалогообложениеНДС, Документ.Дата, Документ.Организация);			
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", СтруктураИнформации);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		ПересчитатьНДСПоДанным1С = Истина;
	КонецЕсли;
		
	Если (СтруктураЗначений.ПересчитыватьЦеныПоДанным1С = 1
		ИЛИ (СтруктураЗначений.ПересчитыватьЦеныПоДанным1С = 0 
		И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Сумма)
		И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Цена)))
		И ЗначениеЗаполнено(Документ.Соглашение) Тогда
		
		Для каждого ИмяРеквизита Из СтруктураЗначений.ВозможныеИменаРеквизитаЦен Цикл
			Если ИмяРеквизита.Значение Тогда
				
				ЗаполнитьВидЦены = Новый Структура("ВидЦены, ИмяПоляВидЦены",
				Документ.Соглашение[ИмяРеквизита.Ключ],
				ИмяВидаЦеныТЧ);
				СтруктураДействий.Вставить("ЗаполнитьВидЦены", ЗаполнитьВидЦены);
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
		ДополнитьСтруктуруДействийОтЦены(СтруктураДействий, Документ);
				
		ПересчитатьЦеныПоДанным1С = Истина;
	КонецЕсли;
	СтруктураЗначенийВозврата = Новый Структура;
	СтруктураЗначенийВозврата.Вставить("ПересчитатьЦеныПоДанным1С", ПересчитатьЦеныПоДанным1С);
	СтруктураЗначенийВозврата.Вставить("ПересчитатьНДСПоДанным1С", ПересчитатьНДСПоДанным1С);
	СтруктураЗначенийВозврата.Вставить("СтруктураДействий", СтруктураДействий);
	Возврат СтруктураЗначенийВозврата;
	
КонецФункции

