
// Функция - Определяет, есть справочники, документы и др. таблицы, а так же их реквизиты
// в метаданных конфигурации.
//
// Параметры:
//  ПутьОбъекта	 - Строка	 - Строка по типу: "Контрагенты", "ДополнительныеСведения.Объект".
//   Может содержать Название метаданных (справочник, документ и т.д.): определяет есть ли
//   объект с таким названием. Может серез точку быть указано Название реквизита.
//   Тогда определяется, если ли такой реквизит у объекта метаданных.
//  ДопПараметры - Структура	 - Содержит описание коллекций метаданных, в которых
//   производится поиск.
//   КлассМетаданных (строка) - Справочники, Документы, РегистрыСведений или ПланыВидовХарактеристик.
//   НаборОбъектов (строка) - Реквизиты, ТабличныеЧасти, Измерения или Ресурсы.
//   Объект (любая ссылка) - Ссылка на элемент Справочника, Документа или Плана видов.
//   
// Для перечислений  КлассМетаданных = "Перечисления", ПутьОбъекта = НазваниеПеречисления.Значение
// Возвращаемое значение:
//  Булево - Истина, если указанный объект есть
//
Функция СбисСуществуетОбъектКонфигурацииСервер(ПутьОбъекта, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
		ЭлементКоллекцииМетаданных = ЭлементКоллекцииМетаданныхПоПараметрам(ПутьОбъекта, ДополнительныеПараметры);
	Иначе
		ЭлементКоллекцииМетаданных = ЭлементКоллекцииМетаданныхПоПараметрам(ПутьОбъекта, ДопПараметры);
	КонецЕсли;
	
	Возврат Не ЭлементКоллекцииМетаданных = Неопределено;
	
КонецФункции

// Функция - Элемент коллекции метаданных по имени
//
// Параметры:
//  ПутьОбъекта	 - Строка	 - Строка по типу: "Контрагенты", "ДополнительныеСведения.Объект".
//   Может содержать Название метаданных (справочник, документ и т.д.): определяет есть ли
//   объект с таким названием. Может серез точку быть указано Название реквизита.
//   Тогда определяется, если ли такой реквизит у объекта метаданных.
//  ДопПараметры - Структура	 - Содержит описание коллекций метаданных, в которых
//   производится поиск.
//   КлассМетаданных (строка) - Справочники, Документы, РегистрыСведений или ПланыВидовХарактеристик.
//   НаборОбъектов (строка) - Реквизиты, ТабличныеЧасти, Измерения или Ресурсы.
//   Объект (любая ссылка) - Ссылка на элемент Справочника, Документа или Плана видов.
// 
// Возвращаемое значение:
//  ОбъектКоллекцииМетаданных - найденное значение, если не найдено - Неопределено
//
Функция ЭлементКоллекцииМетаданныхПоПараметрам(ПутьОбъекта, ДопПараметры) Экспорт
	Перем ЭлементКоллекцииМетаданных;
	
	ПутьМассивом = Новый Массив;
	ПутьВСтроках = СтрЗаменить(ПутьОбъекта, ".", Символы.ПС);
	
	Для НомерСтроки = 1 По СтрЧислоСтрок(ПутьВСтроках) Цикл
		ПутьМассивом.Добавить(СокрЛП(СтрПолучитьСтроку(ПутьВСтроках, НомерСтроки)));
	КонецЦикла;
	
	КонтекстПолученияПути = Новый Структура("ОбъектМетаданных, ПутьКМетаданным, ПутьОбъекта", 
											Метаданные, Новый Структура, ПутьМассивом);
	ОпределитьПутьМетаданных(КонтекстПолученияПути, ДопПараметры);
	
	ОбъектМетаданных	= КонтекстПолученияПути.ОбъектМетаданных;
	ПутьКМетаданным		= КонтекстПолученияПути.ПутьКМетаданным;
	ПутьМассивом		= КонтекстПолученияПути.ПутьОбъекта;
	Для Каждого ЧастьПутиОбъекта Из КонтекстПолученияПути.ПутьОбъекта Цикл
		
		Если ПутьКМетаданным = Неопределено Тогда
			
			Возврат ЭлементКоллекцииМетаданных;
			
		КонецЕсли;
		
		Для Каждого ЧастьПутиМетаданных Из ПутьКМетаданным Цикл
			ЭлементКоллекцииМетаданных = ЭлементКоллекцииМетаданныхСуществует(ЧастьПутиМетаданных, 
					ОбъектМетаданных, ПутьМассивом, ЧастьПутиОбъекта); 
			Если ЭлементКоллекцииМетаданных = Неопределено Тогда
				
				Продолжить;
				
			ИначеЕсли ЧастьПутиМетаданных.Ключ = "Перечисления" Тогда 
			
				Возврат ЭлементКоллекцииМетаданных;
			
			Иначе
				ОбъектМетаданных = ЭлементКоллекцииМетаданных;
				ПутьКМетаданным = ЧастьПутиМетаданных.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ЭлементКоллекцииМетаданных;

КонецФункции

Функция ЭлементКоллекцииМетаданныхСуществует(ЧастьПутиМетаданных, ОбъектМетаданных, ПутьМассивом, ЧастьПутиОбъекта) 
	ЭлементКоллекцииМетаданных = Неопределено;
	Попытка
		Если ЧастьПутиМетаданных.Ключ = "Перечисления" Тогда
					
			ЭлементКоллекцииМетаданных = ОбъектМетаданных.Перечисления[ПутьМассивом[0]].ЗначенияПеречисления.Найти(ПутьМассивом[1]); 
		Иначе
					
			ЭлементКоллекцииМетаданных = ОбъектМетаданных[ЧастьПутиМетаданных.Ключ].Найти(ЧастьПутиОбъекта);
					
		КонецЕсли;
				
	Исключение
				
		ВызватьИсключение("Неизвестная коллекция метаданных " + ЧастьПутиМетаданных.Ключ);
				
	КонецПопытки;
	Возврат ЭлементКоллекцииМетаданных;

КонецФункции

// Процедура - Определяет путь метаданных
//
// Параметры:
//  КонтекстПоискаПути	 - Структура	 - содержит описание для поиска метаданных           
//   ОбъектМетаданных (строка) - Справочники, Документы, РегистрыСведений или ПланыВидовХарактеристик.
//   ПутьКМетаданным (Структура) - новая Структура
//   ПутьОбъекта (Массив) 
//  ДопПараметры - Структура	 - Содержит описание коллекций метаданных, в которых
//   производится поиск.
//   КлассМетаданных (строка) - Справочники, Документы, РегистрыСведений или ПланыВидовХарактеристик.
//   НаборОбъектов (строка) - Реквизиты, ТабличныеЧасти, Измерения или Ресурсы.
//   Объект (любая ссылка) - Ссылка на элемент Справочника, Документа или Плана видов.
// 
Процедура ОпределитьПутьМетаданных(КонтекстПоискаПути, ДопПараметры)
	Перем КлассМетаданных, НаборОбъектов;
	
	Если ДопПараметры.Свойство("Объект")
		И Метаданные.НайтиПоТипу(ТипЗнч(ДопПараметры.Объект)) <> Неопределено Тогда 	
		
		КонтекстПоискаПути.ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ДопПараметры.Объект));
		
		Если НЕ ДопПараметры.Свойство("НаборОбъектов", НаборОбъектов) Тогда
			КонтекстПоискаПути.ПутьКМетаданным = Неопределено;
		ИначеЕсли КонтекстПоискаПути.ПутьОбъекта.Количество() < 3 Тогда
			КонтекстПоискаПути.ПутьКМетаданным = Новый Структура(НаборОбъектов);
		Иначе

			ОбъектыТабличнойЧасти = Новый Структура("Реквизиты");
			КонтекстПоискаПути.ПутьКМетаданным = Новый Структура(НаборОбъектов, ОбъектыТабличнойЧасти);
		КонецЕсли;
		
	Иначе
		
		Если НЕ ДопПараметры.Свойство("КлассМетаданных", КлассМетаданных) Тогда
			
			КонтекстПоискаПути.ПутьКМетаданным = Неопределено;	
			
		ИначеЕсли НЕ ДопПараметры.Свойство("НаборОбъектов", НаборОбъектов) Тогда
			
			КонтекстПоискаПути.ПутьКМетаданным.Вставить(КлассМетаданных, Неопределено);
			
		ИначеЕсли КонтекстПоискаПути.ПутьОбъекта.Количество() < 3 Тогда
			
			КонтекстПоискаПути.ПутьКМетаданным.Вставить(КлассМетаданных, Новый Структура(НаборОбъектов));
			
		Иначе

			ОбъектыТабличнойЧасти = Новый Структура("Реквизиты");
			КонтекстПоискаПути.ПутьКМетаданным.Вставить(КлассМетаданных, Новый Структура(НаборОбъектов, ОбъектыТабличнойЧасти));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОбщийМодульКонфигурации(ИмяМодуля)
	
	Попытка
		Модуль = ОбщийМодуль(ИмяМодуля);		
	Исключение
		Модуль = Неопределено;
	КонецПопытки;
	
	Возврат Модуль;
		
КонецФункции

Функция ОбщийМодуль(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		// АПК:488-выкл ВычислитьВБезопасномРежиме не используется, чтобы избежать вызова ОбщийМодуль рекурсивно.
		УстановитьБезопасныйРежим(Истина);
		Модуль = Вычислить(Имя);
		// АПК:488-вкл
	ИначеЕсли СтрЧислоВхождений(Имя, ".") = 1 Тогда
		Возврат СерверныйМодульМенеджера(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ТекстОшибки = "Общий модуль "+Имя+" не существует";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции

// Возвращает серверный модуль менеджера по имени объекта.
//
// Параметры:
//  Имя - Строка - Имя модуля менеджера.
//
// Возвращаемое значение:
//   МодульМенеджера
//
Функция СерверныйМодульМенеджера(Имя)
	ОбъектНайден = Ложь;
	
	ЧастиИмени = СтрРазделить82(Имя, ".");
	Если ЧастиИмени.Количество() = 2 Тогда
		
		ИмяВида = ВРег(ЧастиИмени[0]);
		ИмяОбъекта = ЧастиИмени[1];
		
		ДопустимыеВиды = Новый Массив();
		ДопустимыеВиды.Добавить(ВРег("Константы"));
		ДопустимыеВиды.Добавить(ВРег("РегистрыСведений"));
		ДопустимыеВиды.Добавить(ВРег("РегистрыНакопления"));
		ДопустимыеВиды.Добавить(ВРег("РегистрыБухгалтерии"));
		ДопустимыеВиды.Добавить(ВРег("РегистрыРасчета"));
		ДопустимыеВиды.Добавить(ВРег("Справочники"));
		ДопустимыеВиды.Добавить(ВРег("Документы"));
		ДопустимыеВиды.Добавить(ВРег("Отчеты"));
		ДопустимыеВиды.Добавить(ВРег("Обработки"));
		ДопустимыеВиды.Добавить(ВРег("БизнесПроцессы"));
		ДопустимыеВиды.Добавить(ВРег("ЖурналыДокументов"));
		ДопустимыеВиды.Добавить(ВРег("Задачи"));
		ДопустимыеВиды.Добавить(ВРег("ПланыСчетов"));
		ДопустимыеВиды.Добавить(ВРег("ПланыОбмена"));
		ДопустимыеВиды.Добавить(ВРег("ПланыВидовХарактеристик"));
		ДопустимыеВиды.Добавить(ВРег("ПланыВидовРасчета"));
		
		Если ДопустимыеВиды.Найти(ИмяВида) <> Неопределено Тогда 
			Если Метаданные[ИмяВида].Найти(ИмяОбъекта) <> Неопределено Тогда
		    	ОбъектНайден = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ОбъектНайден Тогда
		ТекстОшибки = "Общий модуль "+Имя+" не существует";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	// АПК:488-выкл ВычислитьВБезопасномРежиме не используется, чтобы избежать вызова ОбщийМодуль рекурсивно.
	УстановитьБезопасныйРежим(Истина);
	Модуль = Вычислить(Имя);
	// АПК:488-вкл
	
	Возврат Модуль;
КонецФункции

// Функция - преобразует строку по формату
//
// Параметры:
//   ФорматнаяСтрока  - Строка - строка для изменения
//   ПараметрыФорматнойСтроки 		- Строка - формат строки 
//   КлючФормата - Строка - режим изменения формата
// 
// Возвращаемое значение:
//   НоваяФорматнаяСтрока - строка - измененная строка
//
// BSLLS:CognitiveComplexity-off
// BSLLS:FunctionOutParameter-off
Функция ПрименитьФорматКСтроке(ФорматнаяСтрока, ПараметрыФорматнойСтроки = Неопределено, КлючФормата = "СтрЗаменить") Экспорт
	
	КлючПроверка = НРег(КлючФормата);
	
	Если КлючПроверка = "стрзаменить" Тогда
		
		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		
		Если	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Структура")
			Или	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("ФиксированнаяСтруктура")
			Или	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Соответствие") Тогда
			
			Для Каждого КлючИЗначение Из ПараметрыФорматнойСтроки Цикл
				
				НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, "{" + КлючИЗначение.Ключ + "}", КлючИЗначение.Значение);
				
			КонецЦикла;
			
		ИначеЕсли	ТипЗнч(ПараметрыФорматнойСтроки) = Тип("Массив")
			Или		ТипЗнч(ПараметрыФорматнойСтроки) = Тип("ФиксированныйМассив") Тогда
			
			Для ИндексСтрок = 0 По ПараметрыФорматнойСтроки.Количество() - 1 Цикл
				
				НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, "{" + ИндексСтрок + "}", ПараметрыФорматнойСтроки[ИндексСтрок]);
				
			КонецЦикла;
			
		Иначе
			
			НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, "{" + ПараметрыФорматнойСтроки + "}", "");
			
		КонецЕсли;
	
	ИначеЕсли	КлючПроверка = "убрать" Тогда
		
		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		Если ПараметрыФорматнойСтроки = Неопределено Тогда
			
			ПараметрыФорматнойСтроки =  "@/-?=\& ""'#№*(:|;).";
			
		КонецЕсли;
		Для	Шаг	= 1	По СтрДлина(ПараметрыФорматнойСтроки) Цикл
			
			НоваяФорматнаяСтрока = СтрЗаменить(НоваяФорматнаяСтрока, Сред(ПараметрыФорматнойСтроки, Шаг, 1), "");
			
		КонецЦикла;
		
	ИначеЕсли	КлючПроверка = "ключструктуры" Тогда
		
		НоваяФорматнаяСтрока = ПрименитьФорматКСтроке(ФорматнаяСтрока, , "Убрать");
		Если Найти("0123456789", Лев(НоваяФорматнаяСтрока, 1)) Тогда
			
			// Первый символ - число. Добавить префикс(в структуре ключ не может начинаться с числа)
			НоваяФорматнаяСтрока = "_" + НоваяФорматнаяСтрока;
			
		КонецЕсли;
		
	ИначеЕсли	КлючПроверка = "формат" Тогда
		
		НоваяФорматнаяСтрока = Формат(НоваяФорматнаяСтрока, ПараметрыФорматнойСтроки);
		
	Иначе
		
		НоваяФорматнаяСтрока = ФорматнаяСтрока;
		
	КонецЕсли;
	
	Возврат НоваяФорматнаяСтрока;	

КонецФункции

