
#Область include_core_base_ФоновыеЗадания_Saby_ГлобальныйМодульЯдра
#КонецОбласти

Функция ПолучитьПрогресс(Параметры)
	Прогресс = МодульЯдра().get_prop(Параметры, "ДополнительныеПараметры");
	Прогресс = МодульЯдра().get_prop(Прогресс, "Прогресс", 0); 
	Возврат Прогресс;
КонецФункции

&НаКлиенте
Процедура РасширениеПроверитьСостояниеФоновогоЗаданияКлиент() Экспорт
	МодульФоновогоЗаданияКлиент().Подключаемый_ПроверитьВыполнениеЗадания();
	ПараметрыСеансаРасш = МодульФоновогоЗаданияСервер().ПрогрессФЗПрочитатьЗначения();
	_Параметры			= ПараметрыСеансаРасш.Параметры;
	ТекстОповещения = ПараметрыСеансаРасш.ТекстОповещения;
	Прогресс = ПолучитьПрогресс(ПараметрыСеансаРасш);
	Состояние(_Параметры.ФоновоеЗаданиеНаименование, Прогресс, ТекстОповещения);
КонецПроцедуры

&НаКлиенте
Процедура РасширениеЗавершающееСообщениеПрогресса() Экспорт
	ПараметрыСеансаРасш = МодульФоновогоЗаданияСервер().ПрогрессФЗПрочитатьЗначения();
	_Параметры			= ПараметрыСеансаРасш.Параметры;
	ТекстОповещения		= ПараметрыСеансаРасш.ТекстОповещения;
	Прогресс = ПолучитьПрогресс(ПараметрыСеансаРасш);
	Состояние(_Параметры.ФоновоеЗаданиеНаименование, Прогресс, ТекстОповещения);
КонецПроцедуры

