
#Область include_core_base_ФоновыеЗадания_Saby_ГлобальныйМодульЯдра
#КонецОбласти

&НаКлиенте
Функция ПолучитьПрогресс(Параметры)
	Прогресс = get_prop(Параметры, "ДополнительныеПараметры");
	Прогресс = get_prop(Прогресс, "Прогресс", 0); 
	Возврат Прогресс;
КонецФункции

&НаКлиенте
Процедура ОбработкаПроверитьСостояниеФоновогоЗаданияКлиент() Экспорт
	// Значения до обращения к БЛ
	ПараметрыСеансаРасш = МодульФоновогоЗаданияСервер().ПрогрессФЗПрочитатьЗначения();
	_Параметры			= ПараметрыСеансаРасш.Параметры;
	ТекстОповещения		= ПараметрыСеансаРасш.ТекстОповещения;
	Прогресс			= ПолучитьПрогресс(ПараметрыСеансаРасш);
	// Сообщим
	Состояние(_Параметры.ФоновоеЗаданиеНаименование, Прогресс, ТекстОповещения);

	МодульФоновогоЗаданияКлиент().Подключаемый_ПроверитьВыполнениеЗадания();
	
	// Значения после обращения к БЛ
	ПараметрыСеансаРасш = МодульФоновогоЗаданияСервер().ПрогрессФЗПрочитатьЗначения();
	ТекстОповещения = ПараметрыСеансаРасш.ТекстОповещения;
	Прогресс = ПолучитьПрогресс(ПараметрыСеансаРасш);
	// Сообщим
	Состояние(_Параметры.ФоновоеЗаданиеНаименование, Прогресс, ТекстОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗавершающееСообщениеПрогресса() Экспорт
	ПараметрыСеансаРасш = МодульФоновогоЗаданияСервер().ПрогрессФЗПрочитатьЗначения();
	_Параметры			= ПараметрыСеансаРасш.Параметры;
	ТекстОповещения		= ПараметрыСеансаРасш.ТекстОповещения;
	Прогресс = ПолучитьПрогресс(ПараметрыСеансаРасш);
	Состояние(_Параметры.ФоновоеЗаданиеНаименование, Прогресс, ТекстОповещения);
КонецПроцедуры
