
Функция ПолучитьПрогресс(Параметры)
	Прогресс = Saby_Core.get_prop(Параметры, "ДополнительныеПараметры");
	Прогресс = Saby_Core.get_prop(Прогресс, "Прогресс", 0); 
	Возврат Прогресс;
КонецФункции

&НаКлиенте
Процедура РасширениеКЭДОПроверитьСостояниеФоновогоЗаданияКлиент() Экспорт
	// Значения до обращения к БЛ
	ПараметрыСеансаРасш = Saby_ФоновыеЗаданияСервер.ПараметрыСеансаРасширения();
	Параметры = ПараметрыСеансаРасш.Параметры;
	ТекстОповещения = ПараметрыСеансаРасш.ТекстОповещения;
	Прогресс = ПолучитьПрогресс(ПараметрыСеансаРасш);
	// Сообщим
	Состояние(Параметры.ФоновоеЗаданиеНаименование, Прогресс, ТекстОповещения);

	Saby_ФоновыеЗаданияКлиент.Подключаемый_ПроверитьВыполнениеЗадания();
	
	// Значения после обращения к БЛ
	ПараметрыСеансаРасш = Saby_ФоновыеЗаданияСервер.ПараметрыСеансаРасширения();
	ТекстОповещения = ПараметрыСеансаРасш.ТекстОповещения;
	Прогресс = ПолучитьПрогресс(ПараметрыСеансаРасш);
	// Сообщим
	Состояние(Параметры.ФоновоеЗаданиеНаименование, Прогресс, ТекстОповещения);
КонецПроцедуры

