//&НаКлиенте
//Перем КомандыПечатиФормы;
//&НаКлиенте
//Перем Документы;

#Область ОписаниеПеременных
// BSLLS:UnusedLocalVariable-off Переменные формы
// BSLLS:MissingVariablesDescription-off
&НаКлиенте
Перем ФормаОткрыта, ТранспортИнтеграции, context_param, BlocklyExecutor;
&НаКлиенте
Перем СтатусЧерновик, СтатусЗавершено, СтатусОшибка;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on
#КонецОбласти

#Область include_core_base_ЭДО_Form_ЗагрузкаДокументов_ОсобенностиОбработки
#КонецОбласти

#Область include_core_base_Настройки_ПрочитатьНастройки
#КонецОбласти

#Область include_core_base_Авторизация_ОткрытьФормуАвторизацииПриОтсутствииСессии
#КонецОбласти

#Область include_core_base_ЭДО_Form_ЗагрузкаДокументов_ОсобенностиПродуктаПриОткрытии
#КонецОбласти

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "SabySignOut" Тогда
		Закрыть();
	ИначеЕсли ИмяСобытия = "AddonActionResponse" Тогда
		ОбработатьРезультатСобытия(Параметр);
	ИначеЕсли ИмяСобытия = "ПереносСтатусовSABY" Тогда
		ПоказатьТекстСообщения();
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПФЕслиНеДокумент()
	ТипМетаданных = ТипОбъектаМетаданных(Объекты[0].Объект);
	Если Не ТипМетаданных = "Документы" Тогда 
		ВидимостьЭлементаФормы("ВложенияТипаДокумента", Ложь);
		ВидимостьЭлементаФормы("Предпросмотр", Ложь);
		ВидимостьЭлементаФормы("грДобавитьФайл", Ложь);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция РегламентПоНаименованию(ТекРегламент, ВидОбъекта, ТипОбъекта)
	НайденныйРегламент = Неопределено;
	Отбор = Новый Структура("ВидОбъекта, ТипОбъекта", ВидОбъекта, ТипОбъекта);
    СтрокиРегламента = РегламентПоТипамДокументов.НайтиСтроки(Отбор);
	Для каждого Регламента из СтрокиРегламента Цикл
		Если Регламента.Регламент.Значение = ТекРегламент Тогда
			НайденныйРегламент = Регламента.Регламент;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Возврат НайденныйРегламент;
КонецФункции

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ТД = ЭлементыФормочки.Объекты.ТекущиеДанные;
	Если ТД = Неопределено Тогда 
		Возврат;
	КонецЕсли;
    ЗаписатьТипОбъектаПоУмолчанию(ТД.ВидОбъекта, ЭтаФорма.ТипОбъекта);

	ОтборСтруктура = Новый Структура("ВидОбъекта", ТД.ВидОбъекта);
	СтрокиОбъектов = ЭтаФорма.Объекты.НайтиСтроки(ОтборСтруктура);
	// Установить тип выгружаемого объекта у списка объектов
	Для Каждого СтрокаОбъекта Из СтрокиОбъектов Цикл
		СтрокаОбъекта.ИмяИни = ЭтаФорма.ТипОбъекта;
	КонецЦикла;
	
	ДокументыКОтправкеПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРегламентВидаВыгружаемогоДокумента(ВидОбъекта)
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПроизвольногоНазванияРегламента(ТекРегламент, ВидОбъекта, ТипОбъекта)
	НайденныйРегламент = РегламентПоНаименованию(ТекРегламент, ВидОбъекта, ТипОбъекта);
	ВидимостьПроизвольногоНаименования	= get_prop(НайденныйРегламент, "ПроизвольноеНазваниеРегламента", Ложь);
	ВидимостьЭлементаФормы("ПроизвольноеНазваниеРегламента", ВидимостьПроизвольногоНаименования);
	ВидимостьЭлементаФормы("ПроизвольноеНазваниеРегламентаВидимость", Не ВидимостьПроизвольногоНаименования);
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ЭлементыФормочки.Найти("НадписьПроизвольноеНазваниеРегламента") <> Неопределено Тогда
		ВидимостьЭлементаФормы("НадписьПроизвольноеНазваниеРегламента", ВидимостьПроизвольногоНаименования);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКомандВложения(СсылкаНаОбъект, ТекРегламент, ТекТипОбъекта)
	ТипМетаданных = ТипОбъектаМетаданных(СсылкаНаОбъект);
	ВидимостьЭлементов = Истина;
	Если (ТипМетаданных = "Документы" 
		Или Найти(ТекРегламент, "ПрочийКадровыйДокумент") > 0) 
		Или Не ДокументШтатноеРасписание(СсылкаНаОбъект)
		Тогда
		ВидимостьЭлементов = Истина;
	ИначеЕсли ТипМетаданных = "Справочники" 
		И ВРег(ТекТипОбъекта)  = ВРег("CadresOther")
		И ПустаяСтрока(ТекРегламент) Тогда
		ВидимостьЭлементов = Истина;
	Иначе
		ВидимостьЭлементов = Ложь;
	КонецЕсли;
	ВидимостьЭлементаФормы("ВложенияТипаДокумента", ВидимостьЭлементов);
	ВидимостьЭлементаФормы("Предпросмотр", ВидимостьЭлементов);
	ВидимостьЭлементаФормы("грДобавитьФайл", ВидимостьЭлементов);
	ВидимостьЭлементаФормы("ПростойЗапросПодписи", ВидимостьЭлементов);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПроизвольноеНазваниеРегламента(ВидОбъекта, ТипОбъекта, ТекРегламент)
	ПроизвольноеНазваниеРегламента = "";
	// Дадим произвольному названию регламента название первой отмеченной ПФ
	Отбор = Новый Структура("ВидОбъекта, ТипОбъекта", ВидОбъекта, ТипОбъекта);
	
	// Представление из таблицы сохраненных регламентов
	СписокРегламентов = РегламентТекущегоТипаДокумента.НайтиСтроки(Отбор);
	Для каждого Регл Из СписокРегламентов Цикл
	 	ПроизвольноеНазваниеРегламента = Регл.ПроизвольноеНазваниеРегламента;
		Прервать;
	КонецЦикла;
	
	Если ПустаяСтрока(ПроизвольноеНазваниеРегламента) Тогда
		ОтборВложения = Новый Структура("ВидОбъекта", ВидОбъекта);
	    СтрокиПФ = ВложенияПоТипамОбъектов1С.НайтиСтроки(ОтборВложения);
		Для каждого Влож из СтрокиПФ Цикл
			Если Влож.ОтметкаВыбора Тогда
				ПроизвольноеНазваниеРегламента = Влож.Представление;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ВидимостьЭлементаФормы(НазваниеЭлемента, ВидимостьЭлемента)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки[НазваниеЭлемента].Видимость = ВидимостьЭлемента;		
КонецПроцедуры

#Область include_core_base_ЭДО_Form_ЗагрузкаДокументов_УстановитьЛокализацию
#КонецОбласти

&НаСервере
Функция ДокументШтатноеРасписание(Знач СсылкаОбъект)
	ДокументШР = СсылкаОбъект.Метаданные().Имя = "ШтатноеРасписание" 
		И  Метаданные.Документы.Найти("ШтатноеРасписание") <> Неопределено;
	Возврат ДокументШР;
КонецФункции

&НаСервере
Функция ИсключающийОбъектПерезапускаДО(СсылкаОбъект)
	мИсключения = Новый Массив;
	мИсключения.Добавить("Справочник.Сотрудники");
	мИсключения.Добавить("Справочник.ФизическиеЛица");
	
	НайденОбъект = Неопределено;
	ТипМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаОбъект));
	Если ТипМетаданных <> Неопределено Тогда
		ИмяОбъекта = ТипМетаданных.ПолноеИмя();
	КонецЕсли;
	НайденОбъект = мИсключения.Найти(ИмяОбъекта);
	
	Возврат НайденОбъект <> Неопределено;
КонецФункции

#Область include_core_base_ЭДО_Form_ЗагрузкаДокументов_ПриСозданииНаСервереПереопределяемый
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	УстановитьЛокализацию();
	ДобавитьИнформациюОВерсии(ЭлементыФормочки.ВерсияПродукта);
	мДокументы = Неопределено;
	Объекты.Очистить();
	ТипыВыгружаемыхОбъектов.Очистить();
	ЭтаФорма.Фильтр = Неопределено;

	Если Параметры.Свойство("Filter") Тогда
		мДокументы = Параметры.Filter.Selection.Marked;
		ЭтаФорма.Фильтр = Параметры.Filter;
		ПереданныеПараметрыКоманды = get_prop(Параметры, "ПараметрыКоманды", Новый Структура);
		Для Каждого Парам Из ПереданныеПараметрыКоманды Цикл
			Попытка
				ЭтаФорма[Парам.Ключ] = Парам.Значение
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЦикла;	

	ИначеЕсли Параметры.Свойство("Источник") Тогда
		мДокументы = Параметры.Источник
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если мДокументы.Количество() > 0 Тогда
		ПервыйДок = мДокументы[0];
	Иначе
		//Закроем форму при отсутствии документов
		Отказ = Истина;
		Возврат;
	КонецЕсли;  
	ЗаполнитьОбъекты(мДокументы);
	ЭлементыФормочки.ПерезапуститьДО.Видимость = has_prop(Параметры, "ПерезапуститьДО");
	ПриСозданииНаСервереПереопределяемый();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление(ЭтаФорма_)
	
	//Оптправляем все виды документов. поэтому раскарска уже не нужна, код оставлен на будущее, 
	//ли вдруг нужно будет раскрасить таблицу документов по каким то другим условиям
	
	//мПоляОформления		= Новый Массив();
	//мПоляОформления.Добавить("ДокументыКОтправке");
	//
	//ПутьКПолюОтбора		= "ДокументыКОтправке.СтатусОшибки";
	//ПутьКПолюСравнения	= "ДокументыКОтправке.СтатусОшибки";
	//
	//
	////*******************************
	////Еще собрать
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//Для Каждого ИмяПоля Из мПоляОформления Цикл
	//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяПоля].Имя);
	//КонецЦикла;
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = 1;//Новый ПолеКомпоновкиДанных(ПутьКПолюСравнения);
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВыборПФДляВидаДокумента(Знач ВидОбъекта )
	МассивПечатныхФорм	= Новый Массив();
	мВыбрПечатныхФорм = ВложенияТекущегоТипаОбъекта1С.НайтиСтроки(
		Новый Структура("ОтметкаВыбора, ВидОбъекта", Истина, ВидОбъекта));
	Для Каждого ПФорма из мВыбрПечатныхФорм Цикл
		МассивПечатныхФорм.Добавить( ПФорма.Представление );
	КонецЦикла;
	
	//Обновим отметки в глобальной таблице ПечатныхФорм
	мВыбрПечатныхФорм = ВложенияТекущегоТипаОбъекта1С.НайтиСтроки(Новый Структура("ВидОбъекта", ВидОбъекта));
	Для Каждого ПФорма из мВыбрПечатныхФорм Цикл
		мПФ	= ВложенияПоТипамОбъектов1С.НайтиСтроки(
			Новый Структура("Представление, ВидОбъекта", ПФорма.Представление, ВидОбъекта));
		Для Каждого СтрокаВл Из мПФ Цикл
			СтрокаВл.ОтметкаВыбора = ПФорма.ОтметкаВыбора;
			Прервать;
		КонецЦикла;
	КонецЦикла;
	ЗаписатьВХранилище("Saby_ПФ_КОтправке", ВидОбъекта, МассивПечатныхФорм);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьВыборПФДляВидаДокумента(Знач ВидОбъекта )
 	МассивПечатныхФорм = ПрочитатьИзХранилища("Saby_ПФ_КОтправке", ВидОбъекта);
	ПоказатьПодсказку = Ложь;
	Если ТипЗнч(МассивПечатныхФорм) = Тип("Массив") Тогда
		Для Каждого ПФорма из МассивПечатныхФорм Цикл
			//Обновим общие данные
			мПФ	= ВложенияПоТипамОбъектов1С.НайтиСтроки(
				Новый Структура("Представление, ВидОбъекта", ПФорма, ВидОбъекта));
			Для Каждого СтрокаВл Из мПФ Цикл
				СтрокаВл.ОтметкаВыбора = Истина;
			КонецЦикла;
			//Обновим данные на форме
			мПФ	= ВложенияТекущегоТипаОбъекта1С.НайтиСтроки(
				Новый Структура("Представление, ВидОбъекта", ПФорма, ВидОбъекта));
			Для Каждого СтрокаВл Из мПФ Цикл
				СтрокаВл.ОтметкаВыбора = Истина;
			КонецЦикла;
			ПоказатьПодсказку = Истина;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаВл Из ВложенияПоТипамОбъектов1С Цикл
			СтрокаВл.ОтметкаВыбора = Ложь;
			ПоказатьПодсказку = Истина;
		КонецЦикла;
	КонецЕсли;
	УстановитьВидимостьПодсказкиПФ(ПоказатьПодсказку);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРегламентыПоУмолчанию(Знач ВидОбъекта, Знач ТипОбъекта, Знач ТекРегламент, 
	Знач ПроизвольноеНазвание, Знач ПредставлениеОбъекта)
	ЗаписатьВХранилище("Saby_Регламенты", ВидОбъекта + ТипОбъекта,
		Новый Структура("Регламент,ПроизвольноеНазвание", ТекРегламент, ПроизвольноеНазвание));	
КонецПроцедуры

&НаСервере
Функция ПрочитатьРегламентПоУмолчанию(Знач ВидОбъекта, Знач ТипОбъекта, Знач ПредставлениеОбъекта)
	РегламентПоУмолчанию = ПрочитатьИзХранилища("Saby_Регламенты", ВидОбъекта + ТипОбъекта);
	Возврат РегламентПоУмолчанию;
КонецФункции

&НаСервере
Процедура ЗаписатьТипОбъектаПоУмолчанию(Знач ВидОбъекта, Знач ТипОбъекта)
	ЗаписатьВХранилище("Saby_ОбъектВыгружаемый", ВидОбъекта,
		Новый Структура("ТипОбъекта", ТипОбъекта));
КонецПроцедуры

&НаСервере
Функция ПрочитатьТипОбъектаПоУмолчанию(Знач ВидОбъекта, Знач ЗначениеПоУмолчанию)
	ТипОбъектаИзХранилища = ПрочитатьИзХранилища("Saby_ОбъектВыгружаемый", ВидОбъекта);
	ТипОбъектаУмолчанию = get_prop(ТипОбъектаИзХранилища, "ТипОбъекта", ЗначениеПоУмолчанию);
	Если ПустаяСтрока(ТипОбъектаУмолчанию) Тогда
		ТипОбъектаУмолчанию = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат ТипОбъектаУмолчанию;
КонецФункции

&НаКлиенте
Функция ПервыйТипВыгружаемогоОбъекта(ВидОбъекта)
	ФильтрОтбор = Новый Структура("ВидОбъекта", ВидОбъекта);
	мСтрокТипов = ТипыВыгружаемыхОбъектов.НайтиСтроки(ФильтрОтбор);
	Результат = Неопределено;
	Для Каждого СтрокаТипа Из мСтрокТипов Цикл
		Результат = СтрокаТипа;
		Прервать;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписокВыбораТиповВыгружаемогоОбъекта(ВидОбъекта)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ТипОбъекта.СписокВыбора.Очистить();
	
	ОтборСтруктура = Новый Структура("ВидОбъекта", ВидОбъекта);
	СтрокиТаблицыОбъектов = ТипыВыгружаемыхОбъектов.НайтиСтроки(ОтборСтруктура);
	Если СтрокиТаблицыОбъектов.Количество() = 0 Тогда
		ЭлементыФормочки.ТипОбъекта.СписокВыбора.Добавить(ВидОбъекта, ВидОбъекта);
	Иначе
		Для Каждого СтрокаОбъекта Из СтрокиТаблицыОбъектов Цикл 
			ЭлементыФормочки.ТипОбъекта.СписокВыбора.Добавить(СтрокаОбъекта.ИмяИни, СтрокаОбъекта.КрасивоеНазвание);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьСписокРегламентовВыбранногоВидаОбъекта(СтрокаТаблицы, ИмяИни)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Регламент.СписокВыбора.Очистить();

	ТипОбъектаПоИмениИни = ТипОбъектаПоИмениИни(ИмяИни);
	Отбор = Новый Структура("ВидОбъекта, ТипОбъекта", СтрокаТаблицы.ВидОбъекта, ТипОбъектаПоИмениИни);
    СтрокиРегламента = РегламентПоТипамДокументов.НайтиСтроки(Отбор);
	Для Каждого Регл Из СтрокиРегламента Цикл
		Если Регл.ПредставлениеОбъекта = СтрокаТаблицы.Представление Тогда 
	 		_Строка = ЭлементыФормочки.Регламент.СписокВыбора.Добавить();
	 		_Строка.Значение = Регл.Регламент.Значение;
			_Строка.Представление = Регл.Регламент.Представление;
		КонецЕсли;	
	КонецЦикла;
	
	ЭлементыФормочки.Регламент.Видимость = (ЭлементыФормочки.Регламент.СписокВыбора.Количество() > 1);
КонецПроцедуры	

&НаКлиенте
Функция РанееВыбранныйРегламент(СтрокаТаблицы, ТипОбъекта)
	Если НЕ ФормаОткрыта Тогда
		Возврат Неопределено;
	КонецЕсли;
	//Выбренем запомненый Регламент
	Отбор = Новый Структура("ПредставлениеОбъекта, ТипОбъекта", СтрокаТаблицы.Представление, ТипОбъекта);
	СтрокиРегл = РегламентТекущегоТипаДокумента.НайтиСтроки(Отбор);
	Если СтрокиРегл.Количество() > 0 Тогда
		Для каждого Регл из СтрокиРегл Цикл
			ВремРегламент = Регл.Регламент;
			Прервать;
		КонецЦикла;
	Иначе
		//Этого быть не может но пусть отработает этот вариант
		ЭлементыФормочки = ПолучитьЭлементыФормы();
		Если ЭлементыФормочки.Регламент.СписокВыбора.Количество() > 0 Тогда 
			// На случай отстуствия регламентов
			ВремРегламент = ЭлементыФормочки.Регламент.СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ВремРегламент;
КонецФункции	

&НаСервере
Процедура ДобавитьПараметрыВОбщиеНастройки(context_params, СтруктураПараметров)
	МодульОбъекта = МодульОбъекта();
	ОбщиеНастройки	= МодульОбъекта.ОбщиеНастройкиПрочитать();
	ПубличныеОбщиеНастройки	= get_prop(ОбщиеНастройки, "public", Новый Структура);
	Для каждого ЭлемСтруктуры из СтруктураПараметров Цикл
		ПубличныеОбщиеНастройки.Вставить(ЭлемСтруктуры.Ключ, ЭлемСтруктуры.Значение);
	КонецЦикла;
	ОбщиеНастройки.Вставить("public", ПубличныеОбщиеНастройки);
	МодульОбъекта.ОбщиеНастройкиЗаписать(ОбщиеНастройки);
	context_params["public"] = ПубличныеОбщиеНастройки;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы(КоличествоДок, ПервыйДок)
	//Элементы.ГрПредпросмотр.Видимость = (КоличествоДок = 1);
	//Элементы.ГрСписокДокументов.Видимость = НЕ (КоличествоДок = 1);
	Если КоличествоДок = 1 Тогда 
		ЭтаФорма.Заголовок	= "Отправка в "+ ЛокализацияНазваниеПродукта() +" "+ СокрЛП(ПервыйДок.Ссылка);
	Иначе
		ЭтаФорма.Заголовок	= "Отправка документов в "+ЛокализацияНазваниеПродукта();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПроизвольноеНазваниеИзПолногоНазванияРегламента(ПолноеНазваниеРегламента);
	Возврат Лев(ПолноеНазваниеРегламента, Найти(ПолноеНазваниеРегламента,"[/") - 1);
КонецФункции

// BSLLS:CognitiveComplexity-off

&НаКлиенте
Процедура ЗаполнитьТЗДоступныхРегламентов()
	ПоддерживаемыТипыВыгрузки = Новый Соответствие;
	ТипыОбъектов	= Новый Соответствие;
	
	// Подготовка данных
	Для Каждого СтрДокум Из ЭтаФорма.Объекты Цикл
		ИмяВидаОбъектаДокумента	= СтрДокум.ВидОбъекта;
		ПредставлениеДокумента	= СтрДокум.Представление;
		
		ОбработанТип = ТипыОбъектов[ИмяВидаОбъектаДокумента];
		Если ОбработанТип =Истина Тогда
			Продолжить;
		КонецЕсли;
		ТипыОбъектов.Вставить(ИмяВидаОбъектаДокумента, Истина);

		ИмяОбъектаИС = ПолучитьИмяОбъектаИС(СтрДокум.Объект);
		ЗаполнитьТипВыгружаемыхОбъектов(ИмяОбъектаИС);
		
		СписокРегламентов = ВызовПолученияСпискаРегламентов(ИмяВидаОбъектаДокумента);
		
		// Регламент по умолчанию для каждого типа выгружаемых документов
		СписокТиповДок = Новый Соответствие;
		Для каждого Регл Из СписокРегламентов Цикл
			ТипВыгружаемогоДокумента = get_prop(Регл, "DocType");
			СписокТиповДок.Вставить(ТипВыгружаемогоДокумента, ТипВыгружаемогоДокумента);
		КонецЦикла;
		Если СписокТиповДок.Количество() = 0 Тогда
			СписокТиповДок.Вставить(ИмяВидаОбъектаДокумента, ИмяВидаОбъектаДокумента);
		КонецЕсли;
		
		// Заполнить по каждому документу/объекту
		ОтборДокументов = Новый Структура("ВидОбъекта", ИмяВидаОбъектаДокумента);
		СтрокиОбъектовОдногоТипа = ЭтаФорма.Объекты.НайтиСтроки(ОтборДокументов);
		Для Каждого СтрокаДокументаОбъекта Из СтрокиОбъектовОдногоТипа Цикл
			ДанныеОбОбъекте = Новый Структура;
			ДанныеОбОбъекте.Вставить("ВидОбъекта", СтрокаДокументаОбъекта.ВидОбъекта);
			ДанныеОбОбъекте.Вставить("Представление", СтрокаДокументаОбъекта.Представление);
			ДанныеОбОбъекте.Вставить("СписокТиповДок", СписокТиповДок);
			ДанныеОбОбъекте.Вставить("СписокРегламентов", СписокРегламентов);
			ПоддерживаемыТипыВыгрузки.Вставить(ДанныеОбОбъекте.Представление, ДанныеОбОбъекте);
		КонецЦикла;
	КонецЦикла; // ЭтаФорма.Объекты
		
	// Заполнение таблиц
	Для Каждого СтрокаДанныхОбъекта Из ПоддерживаемыТипыВыгрузки Цикл
		
		мРегламентыОбъекта = Новый Массив();
		
		ИмяВидаОбъектаДокумента	= СтрокаДанныхОбъекта.Значение.ВидОбъекта;
		ПредставлениеДокумента	= СтрокаДанныхОбъекта.Значение.Представление;
		СписокТиповДок			= СтрокаДанныхОбъекта.Значение.СписокТиповДок;
		СписокРегламентов		= СтрокаДанныхОбъекта.Значение.СписокРегламентов;

		// Обход Выгружаемого Типа для каждого документа - СтрокаДанныхОбъекта.ВидОбъекта
		Для Каждого ТипВыгружаемогоДокументаКЗ Из СписокТиповДок Цикл

			// Регламент по умолчанию
			ТипВыгружаемогоДокумента = ТипВыгружаемогоДокументаКЗ.Значение;
			НовыйРегл = РегламентПоТипамДокументов.Добавить();
			НовыйРегл.Регламент = Новый Структура("Значение, Представление, ПроизвольноеНазваниеРегламента",
				"", 
				"По умолчанию",
				Ложь);
			НовыйРегл.ВидОбъекта = ИмяВидаОбъектаДокумента;
			НовыйРегл.ТипОбъекта = ТипВыгружаемогоДокумента;
			НовыйРегл.ПредставлениеОбъекта = ПредставлениеДокумента;
			
			// Регламеты по типу документа		
			Для каждого Регл из СписокРегламентов Цикл
				DocType = get_prop(Регл, "DocType");
				Если DocType <> ТипВыгружаемогоДокумента Тогда
					Продолжить;
				КонецЕсли;	
				
				НовыйРегл = РегламентПоТипамДокументов.Добавить();
				НовыйРегл.Регламент = Новый Структура("Значение, Представление, ПроизвольноеНазваниеРегламента",
				Регл["Name"] + "[/" + ТипОбъектаАПИПоТипуСБИС(DocType, "", "", Неопределено) + "/]",
				Регл["Name"],
				get_prop(get_prop(Регл,"AdditionalData", Новый Соответствие), "DocOtherCustomTitle", Ложь));
				НовыйРегл.ВидОбъекта = ИмяВидаОбъектаДокумента;
				НовыйРегл.ТипОбъекта = ТипВыгружаемогоДокумента;
				НовыйРегл.ПредставлениеОбъекта = ПредставлениеДокумента;
				мРегламентыОбъекта.Добавить(Регл["Name"] + "[/" + ТипОбъектаАПИПоТипуСБИС(DocType, "", "", Неопределено) + "/]");
			КонецЦикла;
			
			//*********************************************
			
			// Получим первый по списку регламент
			ПервыйРегламент = "";
			Если мРегламентыОбъекта.Количество() > 0 Тогда
				ПервыйРегламент = мРегламентыОбъекта[0];
			КонецЕсли;
			
			// Получим Регламент по умолчанию для Объекта
			ВремРегламент = "";
			РегламентПоУмолчанию = ПрочитатьРегламентПоУмолчанию(ИмяВидаОбъектаДокумента,
				ТипВыгружаемогоДокумента,
				ПредставлениеДокумента);
			Если РегламентПоУмолчанию <> Неопределено Тогда
				ВремРегламент = get_prop(РегламентПоУмолчанию, "Регламент", ПервыйРегламент);
			КонецЕсли;
			
			// Установить значение в таблице выбраных Регламентов
			Отбор = Новый Структура("ПредставлениеОбъекта, ТипОбъекта", ПредставлениеДокумента, ТипВыгружаемогоДокумента);
			СписокРегламентовТекущегоТипаДокумента = РегламентТекущегоТипаДокумента.НайтиСтроки(Отбор);
			Если СписокРегламентовТекущегоТипаДокумента.Количество() = 0 Тогда
				РедактируемаСтрока = РегламентТекущегоТипаДокумента.Добавить();
			Иначе
				РедактируемаСтрока = СписокРегламентовТекущегоТипаДокумента.Получить(0);
			КонецЕсли ;
			РедактируемаСтрока.ВидОбъекта	= ИмяВидаОбъектаДокумента;
			РедактируемаСтрока.ТипОбъекта	= ТипВыгружаемогоДокумента;
			РедактируемаСтрока.ПредставлениеОбъекта = ПредставлениеДокумента;
			РедактируемаСтрока.Регламент	= ВремРегламент;
			РедактируемаСтрока.ПроизвольноеНазваниеРегламента	= get_prop(
				РегламентПоУмолчанию,
				"ПроизвольноеНазвание", 
				ПолучитьПроизвольноеНазваниеИзПолногоНазванияРегламента(ВремРегламент));
		КонецЦикла; // СписокДоступныхРегламентов
		
	КонецЦикла; // Объекты
	
КонецПроцедуры	
// BSLLS:CognitiveComplexity-on

&НаСервере
Функция ПолучитьИмяОбъектаИС(Знач СсылкаОбъекта)
	Возврат ТипОбъектаМетаданных(СсылкаОбъекта) + "." + СсылкаОбъекта.Метаданные().Имя;	
КонецФункции	

&НаСервере
Процедура ПослеВыполненияЗадания(Результат, ДопПараметры) Экспорт
	Сообщить("ПослеВыполненияЗадания");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВСБИС_ПослеАутентификации(Результат, Параметры) Экспорт 
	Если Результат <> Неопределено Тогда
		ЗагрузитьВСБИС( Параметры.Команда );
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСтруктуруПечатныхФормДляПередачиНаСервере()
	МодульОбработки = МодульОбъекта();
	Возврат МодульОбработки.ЗаполнитьСтруктуруПечатныхФормДляПередачи(ВложенияПоТипамОбъектов1С);
КонецФункции

#Область ЗагрузитьВСБИС

&НаСервере
Процедура ДобавитьВФильтрДанныеПоТипу()
	ВыбранныеПечатныеФормы = ЗаполнитьСтруктуруПечатныхФормДляПередачиНаСервере();
	ВидОбъектаТипОбъекта = КопияТаблицыФормы(Объекты);		
    ВидОбъектаТипОбъекта.Свернуть("ВидОбъекта,ТипОбъекта,ИмяИни");
	Фильтр.Selection.Вставить("DefaultValueForType", Новый Структура);
	Для Каждого Запись Из ВидОбъектаТипОбъекта Цикл 
		Отбор = Новый Структура("ВидОбъекта,ТипОбъекта", Запись.ВидОбъекта, Запись.ТипОбъекта);
		ТекущиеРегламенты = РегламентТекущегоТипаДокумента.НайтиСтроки(Отбор);
		НазваниеРегламента = "";
		ПроизвольноеНазваниеРегламента = "";
		Если ТекущиеРегламенты.Количество() > 0 Тогда
			ТекущийРегламент = ТекущиеРегламенты.Получить(0); 
			НазваниеРегламента = ПолучитьПроизвольноеНазваниеИзПолногоНазванияРегламента(ТекущийРегламент.Регламент);
			ПроизвольноеНазваниеРегламента = ТекущийРегламент.ПроизвольноеНазваниеРегламента;
		КонецЕсли;
		РегламентПоТипу = Новый Структура;
		РегламентПоТипу.Вставить("НазваниеРегламента", НазваниеРегламента);
		РегламентПоТипу.Вставить("ПроизвольноеНазваниеРегламента", ПроизвольноеНазваниеРегламента);
		Вложения = Неопределено;
		ВыбранныеПечатныеФормы.Свойство(Запись.ВидОбъекта, Вложения);
		СтруктураПоВидуОбъекта = Новый Структура;
		СтруктураПоВидуОбъекта.Вставить("Algorithm", Запись.ИмяИни);
		СтруктураПоВидуОбъекта.Вставить("Regulation", РегламентПоТипу);
		Если Вложения <> Неопределено Тогда
			СтруктураПоВидуОбъекта.Вставить("Attachments", Вложения);	
		КонецЕсли;
		Фильтр.Selection.DefaultValueForType.Вставить(Запись.ВидОбъекта, СтруктураПоВидуОбъекта);	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВСБИС(Команда)

	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементЗагрузитьВСБИС = ЭлементыФормочки.Найти("ЗагрузитьВСБИС");
	Если ЭлементЗагрузитьВСБИС <> Неопределено Тогда
		ЭлементЗагрузитьВСБИС.Доступность = Ложь;
	КонецЕсли;

	мИсполнители = Новый Массив;
	Если ПростойЗапросПодписи Тогда
		Для Каждого Исполнитель Из СписокИсполнителей Цикл
			Если НЕ ЗначениеЗаполнено(Исполнитель.Сотрудник) Тогда
				Продолжить;
			КонецЕсли;
			_Исполнитель = Новый Структура;
			_Исполнитель.Вставить("Роль", ?(ЗначениеЗаполнено(Исполнитель.Роль), Исполнитель.Роль, "Сотрудник"));
			_Исполнитель.Вставить("ТабельныйНомер", Исполнитель.ТабельныйНомер);
			_Исполнитель.Вставить("ЭлПочта", Исполнитель.ЭлПочта);
			_Исполнитель.Вставить("МобильныйТелефон", Исполнитель.МобильныйТелефон);
			мИсполнители.Добавить(_Исполнитель);
		КонецЦикла;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Фильтр) Тогда
		ОбрабатываемыеОбъекты = ПолучитьОбрабатываемыеОбъекты();
	Иначе
		ДобавитьВФильтрДанныеПоТипу();
		ОбрабатываемыеОбъекты = Неопределено;
	КонецЕсли;

	EndpointArgs = Новый Структура;
	EndpointArgs.Вставить("list_doc_ref",       ОбрабатываемыеОбъекты);
	EndpointArgs.Вставить("Исполнители",          мИсполнители);
	EndpointArgs.Вставить("ПростойЗапросПодписи", ПростойЗапросПодписи);
	EndpointArgs.Вставить("КаналИнформации",      ?(ЗначениеЗаполнено(КаналИнформации), КаналИнформации, 0));
	EndpointArgs.Вставить("МаршрутОзнакомления",  ?(ЗначениеЗаполнено(МаршрутОзнакомления), МаршрутОзнакомления, 0));
	EndpointArgs.Вставить("ПерезапуститьДО",  	ПерезапуститьДО);
	EndpointArgs.Вставить("Filter", Фильтр);
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("EndpointArgs",       EndpointArgs);

	Контекст = Новый Структура;
	Контекст.Вставить("ПараметрыВызова", ПараметрыВызова);
	Контекст.Вставить("context_params", context_param);
	Контекст.Вставить("algorithm", "Документы_send");
	Контекст.Вставить("НазваниеОперации", "Загрузка в " + ЛокализацияНазваниеПродукта());
	ОбработчикРезультата = SabyОписаниеОповещения("ЗагрузитьВСБИСПослеОбновленияКэшаЛокальныхСертификатов", ЭтаФорма, Контекст);

	ОбновитьКэшЛокальныхСертификатов(ОбработчикРезультата);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьОбрабатываемыеОбъекты()
	ОбрабатываемыеОбъекты = Новый Массив;
	ВыбранныеПечатныеФормы = ЗаполнитьСтруктуруПечатныхФормДляПередачиНаСервере();

	ТипМетаданных = ТипОбъектаМетаданных(Объекты[0].Объект);
	Для Каждого ВыгружаемыйДокумент Из Объекты Цикл

		Отбор = Новый Структура("ПредставлениеОбъекта, ТипОбъекта", ВыгружаемыйДокумент.Представление, ВыгружаемыйДокумент.ТипОбъекта);
    	СписокРегламентов = РегламентТекущегоТипаДокумента.НайтиСтроки(Отбор);
		ПроизвольноеНазваниеРегламента = "";
		Для каждого Регл из СписокРегламентов Цикл
		 	ПолноеНазваниеРегламента = Регл.Регламент;
			ПроизвольноеНазваниеРегламента = Регл.ПроизвольноеНазваниеРегламента;
		КонецЦикла;
		НазваниеРегламента = ПолучитьПроизвольноеНазваниеИзПолногоНазванияРегламента(ПолноеНазваниеРегламента);

		API3_ref = Новый Структура;
		API3_ref.Вставить("ИдИС",			СокрЛП(ВыгружаемыйДокумент.Объект.УникальныйИдентификатор()));
		API3_ref.Вставить("ТипИС",			ТипМетаданных);
		API3_ref.Вставить("ИмяИС",			ВыгружаемыйДокумент.ВидОбъекта);
		API3_ref.Вставить("ini_name",		ВыгружаемыйДокумент.ИмяИни);
		API3_ref.Вставить("Название",		СокрЛП(ВыгружаемыйДокумент.Объект));
		API3_ref.Вставить("Регламент",		?(ЗначениеЗаполнено(НазваниеРегламента), НазваниеРегламента, Неопределено));
		API3_ref.Вставить("ПроизвольноеНазваниеРегламента",	ПроизвольноеНазваниеРегламента);
		API3_ref.Вставить("_print_forms",	?(ВыбранныеПечатныеФормы.Свойство(ВыгружаемыйДокумент.ВидОбъекта),
			ВыбранныеПечатныеФормы[ВыгружаемыйДокумент.ВидОбъекта], Неопределено));
		ОбрабатываемыеОбъекты.Добавить(API3_ref);
	КонецЦикла;

	Возврат ОбрабатываемыеОбъекты;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьВСБИССразу() Экспорт
    ЗагрузитьВСБИС(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВСБИСПослеОбновленияКэшаЛокальныхСертификатов(РезультатОбновленияКеша, Контекст) Экспорт 
	Если BlocklyExecutor = Неопределено Тогда
		BlocklyExecutor = ПолучитьФормуBlockly();	
	КонецЕсли;	
	BlocklyExecutor.ЗапуститьINI(Контекст);  
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьКоментарииДокументовКОтправке()

	//ТД_ПФ = Элементы.ТаблицаВложений.ТекущиеДанные;
	//МДокументов = ДокументыКОтправке.НайтиСтроки( Новый СТруктура("ВидОбъекта"), ТД_ПФ.ВидОбъекта );
	//Если МДокументов.Количество() > 0 Тогда
	//	ТипПервогоДокумента = МДокументов.Документ.Метаданные().Имя;
	//Иначе
	//	//Э... так быть не должОн.
	//	Возврат;
	//КонецЕсли;
	//СписокПФСтрокой	= "";
	//мВыбрПечатныхФорм = ТаблицаВложений.НайтиСтроки( Новый Структура("ОтметкаВыбора", Истина) );
	//Для Каждого ПФорма из мВыбрПечатныхФорм Цикл
	//	СписокПФСтрокой	= СписокПФСтрокой + ПФорма.Представление + ",";
	//КонецЦикла;
	//Для Каждого УказательДок Из ДокументыКОтправке Цикл
	//	Если ТипПервогоДокумента <> УказательДок.Документ.Метаданные().Имя Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	УказательДок.Комментарий	= СписокПФСтрокой;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФильтрПФПоТипуДокумента(ВидОбъекта = Неопределено)
	ВложенияТекущегоТипаОбъекта1С.Очистить();
	Отбор = Новый Структура("ВидОбъекта", ВидОбъекта);
    СтрокиПФ = ВложенияПоТипамОбъектов1С.НайтиСтроки(Отбор);
	Для Каждого СтрокаДокПФ Из СтрокиПФ Цикл
		ЗаполнитьЗначенияСвойств(ВложенияТекущегоТипаОбъекта1С.Добавить(), СтрокаДокПФ);
	КонецЦикла;
	УстановитьВидимостьПодсказкиПФ(СтрокиПФ.Количество() > 0);
КонецПроцедуры

&НаКлиенте
Функция ТипВыгружаемогоОбъектаПоВидуОбъекта(ВидОбъекта)
	ПервыйТипОбъекта = ПервыйТипВыгружаемогоОбъекта(ВидОбъекта);
	ТипОбъектаБЛ = ПрочитатьТипОбъектаПоУмолчанию(ВидОбъекта, get_prop(ПервыйТипОбъекта, "ИмяИни", ""));
	Возврат ТипОбъектаБЛ;
КонецФункции

&НаКлиенте
Процедура УстановитьТипВыгружаемогоОбъектаВсемОбъектам()
	ОбработанныйВид = Новый Соответствие;
	Для Каждого СтрокаОбъекта Из ЭтаФорма.Объекты Цикл
		Если ОбработанныйВид[СтрокаОбъекта.ВидОбъекта] = Истина Тогда
			// Этот тип уже обработали
			Продолжить;
		КонецЕсли;
		ОбработанныйВид[СтрокаОбъекта.ВидОбъекта] = Истина;
		
		// Получим тип выгружаемого объек4та и установим его на все объеккты Вида
		ПервыйТипОбъекта = ПервыйТипВыгружаемогоОбъекта(СтрокаОбъекта.ВидОбъекта);  
		_ИмяИниНовый = get_prop(ПервыйТипОбъекта, "ИмяИни", "");
		_ИмяИни = ПрочитатьТипОбъектаПоУмолчанию(СтрокаОбъекта.ВидОбъекта, _ИмяИниНовый);
		_ИмяИни = КорректноеЗначениеИмениИни(_ИмяИни, ПервыйТипОбъекта);
		ТипОбъектаБЛ = ТипОбъектаПоИмениИни(_ИмяИни);
		мВидовОбъектов = ЭтаФорма.Объекты.НайтиСтроки(Новый Структура("ВидОбъекта", СтрокаОбъекта.ВидОбъекта));
		Для Каждого мВидовОбъектов Из мВидовОбъектов Цикл
			мВидовОбъектов.ИмяИни = _ИмяИни;
			мВидовОбъектов.ТипОбъекта = ТипОбъектаБЛ;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКОтправкеПриАктивизацииСтроки(Элемент)
	Если НЕ ФормаОткрыта Тогда
		Возврат;
	КонецЕсли;
	ЭтаФорма.ТипОбъекта = "";
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ТД = ЭлементыФормочки.Объекты.ТекущиеДанные;
	ВложенияТекущегоТипаОбъекта1С.Очистить();
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьВыборПФДляВидаДокумента(ТД.ВидОбъекта);
	УстановитьФильтрПФПоТипуДокумента(ТД.ВидОбъекта);

	ЗаполнитьСписокВыбораТиповВыгружаемогоОбъекта(ТД.ВидОбъекта);
	ПервыйТипОбъекта = ПервыйТипВыгружаемогоОбъекта(ТД.ВидОбъекта);  
	_ИмяИни = КорректноеЗначениеИмениИни(ТипВыгружаемогоОбъектаПоВидуОбъекта(ТД.ВидОбъекта), ПервыйТипОбъекта);
	ЭтаФорма.ТипОбъекта = _ИмяИни;
	ЗаполнитьСписокРегламентовВыбранногоВидаОбъекта(ТД, ЭтаФорма.ТипОбъекта);
	ТипОбъектаПоИмени = ТипОбъектаПоИмениИни(ЭтаФорма.ТипОбъекта);
	ЭтаФорма.Регламент = РанееВыбранныйРегламент(ТД, ТипОбъектаПоИмени);
	УстановитьПроизвольноеНазваниеРегламента(ТД.ВидОбъекта, ТипОбъектаПоИмени, ЭтаФорма.Регламент);
	УстановитьВидимостьПроизвольногоНазванияРегламента(ЭтаФорма.Регламент, ТД.ВидОбъекта, ТипОбъектаПоИмени);
	
	//После выбора регламента для тек объекта
	УстановитьВидимостьКомандВложения(ТД.Объект, Регламент, ТипОбъекта);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОтветНаВопросОбУдаленииВыгружаемыхОбъектов(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Объекты.Количество() = Параметры.Количество() Тогда
			//Удалены все объекты, имеет смысл сразу же закрыть форму
			Закрыть();
		Иначе
			Если Параметры.Количество() > 0 Тогда
				УдалитьСтрокуВыбранногоОбъекта(Параметры);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокИсполнителейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	 Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОбъектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ИдентификаторыСтрок = Новый Массив;
	Для Каждого ИдСтроки Из Элемент.ВыделенныеСтроки Цикл
		ИдентификаторыСтрок.Добавить(ИдСтроки);
	КонецЦикла;
	Оповещение = SabyОписаниеОповещения("ПроверитьОтветНаВопросОбУдаленииВыгружаемыхОбъектов", ЭтаФорма, ИдентификаторыСтрок);
	SabyПоказатьВопрос(
		Оповещение,
		"Удалить выбранные объекты из списка отправляемых?",
		РежимДиалогаВопрос.ДаНет,
		0,
		КодВозвратаДиалога.Нет,
		"Удаление объектов из списка.");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВложение(Команда)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ДанныеСтроки = ЭлементыФормочки.ВложенияТипаДокумента.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено ИЛИ ДанныеСтроки.ТипВложения = "ПечатнаяФорма" Тогда
		Возврат;
	КонецЕсли;
	//Удаление из общей таблицы
	УдалитьВложениеИзТаблицы("ВложенияПоТипамОбъектов1С", ДанныеСтроки);
	//Удаление из таблицы на форме
	УдалитьВложениеИзТаблицы("ВложенияТекущегоТипаОбъекта1С", ДанныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОВыбранномРегламенте(ТекущиеДанныеОбъекты, ИмяИни,
	ВыбРегламент, НазваниеРегламентаПользоваателя)
	
	ТипОбъектаПоИмени = ТипОбъектаПоИмениИни(ИмяИни);
	Отбор = Новый Структура("ВидОбъекта,ТипОбъекта", ТекущиеДанныеОбъекты.ВидОбъекта, ТипОбъектаПоИмени);
	СписокРегламентов = РегламентТекущегоТипаДокумента.НайтиСтроки(Отбор);
	Для каждого Регл из СписокРегламентов Цикл
	 	Регл.Регламент	= ВыбРегламент;
	 	Регл.ПроизвольноеНазваниеРегламента	= НазваниеРегламентаПользоваателя;
		// Сменим регламент всем объектам одного типа
	КонецЦикла;	
	
	ЗаписатьРегламентыПоУмолчанию(
		ТекущиеДанныеОбъекты.ВидОбъекта,
		ТипОбъектаПоИмени,
		ВыбРегламент,
		НазваниеРегламентаПользоваателя,
		ТекущиеДанныеОбъекты.Представление);
КонецПроцедуры

&НаКлиенте
Процедура РегламентПриИзменении(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ТД = ЭлементыФормочки.Объекты.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбновитьДанныеОВыбранномРегламенте(ТД, ЭтаФорма.ТипОбъекта, ЭтаФорма.Регламент, ЭтаФорма.ПроизвольноеНазваниеРегламента);
	ТипОбъектаПоИмени = ТипОбъектаПоИмениИни(ЭтаФорма.ТипОбъекта);
	УстановитьПроизвольноеНазваниеРегламента(ТД.ВидОбъекта, ТипОбъектаПоИмени, ЭтаФорма.Регламент);
	УстановитьВидимостьПроизвольногоНазванияРегламента(Регламент, ТД.ВидОбъекта, ЭтаФорма.ТипОбъекта);
	УстановитьВидимостьКомандВложения(ТД.Объект, Регламент, ТипОбъекта);
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольноеНазваниеРегламентаПриИзменении(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ТД = ЭлементыФормочки.Объекты.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДанныеОВыбранномРегламенте(
		ТД,
		ЭтаФорма.ТипОбъекта, 
		ЭтаФорма.Регламент, 
		ЭтаФорма.ПроизвольноеНазваниеРегламента);
КонецПроцедуры

#Область include_core_base_ЭДО_ВыборФайлаЗавершение_МетодыФормыЗагрузкаДокумента
#КонецОбласти

#Область include_core_base_ЭДО_ВыборФайлаЗавершение_ОбщийМетод
#КонецОбласти

&НаСервере
Функция ПолучитьИмяПрисоединенногоФайла(Знач СсылкаНаПрисоединенныйФайл) Экспорт
	Возврат СсылкаНаПрисоединенныйФайл.Наименование;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораВложения(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		ЭлементыФормочки = ПолучитьЭлементыФормы();
		Для Каждого СсылкаНаПрисоединенныйФайл Из ВыбранныеФайлы Цикл
			ВидОбъекта				= ЭлементыФормочки.Объекты.ТекущиеДанные.ВидОбъекта;
			
			НоваяПФ					= ВложенияПоТипамОбъектов1С.Добавить();
			НоваяПФ.ОтметкаВыбора	= Истина;
			НоваяПФ.Представление	= ПолучитьИмяПрисоединенногоФайла(СсылкаНаПрисоединенныйФайл);
			НоваяПФ.ТипВложения     = "ПрисоединенныйФайл";
			НоваяПФ.ИндексКартинки	= 0;
			НоваяПФ.ВидОбъекта		= ВидОбъекта;
			НоваяПФ.Команда			= Новый Структура("Ссылка",СсылкаНаПрисоединенныйФайл);
			УстановитьФильтрПФПоТипуДокумента(ВидОбъекта);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложениеИзПрикреплёныхФайлов(Команда)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ТД = ЭлементыФормочки.Объекты.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВладелецФайла = ТД.Объект;
	ДобавитьВложениеИзПрикреплёныхФайловВладельца(ВладелецФайла);
КонецПроцедуры

#Область include_core_base_ЭДО_РаботаСТаблицейВложений
#КонецОбласти

&НаКлиенте
Процедура ПростойЗапросПодписиПриИзменении(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ЭлементыФормочки.Найти("НадписьКаналИнформации") <> Неопределено Тогда
		ЭлементыФормочки.НадписьКаналИнформации.Видимость = ПростойЗапросПодписи;
	КонецЕсли;
	Если ЭлементыФормочки.Найти("НадписьМаршрутОзнакомления") <> Неопределено Тогда
		ЭлементыФормочки.НадписьМаршрутОзнакомления.Видимость = ПростойЗапросПодписи;
	КонецЕсли;
	ЭлементыФормочки.ДобавитьСотрудника.Видимость = ПростойЗапросПодписи;
	ЭлементыФормочки.СписокИсполнителей.Видимость = ПростойЗапросПодписи;
	ЭлементыФормочки.КаналИнформации.Видимость = ПростойЗапросПодписи;
	ЭлементыФормочки.МаршрутОзнакомления.Видимость = ПростойЗапросПодписи;
	Если ПростойЗапросПодписи Тогда
		СписокИсполнителей.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиСотрудника(ИмяСотрудника)
	Попытка
		Возврат Справочники["Сотрудники"].НайтиПоНаименованию(ИмяСотрудника);
	Исключение
		Попытка
			Возврат Справочники["СотрудникиОрганизаций"].НайтиПоНаименованию(ИмяСотрудника);	
		Исключение	
			Возврат Неопределено;
		КонецПопытки	
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция ЭтотОбъектНаКлиенте() 
    Возврат ЭтаФорма;
КонецФункции

#Область include_core_base_ЗапускМодуля_ПроверкаВерсии_НаФорме
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_ЭДО_РаботаСТаблицейИсполнителей
#КонецОбласти


#Область include_core_base_Криптография_НаКлиенте1С_МодульФормы
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСерверСКлиента
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти

#Область include_core_base_ЭДО_Form_ЗагрузкаДокументов_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_ЭДО_Form_ЗагрузкаДокументов_ОсобенностиПродукта
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьТипВыгружаемыхОбъектов(ИмяОбъектаИС)
	ВидОбъекта = ИмяОбъектаИС;
    МассивТиповОбъектовАПИ = Saby_СтрРазделить82(ИмяОбъектаИС,".");
	Если МассивТиповОбъектовАПИ.Количество() > 1 Тогда
		ВидОбъекта = МассивТиповОбъектовАПИ[1];
	КонецЕсли;	
	ОтборСтруктура = Новый Структура("ВидОбъекта", ВидОбъекта);
	СтрокиТаблицыОбъектов = ТипыВыгружаемыхОбъектов.НайтиСтроки(ОтборСтруктура);
	Если СтрокиТаблицыОбъектов.Количество() > 0 Тогда
		// Уже заполнили, уходим
		Возврат;
	КонецЕсли;
	ТипыОбъекта	= ПолучитьИзОбъекта1СОбъектСБИС(ИмяОбъектаИС);
	Для Каждого ТипВыгружаемгоОбъекта Из ТипыОбъекта Цикл
		НоваяЗапись = ТипыВыгружаемыхОбъектов.Добавить();
		НоваяЗапись.ВидОбъекта = ВидОбъекта;
		НоваяЗапись.ТипыОбъекта = ТипВыгружаемгоОбъекта["SbisType"];
		НоваяЗапись.ФайлНастроек = ТипВыгружаемгоОбъекта["Ini"];
		НоваяЗапись.КрасивоеНазвание = ТипВыгружаемгоОбъекта["Title"];
		НоваяЗапись.ИмяОбъектаИС = ИмяОбъектаИС;
		НоваяЗапись.ИмяИни	= ТипВыгружаемгоОбъекта["Ini"];
		НоваяЗапись.ТипАпи3Объекта = ТипВыгружаемгоОбъекта["Api3Type"];
	КонецЦикла;
КонецПроцедуры

#Область include_core_base_Helpers_ПолучитьРегламенты
#КонецОбласти

#Область include_core_base_Helpers_ПреобразованиеТиповСБИСАПИ3 //&НаКлиенте
#КонецОбласти

&НаКлиенте
Процедура ТаблицаВложенийОтметкаПриИзменении(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	//ТД = ЭлементыФормочки.ВложенияТипаДокумента.ТекущиеДанные;
	//ОтобразитьПФ( ?(ТД.ОтметкаВыбора, ТД.ПФ, "") );
	//ЗаполнитьКоментарииДокументовКОтправке();
	Если Объекты.Количество() = 1 Тогда
		ЗаписатьВыборПФДляВидаДокумента(Объекты[0].ВидОбъекта);
	Иначе
		ЗаписатьВыборПФДляВидаДокумента(ЭлементыФормочки.Объекты.ТекущиеДанные.ВидОбъекта);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъекты(мДокументы)
	Для Каждого ОтпДокумент Из мДокументы Цикл
		нСтрока 				= Объекты.Добавить();
		Если ТипЗнч(ОтпДокумент) = Тип("Структура") Тогда
			СсылкаНаОбъект = get_prop(ОтпДокумент, "ОбъектИС", get_prop(ОтпДокумент, "Ссылка"));
		Иначе
			СсылкаНаОбъект = ОтпДокумент.Ссылка
		КонецЕсли;
		Если СсылкаНаОбъект = Неопределено Тогда
			ВызватьИсключение "Не удалось определить объект 1С для загрузки";
		КонецЕсли;
		нСтрока.Объект			= СсылкаНаОбъект.Ссылка;
		нСтрока.Представление	= СсылкаНаОбъект.Ссылка;
		нСтрока.СтатусОшибки	= 0;
		нСтрока.ВидОбъекта		= СсылкаНаОбъект.Метаданные().Имя;
		нСтрока.ТипОбъекта 		= нСтрока.ВидОбъекта;
	КонецЦикла;	

КонецПроцедуры

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_СтатусыДокументов_ПоказатьТекстСообщения
#КонецОбласти

#Область include_base_CommonModule_ИменаМодулейКлиент
#КонецОбласти

#Область include_core_base_Helpers_КартинкиУспешноОшибка
#КонецОбласти

#Область include_core_base_Helpers_РаботаСМетаданными //&НаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Транспорт_LocalHelper_ВидТранспортаExtSdk //&НаКлиенте
#КонецОбласти

#Область include_core_base_Транспорт_ВидТранспорта //&НаКлиенте
#КонецОбласти

#Область include_core_base_Транспорт_ИмяСвойстваТранспорта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти
