
#Область ТаблицаПечатныхФормИФормированиеПредпросмотра

&НаСервере
Функция СформироватьПФНаСервере(Знач КомандаПечати, Знач ВыбранныйДокумент)

	ПараметрыПечати = Новый Структура("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	ОбъектыПечати = Новый Массив;
	ОбъектыПечати.Добавить(ВыбранныйДокумент);

	ВзТабличныйДокумент = "";
	// Формирование табличных документов.
	Если Найти(КомандаПечати.Менеджерпечати, "ДополнительныеОтчетыИОбработки") > 0 Тогда
		ВзТабличныйДокумент = СформироватьПФНаСервереМенеджерПечатиДополнительныеОтчетыИОбработки(
									КомандаПечати, ОбъектыПечати);
	Иначе
		Попытка
			МодульОбъекта = МодульОбъекта();	
			ОбщийМодульУправлениеПечатью = МодульОбъекта.ОбщийМодульЗначение("УправлениеПечатью");
			ПечатныеФормы = ОбщийМодульУправлениеПечатью.СформироватьПечатныеФормы(КомандаПечати.МенеджерПечати,
				КомандаПечати.Идентификатор, ОбъектыПечати, ПараметрыПечати);
		Исключение
			ПечатныеФормы = Неопределено;
		КонецПопытки;

		Если ТипЗнч(ПечатныеФормы) = Тип("Структура") И ПечатныеФормы.Свойство("КоллекцияПечатныхФорм") Тогда
			Для Каждого ПФ Из ПечатныеФормы.КоллекцияПечатныхФорм Цикл
				ВзТабличныйДокумент = ПоместитьВоВременноеХранилище(ПФ.ТабличныйДокумент, Новый УникальныйИдентификатор);
				Прервать;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Возврат ВзТабличныйДокумент;

КонецФункции

&НаСервере
Функция СформироватьПФНаСервереМенеджерПечатиДополнительныеОтчетыИОбработки(КомандаПечати, ОбъектыНазначения)
	ВзТабличныйДокумент = "";

	СсылкаНаПечатнуюФорму	= КомандаПечати.ДополнительныеПараметры.Ссылка;
	Если СсылкаНаПечатнуюФорму.Пустая() Тогда
		ВызватьИсключение("Отсутствует внешняя печатная форма.");
	КонецЕсли;
	ПараметрыВызова	= Новый Структура("ИдентификаторКоманды, ОбъектыНазначения",
								КомандаПечати.Идентификатор, ОбъектыНазначения);
	ПечатныеФормы	= Неопределено;
	ОбъектыПечати	= Новый СписокЗначений;
	ПараметрыВывода	= Неопределено;
	Попытка
		МодульОбъекта = МодульОбъекта();	
		ОбщийМодульУправлениеПечатью = МодульОбъекта.ОбщийМодульЗначение("УправлениеПечатью");
		ОбщийМодульУправлениеПечатью.ПечатьПоВнешнемуИсточнику(
			СсылкаНаПечатнуюФорму,
			ПараметрыВызова,
			ПечатныеФормы,
			ОбъектыПечати,
			ПараметрыВывода);
	Исключение
		ПечатныеФормы = Новый Массив;
	КонецПопытки;
	Для Каждого ПФ Из ПечатныеФормы Цикл
		ВзТабличныйДокумент = ПоместитьВоВременноеХранилище(ПФ.ТабличныйДокумент, Новый УникальныйИдентификатор);
		Прервать;
	КонецЦикла;

	Возврат ВзТабличныйДокумент;
КонецФункции

&НаСервере
Процедура ОтобразитьПФ(Знач АдресТД)
	ТабДокПредпросмотр = ЭтаФорма["Предпросмотр"];
	ТабДокПредпросмотр.Очистить();
	Если НЕ ПустаяСтрока(АдресТД) Тогда
		// BSLLS:MissingTempStorageDeletion-off
		ВрТабличныйДок = ПолучитьИзВременногоХранилища(АдресТД);
		// BSLLS:MissingTempStorageDeletion-on
		Если ТипЗнч(ВрТабличныйДок) = Тип("ТабличныйДокумент") Тогда
			ТабДокПредпросмотр.Вывести(ВрТабличныйДок);
			// Удаляем подсказку только когда есть печатная форма
			ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
			ПолеТабДок = ЭлементыФормочки.Предпросмотр; 
			ОтображениеСостояния = ПолеТабДок.ОтображениеСостояния;
			ОтображениеСостояния.Видимость	= Ложь;
			ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
			ОтображениеСостояния.Картинка                       = Новый Картинка;
			ОтображениеСостояния.Текст                          = "";
		КонецЕсли;
		УдалитьИзВременногоХранилища(АдресТД);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПФ()
	// А нужно ли это условие???
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ТД = ЭлементыФормочки.ВложенияТипаДокумента.ТекущиеДанные;
	Если Объекты.Количество() = 1 Тогда
		ТД.АдресПревьюВХранилище = СформироватьПФНаСервере(ТД.Команда, Объекты[0].Объект);
	Иначе
		ТД.АдресПревьюВХранилище = СформироватьПФНаСервере(ТД.Команда,
										ЭлементыФормочки.Объекты.ТекущиеДанные.Объект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВложенияТипаДокументаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВложенияТипаДокументаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВложенийПриАктивизацииСтроки(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ТД = ЭлементыФормочки.ВложенияТипаДокумента.ТекущиеДанные;
	Если ТД = Неопределено ИЛИ ТД.ТипВложения <> "ПечатнаяФорма" Тогда
		Возврат;
	КонецЕсли;
	ОтобразитьПФ(ТД.АдресПревьюВХранилище);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВложенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ТД = ЭлементыФормочки.ВложенияТипаДокумента.ТекущиеДанные;
	Если ТД = Неопределено ИЛИ ТД.ТипВложения <> "ПечатнаяФорма"  Тогда
		Возврат;
	КонецЕсли;
	СформироватьПФ();
	ОтобразитьПФ(ТД.АдресПревьюВХранилище);
КонецПроцедуры

#КонецОбласти


#Область include_core_base_ExtException
#КонецОбласти

#Область include_core_base_Криптография_НаКлиенте1С
#КонецОбласти

#Область include_core_base_Криптография_НаКлиенте1С_СинхронныеМетодыНаКлиенте //&НаКлиенте
#КонецОбласти

#Область include_core_base_Криптография_МенеджерКриптографииБазовый //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

&НаСервере
Процедура УдалитьСтрокуВыбранногоОбъекта(ИдентификаторыСтрок)
	Для Каждого ИдентификаторСтроки Из ИдентификаторыСтрок Цикл
		СтрокаТЧ = Объекты.НайтиПоИдентификатору(ИдентификаторСтроки);
		Объекты.Удалить(СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ТаблицаМетаданныхПоТаблицеДокументов()
	Если ТипЗнч(Объекты) = Тип("ДанныеФормыКоллекция") Тогда
		ВремТаблМД = Объекты.Выгрузить(, "Объект");
	ИначеЕсли ТипЗнч(Объекты) = Тип("ТаблицаЗначений") Тогда
		ВремТаблМД = Объекты.Скопировать(, "Объект");
	Иначе
		ВремТаблМД = Объекты;
	КонецЕсли;
	ВремТаблМД.Колонки.Добавить("ОбъектМД");
	Для Каждого СтрДокум Из ВремТаблМД Цикл
		СтрДокум.ОбъектМД = СтрДокум.Объект.Метаданные();
	КонецЦикла;
	ВремТаблМД.Свернуть("ОбъектМД");
	Возврат ВремТаблМД;
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокПФПоТблДокументов()
	ВремТаблМД = ТаблицаМетаданныхПоТаблицеДокументов();
	Для Каждого СтрДокум Из ВремТаблМД Цикл
		Попытка
			МодульОбъекта = МодульОбъекта();	
			ОбщийМодульУправлениеПечатью = МодульОбъекта.ОбщийМодульЗначение("УправлениеПечатью");
			КомандыПечатиФормыВр = ОбщийМодульУправлениеПечатью.КомандыПечатиОбъекта(СтрДокум.ОбъектМД);
		Исключение
			//У объекта в менеджере объекта отсутствует процедура - ДобавитьКомандыПечати
			Продолжить;
		КонецПопытки;

		ДобавленныеПФ = Новый Соответствие();
		//Общие ПФ формы
		ИспКомандыПФ = КомандыПечатиФормыВр.НайтиСтроки(
			Новый Структура("Отключена, СкрытаФункциональнымиОпциями", Ложь, Ложь));
		Для Каждого КомандаПечати Из ИспКомандыПФ Цикл
			//Отключим дублирование ПФ, используются при включении ФО - "Работа в россии"
			Если Найти(КомандаПечати.Обработчик, "КадровыйЭДОКлиент") > 0 Тогда 
				Продолжить; 
			КонецЕсли;
			Если Найти(КомандаПечати.Обработчик, "ЭДОБЗККлиент") > 0 Тогда 
				Продолжить; 
			КонецЕсли;
			Если НЕ (ПустаяСтрока(КомандаПечати.СписокФорм)
				ИЛИ Найти(КомандаПечати.СписокФорм,"ФормаДокумента") > 0
				ИЛИ Найти(КомандаПечати.СписокФорм,"ФормаЭлемента") > 0
				ИЛИ Найти(КомандаПечати.СписокФорм,"ФормаСписка") > 0) Тогда
				Продолжить;
			КонецЕсли;
			ДобавленныеПФ.Вставить(КомандаПечати.Представление, Истина);

			КомандаП = Новый Структура("Обработчик, ДополнительныеПараметры, МенеджерПечати,
				|Идентификатор, Представление, ПроверкаПроведенияПередПечатью,
				|ПроверкаПроведенияПередПечатью, ФункциональныеОпции");

			ЗаполнитьЗначенияСвойств(КомандаП, КомандаПечати);
			НоваяПФ = ВложенияПоТипамОбъектов1С.Добавить();
			НоваяПФ.Представление = КомандаПечати.Представление;
			НоваяПФ.ТипВложения = "ПечатнаяФорма";
			НоваяПФ.ИндексКартинки = 0;
			НоваяПФ.ВидОбъекта = СтрДокум.ОбъектМД.Имя;
			НоваяПФ.Команда = КомандаП;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#Область include_core_base_ЭДО_РаботаСТаблицейВложенийОсобенностиПриложения
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключения //&НаКлиенте
#КонецОбласти

#Область include_core_base_Helpers_ОбщиеНастройки
#КонецОбласти

#Область include_base_НазваниеПродукта
#КонецОбласти

#Область include_core_base_Транспорт_ВидТранспорта //&НаКлиенте
#КонецОбласти

#Область include_core_base_LocalHelper_Session //&НаКлиенте
#КонецОбласти

#Область include_core_base_Транспорт_ИмяСвойстваТранспорта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти
