&НаКлиенте
Функция ПараметрыПереотправки()
	// BSLLS:UnusedLocalVariable-on
	
	ОбъектыОтправки = Новый Массив;
	Для Каждого СтрокаТбл Из Объекты Цикл
		ОбъектыОтправки.Добавить(СтрокаТбл.Объект);
	КонецЦикла;
	ПараметрыПереотправки = Новый Структура();
	ПараметрыПереотправки.Вставить("ОбъектыОтправки", ОбъектыОтправки);
	ПараметрыПереотправки.Вставить("ВладелецФормы", ЭтаФорма.ВладелецФормы);
	Возврат ПараметрыПереотправки;	
	// BSLLS:UnusedLocalVariable-off Переменная используется в склеянных областях

КонецФункции	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ФормаОткрыта = Ложь;
	ЭтаФорма.ВыполнитьЗакрытиеФормы = Ложь;
	context_param = СБИСПараметры();
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_param);
	ОбработчикПослеАвторизации = SabyОписаниеОповещения("ПриОткрытииПослеАвторизации", ЭтаФорма);
	ОткрытьФормуАвторизацииПриОтсутствииСессии(context_param, ТранспортИнтеграции, ОбработчикПослеАвторизации);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПослеАвторизации(Результат, ДопПараметры = Неопределено) Экспорт
	Если Результат = Неопределено Тогда
		ЭтаФорма.Закрыть();
		Возврат;	
	КонецЕсли;
	context_param = Результат;
	СтатусЧерновик = 0;
	СтатусЗавершено = 7;
	СтатусОшибка = 9;
	

	// BSLLS:UnusedLocalVariable-off Заполнение переменных формы
	BlocklyExecutor = ПолучитьФормуBlockly();
	ФормаОткрыта = Истина;
	ПроверкаВведенныхДанныхАутентификации = Неопределено;
	// BSLLS:UnusedLocalVariable-on
	
		
	СтатусВерсии = ПолучитьИнформациюОВерсииПоУмолчанию();
	СтатусВерсии = ПолучитьСтатусВерсииНаФорме(Ложь);
	
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочкиСтраницы = ЭлементыФормочки.Найти("Страницы");
	Если ЭлементыФормочкиСтраницы <> Неопределено Тогда
		ЭлементыФормочкиСтраницы.Видимость = Ложь;
	КонецЕсли;

	ОбновитьИнформациюОВерсии(СтатусВерсии);  
	Если ЭлементыФормочки.ПерезапуститьДО.Видимость = Ложь Тогда
		ВыполнитьПроверкуДокументов(context_param);
	Иначе
		ПослеПроверкиДокументовНаСервере(Неопределено);
		ПослеПроверкиДокументов(Неопределено, Неопределено);
	КонецЕсли;	
	
	УстановитьТипВыгружаемогоОбъектаВсемОбъектам();
КонецПроцедуры

&НаКлиенте
Функция ОбработатьРезультатСобытия(Параметры)
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Функция ВызовПолученияСпискаРегламентов(ИмяТипаДокумента)
	Возврат ПолучитьСписокРегламентов(ИмяТипаДокумента); 
КонецФункции


&НаКлиенте
Процедура ИнтеграцияДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь) Экспорт
	
	Если ТолькоУникальныеЗначения Тогда
		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПередаваемыхДокументов(ПроверкаОбмена, ВопросыПользователю)
	КоличествоСОшибками = 0;
	КоличествоЗавершенных = 0;
	КоличествоЧерновиков = 0;
	КоличествоСПометкойУдаления = 0;
	
	Если ТипЗнч(get_prop(ПроверкаОбмена, "Удаленные", Неопределено)) = Тип("Массив") Тогда
		КоличествоСПометкойУдаления = ПроверкаОбмена.Удаленные.Количество();	
	КонецЕсли;
	
	МассивБылОбмен = Новый Массив;
	МассивЧерновики = Новый Массив;
	МассивЗавершено = Новый Массив;
	МассивСОшибками = Новый Массив;
	
	Для Каждого ЗаписьОбъекта Из ПроверкаОбмена.БылОбмен Цикл
		// Состчитаем статусы, разнесём по разным массивам
		Если ЗаписьОбъекта.СостояниеИдСБИС = СтатусЧерновик Тогда
			КоличествоЧерновиков = КоличествоЧерновиков + 1;
			МассивЧерновики.Добавить(ЗаписьОбъекта);	
		ИначеЕсли ЗаписьОбъекта.СостояниеИдСБИС = СтатусЗавершено Тогда
			КоличествоЗавершенных = КоличествоЗавершенных + 1;
			МассивЗавершено.Добавить(ЗаписьОбъекта);	
		ИначеЕсли ЗаписьОбъекта.СостояниеИдСБИС = СтатусОшибка Тогда
			КоличествоСОшибками = КоличествоСОшибками + 1;
			МассивСОшибками.Добавить(ЗаписьОбъекта);	
		Иначе
			МассивБылОбмен.Добавить(ЗаписьОбъекта);	
		КонецЕСли;
	КонецЦикла;
	
	// Установим новые значения
	ПроверкаОбмена.БылОбмен = МассивБылОбмен;
	ИнтеграцияДополнитьМассив(ПроверкаОбмена.БылОбмен, МассивЗавершено, Истина);
	ИнтеграцияДополнитьМассив(ПроверкаОбмена.БылОбмен, МассивЧерновики, Истина);
	
	ИнтеграцияДополнитьМассив(ПроверкаОбмена.ОбменаНебыло, МассивСОшибками, Истина);
	
	Если КоличествоЗавершенных > 0 Тогда
		ВопросКПользователю = "Один или несколько документов уже отправлены, и в "
			+ ЛокализацияНазваниеПродукта() + " по ним завершен документооборот. Загрузить их повторно?";
		ВопросыПользователю.Добавить( Новый Структура("ТекстВопроса, КодСтатуса", ВопросКПользователю, СтатусЗавершено) );
	КонецЕсли;
	
	// Один объект с пометкой, сообщим в единственном числе
	Если КоличествоСПометкойУдаления = 1 Тогда
		ПоказатьОповещениеПользователя(
			"Внимание",
			,
			"Объект помечен на удаление в 1С. Он исключен из отправки в " + ЛокализацияНазваниеПродукта(),
			КартинкаИнформация());
	КонецЕсли;
	
	// Несколько объектов с пометкой, сообщим во множественном числе
	Если КоличествоСПометкойУдаления > 1 Тогда
		ПоказатьОповещениеПользователя(
			"Внимание",
			,
			"Часть объектов ("+Формат(КоличествоСПометкойУдаления, "ЧГ=0") 
				+ ") помечены на удаление в 1С. Они были исключены из отправки в " + ЛокализацияНазваниеПродукта(),
			КартинкаИнформация());
	КонецЕсли;
КонецПроцедуры	

Функция ПроисходилЛиОбменДокументовНаСервере(Источник, ДопПараметры = Неопределено) Экспорт
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.ПроисходилЛиОбменДокументов(Источник, ДопПараметры);
КонецФункции

&НаКлиенте
Функция ПолучитьДействияОбъекта(ПроверкаОбмена, context_params) 
	//Переданные документы
	ДействияОбъекта = Неопределено;
	Если ПроверкаОбмена.БылОбмен.Количество() Тогда
		//Проверим возможность получения действий для первого элемента массива
		//Проверка для большого массива займёт уйму времени, поэтому только 0й элемент
		Попытка    
			ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
			ДействияОбъекта = ТранспортИнтеграции.ПолучитьДействияДляОбъекта(ПроверкаОбмена.БылОбмен[0].Ссылка, context_params);
		Исключение                  
			ИнфоОбОшибке = ИнформацияОбОшибке();
			СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		КонецПопытки;
	КонецЕсли;  
	
	Если ТипЗнч(ДействияОбъекта) <> Тип("Массив") 
		И get_prop(ДействияОбъекта, "message2user") <> Неопределено Тогда
		СообщениеПользователю = get_prop(ДействияОбъекта, "message2user");
		СтатусОперации = get_prop(ДействияОбъекта, "status");
		КартинкаОповещения = КартинкаУспешно();
		ЗаголовокОповещения = "Внимание";
		СообщениеПользователю = СообщениеПользователю + " " + Символы.ПС + СокрЛП(ПроверкаОбмена.БылОбмен[0].Ссылка);
		Если СтатусОперации = "error" Тогда
			ЗаголовокОповещения = "Ошибка";
			КартинкаОповещения = КартинкаОшибка();
		КонецЕсли;
		ПоказатьОповещениеПользователя(
			ЗаголовокОповещения,
			,СообщениеПользователю
			,КартинкаОповещения
		);
	КонецЕсли;

	Возврат ДействияОбъекта; 
КонецФункции

// Нет необходимости уменьшать когнитивную сложность
// BSLLS:CognitiveComplexity-off

&НаКлиенте
Процедура ЗагрузитьВСБИСДействие(ПроверкаОбмена, ДействияОбъекта, context_params)
	ОткрытьФормуДДЗ = Ложь;
	ПараметрыВФормуДДЗ = Новый Структура; 
	МассивОбменаНеБыло = Новый Массив();
	Если ДействияОбъекта = Неопределено Тогда
		ДействияОбъекта = ПолучитьДействияОбъекта(ПроверкаОбмена, context_params);
	КонецЕсли;
	
    Если ДействияОбъекта = Неопределено Или ТипЗнч(ДействияОбъекта)	<> Тип("Массив") Тогда
		//Действий для объекта нет, либо объект/документ удален на стороне сервера, и требуется переотправка
		Для Каждого ДанныеПоДокументу Из ПроверкаОбмена.БылОбмен Цикл
			//Перенесем объекты в список не обработаных     
			ПроверкаОбмена.ОбменаНебыло.Добавить(ДанныеПоДокументу);
		КонецЦикла;
	Иначе
		СписокДокументовСБИС = Новый Массив();
		СписокДокументов1С = Новый Массив();
		Для Каждого СтрокаСпискаЗадач Из ПроверкаОбмена.БылОбмен Цикл    
			//Если СуществуетОбъектКонфигурации Тогда
			//	Если ТипЗнч(СтрокаСпискаЗадач.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда   
			//		ПроверкаОбмена.ОбменСразу.Добавить(СтрокаСпискаЗадач); 
			//		Продолжить;
			//	КонецЕсли; 
			//КонецЕсли;
			
			ДокументСБИС = Новый Структура("Идентификатор, ПервичныйКлюч, Документ1С", 
			СтрокаСпискаЗадач.UID,
			"",
			СтрокаСпискаЗадач.Ссылка);	
			СписокДокументовСБИС.Добавить(ДокументСБИС);
			
			СписокДокументов1С.Добавить(СтрокаСпискаЗадач.Ссылка);
		КонецЦикла;
		Если СписокДокументовСБИС.Количество() > 0 ИЛИ СписокДокументов1С.Количество() > 0 Тогда 
			
			ПараметрыВФормуДДЗ = Новый Структура("СписокДокументовСБИС, СписокДокументов1С, МожноПереотправитьВСБИС, МожноОбновитьВСБИС", 
			СписокДокументовСБИС, СписокДокументов1С, СписокДокументов1С.Количество() > 0, Истина);
			ОткрытьФормуДДЗ = Истина;  
		КонецЕсли;
	КонецЕсли;
	
	//Формы выполнить действие должна быть активной, поэтому открывается последней
	Если ОткрытьФормуДДЗ Тогда 
		Попытка
			ОткрытьФормуОбработки("ВыполнитьДействие",
			ПараметрыВФормуДДЗ, 
			ЭтаФорма.ВладелецФормы,
			Новый УникальныйИдентификатор());
		Исключение
			ИнфоОбОшибке = ИнформацияОбОшибке();
			СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
			ОписаниеОшибки = get_prop(СтруктураОшибки, "detail", Новый Структура);
			ПоказатьОповещениеПользователя(
			"Ошибка",
			,
			ОписаниеОшибки,
			КартинкаОшибка());
		КонецПопытки; 
	КонецЕсли;   
	Если ПроверкаОбмена.ОбменаНебыло.Количество() = 0 Тогда
		ЭтаФорма.ВыполнитьЗакрытиеФормы = Истина;
		Если ЭтаФорма.Открыта() Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
		Возврат;
	КонецЕсли;	

	ПослеПроверкиДокументовНаСервере(ПроверкаОбмена.ОбменаНебыло);
	ПослеПроверкиДокументов(Неопределено, Неопределено);
КонецПроцедуры	
// BSLLS:CognitiveComplexity-on

&НаКлиенте
Процедура ЗагрузитьВСБИСОбработкаОтветаНаВопрос(ОтветПользователя, ПараметрКоманды ) Экспорт 
	ВопросКПользователю = Неопределено;
	ВопросыПользователю = Неопределено;
	ПараметрКоманды.Свойство("ТекстВопроса", ВопросКПользователю);
	ПараметрКоманды.Свойство("ВопросыПользователю", ВопросыПользователю);
	КодСтатуса	= ВопросыПользователю[0].КодСтатуса;
	ВопросыПользователю.Удалить(0);

	ПроверкаОбмена	= Неопределено;
	ПараметрКоманды.Свойство("ПроверкаОбмена", ПроверкаОбмена);
	
	// Ответ на вопрос - Загрузить их повторно?
	Если ОтветПользователя  = КодВозвратаДиалога.Нет Тогда
		НовыйМассивДокументов = Новый Массив;
		Для Каждого ЗаписьДокумента Из ПроверкаОбмена.БылОбмен Цикл
			Если ЗаписьДокумента.СостояниеИдСБИС <> КодСтатуса Тогда
				НовыйМассивДокументов.Добавить(ЗаписьДокумента);
			КонецЕсли;
		КонецЦикла;
		// Обновить значение массива, удалили из списка документы раз уж пользователь отказался их загружать
		ПроверкаОбмена.Вставить("БылОбмен", НовыйМассивДокументов);
		// Обновить значение реквизита ПроверкаОбмена
		ПараметрКоманды.Вставить("ПроверкаОбмена", ПроверкаОбмена);
	КонецЕсли;
	Если ОтветПользователя  = КодВозвратаДиалога.Да Тогда
		НовыйМассивДокументовБыл = Новый Массив;
		НовыйМассивДокументовНебыл = Новый Массив;
		Для Каждого ЗаписьДокумента Из ПроверкаОбмена.БылОбмен Цикл
			Если ЗаписьДокумента.СостояниеИдСБИС <> КодСтатуса Тогда
				НовыйМассивДокументовБыл.Добавить(ЗаписьДокумента);
			Иначе
				НовыйМассивДокументовНебыл.Добавить(ЗаписьДокумента);
			КонецЕсли;
		КонецЦикла;
		// Обновить значение массивов объектов
		ПроверкаОбмена.Вставить("БылОбмен", НовыйМассивДокументовБыл);
		//Добавим новые значения в массив
		ИнтеграцияДополнитьМассив(ПроверкаОбмена.ОбменаНебыло, НовыйМассивДокументовНебыл, Истина);
		// Обновить значение реквизита ПроверкаОбмена
		ПараметрКоманды.Вставить("ПроверкаОбмена", ПроверкаОбмена);
	КонецЕсли;
	
	Если ВопросыПользователю.Количество() > 0 Тогда
		ВопросКПользователю = ВопросыПользователю[0].ТекстВопроса;
		ДействиеВопроса = SabyОписаниеОповещения("ЗагрузитьВСБИСОбработкаОтветаНаВопрос", ЭтотМодуль(), ПараметрКоманды);
		SabyПоказатьВопрос(ДействиеВопроса,
			ВопросКПользователю,
			РежимДиалогаВопрос.ДаНет,
			0,
			КодВозвратаДиалога.Да,
			"Загрузить повторно?");
		Возврат;
	КонецЕсли;
		
	ЗагрузитьВСБИСДействие(ПроверкаОбмена, Неопределено, get_prop(ПараметрКоманды, "context_params"));
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПроверкуДокументов(context_params)   
	ОбъектыОтправки = Новый Массив;
	Для Каждого СтрокаТбл Из Объекты Цикл
		ОбъектыОтправки.Добавить(СтрокаТбл.Объект);
	КонецЦикла;
	ПроверкаОбмена = ПроисходилЛиОбменДокументовНаСервере(ОбъектыОтправки);
	ВопросыПользователю = Новый Массив;
	ПроверкаПередаваемыхДокументов(ПроверкаОбмена, ВопросыПользователю);

	ДопПараметры		= Новый Структура();
	ДопПараметры.Вставить("ПроверкаОбмена", ПроверкаОбмена);
	ДопПараметры.Вставить("ВопросыПользователю", ВопросыПользователю);
	ДопПараметры.Вставить("context_params", context_params);
	
	ДействияОбъекта = ПолучитьДействияОбъекта(ПроверкаОбмена, context_params);
	Если ТипЗнч(ДействияОбъекта)	= Тип("Массив") Тогда
		// Для первого документа есть действия. удалим из вопросов вопрос со статусвом - СтатусЗавершено
		ВрВопросыПользователю = Новый Массив;
		Для Каждого Вопрос Из ВопросыПользователю Цикл 
			Если Вопрос.КодСтатуса = СтатусЗавершено Тогда 
				Продолжить;
			КонецЕсли;
			ВрВопросыПользователю.Добавить(Вопрос);
		КонецЦикла;
		ВопросыПользователю = ВрВопросыПользователю;
	КонецЕсли;
	
	Если ВопросыПользователю.Количество() = 0 Тогда
		ЗагрузитьВСБИСДействие(ПроверкаОбмена, ДействияОбъекта, context_params);		
	Иначе
		ВопросКПользователю = ВопросыПользователю[0].ТекстВопроса;
		
		ДействиеВопроса = SabyОписаниеОповещения("ЗагрузитьВСБИСОбработкаОтветаНаВопрос", ЭтотМодуль(), ДопПараметры);
		
		SabyПоказатьВопрос(ДействиеВопроса,
			ВопросКПользователю,
			РежимДиалогаВопрос.ДаНет,
			0,
			КодВозвратаДиалога.Да,
			"Загрузить повторно?");	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерезаполнитьФильтр(мДокументы) 
	Если Не ЗначениеЗаполнено(Фильтр) Тогда
		Возврат;
	КонецЕсли;
	ВсегоОбъектовВФильтре = Фильтр.Selection.Marked.Количество();  
	СчетчикОбъекта = ВсегоОбъектовВФильтре - 1;
	Если Объекты.Количество() = ВсегоОбъектовВФильтре Тогда
		Возврат;
	КонецЕсли;
	ОбъектыТаблицаЗначений = Объекты.Выгрузить(, "Объект");
	Пока СчетчикОбъекта >= 0 Цикл  
		ОбъектИС = Фильтр.Selection.Marked[СчетчикОбъекта].ОбъектИС;
 		Если ОбъектыТаблицаЗначений.Найти(ОбъектИС) = Неопределено Тогда  
			Фильтр.Selection.Marked.Удалить(СчетчикОбъекта);	
		КонецЕсли;	
		СчетчикОбъекта = СчетчикОбъекта - 1;
	КонецЦикла;	
КонецПроцедуры


Процедура ПослеПроверкиДокументовНаСервере(мДокументы) 
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	Если мДокументы <> Неопределено Тогда
		Объекты.Очистить();
		ЗаполнитьОбъекты(мДокументы); 
		ПерезаполнитьФильтр(мДокументы);
	КонецЕсли;	
	ПервыйДок = Объекты[0].Объект;	
	УстановитьЗаголовокФормы(Объекты.Количество(), ПервыйДок);
	ТипМетаданных = ТипОбъектаМетаданных(ПервыйДок.Ссылка);
	ЭлементыФормочки.ПростойЗапросПодписи.Видимость = НЕ(ТипМетаданных = "Справочники"  ИЛИ ДокументШтатноеРасписание(ПервыйДок.Ссылка));
	
	ЭтаФорма.ПерезапуститьДО = Ложь;
	// Установим видимость если есть запись в состояниях объекта
	ЭлементПДО = ЭлементыФормочки.ПерезапуститьДО;
	МодульОбъекта	= МодульОбъекта();
	ЗаписиОбОбъекте = МодульОбъекта.СтатусыДокументовПрочитатьПоОбъекту(ПервыйДок);
	// Проверка на объекты исключения
	ЭлементПДО.Видимость = НЕ ИсключающийОбъектПерезапускаДО(ПервыйДок.Ссылка);
	// Был ли обмен
	ЭлементПДО.Видимость = ЭлементПДО.Видимость И ТипЗНЧ(ЗаписиОбОбъекте) = Тип("Структура");
	
	УстановитьУсловноеОформление(ЭтаФорма);
	ПростойЗапросПодписи = Ложь;
	ЭлементыФормочки.ДобавитьСотрудника.Видимость = ПростойЗапросПодписи;
	ЭлементыФормочки.СписокИсполнителей.Видимость = ПростойЗапросПодписи;
	ЭлементыФормочки.КаналИнформации.Видимость = ПростойЗапросПодписи;
	ЭлементыФормочки.МаршрутОзнакомления.Видимость = ПростойЗапросПодписи;
	УстановитьЛокализацию();
	ПоказатьТекстСообщения();
КонецПроцедуры

&НаКлиенте
Функция ТипОбъектаПоИмениИни(ИмяИни)
	Результат = "";	
	ОтборСтруктура = Новый Структура("ИмяИни", ИмяИни);
	СтрокиТаблицыОбъектов = ТипыВыгружаемыхОбъектов.НайтиСтроки(ОтборСтруктура);
	Для Каждого СтрокаТблОбъектов Из СтрокиТаблицыОбъектов Цикл
		Результат = СтрокаТблОбъектов.ТипыОбъекта;
		Прервать;
	КонецЦикла;	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция КорректноеЗначениеИмениИни(ПредыдущееЗначение, ТипОбъектаПоВиду)
	Результат = ПредыдущееЗначение;
	Если Не ЗначениеЗаполнено(ПредыдущееЗначение) Или Найти(ПредыдущееЗначение, "Blockly_") = 0 Тогда
		Результат = get_prop(ТипОбъектаПоВиду, "ИмяИни", "");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПослеПроверкиДокументов(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	//Saby_ТранспортПриИзменении( Элементы.ТаблицаПолучателейSMS );
	//ИзменениеВидаЭлементов();
	
	//ВЫзов с клиента, тк всё храниться в переменных формы
	ВложенияТекущегоТипаОбъекта1С.Очистить();
	ВложенияПоТипамОбъектов1С.Очистить();
	РегламентПоТипамДокументов.Очистить();
	//КомандыПечатиФормы = Новый Массив;
	
	ЗаполнитьСписокПФПоТблДокументов();
	Попытка
		ЗаполнитьТЗДоступныхРегламентов();
	Исключение
		Отказ	= Истина;
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		ОписаниеОшибки = get_prop(СтруктураОшибки, "detail", Новый Структура);
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			ОписаниеОшибки,
			БиблиотекаКартинок["Ошибка32"]
		);
       	Отказ = Истина;
		Возврат;
	КонецПопытки;

	УстановитьТипВыгружаемогоОбъектаВсемОбъектам();
	// Установим реквизиты элементов формы по первому документу
	
	ТипОбъектаПоВиду = ТипВыгружаемогоОбъектаПоВидуОбъекта(ЭтаФорма.Объекты[0].ВидОбъекта);
	// Переход с типа на имя ини ++
	_ИмяИни = ПрочитатьТипОбъектаПоУмолчанию(ЭтаФорма.Объекты[0].ВидОбъекта, get_prop(ТипОбъектаПоВиду, "ИмяИни", ""));
	ПервыйТипОбъекта = ПервыйТипВыгружаемогоОбъекта(ЭтаФорма.Объекты[0].ВидОбъекта);  
	ЭтаФорма.ТипОбъекта = КорректноеЗначениеИмениИни(_ИмяИни, ПервыйТипОбъекта);
	// Переход с типа на имя ини --
	
	// Будем проверять единыжды, при открытии по первому объекту
	ФормаОткрыта = Истина;
	СкрытьПФЕслиНеДокумент();
    ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочкиСтраницы = ЭлементыФормочки.Найти("Страницы");
	Если ЭлементыФормочкиСтраницы <> Неопределено Тогда
		ЭлементыФормочкиСтраницы.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры	
