
&НаСервере
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	ВложенияПоТипамОбъектов1С.Колонки.Добавить("Представление");
	ВложенияПоТипамОбъектов1С.Колонки.Добавить("ОтметкаВыбора");
	ВложенияПоТипамОбъектов1С.Колонки.Добавить("ИндексКартинки");
	ВложенияПоТипамОбъектов1С.Колонки.Добавить("Команда");
	ВложенияПоТипамОбъектов1С.Колонки.Добавить("ТипВложения");
	ВложенияПоТипамОбъектов1С.Колонки.Добавить("ВидОбъекта");
	ВложенияПоТипамОбъектов1С.Колонки.Добавить("СсылкаНаПрисоединенныйФайл");

	РегламентПоТипамДокументов.Колонки.Добавить("Регламент");
	РегламентПоТипамДокументов.Колонки.Добавить("ВидОбъекта");

	РегламентТекущегоТипаДокумента.Колонки.Добавить("Регламент");
	РегламентТекущегоТипаДокумента.Колонки.Добавить("ВидОбъекта");
	РегламентТекущегоТипаДокумента.Колонки.Добавить("ПроизвольноеНазваниеРегламента");

	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();

	ЭлементыФормочки.КаналИнформации.СписокВыбора.Добавить(0, "Электронная почта");
	ЭлементыФормочки.КаналИнформации.СписокВыбора.Добавить(1, "СМС");
	ЭлементыФормочки.КаналИнформации.СписокВыбора.Добавить(2, "Viber");
	ЭлементыФормочки.КаналИнформации.СписокВыбора.Добавить(3, "WhatsApp");
	ЭлементыФормочки.КаналИнформации.СписокВыбора.Добавить(4, "Telegram");

	ЭлементыФормочки.МаршрутОзнакомления.СписокВыбора.Добавить(0, "Одновременно всем");
	ЭлементыФормочки.МаршрутОзнакомления.СписокВыбора.Добавить(1, "Сначала руководители");
	ЭлементыФормочки.МаршрутОзнакомления.СписокВыбора.Добавить(2, "Сначала сотрудники");

	ПростойЗапросПодписи = Ложь;
	Если ЭлементыФормочки.Найти("НадписьКаналИнформации") <> Неопределено Тогда
		ЭлементыФормочки.НадписьКаналИнформации.Видимость = ПростойЗапросПодписи;
	КонецЕсли;
	Если ЭлементыФормочки.Найти("НадписьМаршрутОзнакомления") <> Неопределено Тогда
		ЭлементыФормочки.НадписьМаршрутОзнакомления.Видимость = ПростойЗапросПодписи;
	КонецЕсли;

	ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложение(Команда)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = НСтр("ru=’Любой файл (*.*)|*.*'");
	Диалог.Заголовок = НСтр("ru=’Выберите файл'");
	Диалог.МножественныйВыбор = Истина;
	ОбработкаОкончанияЗагрузки = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма, Диалог);
	НачатьПомещениеФайлов(ОбработкаОкончанияЗагрузки,, Диалог, Истина);
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуВыбранногоОбъекта(ИдентификаторыСтрок)
	Для Каждого ИдентификаторСтроки Из ИдентификаторыСтрок Цикл
		Объекты.Удалить(ИдентификаторСтроки);
	КонецЦикла;
КонецПроцедуры

