
#Область ТаблицаПечатныхФормИФормированиеПредпросмотра

&НаСервере
Функция СформироватьПФНаСервере(КомандаПечати, ВыбранныйДокумент)

	ПараметрыПечати = Новый Структура("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	ОбъектыПечати = Новый Массив;
	ОбъектыПечати.Добавить(ВыбранныйДокумент);

	ВзТабличныйДокумент = "";
	// Формирование табличных документов.
	Если Найти(КомандаПечати.Менеджерпечати, "ДополнительныеОтчетыИОбработки") > 0 Тогда
		ВзТабличныйДокумент = СформироватьПФНаСервереМенеджерПечатиДополнительныеОтчетыИОбработки(
									КомандаПечати, ОбъектыПечати);
	Иначе
		Попытка
			ПечатныеФормы = УправлениеПечатью.СформироватьПечатныеФормы(КомандаПечати.МенеджерПечати,
				КомандаПечати.Идентификатор, ОбъектыПечати, ПараметрыПечати);
		Исключение
			ПечатныеФормы = Неопределено;
		КонецПопытки;

		Если ТипЗнч(ПечатныеФормы) = Тип("Структура") И ПечатныеФормы.Свойство("КоллекцияПечатныхФорм") Тогда
			Для Каждого ПФ Из ПечатныеФормы.КоллекцияПечатныхФорм Цикл
				ВзТабличныйДокумент = ПоместитьВоВременноеХранилище(ПФ.ТабличныйДокумент, Новый УникальныйИдентификатор);
				Прервать;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Возврат ВзТабличныйДокумент;

КонецФункции

&НаСервере
Функция СформироватьПФНаСервереМенеджерПечатиДополнительныеОтчетыИОбработки(КомандаПечати, ОбъектыПечати)
	ВзТабличныйДокумент = "";

	СсылкаНаПечатнуюФорму	= КомандаПечати.ДополнительныеПараметры.Ссылка;
	Если СсылкаНаПечатнуюФорму.Пустая() Тогда
		ВызватьИсключение("Отсутствует внешняя печатная форма.");
	КонецЕсли;
	ПараметрыВызова	= Новый Структура("ИдентификаторКоманды, ОбъектыНазначения",
								КомандаПечати.Идентификатор, ОбъектыПечати);
	ПечатныеФормы	= Неопределено;
	ОбъектыПечати	= Новый СписокЗначений;
	ПараметрыВывода	= Неопределено;
	Попытка
		УправлениеПечатью.ПечатьПоВнешнемуИсточнику(
			СсылкаНаПечатнуюФорму,
			ПараметрыВызова,
			ПечатныеФормы,
			ОбъектыПечати,
			ПараметрыВывода);
	Исключение
		ПечатныеФормы = Новый Массив;
	КонецПопытки;
	Для Каждого ПФ Из ПечатныеФормы Цикл
		ВзТабличныйДокумент = ПоместитьВоВременноеХранилище(ПФ.ТабличныйДокумент, Новый УникальныйИдентификатор);
		Прервать;
	КонецЦикла;

	Возврат ВзТабличныйДокумент;
КонецФункции

&НаСервере
Процедура ОтобразитьПФ(АдресТД)
	ТабДокПредпросмотр = ЭтотОбъект["Предпросмотр"];
	ТабДокПредпросмотр.Очистить();
	Если НЕ ПустаяСтрока(АдресТД) Тогда
		// BSLLS:MissingTempStorageDeletion-off
		ВрТабличныйДок = ПолучитьИзВременногоХранилища(АдресТД);
		// BSLLS:MissingTempStorageDeletion-on
		Если ТипЗнч(ВрТабличныйДок) = Тип("ТабличныйДокумент") Тогда
			ТабДокПредпросмотр.Вывести(ВрТабличныйДок);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПФ()
	//А нужно ли это условие???
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ТД = ЭлементыФормочки.ВложенияТипаДокумента.ТекущиеДанные;
	Если Объекты.Количество() = 1 Тогда
		ТД.АдресПревьюВХранилище = СформироватьПФНаСервере(ТД.Команда, Объекты[0].Объект);
	Иначе
		ТД.АдресПревьюВХранилище = СформироватьПФНаСервере(ТД.Команда,
										ЭлементыФормочки.Объекты.ТекущиеДанные.Объект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВложенийПриАктивизацииСтроки(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ТД = ЭлементыФормочки.ВложенияТипаДокумента.ТекущиеДанные;
	Если ТД = Неопределено ИЛИ ТД.ТипВложения <> "ПечатнаяФорма" Тогда
		Возврат;
	КонецЕсли;
	//Пока печать только по двойному клику на строчке печатной формы

	//Если ДокументыКОтправке.Количество() = 1 Тогда
	//	ТД.ПФ = СформироватьПФНаСервере(ТД.Команда, ДокументыКОтправке[0].Документ);
	//Иначе
	//	ТД.ПФ = СформироватьПФНаСервере(ТД.Команда, Элементы.ДокументыКОтправке.ТекущиеДанные.Документ);
	//КонецЕсли;
	//ЗаполнитьКоментарииДокументовКОтправке();
	ОтобразитьПФ(ТД.АдресПревьюВХранилище);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВложенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ТД = ЭлементыФормочки.ВложенияТипаДокумента.ТекущиеДанные;
	Если ТД = Неопределено ИЛИ ТД.ТипВложения <> "ПечатнаяФорма"  Тогда Возврат; КонецЕсли;
	СформироватьПФ();
	ОтобразитьПФ(ТД.АдресПревьюВХранилище);
КонецПроцедуры

#КонецОбласти

