
&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый()
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ПолеТабДок = ЭлементыФормочки.Предпросмотр; 
	ОтображениеСостояния = ПолеТабДок.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = НСтр("ru = 'Для предварительного просмотра сделайте двойной клик на названии печатной формы'");
КонецПроцедуры

