
&НаСервере
Процедура УстановитьВидимостьПодсказкиПФ(ВидимостьПодсказки = Ложь)
	ТекстСообщения = "";
	РежимОТображения = ДополнительныйРежимОтображения.НеИспользовать;
	Если ВидимостьПодсказки = Истина Тогда 
		ТекстСообщения = НСтр("ru = 'Для предварительного просмотра сделайте двойной клик на названии печатной формы'");
		РежимОТображения = ДополнительныйРежимОтображения.Неактуальность;
	КонецЕсли;
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ПолеТабДок = ЭлементыФормочки.Предпросмотр; 
	ОтображениеСостояния = ПолеТабДок.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = ВидимостьПодсказки;
	ОтображениеСостояния.ДополнительныйРежимОтображения = РежимОТображения;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = ТекстСообщения;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый()
	УстановитьВидимостьПодсказкиПФ(Истина);
КонецПроцедуры

