
&НаКлиенте
Процедура СоздатьМенеджерыКриптографииНачатьИнициализацию(Контекст)
	
	СвойстваПрограммы = Контекст.ПрограммыКриптографии[Контекст.ТекущийИндексПрограммыКриптографии];
	
	// BSLLS:MissingCodeTryCatchEx-off
	//Для совместимости со старыми платформами 8.3.12 и ниже, в которых нет ИспользованиеИнтерактивногоРежимаКриптографии 
	Попытка
		ИспользованиеИнтерактивногоРежимаКриптографии = Неопределено;
	Исключение  
	КонецПопытки;
	// BSLLS:MissingCodeTryCatchEx-on
	
    Криптография = Новый МенеджерКриптографии;
	ОписаниеОповещения =  Новый ОписаниеОповещения(
            "СоздатьМенеджерыКриптографииПослеИнициализацииМенеджераКриптографии", МодульФоновогоЗаданияКлиент(), Контекст,
            "СоздатьМенеджерыКриптографииПослеОшибкиИнициализацииМенеджераКриптографии", МодульФоновогоЗаданияКлиент());
	Попытка
		Криптография.НачатьИнициализацию(
			ОписаниеОповещения,
			СвойстваПрограммы.ИмяПрограммы, 
			СвойстваПрограммы.ПутьКПрограмме, 
			СвойстваПрограммы.ТипПрограммы,
			ИспользованиеИнтерактивногоРежимаКриптографии.Использовать);
	Исключение
		Криптография.НачатьИнициализацию(
			ОписаниеОповещения,
			СвойстваПрограммы.ИмяПрограммы, 
			СвойстваПрограммы.ПутьКПрограмме, 
			СвойстваПрограммы.ТипПрограммы);
	КонецПопытки;	
		
КонецПроцедуры
	
