
&НаКлиенте
Процедура СоздатьМенеджерыКриптографииНачатьИнициализацию(Контекст)
	
	СвойстваПрограммы = Контекст.ПрограммыКриптографии[Контекст.ТекущийИндексПрограммыКриптографии];
	
    Криптография = Новый МенеджерКриптографии;
	ОбработчикРезультата = SabyОписаниеОповещения(
		"СоздатьМенеджерыКриптографииПослеИнициализацииМенеджераКриптографии", МодульФоновогоЗаданияКлиент(), Контекст,
            "СоздатьМенеджерыКриптографииПослеОшибкиИнициализацииМенеджераКриптографии", МодульФоновогоЗаданияКлиент());
    Криптография.НачатьИнициализацию(
        ОбработчикРезультата,
		СвойстваПрограммы.ИмяПрограммы, СвойстваПрограммы.ПутьКПрограмме, СвойстваПрограммы.ТипПрограммы);
		
КонецПроцедуры
	
