
&НаКлиенте
Процедура СоздатьМенеджерыКриптографииНачатьИнициализацию(Контекст)
	
	СвойстваПрограммы = Контекст.ПрограммыКриптографии[Контекст.ТекущийИндексПрограммыКриптографии];
	
	// BSLLS:MissingCodeTryCatchEx-off
	//Для совместимости со старыми платформами 8.3.12 и ниже, в которых нет ИспользованиеИнтерактивногоРежимаКриптографии 
	Попытка
		ИспользованиеИнтерактивногоРежимаКриптографии = Неопределено;
	Исключение  
	КонецПопытки;
	// BSLLS:MissingCodeTryCatchEx-on
	
    Криптография = Новый МенеджерКриптографии;
	Криптография.НачатьИнициализацию(
        Новый ОписаниеОповещения(
            "СоздатьМенеджерыКриптографииПослеИнициализацииМенеджераКриптографии", МодульФоновогоЗаданияКлиент(), Контекст,
            "СоздатьМенеджерыКриптографииПослеОшибкиИнициализацииМенеджераКриптографии", МодульФоновогоЗаданияКлиент()),
		СвойстваПрограммы.ИмяПрограммы, СвойстваПрограммы.ПутьКПрограмме, СвойстваПрограммы.ТипПрограммы,
		ИспользованиеИнтерактивногоРежимаКриптографии.Использовать);
		
КонецПроцедуры
	
