
&НаКлиенте
Процедура НайтиСертификатПоОтпечатку(ОбработчикРезультата, ХранилищеСертификатовКриптографии, Отпечаток)
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
	
	ХранилищеСертификатовКриптографии.НачатьПоискПоОтпечатку(
		SabyОписаниеОповещения("НайтиСертификатПоОтпечаткуЗавершение", МодульФоновогоЗаданияКлиент(), Контекст),
		Отпечаток);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСертификатПоОтпечаткуЗавершение(Сертификат, Контекст) Экспорт
	
	ВыполнитьSabyОписаниеОповещения(Контекст.ОбработчикРезультата, Сертификат);
	
КонецПроцедуры

