
&НаКлиенте
Процедура НайтиМенеджерКриптографии(ОбработчикРезультата, Алгоритм = Неопределено) Экспорт
	
	// Получаем асинхронно
	Контекст = Новый Структура;
	Контекст.Вставить("Алгоритм", Алгоритм);
	Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
	
	НайтиМенеджерКриптографииНачатьПоиск(Контекст);

КонецПроцедуры

&НаКлиенте
Процедура НайтиМенеджерКриптографииНачатьПоиск(Контекст)
	
	ОбработчикРезультата = Новый ОписаниеОповещения(
		"НайтиМенеджерКриптографииПослеСозданияМенеджеровКриптографии", МодульФоновогоЗаданияКлиент(), Контекст);
	СоздатьМенеджерыКриптографии(ОбработчикРезультата, Контекст.Алгоритм)
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиМенеджерКриптографииПослеСозданияМенеджеровКриптографии(Менеджеры, Контекст) Экспорт
	
	Если Менеджеры = Неопределено ИЛИ Менеджеры.Количество() = 0 Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОбработчикРезультата, Неопределено); // Ошибка
		Возврат;
	КонецЕсли;
	
	Если Контекст.ОбработчикРезультата.ДополнительныеПараметры = Неопределено Тогда
		Контекст.ОбработчикРезультата.ДополнительныеПараметры = Новый Структура;
	КонецЕсли;	
	Контекст.ОбработчикРезультата.ДополнительныеПараметры.Вставить("МенеджерыКриптографии", Менеджеры);

	
	НайтиМенеджерКриптографииЗавершение(Контекст);

КонецПроцедуры

&НаКлиенте
Процедура НайтиМенеджерКриптографииЗавершение(Контекст)
	
	Результат = Неопределено;
	
	Если Контекст.Алгоритм = Неопределено Тогда
		Для Каждого Элем Из Контекст.ОбработчикРезультата.ДополнительныеПараметры.МенеджерыКриптографии Цикл
			Результат = Элем.Значение;
			Прервать;
		КонецЦикла
	Иначе
		Результат = Контекст.ОбработчикРезультата.ДополнительныеПараметры.МенеджерыКриптографии.Получить(Контекст.Алгоритм);
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Контекст.ОбработчикРезультата, Результат);
	
КонецПроцедуры

