
&НаСервереБезКонтекста
Функция ПрограммыКриптографии() Экспорт
	
    Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	Программы.ИмяПрограммы, 
		|	Программы.ТипПрограммы, 
		|	ЕстьNULL(Пути.ПутьКПрограмме,"""") КАК ПутьКПрограмме
		|ИЗ Справочник.ПрограммыЭлектроннойПодписиИШифрования КАК Программы
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux КАК Пути
		|	ПО Программы.Ссылка = Пути.Программа
		|ГДЕ НЕ ПометкаУдаления
		|";
	ОписанияПрограмм = Новый Массив; 
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СвойстваПрограммы = Новый Структура("ИмяПрограммы, ПутьКПрограмме, ТипПрограммы",
				Выборка.ИмяПрограммы,
				Выборка.ПутьКПрограмме,
				Выборка.ТипПрограммы);
			ОписанияПрограмм.Добавить(СвойстваПрограммы);
		КонецЦикла;
	Исключение
	КонецПопытки;
	Возврат ОписанияПрограмм;
КонецФункции

&НаСервереБезКонтекста
Функция КэшЛокальныхСертификатовПрочитать() Экспорт
	КэшЛокальныхСертификатов = ХранилищеОбщихНастроек.Загрузить("Saby", "КэшЛокальныхСертификатов");
	Если ТипЗнч(КэшЛокальныхСертификатов) <> Тип("Структура") Тогда
		КэшЛокальныхСертификатов = Новый Структура("ПоследнееОбновление, Отпечатки, Алгоритмы",, Новый Массив(),
			Новый Соответствие());
	КонецЕсли;

	Возврат КэшЛокальныхСертификатов;
КонецФункции

&НаСервереБезКонтекста
Функция КэшЛокальныхСертификатовЗаписать(КэшЛокальныхСертификатов) Экспорт
	ХранилищеОбщихНастроек.Сохранить("Saby", "КэшЛокальныхСертификатов", КэшЛокальныхСертификатов);
КонецФункции

