
#Область include_core_base_Криптография_ПрограммыЭП
#КонецОбласти

&НаСервере
Функция КэшЛокальныхСертификатовПрочитать() Экспорт
	КэшЛокальныхСертификатов = ПрочитатьИзХранилища("Saby", "КэшЛокальныхСертификатов");
	Если ТипЗнч(КэшЛокальныхСертификатов) <> Тип("Структура") Тогда
		КэшЛокальныхСертификатов = Новый Структура("ПоследнееОбновление, Отпечатки, Алгоритмы",, Новый Массив(),
			Новый Соответствие());
	КонецЕсли;

	Возврат КэшЛокальныхСертификатов;
КонецФункции

&НаСервере
Процедура КэшЛокальныхСертификатовЗаписать(КэшЛокальныхСертификатов) Экспорт
	ЗаписатьВХранилище("Saby", "КэшЛокальныхСертификатов", КэшЛокальныхСертификатов);
КонецПроцедуры

