
&НаКлиенте
Процедура ПодключитьРасширениеРаботыСКриптографиейНаВебКлиенте(ОбработчикРезультата) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("УстановитьРасширенияРаботыСКриптографиейЕслиНеПодключено", Истина);
	Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
	
	ПодключитьРасширениеРаботыСКриптографиейНаВебКлиентеНачатьПодключение(Контекст);
	
КонецПроцедуры  

&НаКлиенте 
Процедура ПодключитьРасширениеРаботыСКриптографиейНаВебКлиентеНачатьПодключение(Контекст) Экспорт
	
    #Если Клиент Тогда
	НачатьПодключениеРасширенияРаботыСКриптографией(
        SabyОписаниеОповещения(
			"ПодключитьРасширениеРаботыСКриптографиейНаВебКлиентеПослеПодключенияРасширения", МодульФоновогоЗаданияКлиент(), Контекст));
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьРасширениеРаботыСКриптографиейНаВебКлиентеПослеПодключенияРасширения(Подключено,
		Контекст) Экспорт
	
	Если Подключено Тогда
		
		//Сообщить("Расширение работы с криптографией подключено.");
		ВыполнитьSabyОписаниеОповещения(Контекст.ОбработчикРезультата, Истина);
		
	ИначеЕсли Контекст.УстановитьРасширенияРаботыСКриптографиейЕслиНеПодключено Тогда
		
		//Сообщить("Начали установку расширения работы с криптографией.");
		#Если Клиент Тогда
		Контекст.УстановитьРасширенияРаботыСКриптографиейЕслиНеПодключено = Ложь;
        НачатьУстановкуРасширенияРаботыСКриптографией(
            SabyОписаниеОповещения(
				"ПодключитьРасширениеРаботыСКриптографиейНаВебКлиентеНачатьПодключение", МодульФоновогоЗаданияКлиент(), Контекст));
		#КонецЕсли
		
	Иначе
		
		//Сообщить("Не удалось установить или подключить расширение работы с криптографией!");
		ВыполнитьSabyОписаниеОповещения(Контекст.ОбработчикРезультата, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

