
&НаКлиенте
Процедура ПолучитьХранилищеСертификатов(ОбработчикРезультата, МенеджерКриптографии)
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
	
	МенеджерКриптографии.НачатьПолучениеХранилищаСертификатов(
		SabyОписаниеОповещения("ПолучитьХранилищеСертификатовЗавершение", МодульФоновогоЗаданияКлиент(), Контекст));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьХранилищеСертификатовЗавершение(Хранилище, Контекст) Экспорт
	
	ВыполнитьSabyОписаниеОповещения(Контекст.ОбработчикРезультата, Хранилище);
	
КонецПроцедуры

