
&НаКлиенте
Процедура ПодписатьСертификатом(ОбработчикРезультата, МенеджерКриптографии, ИсходныеДанные, Сертификат)
	
	Контекст = Новый Структура;
	Контекст.Вставить("БылаОшибка", Ложь);
	Контекст.Вставить("ИнформацияОбОшибке", Неопределено);
	Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
	
	МенеджерКриптографии.НачатьПодписывание(
		Новый ОписаниеОповещения(
			"ПодписатьСертификатомЗавершение", МодульФоновогоЗаданияКлиент(), Контекст,
			"ПодписатьСертификатомПослеОшибкиПодписания", МодульФоновогоЗаданияКлиент()),
		ИсходныеДанные, Сертификат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьСертификатомПослеОшибкиПодписания(ИнформацияОбОшибке, СтандартнаяОбработка,
		Контекст) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Контекст.БылаОшибка = Истина;
	Контекст.ИнформацияОбОшибке = ИнформацияОбОшибке;
	ВыполнитьОбработкуОповещения(Контекст.ОбработчикРезультата, Контекст);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьСертификатомЗавершение(ПодписанныеДанные, Контекст) Экспорт
	
	ВыполнитьОбработкуОповещения(Контекст.ОбработчикРезультата, ПодписанныеДанные);
	
КонецПроцедуры

