
&НаКлиенте
Процедура ПолучитьВсеСертификаты(ОбработчикРезультата, ХранилищеСертификатовКриптографии)
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
	
	ХранилищеСертификатовКриптографии.НачатьПолучениеВсех(
		Новый ОписаниеОповещения("ПолучитьВсеСертификатыЗавершение", МодульФункции(), Контекст));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВсеСертификатыЗавершение(Сертификаты, Контекст) Экспорт
	
	ВыполнитьОбработкуОповещения(Контекст.ОбработчикРезультата, Сертификаты);
	
КонецПроцедуры

