
&НаКлиенте
Процедура ПолучитьХранилищеСертификатов(ОбработчикРезультата, МенеджерКриптографии)
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
	
	МенеджерКриптографии.НачатьПолучениеХранилищаСертификатов(
		Новый ОписаниеОповещения("ПолучитьХранилищеСертификатовЗавершение", МодульФункции(), Контекст),,);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьХранилищеСертификатовЗавершение(Хранилище, Контекст) Экспорт
	
	ВыполнитьОбработкуОповещения(Контекст.ОбработчикРезультата, Хранилище);
	
КонецПроцедуры

