
&НаКлиенте
Процедура ПолучитьВсеСертификаты(ОбработчикРезультата, ХранилищеСертификатовКриптографии)
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
	
	ХранилищеСертификатовКриптографии.НачатьПолучениеВсех(
		SabyОписаниеОповещения("ПолучитьВсеСертификатыЗавершение", МодульФоновогоЗаданияКлиент(), Контекст));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВсеСертификатыЗавершение(Сертификаты, Контекст) Экспорт
	
	ВыполнитьSabyОписаниеОповещения(Контекст.ОбработчикРезультата, Сертификаты);
	
КонецПроцедуры

