
&НаКлиенте
Процедура ПодписатьСертификатом(ОбработчикРезультата, МенеджерКриптографии, ИсходныеДанные, Сертификат)
	
	Контекст = Новый Структура;
	Контекст.Вставить("БылаОшибка", Ложь);
	Контекст.Вставить("ИнформацияОбОшибке", Неопределено);
	Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
	ОбработчикСледующегоШага = SabyОписаниеОповещения("ПодписатьСертификатомЗавершение", МодульФоновогоЗаданияКлиент(), Контекст,
													"ПодписатьСертификатомПослеОшибкиПодписания", МодульФоновогоЗаданияКлиент());
	
	МенеджерКриптографии.НачатьПодписывание(
		ОбработчикСледующегоШага,
		ИсходныеДанные, Сертификат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьСертификатомПослеОшибкиПодписания(ИнформацияОбОшибке, СтандартнаяОбработка,
		Контекст) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Контекст.БылаОшибка = Истина;
	Контекст.ИнформацияОбОшибке = ИнформацияОбОшибке;
	ВыполнитьSabyОписаниеОповещения(Контекст.ОбработчикРезультата, Контекст);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьСертификатомЗавершение(ПодписанныеДанные, Контекст) Экспорт
	
	ВыполнитьSabyОписаниеОповещения(Контекст.ОбработчикРезультата, ПодписанныеДанные);
	
КонецПроцедуры

