
//DynamicDirective

Функция сбисДвоичныеДанныеСертификатаПоОтпечаткуНаКлиенте(ОписанияПрограмм, Отпечаток) Экспорт
	Попытка
		МенеджерКриптографии = СоздатьМенеджерКриптографии(ОписанияПрограмм);
	Исключение    
		Возврат Ложь;
	КонецПопытки;
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе(); 
	Для Каждого Серт Из Сертификаты Цикл
		Если СтрЗаменить(Строка(Серт.Отпечаток), " ", "") = Отпечаток Тогда
			Возврат СтрЗаменить(СтрЗаменить(Base64Строка(Серт.Выгрузить()), Символы.ПС,""), Символы.ВК, "");
		КонецЕсли;
	КонецЦикла;
КонецФункции

//DynamicDirective

Функция СоздатьМенеджерКриптографии(ОписанияПрограмм, Алгоритм = Неопределено) Экспорт
	
	Возврат МенеджерКриптографииБазовый(ОписанияПрограмм, Алгоритм);
	
КонецФункции

//DynamicDirective

Функция сбисРасшифроватьНаКлиенте(ОписанияПрограмм, ДвоичныеДанные) Экспорт
	МенеджерКриптографии = СоздатьМенеджерКриптографии(ОписанияПрограмм);
	ДвоичныеДанныеРасшифрованные = МенеджерКриптографии.Расшифровать(Base64Значение(ДвоичныеДанные));
	НедопустимыеСимволы = Новый Массив;
	НедопустимыеСимволы.Добавить(Символы.ПС);
	НедопустимыеСимволы.Добавить(Символы.ВК);
	ДанныеВозврат = Base64Строка(ДвоичныеДанныеРасшифрованные);
	Для Каждого НедопустимыйСимвол Из НедопустимыеСимволы Цикл
		ДанныеВозврат = СтрЗаменить(ДанныеВозврат, НедопустимыйСимвол, "");
	КонецЦикла;
	Возврат ДанныеВозврат;
КонецФункции

