&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	context_params = МодульCoreКлиент().ПроверитьНаличиеПараметровПодключения();
	Если МодульCoreКлиент().get_prop(context_params, "session") <> Неопределено Тогда
		АдресСтраницы = context_params.api_url+"/page/tasks-in-work"; //integration-tasks?connector=1C
	ИначеЕсли МодульCoreКлиент().get_prop(context_params, "api_url") <> Неопределено Тогда
		АдресСтраницы = context_params.api_url+"/auth/";
	Иначе
		АдресСтраницы = "https://ie-1c.saby.ru/auth/";	
	КонецЕсли;	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок", "Задачи");
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормы.Вставить("context_param", context_params);
	ОткрытьФорму("Обработка." + ПрефиксПродукта() + "SABY.Форма.Browser", ПараметрыФормы,,"Задачи");
КонецПроцедуры

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_МодульCoreКлиент
#КонецОбласти