
&НаКлиенте
Процедура ВыйтиИОткрытьАвторизацию(ОбработчикПослеАвторизации = Неопределено)
	ВыйтиНаСервере();
	Сообщить("Сессия и пароль сброшены");
	Оповестить("SabySignOut");
	ОткрытьФормуОбработки("Вход",, ЭтаФорма, , ОбработчикПослеАвторизации);
КонецПроцедуры

&НаСервере
Процедура ВыйтиНаСервере()
	МодульОбъекта = МодульОбъекта();
	saby_param = МодульОбъекта.НастройкиПодключенияПрочитать();
	Если saby_param <> Неопределено Тогда	
		МодульОбъекта.ОчиститьСессию(saby_param);
		saby_param.Вставить("password", Неопределено);
		saby_param.Вставить("Сертификат", Неопределено);
		saby_param.Вставить("Certificate", Неопределено);
		МодульОбъекта.НастройкиПодключенияЗаписать(saby_param);
	КонецЕсли;	
КонецПроцедуры

