
&НаКлиенте
Процедура ЗаполнитьСписокСертификатов()
	ОписаниеОповещенияПослеПолученияСписка = Новый ОписаниеОповещения("СписокСертификатовДляАвторизации",ЭтаФорма);
	ДополнительныеПараметры = Новый Структура("ОбработчикРезультата", ОписаниеОповещенияПослеПолученияСписка);
	ОписаниеОповещения = Новый ОписаниеОповещения("СписокСертификатовДляАвторизацииПослеПолученияМенеджераКриптографии",
												  ЭтаФорма, ДополнительныеПараметры);
	BlocklyExecutor.НайтиМенеджерКриптографии(ОписаниеОповещения);
КонецПроцедуры
