
&НаКлиенте  
Процедура ЗаполнитьСписокСертификатов()
	ОписаниеОповещенияПослеПолученияСписка = Новый ОписаниеОповещения("СписокСертификатовДляАвторизации",ЭтаФорма);
	ДополнительныеПараметры = Новый Структура("ОбработчикРезультата", ОписаниеОповещенияПослеПолученияСписка);
	ОписаниеОповещения = Новый ОписаниеОповещения("СписокСертификатовДляАвторизацииПослеПолученияМенеджераКриптографии",
												  ЭтаФорма, ДополнительныеПараметры);
	BlocklyExecutor.НайтиМенеджерКриптографии(ОписаниеОповещения);
КонецПроцедуры  

&НаКлиенте
Процедура  СписокСертификатовДляАвторизацииПослеПолученияМенеджераКриптографии(МенеджерКриптографии, ДополнительныеПараметры) Экспорт
	Если МенеджерКриптографии = Неопределено Тогда   
		СертификатыДляАвторизации = Новый Массив;
		СписокСертификатовДляАвторизацииПослеПолученияСертификатовНаКлиенте(СертификатыДляАвторизации, ДополнительныеПараметры);
	Иначе   
		ОписаниеОповещения = Новый ОписаниеОповещения("СписокСертификатовДляАвторизацииПослеПолученияХранилищаСертификатовНаКлиенте",
												  ЭтаФорма, ДополнительныеПараметры);
		МенеджерКриптографии.НачатьПолучениеХранилищаСертификатов(ОписаниеОповещения);										  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура  СписокСертификатовДляАвторизацииПослеПолученияХранилищаСертификатовНаКлиенте(ХранилищеСертификатовНаКлиенте, ДополнительныеПараметры) Экспорт
	Если ХранилищеСертификатовНаКлиенте = Неопределено Тогда   
		СертификатыДляАвторизации = Новый Массив;
		СписокСертификатовДляАвторизацииПослеПолученияХранилищаСертификатовНаКлиенте(СертификатыДляАвторизации, ДополнительныеПараметры);
	Иначе   
		ОписаниеОповещения = Новый ОписаниеОповещения("СписокСертификатовДляАвторизацииПослеПолученияСертификатовНаКлиенте",
												  ЭтаФорма, ДополнительныеПараметры);
		ХранилищеСертификатовНаКлиенте.НачатьПолучениеВсех(ОписаниеОповещения);										  
	КонецЕсли;	
КонецПроцедуры
