
Процедура ЗаполнитьСписокСертификатов() 
	СписокСертификатовДляАутентификации.Очистить();
	ОписанияПрограмм = сбисПрограммыКриптографии();
	Если ОписанияПрограмм.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм, Неопределено);
	Если МенеджерКриптографии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	Если ХранилищеСертификатов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СертификатыНаКлиенте = ХранилищеСертификатов.ПолучитьВсе();
	ОписаниеОповещенияПослеПолученияСписка = Новый ОписаниеОповещения("СписокСертификатовДляАвторизации", ЭтаФорма);
	ДополнительныеПараметры = Новый Структура("ОбработчикРезультата", ОписаниеОповещенияПослеПолученияСписка);
	СписокСертификатовДляАвторизацииПослеПолученияСертификатовНаКлиенте(СертификатыНаКлиенте, ДополнительныеПараметры);	
КонецПроцедуры
