
Процедура ЗаполнитьСписокСертификатов() 
	ОписанияПрограмм = сбисПрограммыКриптографии();
	Если ОписанияПрограмм.Количество() <> 0 Тогда
		МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм, Неопределено);
		ОписаниеОповещенияПослеПолученияСписка = Новый ОписаниеОповещения("СписокСертификатовДляАвторизации", ЭтаФорма);
		ДополнительныеПараметры = Новый Структура("ОбработчикРезультата", ОписаниеОповещенияПослеПолученияСписка);
		СписокСертификатовДляАвторизацииПослеПолученияМенеджераКриптографии(МенеджерКриптографии, ДополнительныеПараметры);
	КонецЕсли;	
КонецПроцедуры
