
&НаКлиенте
Процедура LoggingCatalogОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапускаПриложения = Новый Структура;	
	ПараметрыЗапускаПриложения.Вставить("Link", Элемент.Значение);
	API_ADDON_OPENURL(ПараметрыЗапускаПриложения);
КонецПроцедуры


&НаКлиенте
Процедура ExchangeCatalogОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапускаПриложения = Новый Структура;	
	ПараметрыЗапускаПриложения.Вставить("Link", Элемент.Значение);
	API_ADDON_OPENURL(ПараметрыЗапускаПриложения);
КонецПроцедуры
