
&НаКлиенте
Процедура ПолучитьСправкуОСпособахОбмена(Команда)
	Link = "https://saby.ru/help/integration/1C_set/modul/tech#_operaczionnaya_sistema_i_kriptoprovajder";
	Если НРег(Country) = "kz" Тогда
		Link = "https://setty.kz/help/integration/1C_set/kedo/install";
	КонецЕсли;	
	ПараметрыЗапускаПриложения = Новый Структура;
	ПараметрыЗапускаПриложения.Вставить("Link", Link); 
	API_ADDON_OPENURL(ПараметрыЗапускаПриложения);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСправкуОССоАвторизации(Команда)
	// TODO Кзнать корректный адрес
	ПараметрыЗапускаПриложения = Новый Структура;
	ПараметрыЗапускаПриложения.Вставить("Link", "https://saby.ru/help/integration/sso/add_sso"); 
	API_ADDON_OPENURL(ПараметрыЗапускаПриложения);
КонецПроцедуры

&НаКлиенте
Процедура AdvancedLogПриИзменении(Элемент)
	ЭлФорм = ПолучитьЭлементыФормы();
	Если ЭтаФорма.AdvancedLog Тогда
		ЭлФорм.AdvancedLog.Заголовок = "Сохранять логи в каталоге";
		ЭлФорм.LoggingCatalog.Видимость = Истина;
	Иначе
		ЭлФорм.AdvancedLog.Заголовок = "Сохранять логи";
		ЭлФорм.LoggingCatalog.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_Авторизация_НастройкиПодключенияПроксиОсобенностиПриложения
#КонецОбласти

&НаКлиенте
Процедура ПроверитьРаботуКомпоненты() 
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ОшибкаНастройки.Заголовок = "";
	Если exchange_method <> "SabyPluginConnector" Тогда
		Возврат;
	КонецЕсли;
	Попытка 
		ПутьКомпоненты = ПолучитьПутьКомпоненты(exchange_method);
		Выполнить("НачатьУстановкуВнешнейКомпоненты(, ПутьКомпоненты)");
	Исключение  
		Попытка
			// BSLLS:UsingSynchronousCalls-off
			УстановитьВнешнююКомпоненту(ПутьКомпоненты);
			// BSLLS:UsingSynchronousCalls-on
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
			ЭлементыФормочки.ОшибкаНастройки.Заголовок = ExtExceptionToMessage(ОшибкаСтруктура);
		КонецПопытки;
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура КонтурПриИзменении(Элемент)
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУРЛОбновитьЗаголовок()
	СформироватьУРЛ();
	ОбновитьЗаголовок();
КонецПроцедуры

#Область include_core_base_Настройки_НастрйкиПроксиСервера
#КонецОбласти

#Область include_core_base_Транспорт_ИмяСвойстваТранспорта //&НаСервереБезКонтекста 
#КонецОбласти

&НаКлиенте
Процедура СформироватьУРЛ()
	api_url = "https://" + ПрефиксКонтур() + ПрефиксГОСТ() + Domain + "." + Country;
	ЭтаФорма.context_params.Вставить("ApiUrl", api_url);
	ЭтаФорма.context_params.Вставить(ИмяСвойстваТранспорта(), ЭтаФорма.exchange_method);
	ЭтаФорма.context_params.Вставить("GostTls", GostTls);
	ЭтаФорма.context_params.Вставить("Country", Country);
	ЭтаФорма.context_params.Вставить("Domain", Domain);
	ЭтаФорма.context_params.Вставить("Contour", Contour);
	ЭтаФорма.context_params.Вставить("AuthSSOUrl", AuthSSOUrl);
КонецПроцедуры

 &НаКлиенте
Функция ПрефиксКонтур()
	Если ЗначениеЗаполнено(Contour) Тогда
		Префикс = Contour + "-";
	Иначе
		Префикс = "";
	КонецЕсли;
	Возврат Префикс;	
КонецФункции

&НаКлиенте
Функция ПрефиксГОСТ()
	Если GostTls = Ложь Тогда
		Префикс = "online.";
	Иначе
		Префикс = "g.";
	КонецЕсли;
	Возврат Префикс;	
КонецФункции

&НаКлиенте
Процедура СпособОбменаПриИзменении(Элемент)
	УстановитьВидимостьВключенияГОСТШифрования();
	УстановитьВидимостьНастроекСпособаОбмена();
	УстановитьВидимостьГОСТШифрования();
	СформироватьУРЛОбновитьЗаголовок();
	ПроверитьРаботуКомпоненты();
	УстановитьВидимостьНастроекПрокси();
	УстановитьДоступностьХраненияНастроек();
	СпособОбменаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНастроекСпособаОбмена()
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.НастройкиСпособаОбменаПраво.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.НастройкиСпособаОбменаПраво, exchange_method);
	ЭлФорм.НастройкиСпособаОбменаНиз.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.НастройкиСпособаОбменаНиз, "Настройки" + exchange_method);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНастроекПрокси()
	// BSLLS:LineLength-off
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ЭтоВидТранспортаExtSdk(context_params) Тогда
		ЭлементыФормочки.ГруппаПараметрыПрокси.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ГруппаПараметрыПрокси, "ПараметрыПроксиНедоступны");
		ЭлементыФормочки.ПроксиПлагин.Заголовок = "Используются параметры прокси десктопного приложения " + ЛокализацияНазваниеПродукта();
	ИначеЕсли exchange_method = "SabyConnect" И Найти(ЭтаФорма.Заголовок, "Настройки") = 0 Тогда
		ЭлементыФормочки.ГруппаПараметрыПрокси.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ГруппаПараметрыПрокси, "ПараметрыПроксиКаталог");	
	ИначеЕсли exchange_method = "SabyConnect" И Найти(ЭтаФорма.Заголовок, "Настройки") > 0 Тогда
		ЭлементыФормочки.ГруппаПараметрыПрокси.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ГруппаПараметрыПрокси, "ПараметрыПроксиКаталогНастройки");				
	Иначе
		ЭлементыФормочки.ГруппаПараметрыПрокси.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ГруппаПараметрыПрокси, "ПараметрыПроксиДоступны");		
		УстановитьЗаголовокПроксиИнфо();
	КонецЕсли;
	// BSLLS:LineLength-on
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьХраненияНастроек()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если exchange_method = "SabyConnect" Тогда
		ЭтаФорма.ИспользоватьНастройкиИзКаталога = Истина;
		ЭлементыФормочки.ИспользоватьНастройкиИзКаталога.Доступность = Ложь;
	Иначе
		ЭтаФорма.ИспользоватьНастройкиИзКаталога = get_prop(context_params, "ИспользоватьНастройкиИзКаталога", Ложь);
		ЭлементыФормочки.ИспользоватьНастройкиИзКаталога.Доступность = Истина;		
	КонецЕсли;
	ИспользоватьНастройкиИзКаталогаПриИзменении(ЭтаФорма.ИспользоватьНастройкиИзКаталога);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьВключенияГОСТШифрования()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлемShowGostTls = ЭлементыФормочки.Найти("ShowGostTls" + exchange_method);
	Если ЭлемShowGostTls <> Неопределено Тогда
		ЭлемShowGostTls.Видимость = Country = "ru";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГОСТШифрования()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлемGostTls = ЭлементыФормочки.Найти("GostTls" + exchange_method);
	Если ЭлемGostTls <> Неопределено Тогда 
		ЭлемGostTls.Видимость = Country = "ru" И ShowGostTls > 6;
		Если Не ЭлемGostTls.Видимость тогда
			ЭтаФорма.GostTls = Ложь;
		КонецЕсли;
	Иначе
		ЭтаФорма.GostTls = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтранаПриИзменении(Элемент)
	ЗаполнитьСписокПриложений();
	ЗаполнитьСписокКонтуров();
	УстановитьВидимостьВключенияГОСТШифрования();
	УстановитьВидимостьГОСТШифрования();
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ГОСТТЛСПриИзменении(Элемент)
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ПриложениеПриИзменении(Элемент)
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьГОСТТЛСНажатие(Элемент)
	ShowGostTls = ShowGostTls + 1;
	УстановитьВидимостьГОСТШифрования();
КонецПроцедуры

Функция ПолучитьПутьКомпоненты(ИмяКомпоненты)
	МодульОбъекта = МодульОбъекта();
	ПутьКомпоненты = МодульОбъекта.АдресНативнойКомпонентыИзВнешнейОбработки(ИмяКомпоненты);	
	Возврат ПутьКомпоненты;	
КонецФункции

&НаКлиенте
Процедура УстановитьЗаголовокПроксиИнфо()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ProxyType = "NotUse" Тогда
		ЭлементыФормочки.ПроксиИнфо.Заголовок = "Не используется";
	ИначеЕсли ProxyType = "SystemSettings" Тогда
		ЭлементыФормочки.ПроксиИнфо.Заголовок = "Используются системные настройки";
	Иначе
		ЭлементыФормочки.ПроксиИнфо.Заголовок = ProxyProtocol + ";" + ProxyServer + ":" + Строка(Формат(ProxyPort, "ЧЦ=5; ЧДЦ=0; ЧН=0; ЧГ=0"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПриложений()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Domain.СписокВыбора.Очистить();
	Если Country = "ru" Тогда
		ЭлементыФормочки.Domain.СписокВыбора.Добавить("saby", "saby");
		ЭлементыФормочки.Domain.СписокВыбора.Добавить("sabyd", "sabyd");
		ЭлементыФормочки.Domain.СписокВыбора.Добавить("sabytest", "sabytest");
		ЭлементыФормочки.Domain.Подсказка = "saby - рабочий домен; sabytest - тестовый домен";
	Иначе
		ЭлементыФормочки.Domain.СписокВыбора.Добавить("setty", "setty");
		ЭлементыФормочки.Domain.Подсказка = "setty - рабочий домен";
	КонецЕсли;
	Если ЭлементыФормочки.Domain.СписокВыбора.НайтиПоЗначению(Domain) = Неопределено Тогда
		Domain = ЭлементыФормочки.Domain.СписокВыбора[0].Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокКонтуров()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Contour.СписокВыбора.Очистить();
	ЭлементыФормочки.Contour.СписокВыбора.Добавить("", "online");
	ЭлементыФормочки.Contour.СписокВыбора.Добавить("fix", "fix");
	Если Country = "ru" Тогда
		ЭлементыФормочки.Contour.СписокВыбора.Добавить("test", "test");
		ЭлементыФормочки.Contour.СписокВыбора.Добавить("pre-test", "pre-test");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметрыПрокси(Команда)
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.СтраницыНастройкиПодключенияПрокси.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыНастройкиПодключенияПрокси, "НастройкиПрокси");
	УстановитьДоступностьНастройкиПрокси();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	ОбязательныеНастройкиЗаполнены = ПроверитьОбязательныеНастройкиПодключенияПрокси();
	Если ОбязательныеНастройкиЗаполнены Тогда
		ЭлФорм = ПолучитьЭлементыФормы();
		ПереключитьСтраницуНастройкиПодключенияПрокси();
		ЭлФорм.СтраницыНастройкиПодключенияПрокси.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыНастройкиПодключенияПрокси, "НастройкиПодключения");
		УстановитьВидимостьНастроекСпособаОбмена();
		УстановитьВидимостьНастроекПрокси();
		УстановитьДоступностьХраненияНастроек();
		ОчиститьСообщения();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНастройкиИзКаталогаПриИзменении(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.КаталогХраненияНастроек.Видимость = ЭтаФорма.ИспользоватьНастройкиИзКаталога;
КонецПроцедуры

&НаКлиенте
Процедура КаталогХраненияНастроекНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	КаталогХраненияНастроек	= Saby_ВыбратьКаталог(КаталогХраненияНастроек);
КонецПроцедуры


#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_Авторизация_СписокСтран
#КонецОбласти

&НаКлиенте
Процедура ТипПроксиПриИзменении(Элемент)
	УстановитьДоступностьНастройкиПрокси();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьНастройкиПрокси()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ДоступностьПрокси = ProxyType = "OtherSettings";
	ЭлементыФормочки.ПроксиПротокол.Доступность = ДоступностьПрокси;
	УстановитьЭлементуОтметкуНезаполненногоПоРеквизиту(ЭлементыФормочки.ПроксиПротокол, ДоступностьПрокси, ЭтаФорма.ProxyProtocol);
	ЭлементыФормочки.ПроксиСервер.Доступность = ДоступностьПрокси;
	УстановитьЭлементуОтметкуНезаполненногоПоРеквизиту(ЭлементыФормочки.ПроксиСервер, ДоступностьПрокси, ЭтаФорма.ProxyServer);
	ЭлементыФормочки.ПроксиПорт.Доступность = ДоступностьПрокси;
	ЭлементыФормочки.ИспользоватьАутентификациюОС.Доступность = ДоступностьПрокси;
	ЭлементыФормочки.ПроксиЛогин.Доступность = ДоступностьПрокси;
	ЭлементыФормочки.ПроксиПароль.Доступность = ДоступностьПрокси;
	ЭлементыФормочки.ВзятьНастройкиПроксиИз1С.Доступность = ДоступностьПрокси;
КонецПроцедуры

&НаКлиенте
Процедура ExchangeCatalogНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	ExchangeCatalog	= Saby_ВыбратьКаталог(ExchangeCatalog);
КонецПроцедуры

&НаКлиенте
Функция Saby_ВыбратьКаталог(СтароеЗначение)
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог		= СтароеЗначение;
	ДиалогОткрытия.Заголовок	= "Выберите каталог"; 
	Если ДиалогОткрытия.Выбрать() Тогда 
		Возврат ДиалогОткрытия.Каталог; 
	КонецЕсли;
	
	Возврат	СтароеЗначение;
	
КонецФункции

&НаКлиенте
Процедура LoggingCatalogНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	LoggingCatalog	= Saby_ВыбратьКаталог(LoggingCatalog);
КонецПроцедуры

&НаКлиенте
Процедура ПроксиПарольНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭтаФорма.ProxyPassword = ЭлементыФормочки.ПроксиПароль.ТекстРедактирования;
	ЭлементыФормочки.ПроксиПароль.Видимость = Ложь;
	Если ЭлементыФормочки.ПроксиПароль.РежимПароля Тогда 	
		ЭлементыФормочки.ПроксиПароль.РежимПароля = Ложь;
		Попытка
			ЭлементыФормочки.ПроксиПароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.СкрытьПароль;
		Исключение                  
			ЭлементыФормочки.ПроксиПароль.КнопкаВыбора = Ложь;	
		КонецПопытки;
   	Иначе
		ЭлементыФормочки.ПроксиПароль.РежимПароля = Истина;
		Попытка
			ЭлементыФормочки.ПроксиПароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.ПоказатьПароль;
		Исключение                  
			ЭлементыФормочки.ПроксиПароль.КнопкаВыбора = Ложь;	
		КонецПопытки;
	КонецЕсли; 
	ЭлементыФормочки.ПроксиПароль.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьОбязательныеНастройкиПодключенияПрокси()
	ЭлФорм = ПолучитьЭлементыФормы();
	УстановитьЭлементуОтметкуНезаполненногоПоРеквизиту(ЭлФорм.ПроксиПротокол, ProxyType = "OtherSettings", ЭтаФорма.ProxyProtocol);
	УстановитьЭлементуОтметкуНезаполненногоПоРеквизиту(ЭлФорм.ПроксиСервер, ProxyType = "OtherSettings", ЭтаФорма.ProxyServer);
	Если ЭлФорм.СтраницыНастройкиПодключенияПрокси.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыНастройкиПодключенияПрокси, "НастройкиПрокси") И
		ProxyType = "OtherSettings" И 
		(Не ЗначениеЗаполнено(ЭтаФорма.ProxyProtocol) Или Не ЗначениеЗаполнено(ЭтаФорма.ProxyServer)) Тогда
		Сообщить("Заполните обязательные поля или выберите другой тип настроек прокси");
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура УстановитьЭлементуОтметкуНезаполненногоПоРеквизиту(ЭлФормы, ДоступностьЭлФормы, ЗначениеРеквизита)
	// BSLLS:IfElseIfEndsWithElse-off
	Если Не ДоступностьЭлФормы Тогда
		ЭлФормы.АвтоОтметкаНезаполненного = Ложь;
		ЭлФормы.ОтметкаНезаполненного = Ложь;
	ИначеЕсли ДоступностьЭлФормы И Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ЭлФормы.АвтоОтметкаНезаполненного = Истина;
		ЭлФормы.ОтметкаНезаполненного = Истина;	
	КонецЕсли;
	// BSLLS:IfElseIfEndsWithElse-on
КонецПроцедуры

#Область include_core_base_Транспорт_ВидТранспорта //&НаСервереБезКонтекста 
#КонецОбласти
