
&НаКлиенте
Процедура LoggingCatalogОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапускаПриложения = Новый Структура;	
	ПараметрыЗапускаПриложения.Вставить("Link", Элемент.Значение);
	API_ADDON_OPENURL(ПараметрыЗапускаПриложения);
КонецПроцедуры


&НаКлиенте
Процедура ExchangeCatalogОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапускаПриложения = Новый Структура;	
	ПараметрыЗапускаПриложения.Вставить("Link", Элемент.Значение);
	API_ADDON_OPENURL(ПараметрыЗапускаПриложения);
КонецПроцедуры

&НаКлиенте
Процедура КаталогХраненияНастроекОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапускаПриложения = Новый Структура;	
	ПараметрыЗапускаПриложения.Вставить("Link", Элемент.Значение);
	API_ADDON_OPENURL(ПараметрыЗапускаПриложения);
КонецПроцедуры

&НаКлиенте
Процедура ExchangeCatalogНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	ExchangeCatalog	= Saby_ВыбратьКаталог(ExchangeCatalog);
	ЭтаФорма.context_params.Вставить("ExchangeCatalog",	ExchangeCatalog);
КонецПроцедуры

&НаКлиенте
Функция Saby_ВыбратьКаталог(СтароеЗначение)
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог		= СтароеЗначение;
	ДиалогОткрытия.Заголовок	= "Выберите каталог"; 
	Если ДиалогОткрытия.Выбрать() Тогда 
		Возврат ДиалогОткрытия.Каталог; 
	КонецЕсли;
	
	Возврат	СтароеЗначение;
	
КонецФункции

&НаКлиенте
Процедура LoggingCatalogНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	LoggingCatalog	= Saby_ВыбратьКаталог(LoggingCatalog);
	ЭтаФорма.context_params.Вставить("LoggingCatalog",	LoggingCatalog);
КонецПроцедуры


&НаКлиенте
Процедура КаталогХраненияНастроекНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	КаталогХраненияНастроек = Saby_ВыбратьКаталог(КаталогХраненияНастроек);
КонецПроцедуры

