&НаКлиенте
Процедура LoggingCatalogОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапускаПриложения = Новый Структура;	
	ПараметрыЗапускаПриложения.Вставить("Link", Элемент.ТекстРедактирования);
	API_ADDON_OPENURL(ПараметрыЗапускаПриложения);
КонецПроцедуры

&НаКлиенте
Процедура ExchangeCatalogОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапускаПриложения = Новый Структура;	
	ПараметрыЗапускаПриложения.Вставить("Link", Элемент.ТекстРедактирования);
	API_ADDON_OPENURL(ПараметрыЗапускаПриложения);
КонецПроцедуры

&НаКлиенте
Процедура КаталогХраненияНастроекОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапускаПриложения = Новый Структура;	
	ПараметрыЗапускаПриложения.Вставить("Link", Элемент.ТекстРедактирования);
	API_ADDON_OPENURL(ПараметрыЗапускаПриложения);
КонецПроцедуры

&НаКлиенте
Процедура ExchangeCatalogНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    Saby_ВыбратьКаталог(ExchangeCatalog, "ExchangeCatalog");
КонецПроцедуры

&НаКлиенте
Процедура Saby_ВыбратьКаталог(СтароеЗначение, ИмяРеквизита)

	ДиалогОткрытия = Новый ДиалогВыбораФайла(
		РежимДиалогаВыбораФайла.ВыборКаталога);

	ДиалогОткрытия.Каталог = СтароеЗначение;
	ДиалогОткрытия.Заголовок = "Выберите каталог";

	Оповещение = Новый ОписаниеОповещения(
		"Saby_ВыборКаталогаЗавершен",
		ЭтаФорма,
		ИмяРеквизита);

	ДиалогОткрытия.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура Saby_ВыборКаталогаЗавершен(Результат, ИмяРеквизита) Экспорт

	Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
       ЭтаФорма[ИмяРеквизита] = Результат[0];
	КонецЕсли;

    ЭтаФорма.context_params.Вставить(ИмяРеквизита, ЭтаФорма[ИмяРеквизита]);
КонецПроцедуры

&НаКлиенте
Процедура LoggingCatalogНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Saby_ВыбратьКаталог(LoggingCatalog, "LoggingCatalog");
КонецПроцедуры

&НаКлиенте
Процедура КаталогХраненияНастроекНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Saby_ВыбратьКаталог(КаталогХраненияНастроек, "КаталогХраненияНастроек");
КонецПроцедуры


#Область include_core_base_Helpers_ExtException //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти


