&НаКлиенте
Процедура LoggingCatalogОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапускаПриложения = Новый Структура;	
	ПараметрыЗапускаПриложения.Вставить("Link", Элемент.ТекстРедактирования);
	API_ADDON_OPENURL(ПараметрыЗапускаПриложения);
КонецПроцедуры


&НаКлиенте
Процедура ExchangeCatalogОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапускаПриложения = Новый Структура;	
	ПараметрыЗапускаПриложения.Вставить("Link", Элемент.ТекстРедактирования);
	API_ADDON_OPENURL(ПараметрыЗапускаПриложения);
КонецПроцедуры

#Область include_core_base_Helpers_ExtException
#КонецОбласти

#Область include_core_base_Helpers_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти


