
&НаКлиенте
Процедура ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции, ОбработчикПослеАвторизации, ВладелецФормы = Неопределено) Экспорт
	session = ТранспортИнтеграции.СвойствоСессии(context_params, "session");
	Если ЗначениеЗаполнено(session) Тогда
		ВыполнитьSabyОписаниеОповещения(ОбработчикПослеАвторизации, context_params);
	ИначеЕсли get_prop(context_params, "AutoAuth", Ложь) Тогда
		Попытка
			ТранспортИнтеграции.ВойтиТранспорт(context_params);
			ВыполнитьSabyОписаниеОповещения(ОбработчикПослеАвторизации, context_params);
		Исключение
			ОткрытьФормуОбработки("Вход", ,ВладелецФормы , , ОбработчикПослеАвторизации);
		КонецПопытки;
	Иначе
		ОткрытьФормуОбработки("Вход", ,ВладелецФормы , , ОбработчикПослеАвторизации);
	КонецЕсли;
КонецПроцедуры

