
//DynamicDirective

Функция АвторизоватьсяПоСертификату(context_params)
	Сертификат = get_prop(context_params, "Сертификат");
	Отпечаток = get_prop(Сертификат, "Отпечаток", Неопределено); 
	ОписанияПрограмм = сбисПрограммыКриптографии();
	Если get_prop(Сертификат, "Сервер1С", Ложь) = Истина Тогда
		СертДвоичныеДанные = сбисДвоичныеДанныеСертификатаПоОтпечаткуНаСервере(ОписанияПрограмм, Отпечаток);
	Иначе
		#Если Клиент Тогда
		СертДвоичныеДанные = сбисДвоичныеДанныеСертификатаПоОтпечаткуНаКлиенте(ОписанияПрограмм, Отпечаток);	
		#КонецЕсли
	КонецЕсли;	
	result = ТранспортИнтеграции.local_helper_auth_by_sert(context_params, СертДвоичныеДанные);	
	
	Если get_prop(Сертификат, "Сервер1С", Ложь) = Истина Тогда
		Base64РасшифрованныеДанные = сбисРасшифроватьНаСервере(ОписанияПрограмм, get_prop(result, "result"));
	Иначе     
		#Если Клиент Тогда
		Base64РасшифрованныеДанные = сбисРасшифроватьНаКлиенте(ОписанияПрограмм, get_prop(result, "result"));	
		#КонецЕсли
	КонецЕсли;	
	ДДРасшифрованныеДанные = Base64Значение(Base64РасшифрованныеДанные);
	// BSLLS:UsingSynchronousCalls-off
	// BSLLS:TempFilesDir-off
	ИмяВрФ = КаталогВременныхФайлов()+"sbisTemp.txt";
	// BSLLS:UsingSynchronousCalls-on
	// BSLLS:TempFilesDir-on
	ДДРасшифрованныеДанные.Записать(ИмяВрФ);
	ЧтениеОтвета = Новый ЧтениеТекста(ИмяВрФ, КодировкаТекста.UTF8, Символы.ПС);
	session = ЧтениеОтвета.Прочитать();
	ЧтениеОтвета.Закрыть(); 
	// BSLLS:MissingCodeTryCatchEx-off
	Попытка
		// BSLLS:UsingSynchronousCalls-off
		УдалитьФайлы(ИмяВрФ);
		// BSLLS:UsingSynchronousCalls-on
	Исключение
	КонецПопытки;
	// BSLLS:MissingCodeTryCatchEx-on
	Возврат session; 
КонецФункции
