
//DynamicDirective

Функция Saby_РасшифроватьДанные(context_params, Данные, ПереданныеОписанияПрограмм = Неопределено, СертификатРасположение = "Клиентский", ПарольЗакрытогоКлюча = Неопределено) Экспорт 
	ОписанияПрограмм = ПереданныеОписанияПрограмм;
	Если ОписанияПрограмм = Неопределено Тогда
		ОписанияПрограмм = ПрограммыКриптографии();
	КонецЕсли;
	Попытка
		Если СертификатРасположение = "Клиентский" Тогда
			Base64РасшифрованныеДанные = сбисРасшифроватьНаКлиенте(ОписанияПрограмм, Данные, ПарольЗакрытогоКлюча);
		Иначе
			Base64РасшифрованныеДанные = сбисРасшифроватьНаСервере(ОписанияПрограмм, Данные, ПарольЗакрытогоКлюча);
		КонецЕсли;
	Исключение   
		ИнфОбОшибке = ИнформацияОбОшибке();
		type = "Exception";
		message = ИнфОбОшибке.Причина.Описание; 
		ПричинаПарольЗакрытогоКлюча = "указан неправильный пароль доступа к закрытому ключу";
		Причина0x80090022 = "0x80090022"; // Для Крипто-Про 5.0
		Если Найти(message, ПричинаПарольЗакрытогоКлюча) > 0
				Или Найти(message, Причина0x80090022) > 0 Тогда
			type = "InputSertPassword";
		КонецЕсли;	
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,,,"РасшифровкаДанных", Данные, type);
	КонецПопытки;	
	
	ДДРасшифрованныеДанные = Base64Значение(Base64РасшифрованныеДанные);
	// BSLLS:UsingSynchronousCalls-off
	// BSLLS:TempFilesDir-off
	ИмяВрФ = КаталогВременныхФайлов() + "sbisTemp.txt";
	// BSLLS:UsingSynchronousCalls-on
	// BSLLS:TempFilesDir-on
	ДДРасшифрованныеДанные.Записать(ИмяВрФ);
	ЧтениеОтвета = Новый ЧтениеТекста(ИмяВрФ, КодировкаТекста.UTF8, Символы.ПС);
	Результат = ЧтениеОтвета.Прочитать();
	ЧтениеОтвета.Закрыть(); 
	// BSLLS:UsingSynchronousCalls-off - для совместимости со старыми платформами
	УдалитьФайлы(ИмяВрФ);
    Возврат Результат;

КонецФункции

//DynamicDirective

Функция local_helper_auth_by_certificate(context_params)
	Отпечаток = get_prop(context_params, "Certificate", Неопределено); 
	ОписанияПрограмм = ПрограммыКриптографии();
	
	СертификатРасположение = СертификатНаКлиентеНаСервере(Отпечаток);
	
	Если СертификатРасположение = "Клиентский" Тогда 
		СертДвоичныеДанные = сбисДвоичныеДанныеСертификатаПоОтпечаткуНаКлиенте(ОписанияПрограмм, Отпечаток);
	ИначеЕсли СертификатРасположение = "Серверный" Тогда
		СертДвоичныеДанные = сбисДвоичныеДанныеСертификатаПоОтпечаткуНаСервере(ОписанияПрограмм, Отпечаток); 
	Иначе
		ВызватьИсключение "Не удалось определить расположение сертификата по отпечатку " + Строка(Отпечаток);	
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(СертДвоичныеДанные) Тогда
		ВызватьИсключение "Не удалось получить двоичные данные сертификата по отпечатку " + Строка(Отпечаток);
	КонецЕсли;
	
	result = ТранспортИнтеграции.local_helper_auth_by_sert(context_params, СертДвоичныеДанные);	
	session = ТранспортИнтеграции.Saby_РасшифроватьДанные(context_params, get_prop(result, "result"), ОписанияПрограмм, СертификатРасположение);
		// BSLLS:UsingSynchronousCalls-on
	Возврат session; 

КонецФункции

&НаСервере
Функция СертификатПоОтпечаткуВХранилищеЗначений(ИмяХранилища, Отпечаток)
	КэшЛокальныхСертификатов = ПрочитатьИзХранилища("Saby", ИмяХранилища);
	Отпечатки = get_prop(КэшЛокальныхСертификатов, "Отпечатки", Новый Массив);
	Для Каждого Серт из Отпечатки Цикл
		СертОтпечаток = СтрЗаменить(Строка(Серт), " ", "");
		Если СертОтпечаток = Отпечаток Тогда 
			Возврат СертОтпечаток;
		КонецЕсли;
	КонецЦикла;	
	Возврат Неопределено;
КонецФункции	

&НаСервере
Функция СертификатНаКлиентеНаСервере(Отпечаток)
	СертификатНаКлиенте = СертификатПоОтпечаткуВХранилищеЗначений("КэшЛокальныхСертификатов", Отпечаток);
	
	Если СертификатНаКлиенте <> Неопределено Тогда 
		Возврат "Клиентский";
	КонецЕсли;
	СертификатНаСервере = СертификатПоОтпечаткуВХранилищеЗначений("КэшЛокальныхСертификатовНаСервере", Отпечаток);
	Если СертификатНаСервере <> Неопределено Тогда 
		Возврат "Серверный";
	КонецЕсли;
	Возврат Неопределено;	
КонецФункции
