
Функция ФИОИзНазванияНаСервере(Название) Экспорт
	ФИО = Название;
	
	МассивСобственности = Новый Массив;
	МассивСобственности.Добавить("ип ");
	МассивСобственности.Добавить("чп ");
	МассивСобственности.Добавить("индивидуальный предприниматель ");
	МассивСобственности.Добавить("адвокат ");
	МассивСобственности.Добавить("нотариус ");
	МассивСобственности.Добавить("предприниматель без образования юридического лица ");
	МассивСобственности.Добавить("пбоюл ");
	МассивСобственности.Добавить("предприниматель ");
	
	Для Каждого Запись Из МассивСобственности Цикл
		ДлинаНадписи = СтрДлина(Запись);
	    Если Сред(Нрег(Название),1,ДлинаНадписи) = Запись Тогда
	    	ФИО = СокрЛП(Сред(Название, ДлинаНадписи + 1));
		КонецЕсли;
	КонецЦикла;
	
	ФИО = СтрРазделить82(ФИО," ");
	
	Фамилия  = ?(ФИО.Количество()>0,ФИО[0],"");
	Имя      = ?(ФИО.Количество()>=2,ФИО[1],"");
	Отчество = "";
	Если ФИО.Количество()>=3 Тогда
		Для сч=2 по ФИО.Количество()-1 Цикл
			Отчество=Отчество+ФИО[сч]+" ";
		КонецЦикла;
		Отчество=СокрЛП(Отчество);
	КонецЕсли;
	Возврат Новый Структура("Фамилия,Имя,Отчество", Фамилия, Имя, Отчество);
КонецФункции

Функция ДанныеТекущегоПользователяНаСервере() Экспорт
	// функция ид текущего пользователя 1С	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	УстановитьПривилегированныйРежим(Истина);
	ФизЛицо = get_prop(ТекПользователь, "ФизическоеЛицо", Неопределено);
	Если ФизЛицо = Неопределено Тогда
		ФизЛицо = get_prop(ТекПользователь, "ФизЛицо", Неопределено);
	КонецЕсли;
	ДанныеСотрудника = Новый Структура("Сотрудник, Права", Новый Структура, Новый Структура("Роль", Новый Массив));
	ДанныеСотрудника.Сотрудник.Вставить("ИдентификаторИС", Строка(ФизЛицо.УникальныйИдентификатор()));
	ДанныеСотрудника.Сотрудник.Вставить("ИНН", get_prop(ФизЛицо, "ИНН", Неопределено));
	Попытка
		Фамилия = ФизЛицо.Фамилия;
		Имя = ФизЛицо.Имя;
		Отчество = ФизЛицо.Отчество;
	Исключение
		ФИО = ФИОИзНазванияНаСервере(ФизЛицо.Наименование);
		Фамилия = ФИО.Фамилия;
		Имя = ФИО.Имя;
		Отчество = ФИО.Отчество;
	КонецПопытки;
	ДанныеСотрудника.Сотрудник.Вставить("Фамилия", Фамилия);
	ДанныеСотрудника.Сотрудник.Вставить("Имя", Имя);
	ДанныеСотрудника.Сотрудник.Вставить("Отчество", Отчество);
	ДанныеСотрудника.Сотрудник.Вставить("ДоступВСистему", "Да");	
	Запрос = Новый Запрос();
	Если Метаданные.Справочники.Найти("ГруппыДоступа") <> Неопределено Тогда 
		// BSLLS:UnionAll-off Необходимо отказаться от дублирования ролей, поэтому используем ОБЪЕДИНИТЬ
		Запрос.Текст = "ВЫБРАТЬ
		               |	СоставыГруппПользователей.ГруппаПользователей КАК ГруппаПользователей
		               |ПОМЕСТИТЬ ГруппыПользователя
		               |ИЗ
		               |	РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
		               |ГДЕ
		               |	СоставыГруппПользователей.Пользователь = &Пользователь
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ГруппыДоступаПользователи.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ГруппыДоступа
		               |ИЗ
		               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		               |ГДЕ
		               |	ГруппыДоступаПользователи.Пользователь = &Пользователь
		               |	И ГруппыДоступаПользователи.Ссылка.ПометкаУдаления = ЛОЖЬ
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ГруппыДоступаПользователи.Ссылка
		               |ИЗ
		               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыПользователя КАК ГруппыПользователя
		               |		ПО ГруппыДоступаПользователи.Пользователь = ГруппыПользователя.ГруппаПользователей
		               |ГДЕ
		               |	ГруппыДоступаПользователи.Ссылка.ПометкаУдаления = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПрофилиГруппДоступа.Наименование КАК ПрофильНаименование
		               |ИЗ
		               |	Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыДоступа КАК ГруппыДоступа
		               |		ПО (ГруппыДоступа.Ссылка.Профиль = ПрофилиГруппДоступа.Ссылка)
		               |ГДЕ
		               |	ПрофилиГруппДоступа.ПометкаУдаления = ЛОЖЬ";
		// BSLLS:UnionAll-on			   
	ИначеЕсли Метаданные.Справочники.Найти("ГруппыПользователей") <> Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ГруппыПользователейПользователиГруппы.Ссылка.Наименование КАК ПрофильНаименование
		               |ИЗ
		               |	Справочник.ГруппыПользователей.ПользователиГруппы КАК ГруппыПользователейПользователиГруппы
		               |ГДЕ
		               |	ГруппыПользователейПользователиГруппы.Пользователь = &Пользователь
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ГруппыПользователейПользователиГруппы.Ссылка.Наименование"; 
	Иначе
		Возврат ДанныеСотрудника;
	КонецЕсли;

	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	ТабПрофили = Запрос.Выполнить().Выгрузить();
	Для Каждого Элемент Из ТабПрофили Цикл
		ДанныеСотрудника.Права.Роль.Добавить(Новый Структура("Название", Элемент.ПрофильНаименование));	
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ДанныеСотрудника;
КонецФункции

//DynamicDirective

Функция local_helper_auth_by_token(context_params) Экспорт 	
	Результат = Неопределено;
	Токен = ТокенДляТекущегоПользователя(context_params);
	
	Попытка
		params = Новый Структура("Token, Params", Токен, Новый Структура());;
		url = context_params.api_url + "/auth/service/";
		Результат = local_helper_exec_method(context_params, "СБИС.ExternalAuth", params, Ложь, ,url);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,,,,,"Unauthorized" );
	КонецПопытки;
	Возврат Результат;
КонецФункции

//DynamicDirective

Функция local_helper_auth_by_app(ИДПриложения, КлючПриложения, КлючАутентификации, context_params) Экспорт 
	
	Попытка
		params = Новый Структура("app_client_id, app_secret, secret_key", ИДПриложения, КлючПриложения, КлючАутентификации);  
		url = СтрЗаменить(context_params.api_url, "ie-1c","online");
		
		url = url + "/oauth/service/";
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,"Не заполнен параметр аутентификации",ИнфОбОшибке.Описание,,,"Unauthorized" );
	КонецПопытки;
	Попытка
		result = local_helper_exec_method(context_params, "", params, Ложь, ,url);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,,,,,"Unauthorized" );
	КонецПопытки;
	
	Возврат get_prop(result,"sid");
КонецФункции

//DynamicDirective

Функция ТокенДляТекущегоПользователя(context_params) Экспорт
	
	ДанныеСотрудника = ДанныеТекущегоПользователяНаСервере();
	
	ИдСотрИС = ДанныеСотрудника.Сотрудник.ИдентификаторИС;
	Если ИдСотрИС = "00000000-0000-0000-0000-000000000000" Тогда  
		ВызватьИсключение NewExtExceptionСтрока(,"Не удалось получить идентификатор сотрудника. Возможно текущий пользователь 1С не связан с физическим лицом.",,,,"Unauthorized" );
	КонецЕсли;
	
	context_params_API = Новый Структура;
	Для Каждого КлючИЗначение Из context_params Цикл
		context_params_API.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение); 
	КонецЦикла;
	context_params_API.Вставить(ИмяСвойстваТранспорта(), "API");	
	Результат = ТокенДляТекущегоПользователяПоAPI(ДанныеСотрудника, context_params_API);
	Возврат Результат
КонецФункции

//DynamicDirective

Функция local_helper_read_employee(ДанныеСотрудника, context_params) Экспорт      
	params = Новый Структура("Параметр", ДанныеСотрудника);
	Попытка
		result = local_helper_exec_method(context_params, "СБИС.ПрочитатьСотрудника", params, Ложь);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		Возврат ИнфОбОшибке;
	КонецПопытки;
	Возврат result;
КонецФункции

//DynamicDirective

Функция сбисЗаписатьСотрудникаНаСервере(ДанныеСотрудника, context_params) Экспорт      
	params = Новый Структура("Параметр", ДанныеСотрудника);
	Попытка
		result = local_helper_exec_method(context_params, "СБИС.ЗаписатьСотрудника", params, Ложь);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		Возврат ИнфОбОшибке;
	КонецПопытки;
	Возврат result;
КонецФункции

//DynamicDirective

Функция local_helper_link_external_user( ИдСотрИС, ИдСотрСБИС, context_params) Экспорт
	params = Новый Структура("ExternalId, FaceId", ИдСотрИС, ИдСотрСБИС);
	Попытка
		result = local_helper_exec_method(context_params, "User.LinkExternalUser", params, Ложь);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		Возврат ИнфОбОшибке;
	КонецПопытки;
	Возврат result;
КонецФункции

//DynamicDirective

Функция ТокенПоИдентификатору(ИдСотрИС, context_params) Экспорт  
	Попытка
		params = Новый Структура("ExternalId", ИдСотрИС);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,"Не заполнен параметр аутентификации",ИнфОбОшибке.Описание,,,"Unauthorized" );
	КонецПопытки;
	
	Попытка
		result = local_helper_exec_method(context_params, "User.GetTokenByExternalId", params, Ложь);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,,,,,"Unauthorized" );
	КонецПопытки;
	Возврат get_prop(result,"result");		
КонецФункции	

//DynamicDirective

Функция СоздаватьСотрудникаПоПрофилю(ДанныеСотрудника, Настройки)
	СоздаватьСотрудника = Ложь;
	Для Каждого Стр Из Настройки.Профили Цикл
		Для Каждого Элемент Из ДанныеСотрудника.Права.Роль Цикл
			Если Стр.Наименование = Элемент.Название Тогда
				СоздаватьСотрудника = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;						
	КонецЦикла;
    Возврат СоздаватьСотрудника;
КонецФункции	

//DynamicDirective

Функция ТокенДляТекущегоПользователяПоAPI(ДанныеСотрудника, context_params) Экспорт
		Настройки = ПрочитатьИзХранилища("СБИС", "Авторизация",,"ПользовательСБИС"); 
	ТекстUnauthorized = "Unauthorized";
	Если Настройки = Неопределено Тогда
		ТекстОшибки = "Не заполнены данные администратора системы для авторизации по токену.";
		ВызватьИсключение NewExtExceptionСтрока(, ТекстОшибки, , , , ТекстUnauthorized);
	КонецЕсли;
	Если get_prop(Настройки, "ВидБесшовнойАвторизации") = 1 Тогда	
		ИдентификаторСессииАдминистратора = local_helper_auth_by_app(Настройки.ИДПриложения, Настройки.КлючПриложения, Настройки.КлючАутентификации, context_params);	
	Иначе	
		ИдентификаторСессииАдминистратора = local_helper_auth_by_login_password(context_params, Настройки.Логин, Настройки.Пароль);	
	КонецЕсли;
	
	Если ИдентификаторСессииАдминистратора = Неопределено Тогда
		ТекстОшибки = "Не удалось получить сессию администратора. Проверьте настройки бесшовной авторизации.";
		ВызватьИсключение NewExtExceptionСтрока(, ТекстОшибки, , , , ТекстUnauthorized);	
	КонецЕсли;	
	session = Новый Структура;
	session.Вставить("session", ИдентификаторСессииАдминистратора);
	// BSLLS:DeprecatedCurrentDate-off
	session.Вставить("session_begin", ТекущаяДата());
	// BSLLS:DeprecatedCurrentDate-on
    ЗаписатьСессию(context_params, session); 
	
	ИдСотрИС = ДанныеСотрудника.Сотрудник.ИдентификаторИС;

	Токен = ТокенПоИдентификатору(ИдСотрИС, context_params);
	
	Если ЗначениеЗаполнено(Токен) Тогда 
		Возврат Токен;
	КонецЕсли;
	СтруктураПоискаСотрудника = Новый Структура("ИдентификаторИС", ИдСотрИС); 
	ИННСотрудника = get_prop(ДанныеСотрудника.Сотрудник, "ИНН"); 
	Если ЗначениеЗаполнено(ИННСотрудника) Тогда  
		СтруктураПоискаСотрудника.Вставить("ИНН", ИННСотрудника);	
	КонецЕсли;
	СотрудникПоиска = Новый Структура("Сотрудник", СтруктураПоискаСотрудника);
	СтруктураРезультата = local_helper_read_employee(СотрудникПоиска, context_params);
	Если ТипЗнч(СтруктураРезультата) = Тип("ИнформацияОбОшибке") Тогда
		Описание = ЗначениеИзСтрокиВнутрНаСервере(СтруктураРезультата.Описание); 
		message = get_prop(Описание,"message");
		Если Лев(message, 27) <> "Не удалось найти сотрудника" Тогда 
			ВызватьИсключение NewExtExceptionСтрока(СтруктураРезультата, , , , , ТекстUnauthorized);
		КонецЕсли;
		СоздаватьСотрудника = СоздаватьСотрудникаПоПрофилю(ДанныеСотрудника, Настройки);
		Если Не СоздаватьСотрудника Тогда 
			ВызватьИсключение NewExtExceptionСтрока(СтруктураРезультата, , , , , ТекстUnauthorized);
		КонецЕсли;	
		СтруктураРезультата = сбисЗаписатьСотрудникаНаСервере(ДанныеСотрудника, context_params);
		Если ТипЗнч(СтруктураРезультата) = Тип("ИнформацияОбОшибке") Тогда
			ВызватьИсключение NewExtExceptionСтрока(СтруктураРезультата, , , , , ТекстUnauthorized);
		КонецЕсли; 	
	КонецЕсли;
	СтруктураРезультата = get_prop(СтруктураРезультата,"result");
	Сотрудник = get_prop(СтруктураРезультата,"Сотрудник"); 
	Если get_prop(Сотрудник, "ДоступВСистему", "Нет") = "Нет" Тогда 
		ТекстОшибки = "Пользователю запрещен доступ в " + ЛокализацияНазваниеПродукта();
		ВызватьИсключение NewExtExceptionСтрока(, , , , , ТекстUnauthorized);	
	КонецЕсли;	
	ИдСотрудникаСБИС = get_prop(Сотрудник,"Идентификатор");
	СтруктураРезультата = local_helper_link_external_user(ДанныеСотрудника.Сотрудник.ИдентификаторИС, ИдСотрудникаСБИС, context_params);    
	Если ТипЗнч(СтруктураРезультата) = Тип("ИнформацияОбОшибке") Тогда
		ВызватьИсключение NewExtExceptionСтрока(СтруктураРезультата, , , , , ТекстUnauthorized);
	КонецЕсли;		
	
	Токен = ТокенПоИдентификатору(ИдСотрИС, context_params);
	
	Возврат Токен;
КонецФункции
