
//DynamicDirective

Функция Saby_РасшифроватьДанные(context_params, Данные, ПереданныеОписанияПрограмм = Неопределено) Экспорт 
	ОписанияПрограмм = ПереданныеОписанияПрограмм;
	Если ОписанияПрограмм = Неопределено Тогда
		ОписанияПрограмм = сбисПрограммыКриптографии();
	КонецЕсли;

	Base64РасшифрованныеДанные = сбисРасшифроватьНаКлиенте(ОписанияПрограмм, Данные);	
	
	ДДРасшифрованныеДанные = Base64Значение(Base64РасшифрованныеДанные);
	// BSLLS:UsingSynchronousCalls-off
	// BSLLS:TempFilesDir-off
	ИмяВрФ = КаталогВременныхФайлов() + "sbisTemp.txt";
	// BSLLS:UsingSynchronousCalls-on
	// BSLLS:TempFilesDir-on
	ДДРасшифрованныеДанные.Записать(ИмяВрФ);
	ЧтениеОтвета = Новый ЧтениеТекста(ИмяВрФ, КодировкаТекста.UTF8, Символы.ПС);
	Результат = ЧтениеОтвета.Прочитать();
	ЧтениеОтвета.Закрыть(); 
	// BSLLS:UsingSynchronousCalls-off - для совместимости со старыми платформами
	УдалитьФайлы(ИмяВрФ);
    Возврат Результат;
КонецФункции

//DynamicDirective

Функция local_helper_auth_by_certificate(context_params)
	Отпечаток = get_prop(context_params, "Certificate", Неопределено); 
	ОписанияПрограмм = сбисПрограммыКриптографии();
	
	СертДвоичныеДанные = сбисДвоичныеДанныеСертификатаПоОтпечаткуНаКлиенте(ОписанияПрограмм, Отпечаток);	
	Если Не ЗначениеЗаполнено(СертДвоичныеДанные) Тогда
		ВызватьИсключение "Не удалось получить двоичные данные сертификата по отпечатку " + Строка(Отпечаток);
	КонецЕсли;
	
	result = ТранспортИнтеграции.local_helper_auth_by_sert(context_params, СертДвоичныеДанные);	
	session = ТранспортИнтеграции.Saby_РасшифроватьДанные(context_params, get_prop(result, "result"), ОписанияПрограмм);
		// BSLLS:UsingSynchronousCalls-on
	Возврат session; 
КонецФункции
