
&НаСервереБезКонтекста
Функция XMLЗначениеНаСервере(Знач Тип, Знач Значение)
	Возврат XMLЗначение(Тип, Значение);
КонецФункции

// BSLLS:CognitiveComplexity-off

&НаКлиенте
Процедура СписокСертификатовДляАвторизации(Результат, ДополнительныеПараметры) Экспорт 
	
	type = get_prop(Результат, "type");
	Если type <> Неопределено Тогда 
		ОбработатьОшибкуАвторизации(Результат);	
		Возврат;
	КонецЕсли;
	
	ObjectList = get_prop(Результат, "Сертификат");

	Если ObjectList = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	МожноВойти = Новый Массив;
	НельзяВойти = Новый Массив;
	
	Размер = ObjectList.Количество();
	Для сч=0 По Размер-1 Цикл
		Сертификат = ObjectList[сч];
		Аутентификация = get_prop(Сертификат, "Аутентификация");
		ДействителенПо = get_prop(Сертификат, "ДействителенПо");
		Если ДействителенПо <> Неопределено Тогда 
			Если ТипЗнч(ДействителенПо) = Тип("Строка") Тогда
				Если ЭтоВидТранспортаExtSdk(context_params) Тогда
					ДействителенПо = BlocklyExecutor.ПреобразоватьСтрокуВДату("dd-MM-yyyy HH:mm:ss", ДействителенПо);
				ИначеЕсли Найти(ДействителенПо, "T") > 0 Тогда  
					ДействителенПоДата = XMLЗначениеНаСервере(Тип("Дата"), ДействителенПо);
					ДействителенПо = ДействителенПоДата;
				Иначе	
					// BSLLS:MagicNumber-off
					ДействителенПо = Дата(Сред(ДействителенПо, 7, 4), Сред(ДействителенПо, 4, 2), Лев(ДействителенПо, 2));
					// BSLLS:MagicNumber-on
				КонецЕсли;
			КонецЕсли;	
			Сертификат.Вставить("ДействителенПо", Формат(ДействителенПо, "ДФ=""dd.MM.yyyy"""));
		КонецЕсли;
		
		Если get_prop(Аутентификация, "МожноВойти") = "Да" Тогда
			МожноВойти.Добавить(Сертификат);
		Иначе
			НельзяВойти.Добавить(Сертификат);
		КонецЕсли; 
		
	КонецЦикла;
	
	Для каждого Сертификат Из МожноВойти Цикл
		НоваяСтрока = СписокСертификатовДляАутентификации.Добавить();
		НоваяСтрока.Название = Сертификат["Название"];
		НоваяСтрока.ИНН = ИННПоСертификату(Сертификат);
		НоваяСтрока.ФИО = Сертификат["ФИО"];
		НоваяСтрока.Отпечаток = Сертификат["Отпечаток"];
		НоваяСтрока.ДействителенПо = Сертификат["ДействителенПо"];
		НоваяСтрока.Комментарий = get_prop(Сертификат["Аутентификация"], "Комментарий");
		НоваяСтрока.Статус = 0;
	КонецЦикла;
	
	Если НельзяВойти.Количество() > 0 Тогда
		НоваяСтрока = СписокСертификатовДляАутентификации.Добавить();
		НоваяСтрока.Статус = -1;
		НоваяСтрока.Название = "";
		НоваяСтрока.ФИО = "";
		НоваяСтрока.Отпечаток = "";
		НоваяСтрока.ДействителенПо = "";
		НоваяСтрока.НадписьНедействительные = "Подписи, которыми невозможно воспользоваться";
				
		Для каждого Сертификат Из НельзяВойти Цикл
			НоваяСтрока = СписокСертификатовДляАутентификации.Добавить();
			НоваяСтрока.Статус = 1;
			НоваяСтрока.Название = Сертификат["Название"];
			НоваяСтрока.ИНН = ИННПоСертификату(Сертификат);
			НоваяСтрока.ФИО = Сертификат["ФИО"];
			НоваяСтрока.Отпечаток = Сертификат["Отпечаток"];
			НоваяСтрока.ДействителенПо = Сертификат["ДействителенПо"];
			НоваяСтрока.Комментарий = get_prop(Сертификат["Аутентификация"], "Комментарий");
		КонецЦикла;
	КонецЕсли;
	
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.НайденоЭП.Заголовок = "Найдено подходящих электронных подписей: " + Строка(МожноВойти.Количество());
	
	Если СписокСертификатовДляАутентификации.Количество() = 0 Тогда
		ЭлФорм.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыАвторизации, "СертификатыНеНайдены");	
	КонецЕсли;
	// BSLLS:DuplicateStringLiteral-on
КонецПроцедуры	

// BSLLS:CognitiveComplexity-on

