
#Область include_core_base_Авторизация_ЗаполнитьСписокСертификатов
#КонецОбласти

&НаКлиенте
Функция СписокСертификатовДляАвторизацииНаКлиенте(СертификатыНаКлиенте)
	СертификатыДляАвторизации = Новый Массив();
	Для Каждого Серт из СертификатыНаКлиенте Цикл
		Попытка
			СертДвоичныеДанные = СтрЗаменить(СтрЗаменить(Base64Строка(Серт.Выгрузить()),Символы.ПС,""),Символы.ВК,"");
			СертОтпечаток = СтрЗаменить(Строка(Серт.Отпечаток), " ", ""); 
			Должность = "";
			Если Серт.Субъект.Свойство("T") Тогда 
				Должность = Серт.Субъект.T;
			КонецЕсли;
			Сертификат = Новый Структура;
			Сертификат.Вставить("ДвоичныеДанные", СертДвоичныеДанные);
			Сертификат.Вставить("Отпечаток", СертОтпечаток);
			Сертификат.Вставить("Название", Серт.Субъект.CN);
			Сертификат.Вставить("ФИО", Серт.Субъект.SN+" "+Серт.Субъект.GN);
			Сертификат.Вставить("Должность", Должность);
			Сертификат.Вставить("ДействителенПо", Серт.ДатаОкончания);
			СертификатыДляАвторизации.Добавить(Сертификат);
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	Возврат СертификатыДляАвторизации;
КонецФункции


&НаКлиенте
Процедура СписокСертификатовДляАвторизацииПослеПолученияСертификатовНаКлиенте(СертификатыНаКлиенте, ДополнительныеПараметры) Экспорт
	СертификатыДляАвторизации = СписокСертификатовДляАвторизацииНаКлиенте(СертификатыНаКлиенте); 	
	
	Попытка
		СертификатыНаСервере = BlocklyExecutor.сбисСписокСертификатовДляАвторизацииНаСервере(BlocklyExecutor.ПрограммыКриптографии());
	Исключение
		СертификатыНаСервере = Новый Массив();
	КонецПопытки;	
	Для Каждого Серт Из СертификатыНаСервере Цикл     
		ДобавлятьСертификат = Истина;
		Для Каждого СертНаКлиенте Из СертификатыДляАвторизации Цикл 
			Если СертНаКлиенте.Отпечаток = Серт.Отпечаток Тогда 
				ДобавлятьСертификат = Ложь;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Если ДобавлятьСертификат Тогда
			СертификатыДляАвторизации.Добавить(Серт);	
		КонецЕсли;	
	КонецЦикла;	
	
	Если ДополнительныеПараметры.Свойство("ОбработчикРезультата") = Ложь Тогда
		Возврат;
	КонецЕсли;	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработчикРезультата, СертификатыДляАвторизации);		
КонецПроцедуры

&НаКлиенте
Процедура СписокСертификатовДляАвторизации(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат.Количество() = 0 Тогда
		СписокСертификатов.Очистить();
		Возврат;
	КонецЕсли;	
	РезультатЗапроса = ТранспортИнтеграции.СписокСертификатовДляАутентификации(Результат, ЭтаФорма.context_params);
	Object = РезультатЗапроса;
	ObjectList = get_prop(Object, "Сертификат");

	ВидТранспорта = BlocklyExecutor.ВидТранспорта(context_params); 
	Если ObjectList = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	Размер = ObjectList.Количество();
	Для сч=0 По Размер-1 Цикл
		Сертификат = ObjectList[сч];
		Аутентификация = get_prop(Сертификат, "Аутентификация");
		Зарегистрирован = get_prop(Аутентификация, "Зарегистрирован");
		Если Зарегистрирован = "Нет" Тогда 
			Продолжить;
		КонецЕсли;
		ДействителенПо = get_prop(Сертификат, "ДействителенПо");
		Если ДействителенПо <> Неопределено Тогда 
			Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда
				ДействителенПо = BlocklyExecutor.ПреобразоватьСтрокуВДату("dd-MM-yyyy HH:mm:ss", ДействителенПо);
			ИначеЕсли Найти(ДействителенПо, "T") > 0 Тогда  
				ДействителенПоДата = XMLЗначение(Тип("Дата"), ДействителенПо);
				ДействителенПо = ДействителенПоДата;
			Иначе	
				// BSLLS:MagicNumber-off
				ДействителенПо = Дата(Сред(ДействителенПо, 7, 4), Сред(ДействителенПо, 4, 2), Лев(ДействителенПо, 2));
				// BSLLS:MagicNumber-on
			КонецЕсли;	
			Сертификат.Вставить("ДействителенПо", ДействителенПо);
		КонецЕсли;
		СписокСертификатов.Добавить(Сертификат, ПолучитьПредставлениеСертификата(Сертификат, "[ФИО].([Должность])., [Название].(ИНН [ИНН])., действителен до [ДействителенПо]", Истина, "ДЛФ=DD"));
	КонецЦикла;		
КонецПроцедуры	

&НаКлиенте
Функция РазбитьСтрокуВМассивНаКлиенте(сбисСтрока, сбисРазделитель=".") Экспорт 
	Результат = Новый Массив();	
	МногоуровневаяСтрока = СтрЗаменить(сбисСтрока, сбисРазделитель, Символы.ПС);
	Для НомерСтроки = 1 По СтрЧислоСтрок(МногоуровневаяСтрока) Цикл 
		Результат.Добавить(СокрЛП(СтрПолучитьСтроку(МногоуровневаяСтрока, НомерСтроки)));
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СокращенноеФИО(ФИО) Экспорт
	// Формирует сокращенное ФИО из полного	
	_ФИО = РазбитьСтрокуВМассивНаКлиенте(ФИО," ");
	
	Фамилия  = ?(_ФИО.Количество()>0,_ФИО[0],"");
	Имя      = ?(_ФИО.Количество()>=2,Лев(_ФИО[1],1)+".","");
	Отчество = ?(_ФИО.Количество()>=3,Лев(_ФИО[2],1)+".","");
	Возврат Фамилия+" "+Имя+Отчество;
КонецФункции

&НаКлиенте
Функция ПроверитьШаблонСертификата(Сертификат, Шаблон, СокрФИО, Разделитель)
	Если Не ((ТипЗнч(Сертификат) = Тип("Соответствие") Или ТипЗнч(Сертификат) = Тип("Структура"))
			И ТипЗнч(Шаблон) = Тип("Строка")
			И ТипЗнч(СокрФИО) = Тип("Булево")
			И ТипЗнч(Разделитель) = Тип("Строка")
			И СтрДлина(Разделитель) = 1
			И Найти("[]", Разделитель) = 0) Тогда
		Возврат Ложь
	КонецЕсли;	
	Возврат Истина;
КонецФункции

// Функция возвращает предствление серьтификата
// Параметры:
//  Сертификат	- Структура	- серфикат.
//
//	Шаблон		- Строка	- строка, в которой заменяются подстроки вида "[ПолеСертификата]" на строковые представления
//							  полей сертификата. Если поле не заполнено или отсутствует в сертификате, то игнорируется
//							  само поле и все рядом стоящие символы до разделителя.
//							  Например, "[ФИО]., [ИНН]".
//  СокрФИО		- Булево	- если Истина, то перед подстановкой ФИО будет сокращено до фамилии с инициалами.
//							  Значение по умолчанию - Ложь.
//  ФорматДаты	- Строка	- если встречается значение поля сертификата типа Дата, то используется данный формат
//                            для преобразования даты в строку.
//  Разделитель	- Строка	- символ, который указывает, какие символы не выводятся в случае отсутствия поля.
//                            В представление не выводится.
//							  Знавение по умолчанию - ".".
//
// Возвращаемое значение:
//   Строка - представление сертификата по шаблону с подстановкой полей сертификата.
//            Если параметры указаны неправильно, возвращается Неопределено.
&НаКлиенте
Функция ПолучитьПредставлениеСертификата(Сертификат, Шаблон, СокрФИО = Ложь, ФорматДаты = "ДФ=dd.MM.yyyy", Разделитель = ".") Экспорт
	Перем ЗначениеПоляСертификата;
	
	Если Не ПроверитьШаблонСертификата(Сертификат, Шаблон, СокрФИО, Разделитель) Тогда
		Возврат Неопределено
	КонецЕсли;
	
	МассивЧастейШаблона = РазбитьСтрокуВМассивНаКлиенте(Шаблон, Разделитель);
	Результат = "";
	Если СокрФИО И Сертификат["ФИО"] <> Неопределено Тогда
		Сертификат["ФИО"] = СокращенноеФИО(Сертификат["ФИО"]);
	КонецЕсли;
	
	Для Каждого ЧастьШаблона Из МассивЧастейШаблона Цикл
		ОткСкобка = Найти(ЧастьШаблона, "[");
		ЗакСкобка = Найти(ЧастьШаблона, "]");
		Пропустить = Ложь;
		Пока ОткСкобка < ЗакСкобка Цикл
			ИмяПоля = Сред(ЧастьШаблона, ОткСкобка + 1, ЗакСкобка - ОткСкобка - 1);
			ЗначениеПоляСертификата = Сертификат[ИмяПоля];
			Если Не ЗначениеЗаполнено(ЗначениеПоляСертификата) Тогда
				Пропустить = Истина;
				Прервать;
			КонецЕсли;
			
			Если ТипЗнч(ЗначениеПоляСертификата) = Тип("Дата") Тогда
				ЗначениеПоляСертификата = Формат(ЗначениеПоляСертификата, ФорматДаты);
			КонецЕсли;
			
			ЧастьШаблона = СтрЗаменить(ЧастьШаблона, "[" + ИмяПоля + "]", ЗначениеПоляСертификата);
			ОткСкобка = Найти(ЧастьШаблона, "[");
			ЗакСкобка = Найти(ЧастьШаблона, "]");
		КонецЦикла;
		
		Если Пропустить Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = Результат + ЧастьШаблона;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции
