
#Область include_core_base_Авторизация_ЗаполнитьСписокСертификатов
#КонецОбласти

&НаКлиенте
Функция СписокСертификатовДляАвторизацииНаКлиенте(СертификатыНаКлиенте)
	СертификатыДляАвторизации = Новый Массив();
	Для Каждого Серт из СертификатыНаКлиенте Цикл
		Попытка
			СертДвоичныеДанные = СтрЗаменить(СтрЗаменить(Base64Строка(Серт.Выгрузить()),Символы.ПС,""),Символы.ВК,"");
			СертОтпечаток = СтрЗаменить(Строка(Серт.Отпечаток), " ", ""); 
			Должность = "";
			Если Серт.Субъект.Свойство("T") Тогда 
				Должность = Серт.Субъект.T;
			КонецЕсли;
			Сертификат = Новый Структура;
			Сертификат.Вставить("ДвоичныеДанные", СертДвоичныеДанные);
			Сертификат.Вставить("Отпечаток", СертОтпечаток);
			Сертификат.Вставить("Название", Серт.Субъект.CN);
			Сертификат.Вставить("ФИО", Серт.Субъект.SN+" "+Серт.Субъект.GN);
			Сертификат.Вставить("Должность", Должность);
			Сертификат.Вставить("ДействителенПо", Серт.ДатаОкончания);
			СертификатыДляАвторизации.Добавить(Сертификат);
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	Возврат СертификатыДляАвторизации;
КонецФункции


&НаКлиенте
Процедура СписокСертификатовДляАвторизацииПослеПолученияСертификатовНаКлиенте(СертификатыНаКлиенте, ДополнительныеПараметры) Экспорт
	СертификатыДляАвторизации = СписокСертификатовДляАвторизацииНаКлиенте(СертификатыНаКлиенте); 	
	
	Попытка
		СертификатыНаСервере = BlocklyExecutor.сбисСписокСертификатовДляАвторизацииНаСервере(BlocklyExecutor.ПрограммыКриптографии());
	Исключение
		СертификатыНаСервере = Новый Массив();
	КонецПопытки;	
	Для Каждого Серт Из СертификатыНаСервере Цикл     
		ДобавлятьСертификат = Истина;
		Для Каждого СертНаКлиенте Из СертификатыДляАвторизации Цикл 
			Если СертНаКлиенте.Отпечаток = Серт.Отпечаток Тогда 
				ДобавлятьСертификат = Ложь;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Если ДобавлятьСертификат Тогда
			СертификатыДляАвторизации.Добавить(Серт);	
		КонецЕсли;	
	КонецЦикла;	
	
	Если ДополнительныеПараметры.Свойство("ОбработчикРезультата") = Ложь Тогда
		Возврат;
	КонецЕсли;	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработчикРезультата, СертификатыДляАвторизации);		
КонецПроцедуры

&НаСервереБезКонтекста
Функция XMLЗначениеНаСервере(Знач Тип, Знач Значение)
	Возврат XMLЗначение(Тип, Значение);
КонецФункции

// BSLLS:CognitiveComplexity-off

&НаКлиенте
Процедура СписокСертификатовДляАвторизации(Результат, ДополнительныеПараметры) Экспорт 
	// BSLLS:DuplicateStringLiteral-off
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	Попытка
		РезультатЗапроса = ТранспортИнтеграции.СписокСертификатовДляАутентификации(Результат, ЭтаФорма.context_params);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		ОбработатьОшибкуАвторизации(ОшибкаСтруктура);
		Возврат;
	КонецПопытки;
	Object = РезультатЗапроса;
	ObjectList = get_prop(Object, "Сертификат");

	ВидТранспорта = BlocklyExecutor.ВидТранспорта(context_params); 
	Если ObjectList = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	МожноВойти = Новый Массив;
	НельзяВойти = Новый Массив;
	
	Размер = ObjectList.Количество();
	Для сч=0 По Размер-1 Цикл
		Сертификат = ObjectList[сч];
		Аутентификация = get_prop(Сертификат, "Аутентификация");
		Зарегистрирован = get_prop(Аутентификация, "Зарегистрирован");
		Если Зарегистрирован = "Нет" Тогда 
			Продолжить;
		КонецЕсли;
		ДействителенПо = get_prop(Сертификат, "ДействителенПо");
		Если ДействителенПо <> Неопределено Тогда 
			Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда
				ДействителенПо = BlocklyExecutor.ПреобразоватьСтрокуВДату("dd-MM-yyyy HH:mm:ss", ДействителенПо);
			ИначеЕсли Найти(ДействителенПо, "T") > 0 Тогда  
				ДействителенПоДата = XMLЗначениеНаСервере(Тип("Дата"), ДействителенПо);
				ДействителенПо = ДействителенПоДата;
			Иначе	
				// BSLLS:MagicNumber-off
				ДействителенПо = Дата(Сред(ДействителенПо, 7, 4), Сред(ДействителенПо, 4, 2), Лев(ДействителенПо, 2));
				// BSLLS:MagicNumber-on
			КонецЕсли;	
			Сертификат.Вставить("ДействителенПо", Формат(ДействителенПо, "ДФ=""dd.MM.yyyy"""));
		КонецЕсли;
		
		Если get_prop(Аутентификация, "МожноВойти") = "Да" Тогда
			МожноВойти.Добавить(Сертификат);
		Иначе
			НельзяВойти.Добавить(Сертификат);
		КонецЕсли; 
		
	КонецЦикла;
	
	Для каждого Сертификат Из МожноВойти Цикл
		НоваяСтрока = СписокСертификатовДляАутентификации.Добавить();
		НоваяСтрока.Название = Сертификат["Название"];
		НоваяСтрока.ФИО = Сертификат["ФИО"];
		НоваяСтрока.Отпечаток = Сертификат["Отпечаток"];
		НоваяСтрока.ДействителенПо = Сертификат["ДействителенПо"];
		НоваяСтрока.Комментарий = get_prop(Сертификат["Аутентификация"], "Комментарий");
		НоваяСтрока.Статус = 0;
	КонецЦикла;
	
	Если НельзяВойти.Количество() > 0 Тогда
		НоваяСтрока = СписокСертификатовДляАутентификации.Добавить();
		НоваяСтрока.Статус = -1;
		НоваяСтрока.Название = "";
		НоваяСтрока.ФИО = "";
		НоваяСтрока.Отпечаток = "";
		НоваяСтрока.ДействителенПо = "";
		НоваяСтрока.НадписьНедействительные = "Подписи, которыми невозможно воспользоваться";
				
		Для каждого Сертификат Из НельзяВойти Цикл
			НоваяСтрока = СписокСертификатовДляАутентификации.Добавить();
			НоваяСтрока.Статус = 1;
			НоваяСтрока.Название = Сертификат["Название"];
			НоваяСтрока.ФИО = Сертификат["ФИО"];
			НоваяСтрока.Отпечаток = Сертификат["Отпечаток"];
			НоваяСтрока.ДействителенПо = Сертификат["ДействителенПо"];
			НоваяСтрока.Комментарий = get_prop(Сертификат["Аутентификация"], "Комментарий");
		КонецЦикла;
	КонецЕсли;
	
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.НайденоЭП.Заголовок = "Найдено подходящих электронных подписей: " + Строка(МожноВойти.Количество());
	
	Если СписокСертификатовДляАутентификации.Количество() = 0 Тогда
		ЭлФорм.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыАвторизации, "СертификатыНеНайдены");	
	КонецЕсли;
	// BSLLS:DuplicateStringLiteral-on
КонецПроцедуры	

// BSLLS:CognitiveComplexity-on

