
&НаСервере
Функция ОбработкаСменыАккаунтаНаСервер(Знач account_id)
	МодульОбъекта = ПолучитьМодульОбъекта();
	Результат = МодульОбъекта.local_helper_switch_account(Неопределено, account_id);
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		context_param = МодульОбъекта.ПроверитьНаличиеПараметровПодключения();
		МодульОбъекта.ПослеАутентификации(context_param);
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте 
Процедура ОбработкаСменыАккаунта(ВыбранныйЭлемент, ПараметрыОповещения) Экспорт
	ЗакрытьСПередачейПараметров = get_prop(ПараметрыОповещения, "ЗакрытьСПередачейПараметров", Ложь);
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ИдентификаторСесии = Транспорт.ПереключитьАккаунт(ВыбранныйЭлемент.Значение);
		Если ТипЗнч(ИдентификаторСесии) = Тип("Строка") Тогда
			context_param = ПроверитьНаличиеПараметровПодключенияНаСервере();
			Транспорт.ПослеАутентификации(context_param);
		КонецЕсли;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
		Картинка = КартинкаОшибка();
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			СтруктураОшибки.message,
			Картинка,
			СтатусОповещенияПользователя.Важное);
		ВыйтиНаСервере(); 
		ПолучитьАктуальностьВерсии();
		УстановитьЗаголовокПодсказкуКнопкиВыйти();
		Сообщить("Сессия и пароль сброшены");
		Оповестить("SabySignOut");
		Если ЗакрытьСПередачейПараметров Тогда
			ЭтаФорма.Закрыть(context_param);
		КонецЕсли;
		Возврат;
	КонецПопытки;
	Если ТипЗнч(ИдентификаторСесии) = Тип("Строка") Тогда
		ПоказатьОповещениеПользователя("Авторизация",,
			"Выполнен вход - " + ВыбранныйЭлемент.Представление,,
			СтатусОповещенияПользователя.Информация,
			Новый УникальныйИдентификатор);
	КонецЕсли;
	Если ЗакрытьСПередачейПараметров Тогда
		ЭтаФорма.Закрыть(context_param);
	КонецЕСли;
КонецПроцедуры

&НаКлиенте
Процедура СменитьАккаунтВВыпадающемСписке(ЭлементФормыДляВыводаСписка = Неопределено, ЗакрытьСПередачейПараметров = Ложь)
	Попытка
		СписокАккаунтов = Транспорт.ПолучитьСписокАккаунтов();
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
		Картинка = КартинкаОшибка();
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			СтруктураОшибки.message,
			Картинка,
			СтатусОповещенияПользователя.Важное);
		Если ЗакрытьСПередачейПараметров Тогда
			ВыйтиНаСервере(); 
			ЭтаФорма.Закрыть(context_param);; 
		КонецЕсли;
		Возврат;
	КонецПопытки;
	
	Если СписокАккаунтов.Количество() < 2 Тогда
		Если ЗакрытьСПередачейПараметров Тогда //ЗакрытиеФормы - Закрытие формы входа
			ЭтаФорма.Закрыть(context_param);; 
		Иначе
			ПоказатьОповещениеПользователя("Внимание",,
				"У вас один аккаунт. Смена невозможна.",,
				СтатусОповещенияПользователя.Информация,
				Новый УникальныйИдентификатор);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	ПараметрОповещения = Новый Структура("ЗакрытьСПередачейПараметров", ЗакрытьСПередачейПараметров);
	ОповещениеВыбораАккаунта = Новый ОписаниеОповещения("ОбработкаСменыАккаунта", ЭтаФорма, ПараметрОповещения);
	ОткрытьВыборИзСписка(СписокАккаунтов, ОповещениеВыбораАккаунта, ЭлементФормыДляВыводаСписка);
КонецПроцедуры

