
&НаКлиенте 
Процедура ОбработкаСменыАккаунта(ВыбранныйЭлемент, ПараметрыОповещения) Экспорт
	ЗакрытьСПередачейПараметров = get_prop(ПараметрыОповещения, "ЗакрытьСПередачейПараметров", Ложь);
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ИдентификаторСесии = ТранспортИнтеграции.ПереключитьАккаунт(ВыбранныйЭлемент.Значение);
		Если ТипЗнч(ИдентификаторСесии) = Тип("Строка") Тогда
			ЭтаФорма.context_params = ПроверитьНаличиеПараметровПодключенияНаСервере();
			ТранспортИнтеграции.ПослеАутентификации(ЭтаФорма.context_params);
		КонецЕсли;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
		Картинка = КартинкаОшибка();
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			СтруктураОшибки.message,
			Картинка,
			СтатусОповещенияПользователя.Важное);
		ВыйтиНаСервере(); 
		ПолучитьАктуальностьВерсии();
		УстановитьЗаголовокПодсказкуКнопкиВыйти();
		Сообщить("Сессия и пароль сброшены");
		Оповестить("SabySignOut");
		Если ЗакрытьСПередачейПараметров Тогда
			ЭтаФорма.Закрыть(ЭтаФорма.context_params);
		КонецЕсли;
		Возврат;
	КонецПопытки;
	Если ТипЗнч(ИдентификаторСесии) = Тип("Строка") Тогда
		ПоказатьОповещениеПользователя("Авторизация",,
			"Выполнен вход - " + ВыбранныйЭлемент.Представление,,
			СтатусОповещенияПользователя.Информация,
			Новый УникальныйИдентификатор);
		Если get_prop(ЭтаФорма, "АвторизацияУспешна") <> Неопределено Тогда	
			ЭтаФорма.АвторизацияУспешна = Истина;
		КонецЕсли;	
	КонецЕсли;
	УстановитьЗаголовокПодсказкуКнопкиВыйти();
	Если ЗакрытьСПередачейПараметров Тогда
		ЭтаФорма.Закрыть(ЭтаФорма.context_params);
	КонецЕсли;
	
	// Оповестим все окна о смене аккаунта, нужно выполнить действия аналогично - SignOut 
	Оповестить("SabySignOut");
КонецПроцедуры

&НаКлиенте
Процедура СменитьАккаунтВВыпадающемСписке(ЭлементФормыДляВыводаСписка = Неопределено, ЗакрытьСПередачейПараметров = Ложь)
	Попытка
		СписокАккаунтов = ТранспортИнтеграции.ПолучитьСписокАккаунтов();
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
		Картинка = КартинкаОшибка();
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			СтруктураОшибки.message,
			Картинка,
			СтатусОповещенияПользователя.Важное);
		Если ЗакрытьСПередачейПараметров Тогда
			ВыйтиНаСервере(); 
			ЭтаФорма.Закрыть(ЭтаФорма.context_params);
		КонецЕсли;
		Возврат;
	КонецПопытки;
	
	Если СписокАккаунтов.Количество() < 2 Тогда
		Если ЗакрытьСПередачейПараметров Тогда // ЗакрытиеФормы - Закрытие формы входа
			ЭтаФорма.Закрыть(ЭтаФорма.context_params);
		Иначе
			ПоказатьОповещениеПользователя("Внимание", ,
				"У вас один аккаунт. Смена невозможна.", ,
				СтатусОповещенияПользователя.Информация,
				Новый УникальныйИдентификатор);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	ПараметрОповещения = Новый Структура("ЗакрытьСПередачейПараметров", ЗакрытьСПередачейПараметров);
	ОповещениеВыбораАккаунта = Новый ОписаниеОповещения("ОбработкаСменыАккаунта", ЭтаФорма, ПараметрОповещения);
	ОткрытьВыборИзСписка(СписокАккаунтов, ОповещениеВыбораАккаунта, ЭлементФормыДляВыводаСписка, "Выберите аккаунт");
КонецПроцедуры

