
&НаКлиенте 
Процедура ОбработкаСменыАккаунта(ВыбранныйЭлемент, ПараметрыОповещения) Экспорт
	ЗакрытьСПередачейПараметров = get_prop(ПараметрыОповещения, "ЗакрытьСПередачейПараметров", Ложь);
	ОповещениеПослеСменыАккаунта = get_prop(ПараметрыОповещения, "ОповещениеПослеСменыАккаунта");
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ИдентификаторСесии = ТранспортИнтеграции.ПереключитьАккаунт(ВыбранныйЭлемент.Значение);
		Если ТипЗнч(ИдентификаторСесии) = Тип("Строка") Тогда
			ЭтаФорма.context_params = ПроверитьНаличиеПараметровПодключенияНаСервере();
			ТранспортИнтеграции.ПослеАутентификации(ЭтаФорма.context_params);
		КонецЕсли;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
		Картинка = КартинкаОшибка();
		ПоказатьВажноеОповещениеПользователя(
			"Ошибка",,
			СтруктураОшибки.message,
			Картинка);
		ВыйтиНаСервере(); 
		ПолучитьАктуальностьВерсии();
		Сообщить("Сессия и пароль сброшены");
		Оповестить("SabySignOut");
		Если ЗакрытьСПередачейПараметров Тогда
			ЭтаФорма.Закрыть(ЭтаФорма.context_params);
		КонецЕсли;
		Возврат;
	КонецПопытки;
	Если ТипЗнч(ИдентификаторСесии) = Тип("Строка") Тогда
		ПоказатьОповещениеПользователя("Авторизация",,
			"Выполнен вход - " + ВыбранныйЭлемент.Представление);
		Если get_prop(ЭтаФорма, "АвторизацияУспешна") <> Неопределено Тогда	
			ЭтаФорма.АвторизацияУспешна = Истина;
		КонецЕсли;	
	КонецЕсли;
	Если ОповещениеПослеСменыАккаунта <> Неопределено Тогда
		Если ТипЗнч(ОповещениеПослеСменыАккаунта.ДополнительныеПараметры) = Тип("Структура") Тогда
			ОповещениеПослеСменыАккаунта.ДополнительныеПараметры.Вставить("АккаунтИзменился", Истина);	
		КонецЕсли;
		ВыполнитьSabyОписаниеОповещения(ОповещениеПослеСменыАккаунта, ЭтаФорма.context_params);
	КонецЕсли;
	Если ЗакрытьСПередачейПараметров Тогда
		ЭтаФорма.Закрыть(ЭтаФорма.context_params);
	КонецЕсли;
	
	// Оповестим все окна о смене аккаунта, нужно выполнить действия аналогично - SignOut 
	Оповестить("SabySignOut");
КонецПроцедуры

&НаКлиенте
Процедура СменитьАккаунтВВыпадающемСписке(ЭлементФормыДляВыводаСписка = Неопределено, 
		ЗакрытьСПередачейПараметров = Ложь, ОповещениеПослеСменыАккаунта = Неопределено)
	Попытка
		СписокАккаунтов = ТранспортИнтеграции.ПолучитьСписокАккаунтов();
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
		Картинка = КартинкаОшибка();
		ПоказатьВажноеОповещениеПользователя(
			"Ошибка",,
			СтруктураОшибки.message,
			Картинка);
		Если ЗакрытьСПередачейПараметров Тогда
			ВыйтиНаСервере(); 
			ЭтаФорма.Закрыть(ЭтаФорма.context_params);
		КонецЕсли;
		Возврат;
	КонецПопытки;
	
	Если СписокАккаунтов.Количество() < 2 Тогда
		Если ЗакрытьСПередачейПараметров Тогда // ЗакрытиеФормы - Закрытие формы входа
			ЭтаФорма.Закрыть(ЭтаФорма.context_params);
		Иначе
			ПоказатьОповещениеПользователя("Внимание", ,
				"У вас один аккаунт. Смена невозможна.");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	ПараметрОповещения = Новый Структура();
	ПараметрОповещения.Вставить("ЗакрытьСПередачейПараметров", ЗакрытьСПередачейПараметров);
	ПараметрОповещения.Вставить("ОповещениеПослеСменыАккаунта", ОповещениеПослеСменыАккаунта);
	ОповещениеВыбораАккаунта = SabyОписаниеОповещения("ОбработкаСменыАккаунта", ЭтаФорма, ПараметрОповещения);
	СписокАккаунтов.СортироватьПоПредставлению();
	ТекЭлемСписка = СписокАккаунтов.НайтиПоЗначению(ТранспортИнтеграции.СвойствоСессии(ЭтаФорма.context_params, "AccountId"));
	ОткрытьВыборИзСписка(СписокАккаунтов, ОповещениеВыбораАккаунта, ЭлементФормыДляВыводаСписка, "Выберите аккаунт", ТекЭлемСписка);
КонецПроцедуры

