
Процедура ПрисоеденитьФайлНаСервере(ДокументССылка, ДвоичныеДанные, Название, Тип) Экспорт
КонецПроцедуры

Процедура ЗагрузитьВложение(ДокументССылка, Файл, Название, context = Неопределено, block_context = Неопределено)  Экспорт
КонецПроцедуры	

Функция ПолучитьПечатныеФормы(Знач СсылкаНаОбъект, Вложения = Неопределено, БезСодержимого = Ложь) Экспорт
	Если Вложения = Неопределено Тогда
		Вложения = Новый Массив;
	КонецЕсли;	
	Возврат Вложения;		
КонецФункции

Процедура ИнициализацияНедостающихКонстант()  Экспорт
	НаправлениеПоиска = Новый Структура("СНачала, СКонца", "СНачала", "СКонца");
КонецПроцедуры

Функция ПолучитьДанныеПрисоединенногоФайла(ПечатнаяФормаДокументаКомандаСсылка)
	Возврат Неопределено;
КонецФункции

Функция ПолучитьСписокПрикреплёныхФайлов(ВладелецФайлов)
	Возврат Неопределено;	
КонецФункции

#Область include_core_base_ОсобенностиПлатформы_РаботаСоСтроками
#КонецОбласти

