
&НаСервере
Функция ПодписиВложения(Знач ПрикрепненныйФайл)
	Результат = Новый Массив;
	
	МодульОбщегоНазначения 						= ОбщийМодульКонфигурации("ОбщегоНазначения");
	МодульРаботаСФайламиСлужебныйВызовСервера	= ОбщийМодульКонфигурации("РаботаСФайламиСлужебныйВызовСервера");
	МодульЭлектроннаяПодпись				  	= ОбщийМодульКонфигурации("ЭлектроннаяПодпись");
	Если МодульРаботаСФайламиСлужебныйВызовСервера = Неопределено 
		Или МодульЭлектроннаяПодпись = Неопределено 
		Или МодульОбщегоНазначения = Неопределено Тогда
		// На выход, модуль отсутствует
		Возврат Результат;
	КонецЕсли;
	
	ПодписанЭП = get_prop(ПрикрепненныйФайл, "ПодписанЭП", Ложь);
	Если НЕ ПодписанЭП
		ИЛИ Не МодульОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		// На выход, нет необходимости в дальнейших действиях
		// На выход, подсистемы не существует
		Возврат Результат;
	КонецЕсли;
	
	МассивПодписей = Новый Массив;
	
	ПараметрыПолученияПодписей = МодульЭлектроннаяПодпись.НовыйПараметрыПолученияПодписейОбъекта();
	ПараметрыПолученияПодписей.ВозвращатьДанныеМЧД = Истина;
	ПараметрыПолученияПодписей.ВозвращатьСертификатыИзПодписей = Истина;
	КоллекцияПодписей = МодульЭлектроннаяПодпись.ПодписиОбъекта(ПрикрепненныйФайл.Ссылка, ПараметрыПолученияПодписей);
	
	Для каждого ВсеСвойстваПодписи Из КоллекцияПодписей Цикл
		ФайлПодписи = Новый Структура("ДвоичныеДанные", Base64Строка(ВсеСвойстваПодписи.Подпись));
		МассивПодписей.Добавить(Новый Структура("Файл", ФайлПодписи));
	КонецЦикла;
	Если МассивПодписей.Количество() Тогда
		Результат = МассивПодписей;
	КонецЕсли;
			
	Возврат Результат;
КонецФункции

// BSLLS:CognitiveComplexity-off
// Более не имеет сымысла уменьшать когнитивную сложность

Процедура ЗаполнитьСодержимоеВложенийПрикрепленногоФайла(Вложение, ТаблицаПрикреплённыхФайловОбъекта)
	ОбщийМодульРаботаСФайлами = ОбщийМодульКонфигурации("РаботаСФайламиСлужебныйВызовСервера");
	Если ОбщийМодульРаботаСФайлами = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ФайлСтр = "Файл";
	
	Для Каждого ПрикрепненныйФайл Из ТаблицаПрикреплённыхФайловОбъекта Цикл
		Если ПрикрепненныйФайл.ПометкаУдаления Тогда Продолжить; КонецЕсли;
		
		Если ПрикрепненныйФайл.Наименование <> Вложение["Название"] Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			ДанныеФайла	= ОбщийМодульРаботаСФайлами.ПолучитьДанныеФайла(ПрикрепненныйФайл.Ссылка, , Истина);
		Исключение
			Возврат;
		КонецПопытки;
		ИмяФайла	= ДанныеФайла.ИмяФайла;
		ТипКонтента	= ПолучитьКонтентТипВложения(ИмяФайла);
		ФайлДД		= ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
		ФайлBase64	= Base64Строка(ФайлДД);
		
		Вложение[ФайлСтр].Удалить("ПрисоединенныйФайл");
		ВставитьСвойствоЕслиНет(Вложение[ФайлСтр], "Имя", ИмяФайла);
		ВставитьСвойствоЕслиНет(Вложение[ФайлСтр], "ДвоичныеДанные", ФайлBase64);
		ВставитьСвойствоЕслиНет(Вложение[ФайлСтр], "ContentType", ТипКонтента);
		УдалитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
		
		МассивПодписей = ПодписиВложения(ПрикрепненныйФайл.Ссылка);
		Если МассивПодписей.Количество() Тогда
			Вложение.Вставить("Подпись", МассивПодписей);
		КонецЕсли;
		
		Прервать;
	КонецЦикла;	
КонецПроцедуры

// BSLLS:CognitiveComplexity-on

Процедура ЗаполнитьПечатныеФормы(Знач Команда, Знач СсылкаНаОбъект, ПечатныеФормы)
	КомандаПечати = Новый Структура("Обработчик, МенеджерПечати, Идентификатор, Представление, ПроверкаПроведенияПередПечатью, ПроверкаПроведенияПередПечатью, ФункциональныеОпции, ИсточникДанных");
	ЗаполнитьЗначенияСвойств(КомандаПечати, Команда);
	КомандаПечати.Вставить("ИсточникДанных", СсылкаНаОбъект);
	ПараметрыПечати = Новый Структура("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	ОбъектыПечати = Новый Массив;
	ОбъектыПечати.Добавить(КомандаПечати.ИсточникДанных);
	МодульУправлениеПечатью = ОбщийМодульКонфигурации("УправлениеПечатью");
	Если Найти(КомандаПечати.Менеджерпечати, "ДополнительныеОтчетыИОбработки") > 0 Тогда
		СсылкаНаПечатнуюФорму	= Команда.ДополнительныеПараметры.Ссылка;
		Если СсылкаНаПечатнуюФорму.Пустая() Тогда ВызватьИсключение("Отсутствует внешняя печатная форма.") КонецЕсли;
		ПараметрыВызова	= Новый Структура("ИдентификаторКоманды, ОбъектыНазначения", КомандаПечати.Идентификатор, ОбъектыПечати);
		ПечатныеФормы	= Неопределено;
		ОбъектыПечати	= Новый СписокЗначений;
		ПараметрыВывода	= Неопределено;
		Попытка
			МодульУправлениеПечатью.ПечатьПоВнешнемуИсточнику(
			СсылкаНаПечатнуюФорму,
			ПараметрыВызова,
			ПечатныеФормы,
			ОбъектыПечати,
			ПараметрыВывода
			);
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,"Не удалось сформировать печатную форму", Команда.Представление+" ("+ИнфОбОшибке.Описание+")");
		КонецПопытки;
	Иначе
		Попытка
			ПечатныеФормы = МодульУправлениеПечатью.СформироватьПечатныеФормы(КомандаПечати.МенеджерПечати, КомандаПечати.Идентификатор,
			ОбъектыПечати, ПараметрыПечати);
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,"Не удалось сформировать печатную форму", Команда.Представление+" ("+ИнфОбОшибке.Описание+")");
		КонецПопытки;
		Если ТипЗнч(ПечатныеФормы) = Тип("Структура") Тогда
			Если ПечатныеФормы.Свойство("КоллекцияПечатныхФорм") ТОгда
				ПечатныеФормы = ПечатныеФормы.КоллекцияПечатныхФорм;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ЗаполнитьДвоичныеДанныеВложений(Вложение, Команда, ПечатныеФормы) 
	Для Каждого ПечатнаяФорма Из ПечатныеФормы Цикл
		Попытка
			НазваниеПФ = Команда.Представление;
			Вложение["Название"] = ПривестиСтрокуКВалидномуИмениФайла(НазваниеПФ);
			Вложение["Файл"].Удалить("ПечатнаяФормаДокумента");
			
			ВремФайл = ПолучитьИмяВременногоФайла("pdf");
			ПечатнаяФорма.ТабличныйДокумент.Записать(ВремФайл, ТипФайлаТабличногоДокумента.PDF);
			ДвоичныеДанные = Новый ДвоичныеДанные(ВремФайл);
			
			ФайлBase64 = Base64Строка(ДвоичныеДанные);
			// BSLLS:UsingSynchronousCalls-off Серверный вызов, для совместимости с 8.3.5 и ниже
			УдалитьФайлы(ВремФайл);
			// BSLLS:UsingSynchronousCalls-on
			
			ВставитьСвойствоЕслиНет(Вложение["Файл"], "Имя", НазваниеПФ+".pdf");
			ВставитьСвойствоЕслиНет(Вложение["Файл"], "ДвоичныеДанные", ФайлBase64);
			ВставитьСвойствоЕслиНет(Вложение["Файл"], "ContentType", "application/pdf");;
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,"Не удалось сформировать печатную форму", Команда.Представление+" ("+ИнфОбОшибке.Описание+")");
		КонецПопытки;
		Прервать;
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаполнитьСодержимоеВложенийПечатнаяФорма(Вложение, Знач СсылкаНаОбъект, КомандыПечатиФормы)  
	ДобавленныеПФ = Новый Соответствие();
	мКомандыПечатиФормы = КомандыПечатиФормы.НайтиСтроки( Новый Структура("Представление", Вложение["Название"]) );
	Для Каждого Команда Из мКомандыПечатиФормы Цикл
		Если Найти(Команда.Обработчик, "КадровыйЭДОКлиент") > 0 Тогда 
			Продолжить; 
		КонецЕсли;
		Если Найти(Команда.Обработчик, "ЭДОБЗККлиент") > 0 Тогда 
			Продолжить; 
		КонецЕсли;
		Если ДобавленныеПФ[Команда.Представление] <> Неопределено Тогда Продолжить; КонецЕсли;
		ДобавленныеПФ.Вставить(Команда.Представление, Истина);
		
		ПечатныеФормы = Новый Массив();
		// Формирование табличных документов.
		ЗаполнитьПечатныеФормы(Команда, СсылкаНаОбъект, ПечатныеФормы);
		ЗаполнитьДвоичныеДанныеВложений(Вложение, Команда, ПечатныеФормы);	
	КонецЦикла;   
КонецПроцедуры	

// BSLLS:CognitiveComplexity-off
// Процедура не настолько сложна, уменшение когнинтивной сложности не требуется

Процедура ЗаполнитьСодержимоеВложений(Вложения, Знач СсылкаНаОбъект, ТаблицаПрикреплённыхФайловОбъекта, КомандыПечатиФормы)
	ИндексВложения = -1;
	// Попутно далим ПФ без данных (отсутствие прикрепленного файла)
	ВложенияВрем = Новый Массив;
	Для Каждого Вложение Из Вложения Цикл
		ИндексВложения = ИндексВложения + 1;
		Если	get_prop(Вложение["Файл"], "Ссылка") <> Неопределено Тогда
			ВложенияВрем.Добавить(Вложение);
			Продолжить;
		КонецЕсли;
		Если	(Вложение["Файл"] = Неопределено ИЛИ get_prop(Вложение["Файл"], "ПечатнаяФормаДокумента") = Неопределено)
			И
			(get_prop(Вложение["Файл"], "ПрисоединенныйФайл") <> Истина) Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьПФ =  Истина;
		Если get_prop(Вложение["Файл"], "ПрисоединенныйФайл", Ложь) = Истина Тогда
			//Прикреплённый файл  
			ЗаполнитьСодержимоеВложенийПрикрепленногоФайла(Вложение, ТаблицаПрикреплённыхФайловОбъекта);
			СвойствоПрисоединенныйФайл = get_prop(Вложение["Файл"], "ПрисоединенныйФайл", Ложь);
			Если СвойствоПрисоединенныйФайл <> Ложь Тогда
				ДобавитьПФ =  Ложь;
			КонецЕсли;
		Иначе
			// Обычная печатная форма
			Попытка
				ЗаполнитьСодержимоеВложенийПечатнаяФорма(Вложение, СсылкаНаОбъект, КомандыПечатиФормы);
			Исключение
				ДобавитьПФ =  Ложь;
			КонецПопытки;
		КонецЕсли;
		
		Если ДобавитьПФ Тогда
			ВложенияВрем.Добавить(Вложение);
		КонецЕсли;
	КонецЦикла;
	Вложения = ВложенияВрем;	
КонецПроцедуры

// BSLLS:CognitiveComplexity-on

// BSLLS:TooManyReturns-off

Функция ПолучитьПечатныеФормы(Знач СсылкаНаОбъект, ВходящиеВложения = Неопределено, БезСодержимого = Ложь) Экспорт
	Вложения = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ВходящиеВложения));
	Если ТипЗнч(Вложения) <> Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СсылкаНаОбъект = Неопределено Тогда
		Возврат Вложения;
	Иначе
		ВидМетаданных = СсылкаНаОбъект.Метаданные();
	КонецЕсли;
		
	Попытка
		КомандыПечатиФормы	= ОбщийМодульКонфигурации("УправлениеПечатью").КомандыПечатиОбъекта(ВидМетаданных);
	Исключение
		// У объекта в менеджере объекта отсутствует процедура - ДобавитьКомандыПечати 
		Возврат Вложения;
	КонецПопытки;
	
	// Прикреплённые файлы
	ТаблицаПрикрепленныхФайловОбъекта = ПрикрепленныеФайлыКОбъекту(СсылкаНаОбъект);
	// Прикреплённые файлы
	
	// Оставим только доступные пользователю команды печати
	Отбор = Новый Структура("Отключена, СкрытаФункциональнымиОпциями", Ложь, Ложь);
	КомандыПечатиВр = КомандыПечатиФормы.Скопировать();
	КомандыПечатиВр.Очистить();
	КомандыПФ = КомандыПечатиФормы.НайтиСтроки(Отбор);
	Для Каждого Запись Из КомандыПФ Цикл
		СтрПФ = КомандыПечатиВр.Добавить();	
		ЗаполнитьЗначенияСвойств(СтрПФ, Запись);
	КонецЦикла;	
	
	Если БезСодержимого = Истина Тогда
		Для Каждого Запись Из КомандыПФ Цикл
			Файл = Новый Структура("ПечатнаяФормаДокумента", Истина);
			Вложения.Добавить(Новый Структура("Название,Идентификатор,Файл", Запись.Представление, Запись.Идентификатор, Файл));	
		КонецЦикла;	
		Возврат Вложения;
	КонецЕсли;
	
	ЗаполнитьСодержимоеВложений(Вложения, СсылкаНаОбъект, ТаблицаПрикрепленныхФайловОбъекта, КомандыПечатиВр);
	Возврат Вложения;		
КонецФункции

// BSLLS:TooManyReturns-on

// Подготавливает имя прикрепленного файла
//
// Параметры:
//  ИмяФайла - Строка - имя файла.
//  ТипыФайлов - Массив - типы файлов.
//
// Возвращаемое значение:
//   Строка - подготовленное имя файла
//
//DynamicDirectiv
Функция ПодготовитьИмяПрикреплённогоФайла(Знач ИмяФайла, ТипыФайлов)
	ИмяФайлаНовое = ИмяФайла;
	Для Каждого ТипФайла Из ТипыФайлов Цикл
		ИмяФайлаНовое = СтрЗаменить(ИмяФайлаНовое, "."+ТипФайла.Ключ ,"");
	КонецЦикла;
	Возврат ИмяФайлаНовое;
КонецФункции

Функция ИмяСправочникаПрисоединенныеФайлы(ДокументССылка) 
	ИмяОбъекта = СтрРазделить82(ДокументССылка.Метаданные().ПолноеИмя(), ".")[1];
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник." + ИмяОбъекта + "ПрисоединенныеФайлы");
	Если ОбъектМетаданных = Неопределено Тогда
		// КАМИН хранит все вложения по документам в ДокументыПрисоединенныеФайлы, "немного" отойдя от постулатов БСП
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник." + "ДокументыПрисоединенныеФайлы");
	КонецЕсли;
	Если ОбъектМетаданных = Неопределено Тогда
		// У объекта отстутсвует справочник для прикреплённых файлов
		// дальнейшие действия вызовут ошибку
		ЗаписьЖурналаРегистрации(
			ЛокализацияНазваниеПродукта()+" Ошибка Не найден справочник ""Присоединенные файлы""",
			УровеньЖурналаРегистрации.Ошибка,
			,
			ДокументССылка,
			СокрЛП(ДокументССылка),
	    	РежимТранзакцииЗаписиЖурналаРегистрации .Независимая
		);
		Возврат Неопределено;
	КонецЕсли;
	Возврат ОбъектМетаданных.ПолноеИмя();	
КонецФункции	

Функция НайтиПрисоединенныйФайл(ДокументССылка, НазваниеБезРасширения, Тип)   
	ПрисоединенныйФайлО	= Неопределено;
	ВладелецФайлов = ДокументССылка;
	МассивВсеВложений = ПрикрепленныеФайлыКОбъекту(ВладелецФайлов);
	Для Каждого ПрисоединенныйФайл Из МассивВсеВложений Цикл
	
		Если НЕ Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ПрисоединенныйФайл)) Тогда
			//Справочник из расширения (ЕТРН), БСП не умеет с ним работать, упадёт
			Возврат ПрисоединенныйФайлО;
		КонецЕсли;
		
		//Если ПодготовитьИмяПрикреплённогоФайла(ПрисоединенныйФайл.Наименование, ТипыФайлов)	= ПодготовитьИмяПрикреплённогоФайла(НазваниеБезРасширения, ТипыФайлов) Тогда
		Если ПрисоединенныйФайл.Наименование = НазваниеБезРасширения Тогда
			ПрисоединенныйФайлО	= ПрисоединенныйФайл.ПолучитьОбъект();
			Если ПрисоединенныйФайл.ПометкаУдаления Тогда
				ПрисоединенныйФайлО.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
			Если ПрисоединенныйФайл.Расширение	<> Тип Тогда
				//Со сменой данных, мог и поменяться Тип вложения
				ПрисоединенныйФайлО.Расширение	= Тип;
				ПрисоединенныйФайлО.Записать();
			КонецЕсли;
			ПрисоединенныйФайлО = ПрисоединенныйФайлО.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	Возврат ПрисоединенныйФайлО;
КонецФункции

Процедура ЗаписатьНовоеВложение(ВладелецФайлов, НазваниеБезРасширения, Тип, ВременноеХранилище, ПодписанЭП = Ложь, Зашифрован = Ложь) 
	ОбщийМодульРаботаСФайлами = ОбщийМодульКонфигурации("РаботаСФайлами");
	Если ОбщийМодульРаботаСФайлами = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МассивДопРеквизитов = Новый Массив;
	МассивДопРеквизитов.Добавить("ПодписанЭП");
	МассивДопРеквизитов.Добавить("Зашифрован");
	Попытка
		ПараметрыФайла = ОбщийМодульРаботаСФайлами.ПараметрыДобавленияФайла(МассивДопРеквизитов);
	Исключение
		Возврат;
	КонецПопытки;
	ОбщийМодульПользователи = ОбщийМодульКонфигурации("Пользователи");
	Попытка
		Автор = ОбщийМодульПользователи.ТекущийПользователь();
	Исключение
		Автор = Неопределено;
	КонецПопытки;
	ПараметрыФайла.Автор = Автор;
	ПараметрыФайла.ВладелецФайлов = ВладелецФайлов;
	ПараметрыФайла.ИмяБезРасширения = НазваниеБезРасширения;
	ПараметрыФайла.РасширениеБезТочки = Тип;
	ПараметрыФайла.ПодписанЭП = ПодписанЭП;
	ПараметрыФайла.Зашифрован = Зашифрован;
	Попытка
		ОбщийМодульРаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ВременноеХранилище);	
	Исключение
		Возврат;
	КонецПопытки;
КонецПроцедуры	

Процедура ЗаписатьСуществующееВложение(ПрисоединенныйФайл, ВременноеХранилище, ПодписанЭП = Ложь, Зашифрован = Ложь)
	ОбщийМодульРаботаСФайлами = ОбщийМодульКонфигурации("РаботаСФайлами");
	ОбщийМодульОбщегоНазначения = ОбщийМодульКонфигурации("ОбщегоНазначения");
	
	Если ОбщийМодульРаботаСФайлами = Неопределено ИЛИ ОбщийМодульОбщегоНазначения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИнформацияОФайле = Новый Структура;
	ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", ВременноеХранилище);
	ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", "");
	// ** ОБновляем реквизиты ПодписанЭП и Зашифрован
	// Обновить двоичные данные можем через РаботаСФайлами, а реквизиты нет. ШИКАРНО
	//ИнформацияОФайле.Вставить("ПодписанЭП", ПодписанЭП);
	//ИнформацияОФайле.Вставить("Зашифрован", Зашифрован);
	
	// Попробуем обойтись без УстановитьПривилегированныйРежим
	Попытка
		ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();		
	
		Если ОбщийМодульОбщегоНазначения.ЕстьРеквизитОбъекта("ПодписанЭП", ПрисоединенныйФайл.Метаданные()) Тогда
			ПрисоединенныйФайлОбъект.ПодписанЭП = ПодписанЭП;
		КонецЕсли;
		Если ОбщийМодульОбщегоНазначения.ЕстьРеквизитОбъекта("Зашифрован", ПрисоединенныйФайл.Метаданные()) Тогда
			//Нет сертификатов нет и шифрования
			ПрисоединенныйФайлОбъект.Зашифрован = Зашифрован и ПодписанЭП;
		КонецЕсли;
		ПрисоединенныйФайлОбъект.Записать();
		ОбщийМодульРаботаСФайлами.ОбновитьФайл(ПрисоединенныйФайл, ИнформацияОФайле);
	Исключение
		Возврат;
	КонецПопытки;
КонецПроцедуры		
	
// Загружает вложение
//
// Параметры:
//  ДокументССылка - ДокументСсылка - ссылка на документ-владелец файла.
//  Файл - Строка - файл в base64.
//  Название - Строка - название.
//  context - Структура - контекст.
//  block_context - Соответсвие - контекст блока.
//
//DynamicDirective
Процедура ЗагрузитьВложение(ДокументССылка, Файл, Название, context = Неопределено, block_context = Неопределено)
	ОбъектМетаданныхПрисоединенныеФайлы = ИмяСправочникаПрисоединенныеФайлы(ДокументССылка);
	Если ОбъектМетаданныхПрисоединенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НазваниеВМассив       = СтрРазделить82(Название, ".", Ложь);
	ДвоичныеДанные        = Base64Значение(Файл);
	ВременноеХранилище    = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	Тип                   = НазваниеВМассив[НазваниеВМассив.Количество() - 1];
	НазваниеБезРасширения = Лев(Название,          СтрДлина(Название) - СтрДлина(Тип) - 1);
	
	// Установка признака подписи файла
	ПодписанЭП = Ложь;
	Зашифрован = Ложь;
	
	ПрисоединенныйФайл = НайтиПрисоединенныйФайл(ДокументССылка, НазваниеБезРасширения, Тип);
	МодульРаботаСФайламиСлужебныйВызовСервера = ОбщийМодульКонфигурации("РаботаСФайламиСлужебныйВызовСервера");
	Если МодульРаботаСФайламиСлужебныйВызовСервера = Неопределено ИЛИ ПрисоединенныйФайл = Неопределено Тогда
		ТекущаяВерсия = ПрисоединенныйФайл;	
	Иначе
		ДанныеФайла = МодульРаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляСохранения(ПрисоединенныйФайл);
		ТекущаяВерсия = get_prop(ДанныеФайла, "ТекущаяВерсия");
		Если НЕ ЗначениеЗаполнено(ТекущаяВерсия) Тогда
			ТекущаяВерсия = ДанныеФайла.Ссылка;
		КонецЕсли;
	КонецЕсли;
	ВложениеНайдено = ЗначениеЗаполнено(ТекущаяВерсия);
	ЗашифрованИПодписанЭП = Зашифрован и ПодписанЭП;
	Если Не ВложениеНайдено Тогда
		ЗаписатьНовоеВложение(ДокументССылка,
			НазваниеБезРасширения,
			Тип,
			ВременноеХранилище,
			ПодписанЭП,
			ЗашифрованИПодписанЭП);
	Иначе   
		ЗаписатьСуществующееВложение(ТекущаяВерсия,
			ВременноеХранилище,
			Зашифрован,
			ЗашифрованИПодписанЭП);
	КонецЕсли;
КонецПроцедуры	


Функция ПолучитьДанныеПрисоединенногоФайла(ПечатнаяФормаДокументаКомандаСсылка) Экспорт
	ОбщийМодульРаботаСФайлами = ОбщийМодульКонфигурации("РаботаСФайламиСлужебныйВызовСервера");
	Если ОбщийМодульРаботаСФайлами = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Попытка
			Возврат ОбщийМодульРаботаСФайлами.ПолучитьДанныеФайла(ПечатнаяФормаДокументаКомандаСсылка,,Истина);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
КонецФункции

Процедура ИнициализацияНедостающихКонстант()
КонецПроцедуры

