
Функция ДобавитьЭлементФормы(Имя, Тип, Родитель, Видимость = Истина)
	Возврат Элементы.Добавить(Имя, Тип, Родитель);
КонецФункции

Процедура УстановитьДействиеНаЭлемент(Элемент, ИмяДействия, ИмяПроцедуры)
	Элемент.УстановитьДействие(ИмяДействия, ИмяПроцедуры);	
КонецПроцедуры	

Процедура УстановитьHTML(ПолеHTML, ТекстHTML)
	ЭтаФорма[ПолеHTML] = ТекстHTML;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыборИзСписка(СписокВыбора, ОписаниеОповещения, ЭлементФормы = Неопределено, ЗаголовокОкнаВыбора = "Выберите значение", ТекЭлемСписка = 0)
	// Проблема только при скрытии областей управляемой формы с двухфакторной авторизацией
	//Подглядел у 1с
	
	// обход ошибок платформы: в тонком клиенте не работает ПоказатьВыборИзСписка (ПоказатьВыборИзМеню не работает в веб-клиенте 
	// и в событии ПриИзмененииСодержимогоОбласти табличного документа - где мы его и хотим использовать прежде всего)
	# Если ВебКлиент Тогда
	
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, ЭлементФормы, ТекЭлемСписка);
		
	#Иначе

		СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, ЗаголовокОкнаВыбора, ТекЭлемСписка);
			
	#КонецЕсли
КонецПроцедуры

&НаКлиенте

Процедура ОбновитьДанныеНаФорме(Форма)
	Форма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте

Функция ПолучитьКнопкуКоманднойПанели(Знач ИмяПанели, Знач ИмяКнопки)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Возврат ЭлементыФормочки[ИмяКнопки];
КонецФункции

&НаКлиенте

Функция ПолучитьКомандуПодменю(Знач ЭлементРодитель, Знач ИмяКоманды)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Возврат ЭлементыФормочки[ИмяКоманды];
КонецФункции

&НаКлиенте

Процедура УстановитьЗаголовок(ЭлементФормы, ЗаголовокЭлемента)
	ЭлементФормы.Заголовок = ЗаголовокЭлемента;
КонецПроцедуры

