
Процедура УстановитьДействиеНаЭлемент(Элемент, ИмяДействия, ИмяПроцедуры)
	Элемент.УстановитьДействие(ИмяДействия, Новый Действие(ИмяПроцедуры));	
КонецПроцедуры	

Процедура УстановитьHTML(ПолеHTML, ТекстHTML)
	ПолучитьЭлементыФормы()[ПолеHTML].УстановитьТекст(ТекстHTML);
КонецПроцедуры

Процедура ОткрытьВыборИзСписка(СписокВыбора, ОписаниеОповещения, ЭлементФормы = Неопределено, ЗаголовокОкнаВыбора = "Выберите значение")
	ВыбранныйЭлемент = ВыбратьИзСписка(СписокВыбора, ЭлементФормы); 
	Выполнить("ВыполнитьОбработкуОповещения(ОписаниеОповещения, ВыбранныйЭлемент)");
КонецПроцедуры

Процедура ОбновитьДанныеНаФорме(Форма)
	Форма.Обновить();
КонецПроцедуры


