
Процедура УстановитьДействиеНаЭлемент(Элемент, ИмяДействия, ИмяПроцедуры)
	Элемент.УстановитьДействие(ИмяДействия, Новый Действие(ИмяПроцедуры));	
КонецПроцедуры	

Процедура УстановитьHTML(ПолеHTML, ТекстHTML)
	ПолучитьЭлементыФормы()[ПолеHTML].УстановитьТекст(ТекстHTML);
КонецПроцедуры

Процедура ОткрытьВыборИзСписка(СписокВыбора, ОписаниеОповещения, ЭлементФормы = Неопределено, ЗаголовокОкнаВыбора = "Выберите значение", ТекЭлемСписка = 0)
	ВыбранныйЭлемент = ВыбратьИзСписка(СписокВыбора, ЭлементФормы, ТекЭлемСписка); 
	ВыполнитьSabyОписаниеОповещения(ОписаниеОповещения, ВыбранныйЭлемент);
КонецПроцедуры

Процедура ОбновитьДанныеНаФорме(Форма)
	Форма.Обновить();
КонецПроцедуры

Функция ПолучитьКнопкуКоманднойПанели(Знач ИмяПанели, Знач ИмяКнопки)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Возврат ЭлементыФормочки[ИмяПанели].Кнопки[ИмяКнопки];
КонецФункции

Функция ПолучитьКомандуПодменю(Знач ЭлементРодитель, Знач ИмяКоманды)
	Возврат ЭлементРодитель.Кнопки[ИмяКоманды];
КонецФункции

Процедура УстановитьЗаголовок(ЭлементФормы, ЗаголовокЭлемента)
	ЭлементФормы.Текст = ЗаголовокЭлемента;
КонецПроцедуры
