
Функция ПолучитьПрямуюССылку(ЗадачаСсылка)
	ПреобразованнаяСсылка = СтрЗаменить(ЗадачаСсылка, "://ie-1c.", "://web1c.");
	ПреобразованнаяСсылка = СтрЗаменить(ПреобразованнаяСсылка, "://fix-ie-1c.", "://fix-web1c.");
	ПреобразованнаяСсылка = СтрЗаменить(ПреобразованнаяСсылка, "://test-ie-1c.", "://test-web1c.");
	ПреобразованнаяСсылка = СтрЗаменить(ПреобразованнаяСсылка, "://pre-test-ie-1c.", "://pre-test-web1c.");
	Возврат ПреобразованнаяСсылка;
КонецФункции

Процедура УстановитьРежимWebInWeb()
    Обработка = МодульОбъекта();
	WebInWebHtml = Обработка.ПолучитьМакет("WebInWeb").ПолучитьТекст();
	АдресСтраницыССлужебнымиПараметрами = ПолучитьПрямуюССылку(АдресСтраницыССлужебнымиПараметрами);
	АдресСтраницыССлужебнымиПараметрами = СтрЗаменить(WebInWebHtml, "%URL%", АдресСтраницыССлужебнымиПараметрами);
КонецПроцедуры

