Процедура ПриОткрытии()
	ПодключитьОбработчикОжидания("ПослеОткрытия", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьOperationUuid(Источник) 
	OperationUuid = get_prop(Источник,"operation_uuid", Неопределено);
	Если OperationUuid <> Неопределено Тогда
		Команда.Вставить("operation_uuid",OperationUuid); 
		Возврат;
	КонецЕсли; 
	OperationUuid = block_obj_get_path_value(Источник, "result.Uuid",Неопределено);
	Если block_obj_get_path_value(Источник, "result.Uuid",Неопределено) <> Неопределено Тогда
		Команда.Вставить("operation_uuid",OperationUuid); 
		Возврат;	
	КонецЕсли;	
КонецПроцедуры

// BSLLS:CognitiveComplexity-off

&НаКлиенте
Процедура ПослеОткрытия()
	ТекстСообщенияПоУмолчанию = "Операция выполняется";
	ТекстСообщения = "Операция выполняется";
	ПараметрыКоманды = Команда;
	
	ДлительнаяОперация = Новый Структура("form", ЭтаФорма);
	ПараметрыКоманды.Вставить("ДлительнаяОперация", ДлительнаяОперация);
	
	ИмяМетодаКоманды = get_prop(ПараметрыКоманды, "ИмяМетода");
	Если ИмяМетодаКоманды = "ВыгрузитьПИМыИзОблака" Тогда    
		ПараметрыКоманды.ПараметрыВыполнения.Вставить("ДлительнаяОперация", ДлительнаяОперация);	
		Результат = МодульОбъекта().ВыгрузитьПИМыИзОблака(ПараметрыКоманды.ПараметрыВыполнения);
	ИначеЕсли ИмяМетодаКоманды = "ЗагрузитьПИМыВОблако" Тогда 
		ПараметрыКоманды.ПараметрыВыполнения.Вставить("ДлительнаяОперация", ДлительнаяОперация);	
		Результат = МодульОбъекта().ЗагрузитьПИМыВОблако(ПараметрыКоманды.ПараметрыВыполнения);
	ИначеЕсли ИмяМетодаКоманды = "ЗагрузитьСопоставленияНаСервере" Тогда
		Результат = МодульОбъекта().ЗагрузитьСопоставленияНаСервере(ПараметрыКоманды);
	Иначе
	    Результат = МодульОбъекта().API_BLOCKLY_RUN_CLIENT(ПараметрыКоманды);
	КонецЕсли;
	
	КартинкаОповещения = КартинкаОшибка();
	Если Результат.Свойство("Status") И Результат.Status = "complete" Тогда
		КартинкаОповещения = КартинкаУспешно();
		Результатdata = Результат.Result; 
		ЗаполнитьOperationUuid(Результатdata);
		CountErrors = get_prop(Результатdata,"CountErrors",0);
		Если CountErrors > 0 Тогда
			КартинкаОповещения = КартинкаОшибка();
		КонецЕсли;
		ОшибкаAddon = get_prop(Результатdata,"result",Неопределено);
		ОшибкаAddon = get_prop(ОшибкаAddon,"CountErrors",0);

		Если ОшибкаAddon > 0 Тогда
			КартинкаОповещения = КартинкаОшибка();
		КонецЕсли;			
		Если ТекстСообщения = ТекстСообщенияПоУмолчанию Тогда
			ТекстОповещения = "Операция выполнена";
		Иначе
			ТекстОповещения = ТекстСообщения; 
		КонецЕсли;
	ИначеЕсли Результат.Свойство("Status") И Результат.Status = "error" Тогда
		РезультатData = get_prop(Результат, "Result");
		ТекстОповещения	= СокрЛП(get_prop(РезультатData, "message")) + " " +
			СокрЛП(get_prop(РезультатData, "detail"));
	Иначе
		ТекстОповещения	= "Неизвестная ошибка выполнения";	
	КонецЕсли;
	ТекстСообщения = ТекстОповещения;
	
	ЭлементыФормы.КартинкаСостояния.Картинка = КартинкаОповещения;
	Оповестить("Saby_ЗавершениеДлительнойОперации", Результат);
	МассивОперацийОЗагрузке = Новый Массив;
	МассивОперацийОЗагрузке.Добавить("Загрузка в " + ЛокализацияНазваниеПродукта()); //команда - "Загрузка в СБИС"
	МассивОперацийОЗагрузке.Добавить("Выгрузка в 1С");
	МассивОперацийОЗагрузке.Добавить("");
	НазваниеОперации = get_prop(ПараметрыКоманды,"НазваниеОперации","");
	
	Если МассивОперацийОЗагрузке.Найти(НазваниеОперации) <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(Команда["ContextId"]) Тогда
			Команда.Вставить("ContextId", get_prop(Результат, "ContextId"));
		КонецЕсли;
		ЭлементыФормы.ТекстСообщения.Гиперссылка = ИСТИНА;
		ЭлементыФормы.ТекстСообщения.УстановитьДействие("Нажатие", Новый Действие("ОткрытьФормуОтчетаОЗагрузке"));
	КонецЕсли;
КонецПроцедуры

// BSLLS:CognitiveComplexity-on

Функция АдресСтраницыОтчетОЗагрузке(URL, extSyncDocId) 
	Возврат URL+"/ext-sync-doc/page/?extSyncDocId="+extSyncDocId; 	 	
КонецФункции

Процедура ОткрытьФормуОтчетаОЗагрузке(Элемент) Экспорт
	context_param = НастройкиПодключенияПрочитать();
	URL = get_prop(context_param, "ApiUrl", "");
	АдресСтраницы = АдресСтраницыОтчетОЗагрузке(URL, Команда["ContextId"]); 
	АдресСтраницы = ПолучитьПрямуюССылку(АдресСтраницы);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	// BSLLS:UsingSynchronousCalls-off
	ЗапуститьПриложение(АдресСтраницы);
	// BSLLS:UsingSynchronousCalls-on
	#Иначе	
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);	
	#КонецЕсли

КонецПроцедуры


#Область include_core_base_Helpers_Картинки
#КонецОбласти

