
&НаСервере
Функция ДополнительнаяТехническаяИнформацияПрочитать() Экспорт
	КлючОбъекта = НазваниеПродукта();
	ДопТехИнфо = ПрочитатьИзХранилища(КлючОбъекта, "SabyДополнительнаяТехническаяИнформация");
	Возврат ДопТехИнфо;
КонецФункции

&НаСервере
Процедура ДополнительнаяТехническаяИнформацияЗаписать(ДопТехИнфо) Экспорт
	КлючОбъекта = НазваниеПродукта(); 
	ЗаписатьВХранилище(КлючОбъекта, "SabyДополнительнаяТехническаяИнформация", ДопТехИнфо);
КонецПроцедуры

&НаСервере
Процедура ДополнительнаяТехническаяИнформацияУдалить() Экспорт
	ДополнительнаяТехническаяИнформацияЗаписать(Неопределено);
КонецПроцедуры

