
&НаСервере
Функция СобратьТехническуюИнформациюНаСервере(Знач ТехИнфо)
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.СобратьТехническуюИнформациюССервера(ТехИнфо);
КонецФункции

&НаКлиенте
Функция СобратьТехническуюИнформациюОкружениеНаКлиенте()
	ТехИнфоОкружение = Новый Структура("ОС", Новый Структура);
	
	//"ОС": {
	//  "Клиент": {
	//    "ТипОС": "<значение>",
	//    "ЭтоLinux": "<Истина/Ложь>"
	//  }
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТипОС = СокрЛП(СистемнаяИнформация.ТипПлатформы);
	ЭтоЛинукс = НРег(Лев(ТипОС, 5)) = "linux";
	
	ТехИнфоОкружение.ОС.Вставить("Клиент", Новый Структура);
	ТехИнфоОкружение.ОС.Клиент.Вставить("ТипОС",    ТипОС);
	ТехИнфоОкружение.ОС.Клиент.Вставить("ЭтоLinux", ЭтоЛинукс);
	
	//"Приложение": {
	//  "УправляемоеПриложение": "<Истина/Ложь>",
	//  "РежимЗапускаПриложения": "<ТолстыйКлиентУправляемоеПриложение/ТолстыйКлиентОбычноеПриложение/ТонкийКлиент/Веб-клиент/МобильныйКлиент>",
	//  "ВстроенныйЯзык": "<значение>"
	//},
	ТехИнфоОкружение.Вставить("Приложение", Новый Структура);
	ТехИнфоОкружение.Приложение.Вставить("УправляемоеПриложение",
											ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение);
	ТехИнфоОкружение.Приложение.Вставить("РежимЗапускаПриложения", РежимЗапускаПриложенияНаКлиенте());
	ТехИнфоОкружение.Приложение.Вставить("ВстроенныйЯзык", ТекущийЯзыкСистемы());
	
	Возврат Новый Структура("Окружение", ТехИнфоОкружение);
КонецФункции

#Область include_core_base_ТехническаяИнформация_ПереопределяемыйНаКлиенте
#КонецОбласти

&НаКлиенте
Функция СобратьТехническуюИнформациюНаКлиенте()
	ТехИнфо = Новый Структура;
	
	// 1. Сбор тех.информации окружения на клиенте в структуру
	ОкружениеНаКлиенте = СобратьТехническуюИнформациюОкружениеНаКлиенте();
	ОбновитьСтруктуруРекурсивно(ТехИнфо, ОкружениеНаКлиенте);
	// 2. Сбор доп.тех.информации на клиенте в структуру
	ДопТехИнфо = СобратьТехническуюИнформациюПереопределяемыйНаКлиенте();
	ОбновитьСтруктуруРекурсивно(ТехИнфо, ДопТехИнфо);
	
	Возврат ТехИнфо;
КонецФункции

&НаКлиенте
Функция СобратьТехническуюИнформацию(ПолучитьСсылкуНаСбисДиск = Ложь) Экспорт
	ТехИнфо = Новый Структура;
	
	// 1. Сбор тех.информации окружения на клиенте + переопределяемый на клиенте - в структуру
	ТехИнфоНаКлиенте = СобратьТехническуюИнформациюНаКлиенте();
	ОбновитьСтруктуруРекурсивно(ТехИнфо, ТехИнфоНаКлиенте);
	// 2. Сбор информации на сервере + доп. информация на сервере + переопределяемый на сервере
	//    Результат = сразу архив строкой в base64, т.к. ЗаписьZipФайла нет на веб-клиенте
	Результат = СобратьТехническуюИнформациюНаСервере(ТехИнфо);
	
	// Елси требуется загрузка на СБИС-диск
	Если ПолучитьСсылкуНаСбисДиск = Истина Тогда
		ДанныеДляЗагрузки = Новый Структура;
		ДанныеДляЗагрузки.Вставить("Имя", "ТехническаяИнформацияВнешнейСистемы.zip");
		ДанныеДляЗагрузки.Вставить("ContentType", "application/zip");
		ДанныеДляЗагрузки.Вставить("ДвоичныеДанные", Результат);
		ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
		Результат = ТранспортИнтеграции.ЗагрузитьВременныеФайлыНаДискСБИС(
						context_params,
						Новый Структура("Файл", ДанныеДляЗагрузки));
		Попытка
			Результат = Результат.Файл.Ссылка;
		Исключение
			Результат = "";
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

