
&НаСервере
Функция СобратьТехническуюИнформациюФайлПоКонстантам(Константы) Экспорт
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.ДобавитьСтроку("" + Символы.ПС
						  + ";  Константы конфигурации внешней системы" + Символы.ПС + Символы.ПС + "[Константы]");
	Для Каждого ТекущаяКонстанта Из Константы Цикл
		Попытка
			ТекстДок.ДобавитьСтроку("; " + СокрЛП(ТекущаяКонстанта.Синоним));
			ТекстДок.ДобавитьСтроку(ТекущаяКонстанта.Имя + " = " + СокрЛП(ТекущаяКонстанта.Значение) + Символы.ПС);
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	Возврат ТекстДок;
КонецФункции

&НаСервере
Функция СобратьТехническуюИнформациюПоКонстантам() Экспорт
	ТехИнфоКонстанты = Новый Массив;
	Для Каждого ТекущаяКонстанта Из Метаданные.Константы Цикл
		Попытка
			ИмяКонстанты = ТекущаяКонстанта.Имя;
			ЗначениеКонстанты = СокрЛП(Константы[ИмяКонстанты].Получить());
			ТехИнфоКонстанта = Новый Структура;
			ТехИнфоКонстанта.Вставить("Имя", ИмяКонстанты);
			ТехИнфоКонстанта.Вставить("Синоним", СокрЛП(ТекущаяКонстанта.Синоним));
			ТехИнфоКонстанта.Вставить("Значение", ЗначениеКонстанты);
			ТехИнфоКонстанты.Добавить(ТехИнфоКонстанта);
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	Возврат Новый Структура("Константы", ТехИнфоКонстанты);
КонецФункции

// BSLLS:CognitiveComplexity-off
// BSLLS:MethodSize-off
// BSLLS:DeprecatedCurrentDate-off
// BSLLS:FunctionOutParameter-off

&НаСервере
Функция СобратьТехническуюИнформациюОкружение(context_params = Неопределено) Экспорт
	Если context_params = Неопределено Тогда
		context_params = НастройкиПодключенияПрочитать();
	КонецЕсли;
	
	ТехИнфоОкружение = Новый Структура;
	
	ТехИнфоОкружение.Вставить("ДатаВремяСбора", Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy HH:mm:ss'"));
	ТехИнфоОкружение.Вставить("ТипВнешнейСистемы", "1С");
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	//"ОС": {
	//  "Сервер": {
	//    "ТипОС": "<значение>",
	//    "ЭтоLinux": "<Истина/Ложь>"
	//  },
	ТипОС = СокрЛП(СистемнаяИнформация.ТипПлатформы);
	ЭтоЛинукс = НРег(Лев(ТипОС, 5)) = "linux";
	ТехИнфоОкружение.Вставить("ОС", Новый Структура("Сервер", Новый Структура));
	ТехИнфоОкружение.ОС.Сервер.Вставить("ТипОС", ТипОС);
	ТехИнфоОкружение.ОС.Сервер.Вставить("ЭтоLinux", ЭтоЛинукс);
	
	//"Платформа": {
	//  "ВерсияПлатформы": "<значение>",
	//  "ВерсияБСП": "<значение>"
	//},
	ТехИнфоОкружение.Вставить("Платформа", Новый Структура);
	ТехИнфоОкружение.Платформа.Вставить("ВерсияПлатформы", СистемнаяИнформация.ВерсияПриложения);
	ТехИнфоОкружение.Платформа.Вставить("ВерсияБСП", ВерсияБСП());
	
	//"Конфигурация": {
	//  "Имя": "<значение>",
	//  "Версия": "<значение>",
	//  "КраткаяИнформация": "<значение>",
	//  "ПолнаяИнформация": "<значение>",
	//  "РежимСовместимости": "<значение>",
	//  "РежимСовместимостиИнтерфейса": "<значение>"
	//},
	ТехИнфоОкружение.Вставить("Конфигурация", Новый Структура);
	ТехИнфоОкружение.Конфигурация.Вставить("Имя", Метаданные.Имя);
	ТехИнфоОкружение.Конфигурация.Вставить("Версия", Метаданные.Версия);
	ТехИнфоОкружение.Конфигурация.Вставить("КраткаяИнформация", Метаданные.КраткаяИнформация);
	ТехИнфоОкружение.Конфигурация.Вставить("ПодробнаяИнформация", Метаданные.ПодробнаяИнформация);
	ТехИнфоОкружение.Конфигурация.Вставить("РежимСовместимости", СокрЛП(Метаданные.РежимСовместимости));
	Попытка
		ТехИнфоОкружение.Конфигурация.Вставить("РежимСовместимостиИнтерфейса", СокрЛП(Метаданные.РежимСовместимостиИнтерфейса));
	Исключение
		ТехИнфоОкружение.Конфигурация.Вставить("РежимСовместимостиИнтерфейса", "");
	КонецПопытки;
	
	//"РежимРаботыИБ": {
	//  "Тип": "<Файловый/Веб-сервер/Клиент-серверный>",
	//  "URL": "<значение>"
	//},
	СтрокаСоединенияИБ = СтрокаСоединенияИнформационнойБазы();
	РежимРаботыИБ = "Клиент-серверный";
	Если Найти(СтрокаСоединенияИБ, "File=") > 0 Тогда
		РежимРаботыИБ = "Файловый";
	Иначе
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		НомерСоединенияИБ = НомерСоединенияИнформационнойБазы();
		СеансыИБ = ПолучитьСеансыИнформационнойБазы();
		Для Каждого Соединение Из СеансыИБ Цикл
			Если Соединение.НомерСоединения = НомерСоединенияИБ Тогда
				Если ПустаяСтрока(Соединение.ИмяКомпьютера) Тогда
					РежимРаботыИБ = "Веб-сервер";
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
		// BSLLS:SetPrivilegedMode-on	
	КонецЕсли;
	ТехИнфоОкружение.Вставить("РежимРаботыИБ", Новый Структура);
	ТехИнфоОкружение.РежимРаботыИБ.Вставить("Тип", РежимРаботыИБ);
	ТехИнфоОкружение.РежимРаботыИБ.Вставить("URL", СтрокаСоединенияИБ);
	
	//"ПользовательИС": {
	//  "Представление": "<значение>",
	//  "Идентификатор": "<значение>",
	//  "Роли": [
	//    "<Роль1>",
	//    "<Роль2>",
	//    "<Роль3>"
	//  ]
	//},
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	МассивРолей = Новый Массив;
	РолиПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Роли;
	Для Каждого РольПользователя Из РолиПользователя Цикл
		МассивРолей.Добавить(СокрЛП(РольПользователя));
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	// BSLLS:SetPrivilegedMode-on	
	ТехИнфоОкружение.Вставить("ПользовательИС", Новый Структура);
	ТехИнфоОкружение.ПользовательИС.Вставить("Представление", ТекПользователь.ПолноеИмя);
	ТехИнфоОкружение.ПользовательИС.Вставить("Идентификатор", СокрЛП(ТекПользователь.УникальныйИдентификатор));
	ТехИнфоОкружение.ПользовательИС.Вставить("Роли", МассивРолей);

	//"Интеграция": {
	//  "UUIDИнтеграции": "<значение>"
	//},
	ТехИнфоОкружение.Вставить("Интеграция", Новый Структура);
	ТехИнфоОкружение.Интеграция.Вставить("UUIDИнтеграции", get_prop(context_params, "IntegrationUuid"));

	//"Расширения": [
	//  {
	//    "Имя": "<значение>",
	//    "Версия": "<значение>",
	//    "Назначение": "<значение>",
	//    "Активно": "<Истина/Ложь>",
	//    "БезопасныйРежим": "<Истина/Ложь>",
	//    "ЗащитаОтОпасныхДействий": "<Истина/Ложь>",
	//    "ИспользуетсяВРаспределительнойИБ": "<Истина/Ложь>",
	//    "ОбластьДействия": "<значение>",
	//    "ИспользоватьОсновныеРолиДляВсехПользователей": "<Истина/Ложь>"
	//  }
	//],
	МассивРасширений = Новый Массив;
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда 
		Расширения = РасширенияКонфигурации.Получить();
		Для Каждого РасширениеКонфигурации Из Расширения Цикл
			ЭлементРасширение = Новый Структура;
			ЭлементРасширение.Вставить("Имя", РасширениеКонфигурации.Имя);
			ЭлементРасширение.Вставить("Версия", РасширениеКонфигурации.Версия);
			ЭлементРасширение.Вставить("Назначение", СокрЛП(РасширениеКонфигурации.Назначение));
			ЭлементРасширение.Вставить("Активно", СокрЛП(РасширениеКонфигурации.Активно));
			ЭлементРасширение.Вставить("БезопасныйРежим", СокрЛП(РасширениеКонфигурации.БезопасныйРежим));
			ЭлементРасширение.Вставить("ЗащитаОтОпасныхДействий", 
											СокрЛП(РасширениеКонфигурации.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях));
			ЭлементРасширение.Вставить("ИспользуетсяВРаспределительнойИБ",
											СокрЛП(РасширениеКонфигурации.ИспользуетсяВРаспределеннойИнформационнойБазе));
			ЭлементРасширение.Вставить("ОбластьДействия", СокрЛП(РасширениеКонфигурации.ОбластьДействия));
			ЭлементРасширение.Вставить("ИспользоватьОсновныеРолиДляВсехПользователей",
											СокрЛП(РасширениеКонфигурации.ИспользоватьОсновныеРолиДляВсехПользователей));
			МассивРасширений.Добавить(ЭлементРасширение);
		КонецЦикла;
	#КонецЕсли
	ТехИнфоОкружение.Вставить("Расширения", МассивРасширений);

	//"ИнтеграционныйМодуль": {
	//  "Имя": "<значение>",
	//  "ИмяПродукта": "<значение>",
	//  "Версия": "<значение>",
	//  "Режим": "<Файл/ВнешниеОбработки/Расширение/ОбъектМетаданных>",
	//  "Источник": "<значение>"
	//},
	Имя = НазваниеПродукта();
	Режим = "Расширение";
	Если НРег(Лев(Имя, 2)) = "vo" Тогда
		Режим = "ВнешниеОбработки";
	КонецЕсли;
	ТехИнфоОкружение.Вставить("ИнтеграционныйМодуль", Новый Структура);
	ТехИнфоОкружение.ИнтеграционныйМодуль.Вставить("Имя", Имя);
	ТехИнфоОкружение.ИнтеграционныйМодуль.Вставить("ИмяПродукта", ИмяПродукта());
	ТехИнфоОкружение.ИнтеграционныйМодуль.Вставить("Версия", ПолучитьИмяФайлаИНомерТекущейВерсии()[1]);
	ТехИнфоОкружение.ИнтеграционныйМодуль.Вставить("Режим", Режим);
	ТехИнфоОкружение.ИнтеграционныйМодуль.Вставить("Источник", ""); // ??? что такое ???

	//"Коннектор": {
	//  "Сервис": "<URL>",
	//  "IdАккаунта": "<число>",
	//  "IdПользователя": "<число>",
	//  "UserAgent": "<строка>",
	//  "ConnectionID": "<идентификатор>",
	//  "ИмяТранспорта": "<строка>",
	//  "ВерсияТранспорта": "<строка>"
	//},
	params = Новый Структура("id", get_prop(context_params, "ConnectionUuid"));
	Попытка
		connection_info = ТранспортИнтеграции.local_helper_read_connection(context_params, params);
	Исключение
		connection_info = Новый Структура("Data", Новый Массив);
	КонецПопытки;
	ДанныеОВерсии = ПолучитьИмяФайлаИНомерТекущейВерсии();
	ИдПриложения = "" + ДанныеОВерсии[0] + "/" + ДанныеОВерсии[1];
	ТехИнфоОкружение.Вставить("Коннектор", Новый Структура);
	ТехИнфоОкружение.Коннектор.Вставить("Сервис", get_prop(context_params, "service"));
	ТехИнфоОкружение.Коннектор.Вставить("IdАккаунта", get_prop(connection_info, "account"));
	ТехИнфоОкружение.Коннектор.Вставить("IdПользователя", get_prop(connection_info, "user"));
	ТехИнфоОкружение.Коннектор.Вставить("UserAgent", ИдПриложения);
	ТехИнфоОкружение.Коннектор.Вставить("ConnectionID", get_prop(connection_info, "ConnectionId"));
	ТехИнфоОкружение.Коннектор.Вставить("ИмяТранспорта", ВидТранспорта(context_params));
	ТехИнфоОкружение.Коннектор.Вставить("ВерсияТранспорта", "");

	//"ДанныеПодключения": {
	//  "СпособФормирования": "<СБИСПараметры/Data>",
	//  "Содержимое": [
	//    {
	//      "Ключ": "<имя_параметра>",
	//      "Значение": "<значение_параметра>"
	//    }
	//  ],
	//  "Ошибка": "<значение>"
	//},
	СодержимоеМассив = Новый Массив;
	Для Каждого Параметр Из get_prop(connection_info, "Data") Цикл
		Содержимое = Новый Структура;
		Содержимое.Вставить("Ключ", Параметр.Ключ);
		Содержимое.Вставить("Значение", Параметр.Значение);
		СодержимоеМассив.Добавить(Содержимое);
	КонецЦикла;
	ТехИнфоОкружение.Вставить("ДанныеПодключения", Новый Структура);
	ТехИнфоОкружение.ДанныеПодключения.Вставить("СпособФормирования", "Data");
	ТехИнфоОкружение.ДанныеПодключения.Вставить("Содержимое", СодержимоеМассив);
	ТехИнфоОкружение.ДанныеПодключения.Вставить("Ошибка", "");
	
	//"НастройкиПользователя": [
	//  {
	//    "Ключ": "<имя_параметра>",
	//    "Значение": "<значение_параметра>"
	//  }
	//],
	Настройки = Новый Массив;
	Настройки.Добавить(Новый Структура("Ключ, Значение",
						"ExchangeCatalog", get_prop(context_params, "ExchangeCatalog")));
	Настройки.Добавить(Новый Структура("Ключ, Значение",
						"SendDocNumberDeleteBasePrefix", get_prop(context_params, "SendDocNumberDeleteBasePrefix")));
	Настройки.Добавить(Новый Структура("Ключ, Значение",
						"SendDocNumberDeleteUserPrefix", get_prop(context_params, "SendDocNumberDeleteUserPrefix")));
	ТехИнфоОкружение.Вставить("НастройкиПользователя", Настройки);

	//"ОтчетОбОбмене": {
	//  "Ссылка": "<URL>"
	//}	
	ТехИнфоОкружение.Вставить("ОтчетОбОбмене", Новый Структура);
	ТехИнфоОкружение.ОтчетОбОбмене.Вставить("Ссылка", "");
	
	Возврат Новый Структура("Окружение", ТехИнфоОкружение);
КонецФункции
// BSLLS:FunctionOutParameter-on
// BSLLS:DeprecatedCurrentDate-on
// BSLLS:MethodSize-on
// BSLLS:CognitiveComplexity-on

// BSLLS:FunctionOutParameter-off

&НаСервере
Функция СобратьТехническуюИнформациюССервера(ТехИнфо = Неопределено, context_params = Неопределено) Экспорт
	Если context_params = Неопределено Тогда
		context_params = НастройкиПодключенияПрочитать();
	КонецЕсли;
	Если ТипЗнч(ТехИнфо) <> Тип("Структура") Тогда
		ТехИнфо = Новый Структура;
	КонецЕсли;
	
	// Окружение - структура
	ТехИнфоОкружение = СобратьТехническуюИнформациюОкружение(context_params);
	ОбновитьСтруктуруРекурсивно(ТехИнфо, ТехИнфоОкружение);
	// Константы - структура
	ТехИнфоКонстанты = СобратьТехническуюИнформациюПоКонстантам();
	ОбновитьСтруктуруРекурсивно(ТехИнфо, ТехИнфоКонстанты);
	
	// Переопределяемый - структура
	ДопТехИнфо = СобратьТехническуюИнформациюПереопределяемый();
	ОбновитьСтруктуруРекурсивно(ТехИнфо, ДопТехИнфо);
	
	// Формируем итоговый архив из структур с данными
	ИмяZip = ПолучитьИмяВременногоФайла(".zip"); 
	ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяZip, , , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Оптимальный);
	// Создание временных файлов
	ИмяКаталога = ПолучитьИмяВременногоФайла("") + РазделительКаталоговОС();
	СоздатьКаталог(ИмяКаталога);
	
	// 1. Окружение
	ИмяФайла = ИмяКаталога + "Окружение.json";
	ТекстПоОкружению = local_helper_json_encode(ТехИнфо.Окружение);
	ФайлДляЗаписи = Новый ТекстовыйДокумент; 
	ФайлДляЗаписи.УстановитьТекст(ТекстПоОкружению);
	ФайлДляЗаписи.Записать(ИмяФайла, КодировкаТекста.UTF8);
	ЗаписьZipФайла.Добавить(ИмяФайла, РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
							РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	// 2. Константы
	ИмяФайла = ИмяКаталога + "Константы.ini";
	ФайлДляЗаписи = СобратьТехническуюИнформациюФайлПоКонстантам(ТехИнфо.Константы);
	ФайлДляЗаписи.Записать(ИмяФайла);
	ЗаписьZipФайла.Добавить(ИмяФайла, РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
							РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	// ... 
	
	// Итоговый архив
	ЗаписьZipФайла.Записать();
	ДанныеАрхива = Новый ДвоичныеДанные(ИмяZip);
	ДанныеАрхива = Base64Строка(ДанныеАрхива);
	
	// Очистка временных файлов, данные уже в ДвоичныеДанныеАрхива
	УдалитьФайлы(ИмяКаталога);
	УдалитьФайлы(ИмяZip);

	Возврат ДанныеАрхива;
КонецФункции
// BSLLS:FunctionOutParameter-on

#Область include_core_base_ТехническаяИнформация_ПереопределяемыйМодульОбъекта
#КонецОбласти

