#Область include_core_base_Классы_ОбъектSABY_ОбъектSABY
#КонецОбласти

Функция НовыйБазовыйКомпонент(Имя)

	базовый_компонент = НовыйОбъектSABY();
	ОбъектSABY_УстановитьТип(базовый_компонент, "БазовыйКомпонент");
  
	базовый_компонент.Вставить("Имя", Имя); 
	базовый_компонент.Вставить("Идентификатор", "ГруппаОбычнаяБезОтображения");

	Методы = Новый Структура();
    Методы.Вставить("СформироватьИнтерфейс", "БазовыйКомпонент");
    ОбъектSABY_ЗарегистрироватьМетоды(базовый_компонент, Методы);

	Возврат базовый_компонент; 

КонецФункции

Процедура БазовыйКомпонент_УстановитьСвойстваЭлементу(Элемент, СтруктураСвойств)
	
	Для Каждого тСвойство Из СтруктураСвойств Цикл
		
		Элемент[тСвойство.Ключ] = тСвойство.Значение;	
		
	КонецЦикла;	
	
КонецПроцедуры  

&НаСервере
Функция БазовыйКомпонент_СоздатьЭлемент(ИмяЭлемента, Форма, ТипЭлемента, Родитель, ЭлементПеред = Неопределено)
	
	Если ЭлементПеред = Неопределено Тогда  
		
		НовыйЭлемент = Форма.Элементы.Добавить(ИмяЭлемента, ТипЭлемента, Родитель);  
		
	Иначе
		
		НовыйЭлемент = Форма.Элементы.Вставить(ИмяЭлемента, ТипЭлемента, Родитель, ЭлементПеред); 
		
	КонецЕсли;
	
	Возврат НовыйЭлемент; 
	
КонецФункции

Функция БазовыйКомпонент_ОбъединитьПараметры(Структура1, Структура2)
    ЦелеваяСтруктура = Новый Структура;

	Если Структура1 = Неопределено Тогда
		Возврат Структура2;
	КонецЕсли;

	Если Структура2 = Неопределено Тогда
		Возврат Структура1;
	КонецЕсли;

    // Копируем первую структуру полностью
    Для Каждого Элемент Из Структура1 Цикл
        ЦелеваяСтруктура.Вставить(Элемент.Ключ, Элемент.Значение);
    КонецЦикла;

    // Проходим по второй и добавляем только уникальные ключи
    Для Каждого Элемент Из Структура2 Цикл
        Если Не ЦелеваяСтруктура.Свойство(Элемент.Ключ) Тогда
            ЦелеваяСтруктура.Вставить(Элемент.Ключ, Элемент.Значение);
        КонецЕсли;
    КонецЦикла;

    Возврат ЦелеваяСтруктура;
КонецФункции

Функция БазовыйКомпонент_СоздатьКонтейнер(Имя, Форма, Родитель, ЭлементПеред = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	параметры_контейнера = Новый Структура;

	параметры_контейнера.Вставить("ВертикальноеПоложениеВГруппе", ВертикальноеПоложениеЭлемента.Центр); 
	параметры_контейнера.Вставить("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеЭлемента.Лево); 
	параметры_контейнера.Вставить("ВертикальноеПоложениеПодчиненных", ВертикальноеПоложениеЭлемента.Центр);
	параметры_контейнера.Вставить("ГоризонтальноеПоложениеПодчиненных", ГоризонтальноеПоложениеЭлемента.Лево);
	параметры_контейнера.Вставить("ГоризонтальныйИнтервал", ИнтервалМеждуЭлементамиФормы.Нет);
	параметры_контейнера.Вставить("РастягиватьПоГоризонтали", Ложь);  
	параметры_контейнера.Вставить("РастягиватьПоВертикали", Ложь);  
	параметры_контейнера.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда); 
	параметры_контейнера.Вставить("Высота", 1);

	параметры_контейнера = БазовыйКомпонент_ОбъединитьПараметры(ДопПараметры, параметры_контейнера);

	НовыйЭлемент = БазовыйКомпонент_СоздатьЭлемент(Имя, Форма, Тип("ГруппаФормы"), Родитель, ЭлементПеред);
	
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	
	БазовыйКомпонент_УстановитьСвойстваЭлементу(НовыйЭлемент, параметры_контейнера);
	
	Возврат НовыйЭлемент;	
	
КонецФункции

Функция БазовыйКомпонент_СоздатьДекорацию(Имя, Форма, Родитель, ЭлементПеред = Неопределено, ДопПараметры = Неопределено)  
	
	СвойстваДекорации = Новый Структура;

	СвойстваДекорации.Вставить("АвтоМаксимальнаяШирина", Истина);
	СвойстваДекорации.Вставить("АвтоМаксимальнаяВысота", Истина);
	СвойстваДекорации.Вставить("РастягиватьПоВертикали", Истина);
	СвойстваДекорации.Вставить("РастягиватьПоГоризонтали", Ложь);
	СвойстваДекорации.Вставить("Высота", 2);

	СвойстваДекорации = БазовыйКомпонент_ОбъединитьПараметры(ДопПараметры, СвойстваДекорации);
	
	НовыйЭлемент = БазовыйКомпонент_СоздатьЭлемент(Имя, Форма, Тип("ДекорацияФормы"), Родитель, ЭлементПеред);
	
	БазовыйКомпонент_УстановитьСвойстваЭлементу(НовыйЭлемент, СвойстваДекорации);
	
	Возврат НовыйЭлемент;
	
КонецФункции 

Функция БазовыйКомпонент_СоздатьИзображение(Имя, Форма, Родитель, Картинка, ЭлементПеред = Неопределено, 
	                                        ДопПараметры = Неопределено)
	
	НовыйЭлемент = БазовыйКомпонент_СоздатьДекорацию(Имя, Форма, Родитель, ЭлементПеред, ДопПараметры);	
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка = Картинка;
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция БазовыйКомпонент_СоздатьНадпись(Имя, Форма, Родитель, Надпись, ЭлементПеред = Неопределено, ДопПараметры = Неопределено)
	
	НовыйЭлемент = БазовыйКомпонент_СоздатьДекорацию(Имя, Форма, Родитель, ЭлементПеред, ДопПараметры);	
	НовыйЭлемент.Заголовок = Надпись;
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция БазовыйКомпонент_ПараметрыПостроения()

	доп_параметры = Новый Структура;

	доп_параметры.Вставить("ВертикальноеПоложениеВГруппе", ВертикальноеПоложениеЭлемента.Центр); 
	доп_параметры.Вставить("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеЭлемента.Лево); 
	доп_параметры.Вставить("ВертикальноеПоложениеПодчиненных", ВертикальноеПоложениеЭлемента.Центр);
	доп_параметры.Вставить("ГоризонтальноеПоложениеПодчиненных", ГоризонтальноеПоложениеЭлемента.Лево);
	доп_параметры.Вставить("ГоризонтальныйИнтервал", ИнтервалМеждуЭлементамиФормы.Нет);
	доп_параметры.Вставить("РастягиватьПоГоризонтали", Ложь);  
	доп_параметры.Вставить("РастягиватьПоВертикали", Ложь);  
	доп_параметры.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда); 
	доп_параметры.Вставить("Высота", 1);

	доп_параметры.Вставить("Форма", ЭтаФорма); 
	доп_параметры.Вставить("ТипЭлемента", Тип("ГруппаФормы"));
	доп_параметры.Вставить("Родитель", ЭтаФорма);
	доп_параметры.Вставить("ЭлементПеред", ЭтаФорма.Элементы.Шапка);

	Возврат доп_параметры;

КонецФункции

Функция БазовыйКомпонент_ГруппаОбычнаяБезОтображения(базовый_компонент, ДопПараметры = Неопределено)
	
	НовыйЭлемент = БазовыйКомпонент_СоздатьЭлементФормы(базовый_компонент, ДопПараметры);
	
	НовыйЭлемент.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение 				= ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок 		= Ложь;
	
	Возврат НовыйЭлемент;
	
КонецФункции

&НаСервере
Функция БазовыйКомпонент_СоздатьЭлементФормы(базовый_компонент, ДопПараметры)
	
	ИмяЭлемента 		= ОбъектSABY_Получить(базовый_компонент, "Имя");
	
	Если ДопПараметры.ЭлементПеред = Неопределено Тогда  
		
		НовыйЭлемент = ДопПараметры.Форма.Элементы.Добавить(ИмяЭлемента, ДопПараметры.ТипЭлемента, ДопПараметры.Родитель);  
		
	Иначе
		
		НовыйЭлемент = ДопПараметры.Форма.Элементы.Вставить(ИмяЭлемента, ДопПараметры.ТипЭлемента, 
		                                                    ДопПараметры.Родитель, ДопПараметры.ЭлементПеред); 
		
	КонецЕсли;
	
	Возврат НовыйЭлемент; 
	
КонецФункции
