
#Область include_base_НазваниеПродукта
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_Helpers_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_ФоновыеЗаданияСервер_ПроверитьВыполнениеЗадания
#КонецОбласти

Процедура API_BLOCKLY_PREDEFINE_BACKGROUND(ПараметрыВызова) Экспорт
	
	ТранспортБлокли = Обработки.SABY.Создать();
	
	ТранспортБлокли.ЗагрузитьПредопределенныеОбъекты(ПараметрыВызова["connection_info"]);
КонецПроцедуры	

Процедура АвтоматическоеОбновлениеСтатусов(context_params=Неопределено) Экспорт
	
	ОбработкаТранспорт = МодульОбъекта();
	Если context_params	= Неопределено Тогда
		context_params	= ОбработкаТранспорт.ПроверитьНаличиеПараметровПодключения();
		Если context_params	= Неопределено Тогда
			ВызватьИсключение("Требуется авторизация");
		КонецЕсли;
	КонецЕсли;
	Если context_params <> Неопределено Тогда
		context_params.Удалить("ФоновоеЗаданиеНачало");
	КонецЕсли;

	ПараметрыВызова = МодульФоновогоЗаданияСервер().ПодготовитьПараметрыЗапускINIФоновымЗаданием(
		"ОбновитьСтатусы_send",
		Новый Структура,
		context_params);
	
	ОбработкаТранспорт.API_BLOCKLY_RUN(ПараметрыВызова);

КонецПроцедуры

Функция МодульОбъекта()
	Возврат Обработки[ИмяОбработки()].Создать();
КонецФункции

Процедура ПереносСтатусовSABYНаСервере() Экспорт  
	МодульОбъекта().ПеренестиСтатусыВТиповойРегистр();	
КонецПроцедуры

#Область include_core_base_ДлительныеОперации_Модуль
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_Сервер
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСервер
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПрогрессОперации
#КонецОбласти

#Область include_core_base_Криптография_НаКлиенте1С_НаСервере
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_ПараметрыСеанса
#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключения
#КонецОбласти

#Область include_core_base_Helpers_ОбщиеНастройки
#КонецОбласти

#Область include_core_base_Транспорт_ИмяСвойстваТранспорта 
#КонецОбласти

#Область include_core_base_Транспорт_ВидТранспорта
#КонецОбласти

#Область include_core_base_Транспорт_LocalHelper_Session
#КонецОбласти

