Функция ЭтоФоновоеЗадание() Экспорт
	Возврат ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание() <> Неопределено;
КонецФункции

Функция СообщениеПрогресса() Экспорт
	Возврат "СтандартныеПодсистемы.ДлительныеОперации";
КонецФункции

// Преобразует (сериализует) любое значение в XML-строку.
// Преобразованы в могут быть только те объекты, для которых в синтакс-помощнике указано, что они сериализуются.
// См. также ЗначениеИзСтрокиXML.
//
// Параметры:
//  Значение - Произвольный - значение, которое необходимо сериализовать в XML-строку.
//
// Возвращаемое значение:
//  Строка - XML-строка.
//
Функция ЗначениеВСтрокуXML(Значение) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Выполняет преобразование (десериализацию) XML-строки в значение.
// См. также ЗначениеВСтрокуXML.
//
// Параметры:
//  СтрокаXML - Строка - XML-строка, с сериализованным объектом..
//
// Возвращаемое значение:
//  Произвольный - значение, полученное из переданной XML-строки.
//
Функция ЗначениеИзСтрокиXML(СтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
КонецФункции

// Регистрирует информацию о ходе выполнения длительной операции.
// Во избежание избыточного потребления памяти и ее утечек при выполнении одной длительной операции 
// не следует сообщать прогресс более 100 раз.
//
// Для того чтобы выводить ход выполнения длительной операции для пользователя, следует установить 
// свойство ВыводитьПрогрессВыполнения в Истина (см. ДлительныеОперацииКлиент.ПараметрыОжидания).
// Его также можно получать отдельно при помощи функции ДлительныеОперации.ПрочитатьПрогресс.
//
// Параметры:
//  Процент                 - Число        - процент выполнения.
//  Текст                   - Строка       - информация о текущей операции.
//  ДополнительныеПараметры - Произвольный - любая дополнительная информация, которую необходимо передать на клиент. 
//                                           Значение должно быть простым (сериализуемым в XML-строку).
//
Процедура СообщитьПрогресс(Знач Процент = Неопределено, Знач Текст = Неопределено,
		Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ЭтоФоновоеЗадание() Тогда
		Возврат;
	КонецЕсли;
		
	ПередаваемоеЗначение = Новый Структура;
	Если Процент <> Неопределено Тогда
		ПередаваемоеЗначение.Вставить("Процент", Процент);
	КонецЕсли;
	Если Текст <> Неопределено Тогда
		ПередаваемоеЗначение.Вставить("Текст", Текст);
	КонецЕсли;
	Если ДополнительныеПараметры <> Неопределено Тогда
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") ИЛИ ТипЗнч(ДополнительныеПараметры) = Тип("Соответствие") Тогда
			ДополнительныеПараметры.Удалить("variables");
		КонецЕсли;
		ПередаваемоеЗначение.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	КонецЕсли;
	
	ПередаваемыйТекст = ЗначениеВСтрокуXML(ПередаваемоеЗначение);
	
	Текст = "{" + СообщениеПрогресса() + "}" + ПередаваемыйТекст;
	ОбщегоНазначения.СообщитьПользователю(Текст);
	
КонецПроцедуры

// Считывает информацию о ходе выполнения фонового задания и сообщения, которые в нем были сформированы.
//
// Параметры:
//   ИдентификаторЗадания - УникальныйИдентификатор - идентификатор фонового задания.
//   Режим                - Строка - "ПрогрессИСообщения", "Прогресс" или "Сообщения".
//
// Возвращаемое значение:
//   Структура:
//    * Прогресс  - Неопределено
//                - Структура - информация о ходе выполнения фонового задания, записанная процедурой СообщитьПрогресс:
//     ** Процент                 - Число  - необязательный. Процент выполнения.
//     ** Текст                   - Строка - необязательный. Информация о текущей операции.
//     ** ДополнительныеПараметры - Произвольный - необязательный. Любая дополнительная информация.
//    * Сообщения - ФиксированныйМассив - массив объектов СообщениеПользователю, которые были сформированы в фоновом задании.
//
// BSLLS:CognitiveComplexity-off
// Отсутствуем возможность уменьшения когнитивной сложности
// BSLLS:TooManyReturns-off
// Отсутствуем возможность уменьшения количество возвратов
Функция ПрочитатьПрогрессИСообщения(Знач ИдентификаторЗадания, Знач Режим = "ПрогрессИСообщения")
	
	ЗнчПрогрессИСообщения = "ПрогрессИСообщения";
	ЗнчСообщения	= "Сообщения";
	
	Сообщения = Новый ФиксированныйМассив(Новый Массив);
	Результат = Новый Структура("Сообщения, Прогресс", Сообщения, Неопределено);
	
	Задание = НайтиЗаданиеПоИдентификатору(ИдентификаторЗадания);
	Если Задание = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивСообщений = Задание.ПолучитьСообщенияПользователю(Истина);
	Если МассивСообщений = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Сообщения = Новый Массив;
	ЧитатьСообщения = (Режим = ЗнчПрогрессИСообщения Или Режим = ЗнчСообщения); 
	ЧитатьПрогресс  = (Режим = ЗнчПрогрессИСообщения Или Режим = ЗнчСообщения); 
	
	Если ЧитатьСообщения И Не ЧитатьПрогресс Тогда
		Результат.Сообщения = Новый ФиксированныйМассив(МассивСообщений);
		Возврат Результат;
	КонецЕсли;
	
	Для каждого Сообщение Из МассивСообщений Цикл
		Если ЧитатьПрогресс И СтрНачинаетсяС(Сообщение.Текст, "{") Тогда
			ДваСимвола = 2;
			Позиция = СтрНайти(Сообщение.Текст, "}");
			Если Позиция > ДваСимвола Тогда
				ИдентификаторМеханизма = Сред(Сообщение.Текст, ДваСимвола, Позиция - ДваСимвола);
				Если ИдентификаторМеханизма = СообщениеПрогресса() Тогда
					ПолученныйТекст = Сред(Сообщение.Текст, Позиция + 1);
					Результат.Прогресс = ЗначениеИзСтрокиXML(ПолученныйТекст);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЧитатьСообщения Тогда
			Сообщения.Добавить(Сообщение);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Сообщения = Новый ФиксированныйМассив(Сообщения);
	Возврат Результат;
// BSLLS:CognitiveComplexity-on
// BSLLS:TooManyReturns-on
КонецФункции

Функция НайтиЗаданиеПоИдентификатору(Знач ИдентификаторЗадания) Экспорт
	
	Если ТипЗнч(ИдентификаторЗадания) = Тип("Строка") Тогда
		ИдентификаторЗадания = Новый УникальныйИдентификатор(ИдентификаторЗадания);
	КонецЕсли;
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Возврат Задание;
	
КонецФункции

// Считывает информацию о ходе выполнения фонового задания и возвращает инф о пргрессе.
//
// Параметры:
//   ИдентификаторЗадания 		- УникальныйИдентификатор - идентификатор фонового задания.
//   ИсключениеПриОшибке        - Булево - Признак использоватения исключения.
//   ВыводитьПрогрессВыполнения - Булево - Признак вывода прогресса.
//   ВыводитьСообщения     		- Булево - Признак вывода сообщений.
//
// Возвращаемое значение:
//   Структура -  с прогрессом фонового задания
//   
// BSLLS:CognitiveComplexity-off
// Невозможно красиво и лаконично уменьшить когнитивную сложность.
Функция ОперацияВыполнена(Знач ИдентификаторЗадания, Знач ИсключениеПриОшибке = Ложь, Знач ВыводитьПрогрессВыполнения = Ложь, 
	Знач ВыводитьСообщения = Ложь) Экспорт
	Результат = Новый Структура;
	СтатусВыполняется = "Выполняется";
	Результат.Вставить("Статус", СтатусВыполняется);
	Результат.Вставить("КраткоеПредставлениеОшибки", Неопределено);
	Результат.Вставить("ПодробноеПредставлениеОшибки", Неопределено);
	Результат.Вставить("Прогресс", Неопределено);
	Результат.Вставить("Сообщения", Неопределено);
	Результат.Вставить("Наименование", Неопределено);
	
	Задание = НайтиЗаданиеПоИдентификатору(ИдентификаторЗадания);
	Если Задание = Неопределено Тогда
		Пояснение = НСтр("ru = 'Операция не выполнена из-за аварийного завершения фонового задания.
			|Фоновое задание не существует'") + ": " + Строка(ИдентификаторЗадания);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Длительные операции.Ошибка выполнения'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , Пояснение);
		Если ИсключениеПриОшибке Тогда
			ВызватьИсключение(НСтр("ru = 'Не удалось выполнить данную операцию.'"));
		КонецЕсли;
		Результат.Статус = "Ошибка";
		Результат.КраткоеПредставлениеОшибки = НСтр("ru = 'Операция не выполнена из-за аварийного завершения фонового задания.'");
		Возврат Результат;
	КонецЕсли;
	
	// Получим сообщение уведомления ФЗ
	Если ВыводитьПрогрессВыполнения Тогда
		ПараметрВыводаСообщения = "Прогресс";
		Если ВыводитьСообщения Тогда
			ПараметрВыводаСообщения = "ПрогрессИСообщения";
		КонецЕсли;
		ПрогрессИСообщения = ПрочитатьПрогрессИСообщения(ИдентификаторЗадания, ПараметрВыводаСообщения);
		Результат.Прогресс = ПрогрессИСообщения.Прогресс;
		Если ВыводитьСообщения Тогда
			Результат.Сообщения = ПрогрессИСообщения.Сообщения;
		КонецЕсли;
	Иначе
		Если ВыводитьСообщения Тогда
			Результат.Сообщения = Задание.ПолучитьСообщенияПользователю(Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Результат.Статус = СтатусВыполняется;
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		Результат.Статус = "Отменено";
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Результат.Статус = "Ошибка";
		Если Задание.ИнформацияОбОшибке <> Неопределено Тогда
			Результат.КраткоеПредставлениеОшибки   = КраткоеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
			Результат.ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
		КонецЕсли;
		Если ИсключениеПриОшибке Тогда
			Если Не ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
				ТекстСообщения = Результат.КраткоеПредставлениеОшибки;
			Иначе
				ТекстСообщения = НСтр("ru = 'Не удалось выполнить данную операцию.'");
			КонецЕсли;
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	Иначе
		Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Результат.Статус = "Выполнено";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
// BSLLS:CognitiveComplexity-on

// Проверка фонового задания
// Параметры:
//  ИдентификаторЗадания  - УникальныйИдентификатор - Идентификатор ФЗ
//
// Возвращаемое значение:
//   Строка,Неопределено   - Сообщение пользователю от ФЗ
//
Функция ПроверитьВыполнениеФоновогоЗадания(ИдентификаторЗадания) Экспорт

	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);		
	Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		СообщенияЗадания = Задание.ПолучитьСообщенияПользователю();
		Возврат СообщенияЗадания;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПроверитьВыполнениеФоновогоЗадания()

Процедура API_BLOCKLY_PREDEFINE_BACKGROUND(ПараметрыВызова) Экспорт
	
	ТранспортБлокли = Обработки.SABY.Создать();
	
	ТранспортБлокли.ПриСозданииНовогоПодключения(ПараметрыВызова["connection_info"]);
КонецПроцедуры	

Процедура АвтоматическоеОбновлениеСтатусов(context_params=Неопределено) Экспорт
	
	Если context_params	= Неопределено Тогда
		context_params	= Saby_Core.ПроверитьНаличиеПараметровПодключения();
		Если context_params	= Неопределено Тогда
			ВызватьИсключение("Требуется авторизация");
		КонецЕсли;
	КонецЕсли;
	Если context_params <> Неопределено Тогда
		context_params.Удалить("ФоновоеЗаданиеНачало");
	КонецЕсли;

	ПараметрыВызова = МодульФоновогоЗаданияСервер().ПодготовитьПараметрыЗапускINIФоновымЗаданием(
		"ОбновитьСтатусы_send",
		Новый Структура,
		context_params);
	
	ОбработкаТранспорт = Обработки.SABY.Создать();
	ОбработкаТранспорт.API_BLOCKLY_RUN(ПараметрыВызова);

КонецПроцедуры

Функция ПодготовитьПараметрыЗапускINIФоновымЗаданием(ini_name, ПараметрыВызоваИни, context_params = Неопределено) Экспорт
	ТранспортБлокли = Обработки.SABY.Создать();
	Возврат ТранспортБлокли.ПодготовитьПараметрыЗапускINIФоновымЗаданием(ini_name, ПараметрыВызоваИни, context_params);
КонецФункции

#Область include_core_base_ФоновыеЗадания_Сервер
#КонецОбласти

#Область include_core_base_ДлительныеОперации
#КонецОбласти

#Область include_core_base_Криптография_НаКлиенте1С_НаСервере
#КонецОбласти


#Область include_core_base_ФоновыеЗаданияСервер_ПараметрыСеанса
#КонецОбласти

#Область Saby_ФоновыеЗаданияСервер

&НаСервере
Процедура ПерезапуститьФоновоеЗадание() Экспорт
	// BSLLS:Typo-off
	ПараметрыСеансаРасш		= ПрогрессФЗПрочитатьЗначения();
	// BSLLS:Typo-on
	_Параметры				= ПараметрыСеансаРасш.Параметры;
	ИдентификаторЗадания	= ПараметрыСеансаРасш.ИдентификаторЗадания;
	Задание					= НайтиЗаданиеПоИдентификатору(ИдентификаторЗадания);
	ФоновоеЗадание			= ФоновыеЗадания.Выполнить(
		_Параметры.ФоновоеЗаданиеИмяМетода,
		_Параметры.ФоновоеЗаданиеПараметры,
		Задание.Ключ,
		_Параметры.ФоновоеЗаданиеНаименование);	
	ИдентификаторЗадания	= ФоновоеЗадание.УникальныйИдентификатор;
	
	ПрогрессФЗУстановитьИдентификаторЗадания(ИдентификаторЗадания);
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаданиеВыполнено(ФормаЗакрывается = Ложь) Экспорт
	ПараметрыФЗ				= ПрогрессФЗПрочитатьЗначения();
	ИдентификаторЗадания	= ПараметрыФЗ.ИдентификаторЗадания;
	_Параметры				= ПараметрыФЗ.Параметры;
	
	Задание = ОперацияВыполнена(ИдентификаторЗадания, Ложь, _Параметры.ВыводитьПрогрессВыполнения,
		_Параметры.ВыводитьСообщения);
	
	Если _Параметры.ПолучатьРезультат Тогда
		Если Задание.Статус = "Выполнено" Тогда
			Задание.Вставить("Результат", ПолучитьИзВременногоХранилища(_Параметры.АдресРезультата));
			УдалитьИзВременногоХранилища(_Параметры.АдресРезультата);
		Иначе
			Задание.Вставить("Результат", Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Задание;
	
КонецФункции

#КонецОбласти
