
&НаСервере
Функция НайтиЗаданиеПоИдентификатору(Знач ИдентификаторЗадания) Экспорт
	
	Если ТипЗнч(ИдентификаторЗадания) = Тип("Строка") Тогда
		ИдентификаторЗадания = Новый УникальныйИдентификатор(ИдентификаторЗадания);
	КонецЕсли;
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Возврат Задание;
	
КонецФункции

&НаСервере
Процедура ПерезапуститьФоновоеЗадание() Экспорт
	ПараметрыСеансаРасш		= ПрогрессФЗПрочитатьЗначения();
	_Параметры				= ПараметрыСеансаРасш.Параметры;
	ИдентификаторЗадания	= ПараметрыСеансаРасш.ИдентификаторЗадания;
	Задание					= НайтиЗаданиеПоИдентификатору(ИдентификаторЗадания);
	ФоновоеЗадание			= ФоновыеЗадания.Выполнить(_Параметры.ФоновоеЗаданиеИмяМетода, _Параметры.ФоновоеЗаданиеПараметры, Задание.Ключ, _Параметры.ФоновоеЗаданиеНаименование);	
	ИдентификаторЗадания	= ФоновоеЗадание.УникальныйИдентификатор;
	
	ПрогрессФЗУстановитьИдентификаторЗадания(ИдентификаторЗадания);
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаданиеВыполнено(ФормаЗакрывается = Ложь) Экспорт
	ПараметрыФЗ				= ПрогрессФЗПрочитатьЗначения();
	ИдентификаторЗадания	= ПараметрыФЗ.ИдентификаторЗадания;
	_Параметры				= ПараметрыФЗ.Параметры;
	
	Задание = ОперацияВыполнена(ИдентификаторЗадания, Ложь, _Параметры.ВыводитьПрогрессВыполнения,
		_Параметры.ВыводитьСообщения);
	
	Если _Параметры.ПолучатьРезультат Тогда
		Если Задание.Статус = "Выполнено" Тогда
			Задание.Вставить("Результат", ПолучитьИзВременногоХранилища(_Параметры.АдресРезультата));
			УдалитьИзВременногоХранилища(_Параметры.АдресРезультата);
		Иначе
			Задание.Вставить("Результат", Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Задание;
	
КонецФункции

&НаСервере
Процедура ОбработатьСостояниеЗадания(Задание, Результат, ИсключениеПриОшибке) 
	Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Результат.Статус = "Выполняется";
		Возврат;
	КонецЕсли;
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		Результат.Статус = "Отменено";
		Возврат;
	КонецЕсли;
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		
		Результат.Статус = "Ошибка";
		Если Задание.ИнформацияОбОшибке <> Неопределено Тогда
			Результат.КраткоеПредставлениеОшибки   = КраткоеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
			Результат.ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
		КонецЕсли;
		Если ИсключениеПриОшибке Тогда
			Если Не ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
				ТекстСообщения = Результат.КраткоеПредставлениеОшибки;
			Иначе
				ТекстСообщения = НСтр("ru = 'Не удалось выполнить данную операцию.'");
			КонецЕсли;
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Результат.Статус = "Выполнено";
КонецПроцедуры	


&НаСервере
Функция ОперацияВыполнена(Знач ИдентификаторЗадания, Знач ИсключениеПриОшибке = Ложь, Знач ВыводитьПрогрессВыполнения = Ложь, 
	Знач ВыводитьСообщения = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Статус", "Выполняется");
	Результат.Вставить("КраткоеПредставлениеОшибки", Неопределено);
	Результат.Вставить("ПодробноеПредставлениеОшибки", Неопределено);
	Результат.Вставить("Прогресс", Неопределено);
	Результат.Вставить("Сообщения", Неопределено);
	Результат.Вставить("Наименование", Неопределено);
	
	Задание = НайтиЗаданиеПоИдентификатору(ИдентификаторЗадания);
	Если Задание = Неопределено Тогда
		Пояснение = НСтр("ru = 'Операция не выполнена из-за аварийного завершения фонового задания.
			|Фоновое задание не существует'") + ": " + Строка(ИдентификаторЗадания);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Длительные операции.Ошибка выполнения'"),
			УровеньЖурналаРегистрации.Ошибка, , , Пояснение);
		Если ИсключениеПриОшибке Тогда
			ВызватьИсключение(НСтр("ru = 'Не удалось выполнить данную операцию.'"));
		КонецЕсли;
		Результат.Статус = "Ошибка";
		Результат.КраткоеПредставлениеОшибки = НСтр("ru = 'Операция не выполнена из-за аварийного завершения фонового задания.'");
		Возврат Результат;
	КонецЕсли;
	
	Результат.Наименование	= Задание.Наименование;
	Если ВыводитьПрогрессВыполнения Тогда
		ПрогрессИСообщения = ПрочитатьПрогрессИСообщения(ИдентификаторЗадания, ?(ВыводитьСообщения, "ПрогрессИСообщения", "Прогресс"));
		Результат.Прогресс = ПрогрессИСообщения.Прогресс;
		Если ВыводитьСообщения Тогда
			Результат.Сообщения = ПрогрессИСообщения.Сообщения;
		КонецЕсли;
	ИначеЕсли ВыводитьСообщения Тогда
		Результат.Сообщения = Задание.ПолучитьСообщенияПользователю(Истина);
	Иначе
		Результат.Сообщения = Неопределено;
	КонецЕсли;
	
	ОбработатьСостояниеЗадания(Задание, Результат, ИсключениеПриОшибке);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СообщениеПрогресса()
	Возврат "СтандартныеПодсистемы.ДлительныеОперации";
КонецФункции

&НаСервере
Функция ВернутьПрогрессИСообщения(МассивСообщений, Знач Режим = "ПрогрессИСообщения")
	МодульОбъекта = МодульОбъекта();
	Сообщения = Новый Массив;
	Результат = Новый Структура("Сообщения, Прогресс", Сообщения, Неопределено);
	Количество = МассивСообщений.Количество();
	ЧитатьСообщения = (Режим = "ПрогрессИСообщения" Или Режим = "Сообщения"); 
	ЧитатьПрогресс  = (Режим = "ПрогрессИСообщения" Или Режим = "Прогресс"); 
	
	
	Для Номер = 0 По Количество - 1 Цикл
		Сообщение = МассивСообщений[Номер];
		
		Если ЧитатьПрогресс И Лев(Сообщение.Текст,1)= "{" Тогда
			Позиция = Найти(Сообщение.Текст, "}");
			Если Позиция > 2 Тогда
				ИдентификаторМеханизма = Сред(Сообщение.Текст, 2, Позиция - 2);
				Если ИдентификаторМеханизма = СообщениеПрогресса() Тогда
					ПолученныйТекст = Сред(Сообщение.Текст, Позиция + 1);
					Результат.Прогресс = МодульОбъекта.decode_xml_xdto(ПолученныйТекст);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЧитатьСообщения Тогда
			Сообщения.Добавить(Сообщение);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Сообщения = Новый ФиксированныйМассив(Сообщения);
	Возврат Результат;
КонецФункции


&НаСервере
Функция ПрочитатьПрогрессИСообщения(Знач ИдентификаторЗадания, Знач Режим = "ПрогрессИСообщения")
	
	Сообщения = Новый ФиксированныйМассив(Новый Массив);
	Результат = Новый Структура("Сообщения, Прогресс", Сообщения, Неопределено);
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если Задание = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивСообщений = Задание.ПолучитьСообщенияПользователю(Истина);
	Если МассивСообщений = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	ЧитатьСообщения = (Режим = "ПрогрессИСообщения" Или Режим = "Сообщения"); 
	ЧитатьПрогресс  = (Режим = "ПрогрессИСообщения" Или Режим = "Прогресс"); 
	
	Если ЧитатьСообщения И Не ЧитатьПрогресс Тогда
		Результат.Сообщения = Новый ФиксированныйМассив(МассивСообщений);
		Возврат Результат;
	КонецЕсли;
	
	Результат = ВернутьПрогрессИСообщения(МассивСообщений, Режим);
	
	Возврат Результат;
	
КонецФункции

