
Функция ЗапуститьДлительнуюОперацию(ИмяМетода, НаименованиеФоновогоЗадания, ПараметрыМетода, 
									context, УникальныйИдентификаторЗадания = Неопределено) 
	ПараметрыФоновогоЗадания = ПараметрыОбработкиSaby(context);
	ИмяМодуляДлительныеОперации = ИмяМодуляДлительныеОперации();
	Если ИмяМодуляДлительныеОперации = Неопределено Тогда
		ВызватьИсключение "Отсутствует модуль для запуска длительной операции (Saby)";
	КонецЕсли;
	ВыполняемыйМетод = ИмяМодуляДлительныеОперации + ".ВыполнитьПроцедуруМодуляОбъектаОбработки";
	ИмяОбработки = get_prop(ПараметрыФоновогоЗадания, "Обработка");
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяОбработки",					ИмяОбработки); 
	Если ТипЗнч(ИмяОбработки) <> Тип("Строка") Тогда
		ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка",	ИмяОбработки); 	
	КонецЕсли;
	ПараметрыЗадания.Вставить("ИмяМетода",				ИмяМетода);
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка",	get_prop(ПараметрыФоновогоЗадания, "ЭтоВнешняяОбработка"));
	ПараметрыЗадания.Вставить("ПараметрыВыполнения",	ПараметрыМетода);
	УникальныйИдентификаторДлительнойОперации = УникальныйИдентификаторЗадания;
	Если УникальныйИдентификаторДлительнойОперации = Неопределено Тогда
		УникальныйИдентификаторДлительнойОперации = Новый УникальныйИдентификатор;
	КонецЕсли;	
	ДлительныеОперацииОбщийМодуль = ОбщийМодульЗначение(ИмяМодуляДлительныеОперации);	
	
	ПараметрыВыполнения = ДлительныеОперацииОбщийМодуль.ПараметрыВыполненияВФоне(УникальныйИдентификаторДлительнойОперации);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	Результат = ДлительныеОперацииОбщийМодуль.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);   
	Возврат Результат; 
	
КонецФункции

#Область include_core_base_ДлительныеОперации_ПараметрыЗапуска 
#КонецОбласти
