
Функция ПодготовитьПараметрыЗапускINIФоновымЗаданием(ini_name, ПараметрыВызоваИни, context_params) Экспорт

	Если context_params <> Неопределено Тогда
		context_params.Удалить("ФоновоеЗаданиеНачало");
	КонецЕсли;
	
	ПараметрыВызова	= ПараметрыВызоваИни;
	ПараметрыВызова.Вставить("params", context_params );
	ПараметрыВызова.Вставить("CommandsResult",Новый Массив);
	МодульОбъекта = МодульОбъекта();
	Если МодульОбъекта.get_prop(ПараметрыВызова, "Endpoint") = Неопределено Тогда
		ПараметрыВызова.Вставить("Endpoint", "");
	КонецЕсли;
	Если ПустаяСтрока(МодульОбъекта.get_prop(ПараметрыВызова, "ContextId")) Тогда
		ПараметрыВызова.Вставить("ContextId", Неопределено);
	КонецЕсли;
	ПараметрыВызова.Вставить("Algorithm",ini_name);
	Если ПустаяСтрока(МодульОбъекта.get_prop(ПараметрыВызова, "ConnectionId", "")) Тогда
		ConnectionId	= Неопределено;
		context_params.Свойство("ConnectionUuid", ConnectionId);
		ПараметрыВызова.Вставить("ConnectionId", ConnectionId);
	КонецЕсли;	
	ПараметрыВызова.Вставить("object",Новый Соответствие());
	
	Возврат ПараметрыВызова;
КонецФункции 

#Область include_core_base_ДлительныеОперации_ЭтоФоновоеЗадание
#КонецОбласти

//DynamicDirective

Процедура СообщитьПрогресс(Знач Процент = Неопределено, Знач Текст = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	#Если Сервер Тогда
	
	Если Не ЭтоФоновоеЗадание() Тогда
		Возврат;
	КонецЕсли;	
	ПередаваемоеЗначение = Новый Структура;
	ПередаваемоеЗначение.Вставить("Процент", 0);
	Если Процент <> Неопределено Тогда
		ПередаваемоеЗначение.Вставить("Процент", Процент);
	КонецЕсли;
	ПередаваемоеЗначение.Вставить("Текст", "");
	Если Текст <> Неопределено Тогда
		ПередаваемоеЗначение.Вставить("Текст", Текст);
	КонецЕсли;
	Если ДополнительныеПараметры <> Неопределено Тогда
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") ИЛИ ТипЗнч(ДополнительныеПараметры) = Тип("Соответствие") Тогда
			ДополнительныеПараметры.Удалить("variables");
		КонецЕсли;
		ПередаваемоеЗначение.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	КонецЕсли;
	
	ПередаваемыйТекст = МодульОбъекта().encode_xdto_xml(ПередаваемоеЗначение);
	
	Текст = "{" + СообщениеПрогресса() + "}" + ПередаваемыйТекст;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();
	#Иначе
		Состояние("Выполнение операции", Процент, Текст);
	#КонецЕсли	
КонецПроцедуры

