
Процедура СообщитьПрогрессОперации(Процент = Неопределено, Текст = Неопределено, ДополнительныеПараметры = Неопределено)
	
	Операция = get_prop(ДлитОперации, context.operation.operation_uuid); 
	Если Операция <> Неопределено Тогда
		Форма = get_prop(Операция, "form");
		Если Форма <> Неопределено Тогда
			Форма.ТекстСообщения = Текст;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Функция ЭтоФоновоеЗадание() Экспорт
	Возврат ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание() <> Неопределено;
КонецФункции

