
Функция ПараметрыОбработкиSaby(context = Неопределено)  
	Результат = Новый Структура;
	Результат.Вставить("Обработка", ОбработкаДляДлительнойОперации(context));
	Результат.Вставить("ЭтоВнешняяОбработка", Истина);
	Возврат Результат;
КонецФункции

Функция ОбработкаДляДлительнойОперации(context = Неопределено)
	ОбработкаВО3 = get_prop(context, "ОбработкаВО3");
	Если ОбработкаВО3 = Неопределено Тогда 
		СправочникДополнительныеОтчетыИОбработки = ИмяСправочникаДопОтчетыИОбработки();
		ИмяОбработки = НаименованиеОбработкиВСправочнике();
		ОбработкаВО3 = ОбработкаВО3(СправочникДополнительныеОтчетыИОбработки, ИмяОбработки); 
		Если Не ЗначениеЗаполнено(ОбработкаВО3) Тогда
			ВызватьИсключение "В справочнике " + СправочникДополнительныеОтчетыИОбработки + " отсутствует обработка " + ИмяОбработки;
		КонецЕсли;	
	КонецЕсли;
	Если ТипЗнч(context) = Тип("Структура") Тогда
		context.Вставить("ОбработкаВО3", ОбработкаВО3);
	КонецЕсли;	
	Возврат ОбработкаВО3;
КонецФункции

// Функция ИмяСправочникаДопОтчетыИОбработки
//
// Возвращаемое значение:
//  - Строка - Имя справочника
Функция ИмяСправочникаДопОтчетыИОбработки()
	СправочникДополнительныеОтчетыИОбработки = "ДополнительныеОтчетыИОбработки";
	Если Метаданные.Справочники.Найти(СправочникДополнительныеОтчетыИОбработки) = Неопределено Тогда
		СправочникДополнительныеОтчетыИОбработки = "ВнешниеОбработки";
	КонецЕсли;
	Если Метаданные.Справочники.Найти(СправочникДополнительныеОтчетыИОбработки) = Неопределено Тогда
		ВызватьИсключение "Отсутствует справочник " + СправочникДополнительныеОтчетыИОбработки;
	КонецЕсли;
	Возврат СправочникДополнительныеОтчетыИОбработки;
КонецФункции

// Функция ОбработкаВО3
//
// Параметры:
// 	ИмяСправочника - Строка - Имя справочника в дереве метаданных.
// 	ИмяОбработки - Строка - Имя обработки.
//
// Возвращаемое значение:
//  - Булево - Результат работы метода
//
// BSLLS:QueryParseError-off Имя справочника зависит от конфигурации
Функция ОбработкаВО3(ИмяСправочника, ИмяОбработки)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|ГДЕ
	|	ДополнительныеОтчетыИОбработки.Наименование = &Наименование
	|	И НЕ ДополнительныеОтчетыИОбработки.ЭтоГруппа";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДополнительныеОтчетыИОбработки", ИмяСправочника);
	Запрос.УстановитьПараметр("Наименование", ИмяОбработки);
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Неопределено;
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	Возврат Результат;
КонецФункции
// BSLLS:QueryParseError-on

