
Функция ПараметрыОбработкиSaby(context = Неопределено)  
	Результат = Новый Структура;
	Результат.Вставить("Обработка", ОбработкаДляДлительнойОперации(context));
	Результат.Вставить("ЭтоВнешняяОбработка", Истина);
	Возврат Результат;
КонецФункции

Функция ОбработкаДляДлительнойОперации(context = Неопределено)
	ОбработкаВО3 = get_prop(context, "ОбработкаВО3");
	Если ОбработкаВО3 = Неопределено Тогда 
		СправочникДополнительныеОтчетыИОбработки = "ДополнительныеОтчетыИОбработки";
		Если Метаданные.Справочники.Найти(СправочникДополнительныеОтчетыИОбработки) = Неопределено Тогда
			ВызватьИсключение "Отсутствует справочник " + СправочникДополнительныеОтчетыИОбработки;
		КонецЕсли;
		ИмяОбработки = НаименованиеОбработкиВСправочнике();
		ОбработкаВО3 = Справочники[СправочникДополнительныеОтчетыИОбработки].НайтиПоНаименованию(ИмяОбработки, Истина); 
		Если Не ЗначениеЗаполнено(ОбработкаВО3) Тогда
			ВызватьИсключение "В справочнике " + СправочникДополнительныеОтчетыИОбработки + " отсутствует обработка " + ИмяОбработки;
		КонецЕсли;	
	КонецЕсли;
	Если ТипЗнч(context) = Тип("Структура") Тогда
		context.Вставить("ОбработкаВО3", ОбработкаВО3);
	КонецЕсли;	
	Возврат ОбработкаВО3;
КонецФункции
