
&НаКлиенте
Процедура ПередатьСтатистику_Клиент(СтатусЗадания, СтатусВыполнения, Задание, ДопПараметры)
	Попытка
		ПередатьСтатистику_Сервер(СтатусЗадания, СтатусВыполнения, Задание, ДопПараметры);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ИмяСобытия = ЛокализацияНазваниеПродукта()+" ошибка передачи статистики";
		ПредставлениеУровня = "Ошибка";
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, ПредставлениеУровня,,,Истина);
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПередатьСтатистикуПоДокументам_Сервер(context_params, action_name, extsyncdoc_uuid)
	filter	= Новый Структура("SyncDocId", extsyncdoc_uuid);
	code			= 500;
	ОбработкаСБИС	= Обработки.SABY.Создать();
	resp			= ОбработкаСБИС.local_helper_extsyncobj_list(context_params,, filter,, );
	МассивОбъектов	= get_prop(resp, "Result", Новый Массив);
	
	МассивОшибок	= Новый Массив;
	МассивУспехов	= Новый Массив;
	
	Для Каждого	ЭлементМассива Из МассивОбъектов Цикл
		ЭлементДата			= get_prop(ЭлементМассива, "Data", Новый Массив);
		ЭтоПодобъект		= get_prop(ЭлементДата, "Subobject", Ложь);
		Если НЕ (ЭтоПодобъект = Ложь) Тогда
			//Пропустим объект в случае если он не элемент выгружаемого списка
			Продолжить;
		КонецЕсли;
		
		ДатаИс				= get_prop(ЭлементДата, "data_is");
		ЭлементДатаОшибка	= get_prop(ЭлементДата, "error", Ложь);
		ЭтоОшибка			= НЕ (ЭлементДатаОшибка = Ложь);
		error_name			= get_prop(ЭлементДатаОшибка, "message");
		error_detail		= get_prop(ЭлементДатаОшибка, "detail");
		action_param		= get_prop(ДатаИс, "ИмяСБИС");
		
        Если ЭтоОшибка Тогда
			ЭлементСтатистики	= ОбработкаСБИС.local_helper_element_error(context_params, action_name, action_param, error_name, error_detail, ЭлементДата, code, 1);
        	МассивОшибок.Добавить(ЭлементСтатистики);
        Иначе
			ЭлементСтатистики	= ОбработкаСБИС.local_helper_element_stat(context_params, action_name, action_param, 1);
			МассивУспехов.Добавить(ЭлементСтатистики);
        КонецЕсли;
		
	КонецЦикла;
	
	Если МассивОшибок.Количество() > 0 Тогда
		ОбработкаСБИС.local_helper_write_error(context_params, action_name, МассивОшибок, error_name, error_detail, ЭлементДата, code, 1);
	КонецЕсли;
	Если МассивУспехов.Количество() > 0 Тогда
		ОбработкаСБИС.local_helper_write_stat(context_params, action_name, МассивУспехов, 1);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередатьСтатистику_Сервер(СтатусЗадания, СтатусВыполнения, Задание, ДопПараметры)
	//Информация о завершении 
    action_name		= Задание.Наименование;
	context_params	= Параметры.ФоновоеЗаданиеПараметры[0]["params"];
	extsyncdoc_uuid	= Параметры.ФоновоеЗаданиеПараметры[0]["operation_uuid"];
	//Всё обернем, дабы обойти падения связанные с передачей и работой БЛ
	Если Не ПустаяСтрока(extsyncdoc_uuid) Тогда
		ПередатьСтатистикуПоДокументам_Сервер(context_params, action_name, extsyncdoc_uuid);
	КонецЕсли;
КонецПроцедуры

