
&НаКлиенте
Процедура ЗапуститьINIФоновымЗаданием(ini_name, ПараметрыВызоваИни, context_params = Неопределено,
		ФормаВладелец = Неопределено, ЗаголовокФормы = "") Экспорт
		
	Если context_params = Неопределено Тогда
        context_params = ПроверитьНаличиеПараметровПодключенияНаСервере();
    КонецЕсли;

    ПараметрыВызова = Новый Структура;

    ПараметрыВызова.Вставить("params", context_params);
    ПараметрыВызова.Вставить("commands_result", Новый Массив);
    ПараметрыВызова.Вставить("endpoint","");
    ПараметрыВызова.Вставить("operation_uuid", СокрЛП(Новый УникальныйИдентификатор));
    ПараметрыВызова.Вставить("ini_name", ini_name);
    ConnectionId = Неопределено;
    context_params.Свойство("ConnectionId", ConnectionId);
    ПараметрыВызова.Вставить("connection_uuid", ConnectionId);
    ПараметрыВызова.Вставить("object", Новый Соответствие());
    ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено;
    context_params.Свойство("ОповещениеОЗакрытииФормыФоновогоЗадания", ОповещениеОЗакрытииФормыФоновогоЗадания);
    context_params.Удалить("ОповещениеОЗакрытииФормыФоновогоЗадания");

    Если ini_name = "ОбновитьСтатусы_send" Тогда
        ПараметрыВызова["object"].Вставить("object", Новый Соответствие());
    ИначеЕсли ini_name = "ЗагрузитьВложения_1" Тогда
        ПараметрыВызова["object"].Вставить("МассивСсылок", ПараметрыВызоваИни);
    ИначеЕсли ini_name = "Документы_send" Тогда
        ПараметрыВызова["object"].Вставить("list_doc_ref", ПараметрыВызоваИни["МассивОбъектов"]);
        ПараметрыВызова["object"].Вставить("ПростойЗапросПодписи", ПараметрыВызоваИни["ПростойЗапросПодписи"]);
        ПараметрыВызова["object"].Вставить("Исполнители", ПараметрыВызоваИни["Исполнители"]);
        ПараметрыВызова["object"].Вставить("КаналИнформации", ПараметрыВызоваИни["КаналИнформации"]);
        ПараметрыВызова["object"].Вставить("МаршрутОзнакомления", ПараметрыВызоваИни["МаршрутОзнакомления"]);
        context_params.public.Вставить("ПростойЗапросПодписи", ПараметрыВызоваИни["ПростойЗапросПодписи"]);
    Иначе
        ПараметрыВызова["object"].Вставить("list_doc_ref", ПараметрыВызоваИни);
	КонецЕсли;
	    
	ПараметрыЗадания = Новый Массив();
    ПараметрыЗадания.Добавить(ПараметрыВызова);

    ОткрытьФормуДлительнойОперации("API_BLOCKLY_RUN_BACKGROUND", ПараметрыЗадания, ЗаголовокФормы,
        ФормаВладелец, ОповещениеОЗакрытииФормыФоновогоЗадания);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДлительнойОперации(ФоновоеЗаданиеИмяМетода, ФоновоеЗаданиеПараметры,
		ФоновоеЗаданиеНаименование, Владелец, ОповещениеОЗакрытииФормы = Неопределено) Экспорт
	
	// Пока открываем в маленькой формочке ДлительнаяОперация без фоновых заданий нужный метод
    ФоновоеЗаданиеПараметры[0].Вставить("ДлительнаяОперацияИмяМетода", ФоновоеЗаданиеИмяМетода);
    Форма = ПолучитьФормуОбработки("ДлительнаяОперация", ПутьКФормамОбработки(), , ЭтаФорма);
    Форма.Команда = ФоновоеЗаданиеПараметры[0];
    Форма.ОткрытьМодально(); 
	Если ОповещениеОЗакрытииФормы <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ОповещениеОЗакрытииФормы);
	КонецЕсли;
	
КонецПроцедуры


	
