
#Область include_core_base_ДлительныеОперации_СвойстваОбработкиПродукта
#КонецОбласти

&НаКлиенте
Функция ТипМетаданныхОбработки() 
	Возврат "ВнешняяОбработка";	
КонецФункции

&НаСервере
Функция ПолучитьДополнительнуюОбработку() 
	ЭлементСправочника = Неопределено;
	МодульОбъекта = МодульОбъекта(); 
	НазваниеОбработки = МодульОбъекта.НаименованиеОбработкиВСправочнике(); 
	Если Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") <> Неопределено Тогда 
		ЭлементСправочника = Справочники["ДополнительныеОтчетыИОбработки"].НайтиПоНаименованию(НазваниеОбработки, Истина);
		Если ЭлементСправочника = Справочники["ДополнительныеОтчетыИОбработки"].ПустаяСсылка() Тогда
			// BSLLS:DeprecatedMessage-off
			Сообщить("Не удалось найти обработку с именем " + НазваниеОбработки + " в дополнительных отчетах и обработках");
			// BSLLS:DeprecatedMessage-on
			ЭлементСправочника = Неопределено;	
		КонецЕсли;
	КонецЕсли;
	Возврат ЭлементСправочника;
КонецФункции	

&НаКлиенте
Функция ПутьОбработкиДляВыполненияФоновогоЗадания()
	ИмяФайлаОбработки = ИмяФайлаОбработки();
	Если Найти(ИмяФайлаОбработки, ".epf") = 0 Тогда 
		ИмяОбработки = ПолучитьДополнительнуюОбработку();			
	Иначе	
		Файл = Новый Файл(ИмяФайлаОбработки);
		ФайлСуществует = Файл.Существует();
		Если ФайлСуществует Тогда   
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаОбработки); 
			Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			ИмяОбработки = КопияОбработкиНаСервере(Адрес);
		Иначе
			ИмяОбработки = КопияОбработкиНаСервере(ИмяФайлаОбработки);	
		КонецЕсли;
	КонецЕсли;	
	Возврат ИмяОбработки;
КонецФункции

&НаСервере
Функция ЭтоВнешняяОбработка()
	Возврат ИСТИНА;	
КонецФункции

&НаКлиенте
Функция ВозвращатьРезультатВОбработкуВыбора()
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция ФормаЗапускаФоновогоЗадания() Экспорт
	Возврат Истина;
КонецФункции
