
&НаКлиенте
Процедура ЗапуститьINIФоновымЗаданием(ini_name, ПараметрыВызоваИни, context_params = Неопределено,
	ФормаВладелец = Неопределено, ЗаголовокФормы = "") Экспорт
	
	ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено;	
	Если context_params <> Неопределено Тогда
		context_params.Свойство("ОповещениеОЗакрытииФормыФоновогоЗадания", ОповещениеОЗакрытииФормыФоновогоЗадания);
		context_params.Удалить("ОповещениеОЗакрытииФормыФоновогоЗадания");
	КонецЕсли;
	
	ПараметрыВызова = МодульФоновогоЗаданияСервер().ПодготовитьПараметрыЗапускINIФоновымЗаданием(ini_name, ПараметрыВызоваИни, context_params);
	
	ИмяОбработки = ПутьОбработкиДляВыполненияФоновогоЗадания();
	ПараметрыДлительныеОперации = Новый Структура;
	Если ТипЗнч(ИмяОбработки) = Тип("Строка") Тогда
		ПараметрыДлительныеОперации.Вставить("ИмяОбработки",					ИмяОбработки); 
	Иначе     
		ПараметрыДлительныеОперации.Вставить("ДополнительнаяОбработкаСсылка",	ИмяОбработки); 	
	КонецЕсли;
	ПараметрыДлительныеОперации.Вставить("ИмяМетода",			"API_BLOCKLY_RUN_BACKGROUND");
	ПараметрыДлительныеОперации.Вставить("ПараметрыВыполнения",	ПараметрыВызова);
	ПараметрыДлительныеОперации.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка());
	ИмяМодуляДлительныеОперации = МодульФоновогоЗаданияСервер().ИмяМодуляДлительныеОперации();
	Если ИмяМодуляДлительныеОперации = Неопределено Тогда
		ВызватьИсключение "Отсутствует модуль для запуска длительной операции (Saby)";
	КонецЕсли;
	ВыполняемыйМетод = ИмяМодуляДлительныеОперации + ".ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ПараметрыДлительныеОперации);
	ПараметрыЗадания.Добавить("");

	ОткрытьФормуДлительнойОперации(ВыполняемыйМетод,ПараметрыЗадания, ЗаголовокФормы, ФормаВладелец,ОповещениеОЗакрытииФормыФоновогоЗадания); 

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДлительнойОперации(ФоновоеЗаданиеИмяМетода, ФоновоеЗаданиеПараметры,
		ФоновоеЗаданиеНаименование, Владелец, ОповещениеОЗакрытииФормы = Неопределено, 
		ПереданныйИдентификаторЗадания = Неопределено) Экспорт
   	Сообщение = Новый Структура("Показать, Пояснение, Текст, НавигационнаяСсылка",
		Истина,
		ФоновоеЗаданиеНаименование,
		"Выполняется...");

	ВладелецИдентификатор = Неопределено;
	Попытка
		ВладелецИдентификатор = Владелец.УникальныйИдентификатор;
	Исключение
		ВладелецИдентификатор = Неопределено;
	КонецПопытки;
	
	Если ПереданныйИдентификаторЗадания = Неопределено Тогда
		ИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор;
	Иначе
		ИдентификаторФоновогоЗадания = ПереданныйИдентификаторЗадания;
	КонецЕсли;
	
	ПарамФормы = Новый Структура;
	ПарамФормы.Вставить("АдресДополнительногоРезультата");
	ПарамФормы.Вставить("АдресРезультата");
	ПарамФормы.Вставить("ВыводитьОкноОжидания", Истина);
	ПарамФормы.Вставить("ВыводитьПрогрессВыполнения", Истина);
	ПарамФормы.Вставить("ВыводитьСообщения", Истина);
	ПарамФормы.Вставить("ИдентификаторЗадания", ИдентификаторФоновогоЗадания);
	ПарамФормы.Вставить("УникальныйИдентификатор", ВладелецИдентификатор);
	ПарамФормы.Вставить("Интервал", 1);
	ПарамФормы.Вставить("ОжидатьЗавершение", Ложь);
	ПарамФормы.Вставить("ОповещениеПользователя", Сообщение);
	ПарамФормы.Вставить("ПолучатьРезультат", Ложь);
	ПарамФормы.Вставить("ТекстСообщения", ФоновоеЗаданиеНаименование);
	ПарамФормы.Вставить("ФоновоеЗаданиеИмяМетода", ФоновоеЗаданиеИмяМетода);
	ПарамФормы.Вставить("ФоновоеЗаданиеПараметры", ФоновоеЗаданиеПараметры);
	ПарамФормы.Вставить("ФоновоеЗаданиеНаименование", ФоновоеЗаданиеНаименование);
	ПарамФормы.Вставить("ОповещениеОЗакрытииФормы", ОповещениеОЗакрытииФормы); 
	
	МодульФоновогоЗаданияКлиент().ЗапуститьФоновоеЗаданиеКлиент(ПарамФормы, Владелец);
КонецПроцедуры

#Область include_core_base_ФоновыеЗадания_КлиентИмяОбработчкикаФЗ
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_Клиент
#КонецОбласти

	
