
&НаКлиенте
Функция ТипМетаданныхОбработки() 
	Возврат "ВнешняяОбработка";	
КонецФункции

&НаКлиенте
Функция ЗаполнитьПутьОбработкиДляВыполненияФоновогоЗадания()
	ИмяФайлаОбработки = ИмяФайлаОбработки();
	Файл = Новый Файл(ИмяФайлаОбработки);
	ФайлСуществует = Файл.Существует();
	Если ФайлСуществует Тогда   
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаОбработки); 
		Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		ИмяОбработки = КопияОбработкиНаСервере(Адрес);
	Иначе
		ИмяОбработки = КопияОбработкиНаСервере(ИмяФайлаОбработки);	
	КонецЕсли;	
КонецФункции

&НаСервере
Функция ЭтоВнешняяОбработка()
	Возврат ИСТИНА;	
КонецФункции
