
#Область include_core_base_ФоновыеЗадания_КлиентИмяОбработчкикаФЗ
#КонецОбласти

&НаКлиенте
Процедура ЗапуститьINIФоновымЗаданием(ini_name, ПараметрыВызоваИни, context_params = Неопределено,
		ФормаВладелец = Неопределено, ЗаголовокФормы = "") Экспорт
		
    Если context_params = Неопределено Тогда
        context_params = ПроверитьНаличиеПараметровПодключенияНаСервере();
    КонецЕсли;

	МодульОбъекта = МодульОбъекта();
	ПараметрыВызова = МодульОбъекта.ПодготовитьПараметрыЗапускINIФоновымЗаданием(ini_name,
						ПараметрыВызоваИни,
						context_params);
    ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено;
    context_params.Свойство("ОповещениеОЗакрытииФормыФоновогоЗадания", ОповещениеОЗакрытииФормыФоновогоЗадания);
    context_params.Удалить("ОповещениеОЗакрытииФормыФоновогоЗадания");

	ПараметрыЗадания = Новый Массив();
    ПараметрыЗадания.Добавить(ПараметрыВызова);

    ОткрытьФормуДлительнойОперации("API_BLOCKLY_RUN_BACKGROUND", ПараметрыЗадания, ЗаголовокФормы,
        ФормаВладелец, ОповещениеОЗакрытииФормыФоновогоЗадания);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДлительнойОперации(ФоновоеЗаданиеИмяМетода, ФоновоеЗаданиеПараметры,
		ФоновоеЗаданиеНаименование, Владелец, ОповещениеОЗакрытииФормы = Неопределено) Экспорт
	
	// Пока открываем в маленькой формочке ДлительнаяОперация без фоновых заданий нужный метод
    ФоновоеЗаданиеПараметры[0].Вставить("ДлительнаяОперацияИмяМетода", ФоновоеЗаданиеИмяМетода);
    Форма = ПолучитьФормуОбработки("ДлительнаяОперация", ПутьКФормамОбработки(), , ЭтаФорма);
    Форма.Команда = ФоновоеЗаданиеПараметры[0];
    Форма.ОткрытьМодально(); 
	Если ОповещениеОЗакрытииФормы <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ОповещениеОЗакрытииФормы);
	КонецЕсли;
	
КонецПроцедуры

