
#Область include_core_base_СвойстваОбработкиПродукта
#КонецОбласти

&НаКлиенте
Функция ТипМетаданныхОбработки() 
	Возврат "ВнешняяОбработка";	
КонецФункции

&НаСервере
Функция ПолучитьДополнительнуюОбработку() 
	ЭлементСправочника = Неопределено;
	МодульОбъекта = МодульОбъекта(); 
	НазваниеОбработки = МодульОбъекта.НаименованиеОбработкиВСправочнике(); 
	Если Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") <> Неопределено Тогда 
		ЭлементСправочника = Справочники["ДополнительныеОтчетыИОбработки"].НайтиПоНаименованию(НазваниеОбработки);
		Если ЭлементСправочника = Справочники["ДополнительныеОтчетыИОбработки"].ПустаяСсылка() Тогда 
			Сообщить("Не удалось найти обработку с именем "+ЛокализацияНазваниеПродукта()+" в дополнительных отчетах и обработках");
			ЭлементСправочника = Неопределено;	
		КонецЕсли;
	КонецЕсли;
	Возврат ЭлементСправочника;
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПутьОбработкиДляВыполненияФоновогоЗадания()
	ИмяФайлаОбработки = ИмяФайлаОбработки();
	Если Найти(ИмяФайлаОбработки, ".epf") = 0 Тогда 
		ИмяОбработки = ПолучитьДополнительнуюОбработку();			
	Иначе	
		Файл = Новый Файл(ИмяФайлаОбработки);
		ФайлСуществует = Файл.Существует();
		Если ФайлСуществует Тогда   
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаОбработки); 
			Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			ИмяОбработки = КопияОбработкиНаСервере(Адрес);
		Иначе
			ИмяОбработки = КопияОбработкиНаСервере(ИмяФайлаОбработки);	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ЭтоВнешняяОбработка()
	Возврат ИСТИНА;	
КонецФункции
