
//DynamicDirective

Процедура СообщитьПрогрессОперации(Процент = Неопределено, Текст = Неопределено, 
									ДополнительныеПараметры = Неопределено, ОтображатьПрогрессВыполнения = Истина)
	Если ОтображатьПрогрессВыполнения Тогда
	
		#Если Сервер Тогда
			МодульФоновогоЗаданияСервер().СообщитьПрогресс(Процент, Текст, ДополнительныеПараметры);
		#Иначе
			Если Процент = Неопределено Тогда
				Процент  = get_prop(ДополнительныеПараметры, "Прогресс", 0);
			КонецЕсли;
			Состояние("Выполнение операции", Процент, Текст);
		#КонецЕсли	
	КонецЕсли;
КонецПроцедуры

