
// Обертки для методов и их вызова от контекста. Тут будут расположены экспортные методы, которые можно позвать от другого модуля.

// Функция - конструктор исключения для вызова от контекста
//
// Параметры:
//  HandledException	 - ExtException, ИнформацияОбОшибке, Структура, Строка, Число	 - перехваченная ошибка, либо информация о том, что пошло не так
//  Parent				 - Строка, ExtException											 - родитель ошибки. 
//		Это может быть готовое исключение, В КОТОРОЕ надо добавить возникшую проблему. Остальные параметры игнорируются.
//		Это может быть строка с именем метода где возникла проблема. Тогда основная ошибка формируется по полям Type, Message, Details, Data, а возникшая ошибка обогащает новую
//  Type				 - Число, Строка, Неопределено								 - тип, или код ошибки.
//		Не используется, если Parent готовое исключение
//  Message				 - Строка, Неопределено		 - устанавливаемое сообщение для ошибки. Если не задано явно, то определяется по типу, или коду.
//		Не используется, если Parent готовое исключение
//  Details				 - Строка, Неопределено		 - устанавливаемое расширенное сообщение для ошибки. Если не задано явно, то берется сообщение. 
//		Не используется, если Parent готовое исключение
//  Data				 - Структура, Неопределено	 - устанавливаемые данные ошибки. Если не задано явно, то берется от возникшей ошибки.
//		Не используется, если Parent готовое исключение
// 
// Возвращаемое значение:
//  ExtException - экземпляр класса ошибки.
//
//DynamicDirective
Функция Saby_NewExtException(	HandledException = Неопределено, Parent	= Неопределено,
								Type = Неопределено, Message = Неопределено, Details = Неопределено, Data = Неопределено) Экспорт
							
	Возврат NewExtException(HandledException, Parent, Type, Message, Details, Data);					
	
КонецФункции

// Функция - выгрузка исключения
//
// Параметры:
//  ExtException	 - ExtException				 - экземпляр ошибки
//  Scenario		 - Строка					 - сценарий выгрузки
//	AddParam		 - Неопределено, Структура	 - Расширение
//
// Возвращаемое значение:
//  Произвольный - В зависимости от сценария выгрузки.
//
//DynamicDirective
Функция Saby_ExtException_Dump(ExtException, Scenario = "Строка", AddParam = Неопределено) Экспорт
	
	Возврат ExtException_Dump(ExtException, Scenario, AddParam);					
	
КонецФункции
	
// Функция - Set метод для исключений
//
// Параметры:
//  ExtException	 - ExtException				 - текущая ошибка
//  KeySet			 - Строка					 - Устанавливаемый ключ.
//	ValueSet		 - Произвольный				 - Устанавливаемое значение
//	AddParam		 - Неопределено, Структура   - Расширение
// 
//DynamicDirective
Процедура Saby_ExtException_Set(ExtException, KeySet = Неопределено, ValueSet = Неопределено, AddParam = Неопределено) Экспорт 
	
	ExtException_Set(ExtException, KeySet, ValueSet, AddParam);
	
КонецПроцедуры

// Функция - Get метод для исключений
//
// Параметры:
//  ExtException	 - ExtException				 - текущая ошибка
//  KeyGet		 - Строка						 - ключ, что получить
//	AddParam		 - Неопределено, Структура	 - расширение
// 
// Возвращаемое значение:
//  Произвольный - значение по ключу
//
//DynamicDirective
Функция Saby_ExtException_Get(ExtException, KeyGet = Неопределено, AddParam = Неопределено) Экспорт 
	
	Возврат ExtException_Get(ExtException, KeyGet, AddParam);
	
КонецФункции

// Процедура - Append метод для обогащения текущего объекта
//
// Параметры:
//  ExtException	 - ExtException				 - текущая ошибка
//  KeySet			 - Неопределенно, Строка	 - ключ, что добавляется к ошибке
//  ValueSet		 - Произвольный				 - значение, добавляемое к текущей ошибке
//	AddParam		 - Неопределено, Структура	 - расширение
// 
//DynamicDirective
Процедура Saby_ExtException_Append(ExtException, KeySet = Неопределено, ValueSet = Неопределено, AddParam = Неопределено) Экспорт 
	
	ExtException_Append(ExtException, KeySet, ValueSet, AddParam);

КонецПроцедуры

// Функция - возвращает копию объекта.
//
// Параметры:
//  ExtException	 - ExtException	 - текущая ошибка
//	AddParam		 - Неопределено	 - расширение
// 
// Возвращаемое значение:
//  ExtException - копия объекта
//
//DynamicDirective
Функция Saby_ExtException_Copy(ExtException, AddParam = Неопределено) Экспорт 
	
	// Пока просто в лоб - поверхностная копия
	Возврат ExtException_Copy(ExtException, AddParam);
	
КонецФункции

