// BSLLS:UnusedLocalVariable-off Перемеменные используются в склеиваемых областях
&НаКлиенте
Перем ПутьКФормам, ДокументСБИС, КомандыПанели;
&НаКлиенте
Перем ТранспортИнтеграции, BlocklyExecutor;
&НаКлиенте
Перем ФормаОткрыта;
&НаКлиенте
Перем КомпонентГрадусник;
// BSLLS:UnusedLocalVariable-on

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_ЭДО_СопоставлениеТиповОбъектов
#КонецОбласти

#Область include_core_base_ПросмотрДокумента_УстановитьЛокализацию
#КонецОбласти

#Область include_core_base_ПросмотрДокумента_ПредставлениеДополнительногоПоля
#КонецОбласти

#Область include_core_base_Авторизация_ОткрытьФормуАвторизацииПриОтсутствииСессии
#КонецОбласти

&НаКлиенте
Функция ПрочитатьДокумент()
	context_params = ПроверитьНаличиеПараметровПодключенияНаСервере(); 
	Документ = Новый Структура(
		"Идентификатор, ПервичныйКлюч, ДопПоля", 
		Идентификатор, 
		СтрЗаменить(ИдСБИС, Символы.НПП, ""), "Расширение,ДополнительныеПоля");
	Возврат ТранспортИнтеграции.local_helper_read_document(context_params, Документ);	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ФормаОткрыта = Истина;
	// BSLLS:UnusedLocalVariable-off Переменные объявлены в другой области
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();
	// BSLLS:UnusedLocalVariable-on
	ПутьКФормам = ПутьКФормамОбработки();
	ЭтаФорма.ПараметрыКоманд = Новый Структура;
	ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ПриОткрытииПослеАвторизации", ЭтаФорма);
	ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции, ОбработчикПослеАвторизации);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПослеАвторизации(Результат, ДопПараметры = Неопределено) Экспорт
	Если Результат = Неопределено Тогда
		ЭтаФорма.Закрыть();
		Возврат;	
	КонецЕсли;
	ЭтаФорма.context_params = Результат;
	
	УстановитьРеквизитИмяФормы();	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ФормаОткрыта = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Показать(ДокСБИС, Док1С, cont_param, ДопПараметры = Неопределено) Экспорт
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();
	Если ТипЗнч(ДокСБИС) = Тип("Строка") Тогда
		ЭтаФорма.Идентификатор = ДокСБИС;
	Иначе	
		ЭтаФорма.Идентификатор = get_prop(ДокСБИС, "Идентификатор");	
	КонецЕсли;	
	ДокументСБИС = ПрочитатьДокумент();
	ЭтаФорма.Документ1С = Док1С;
	ЭтаФорма.context_params = cont_param;
	Если ЗначениеЗаполнено(ДокументСБИС) Тогда
		ЗаполнитьШапкуПоДокументуСБИС(ДокументСБИС);
	КонецЕсли;
		
	ЭтаФорма.Открыть();
	
	ЗаполнитьПрохождение(ДокументСБИС);
	ЗаполнитьВложения(ДокументСБИС);
	Если ДопПараметры <> Неопределено И ДопПараметры.Свойство("КомандыПанели") Тогда
		КомандыПанели = ДопПараметры.КомандыПанели;
		ОбновитьПанельОпераций("ПанельОпераций", КомандыПанели);
	Иначе
		КомандыПанели = Новый Массив();	
	КонецЕсли;

	Если Не КомпонентГрадусник = Неопределено Тогда
		КомпонентГрадусник = КомпонентГрадусник_Очистить(КомпонентГрадусник);
	КонецЕсли;
	
	РасширениеДокументов = get_prop(ДокументСБИС, "Расширение");
	ЦепочкаДокументов = get_prop(РасширениеДокументов, "ЦепочкаДокументов");
	КомпонентГрадусник = НовыйКомпонентГрадусник(ЦепочкаДокументов, "ГруппаГрадусник");
	
	СформироватьКомпоненты(КомпонентГрадусник);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКомпоненты(Знач КомпонентГрадусник)
	
	// Совместимость оф уф
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	КомпонентГрадусник_СформироватьИнтерфейс(КомпонентГрадусник, ЭтаФорма, ЭтаФорма, ЭлементыФормочки.Шапка);

КонецПроцедуры

// BSLLS:FunctionOutParameter-off

&НаКлиенте
Функция ОбработатьМассивДопПолей(ДанныеПоля, ДопПоляЗначения = Неопределено, Знач Уровень = 0)
	Если ДопПоляЗначения = Неопределено Тогда
		ДопПоляЗначения = Новый Массив;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеПоля) <> Тип("Соответствие") Тогда
		Возврат ДопПоляЗначения;
	КонецЕсли;
	
	МассивЭлементовГрупп = Новый Массив();
	
	// Для каждого элемента верхнего уровня
	Для Каждого ПолеЭлементМассива Из ДанныеПоля Цикл
		
		// Вначале выводим элементы, затем группы как на форме в ЛК
		Если ТипЗнч(ПолеЭлементМассива.Значение) = Тип("Соответствие") Тогда
			МассивЭлементовГрупп.Добавить(ПолеЭлементМассива);
			Продолжить;
		КонецЕсли;
		
		ЗначениеПоля =  ПредставлениеДополнительногоПоля(ПолеЭлементМассива, Уровень);
		Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
			ДопПоляЗначения.Добавить(ЗначениеПоля);
		КонецЕсли;
	КонецЦикла;
	
	// Теперь отрисуем группы
	Для Каждого ПолеЭлементМассиваГруппы Из МассивЭлементовГрупп Цикл
		ЗначениеПоляГруппы =  ПредставлениеДополнительногоПоля(ПолеЭлементМассиваГруппы, Уровень);
		Если ЗначениеЗаполнено(ЗначениеПоляГруппы) Тогда
			ДопПоляЗначения.Добавить(ЗначениеПоляГруппы);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДопПоляЗначения;
КонецФункции

// BSLLS:FunctionOutParameter-on

&НаКлиенте
Процедура ЗаполнитьШапкуПоДокументуСБИС(СоставПакета)
	ЭтаФорма.Заголовок = СоставПакета["Название"];
	ЭтаФорма.Номер = СоставПакета["Номер"];
	ЭтаФорма.Дата = СоставПакета["Дата"];
	Если get_prop(СоставПакета, "Примечание") <> Неопределено Тогда
		ЭтаФорма.Комментарий = СоставПакета["Примечание"];
	Иначе
		ЭтаФорма.Комментарий = "";
	КонецЕсли;
	ЭтаФорма.Идентификатор 	= СоставПакета["Идентификатор"];
	ЭтаФорма.ИдСБИС			= СоставПакета["Параметры.ИдСБИС"];
	ЭтаФорма.СсылкаСБИС	 	= СоставПакета["СсылкаСБИС"];
	Если Не ЗначениеЗаполнено(ЭтаФорма.Сотрудник) Тогда
		Сотрудники = get_prop(СоставПакета, "Сотрудники", Новый Массив);
		Если Сотрудники.Количество() > 0 Тогда 
			ЭтаФорма.Сотрудник	= get_prop(Сотрудники[0], "ФИО", "");	
			ЭтаФорма.Подразделение	= get_prop(Сотрудники[0], "Подразделение", "");	
		КонецЕсли;	
	КонецЕсли;	
	ЭтаФорма.Примечание      = СтрЗаменить(get_prop(СоставПакета, "Примечание", ""), Символы.ПС, "; ");
		
	ЭтаФорма.Название = Тип1СПоТипуБЛ(
			get_prop(СоставПакета, "Тип", get_prop(СоставПакета, "ИмяСБИС")),
			get_prop(СоставПакета, "Примечание", ""));
	ДанныеДокументаРегламент = get_prop(СоставПакета, "Регламент");
	ЭтаФорма.Регламент = get_prop(ДанныеДокументаРегламент, "Название", ДанныеДокументаРегламент);
	
	ДанныеПоля = get_prop(СоставПакета, "ДополнительныеПоля");
	
	ЭтаФорма.ИдСБИС = ПолучитьИдСбисИзИдентификатора(get_prop(СоставПакета, "Идентификатор"));
	ЭтаФорма.ИдСБИС = СтрЗаменить(ЭтаФорма.ИдСБИС, Символы.НПП, "");
	ДопПоляЗначения = ОбработатьМассивДопПолей(ДанныеПоля);
	
	ЭтаФорма.ДополнительныеПоля = Saby_СтрСоединить82(ДопПоляЗначения, Символы.ВК);
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		ПодразделениеВрем = get_prop(СоставПакета,"Подразделение");
		ДанныеДокументаПодразделение = get_prop(СоставПакета, "ПодразделениеСотрудника", ПодразделениеВрем);
		ЭтаФорма.Подразделение = get_prop(ДанныеДокументаПодразделение, "Название");
	КонецЕсли;

	Если get_prop(СоставПакета, "НашаОрганизация") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если get_prop(СоставПакета["НашаОрганизация"], "СвЮЛ") <> Неопределено Тогда
		ЭтаФорма.Организация = СоставПакета["НашаОрганизация"]["СвЮЛ"]["Название"];
	ИначеЕсли get_prop(СоставПакета["НашаОрганизация"], "СвФЛ") <> Неопределено Тогда
		Фамилия = СоставПакета["НашаОрганизация"]["СвФЛ"]["Фамилия"];
		Имя = СоставПакета["НашаОрганизация"]["СвФЛ"]["Имя"];
		Отчество = СоставПакета["НашаОрганизация"]["СвФЛ"]["Отчество"];
		ЭтаФорма.Организация = Фамилия + " " + Имя + " " + Отчество;
	ИначеЕсли get_prop(СоставПакета["НашаОрганизация"], "Название") <> Неопределено Тогда
		ЭтаФорма.Организация = СоставПакета["НашаОрганизация"]["Название"];
	Иначе	
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВложения(СоставПакета, ДопПараметры = Неопределено) Экспорт
	Вложения.Очистить();
	Если get_prop(СоставПакета,"Вложение") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Вложение Из СоставПакета["Вложение"] Цикл
		Если get_prop(Вложение, "Служебный") = "Да" Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтр = Вложения.Добавить();
		НоваяСтр.Название = Вложение["Название"];
		НоваяСтр.СсылкаНаHTML = Вложение["СсылкаНаHTML"];
		НоваяСтр.СсылкаНаPDF = Вложение["СсылкаНаPDF"];
		НоваяСтр.СсылкаВКабинет = Вложение["СсылкаВКабинет"];
		Если get_prop(Вложение, "Файл") <> Неопределено Тогда
			НоваяСтр.ФайлИмя = Вложение["Файл"]["Имя"];
			НоваяСтр.ФайлСсылка = Вложение["Файл"]["Ссылка"];
		КонецЕсли;
		Если ЗначениеЗаполнено(Вложение["СсылкаНаHTML"]) Тогда
			НоваяСтр.ТекстHTML = ТранспортИнтеграции.local_helper_download_from_link(context_params, Вложение["СсылкаНаHTML"], "text");	
		Иначе
			ПредставлениеДокумента = "<HTML><BODY scroll=no>
									|<table cellspacing=0 cellpadding=0 WIDTH=auto><tr>
									|<td id=Открыть style=""cursor: pointer;""><ins id=Открыть>Открыть в другой программе</ins></td></tr></table>
									|</BODY></HTML>";
			НоваяСтр.ТекстHTML = ПредставлениеДокумента;		
		КонецЕсли;
		Для Каждого Подпись Из get_prop(Вложение, "Подпись", Новый Массив) Цикл
			НоваяСтр.Подпись = НоваяСтр.Подпись + ПолучитьПредставлениеСертификата(Подпись["Сертификат"], "[ФИО]., [Должность]., [Название]") + Символы.ПС;
		КонецЦикла;
		Если get_prop(Вложение, "Документы1С") = Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		НоваяСтр.Документы1С = Вложение["Документы1С"];
		НоваяСтр.Документы1СНазвания = "";
		Для Каждого Док1С Из Вложение["Документы1С"] Цикл
			НоваяСтр.Документы1СНазвания = НоваяСтр.Документы1СНазвания + строка(Док1С.Значение)+Символы.ПС;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВложенияПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		УстановитьHTML("HTMLВложения", Элемент.ТекущиеДанные.ТекстHTML);
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_ПросмотрДокумента_ЛентаДокумента
#КонецОбласти

#Область include_core_base_ПросмотрДокумента_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСЭлементамиФормы
#КонецОбласти

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ЭтаФорма.Сотрудник = "";
	ЭтаФорма.Подразделение = "";
	ЭтаФорма.ИдСБИС = "";
	Если Не ФормаОткрыта ИЛИ ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;
	СкрытьКомандыПанели(КомандыПанели);
КонецПроцедуры

#Область include_core_base_ГлавноеОкно_ПанельОпераций
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандыОбщее
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьПрямуюСсылку
#КонецОбласти

&НаКлиенте
Процедура СформироватьМассивыДокументов(СписокДокументовСБИС, СписокДокументов1С) 
	Если ДокументСБИС = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если ТипЗнч(ДокументСБИС) = Тип("Соответствие") Тогда
		СтруктураДокСБИС = Новый Структура("Идентификатор, ПервичныйКлюч, Документ1С",
			ДокументСБИС["Идентификатор"], ДокументСБИС["ИдСБИС"], Документ1С);
		СписокДокументовСБИС.Добавить(СтруктураДокСБИС);
		Если ЗначениеЗаполнено(Документ1С) Тогда
			СписокДокументов1С.Добавить(Документ1С);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_ВстраиваниеВФормы_КомандаВыполнитьВSABY
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаОбновитьВSABY
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаОбновитьСтатусы
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаОткрытьСБИС
#КонецОбласти

Функция ПолучитьСсылкуПоИдИСНаСервере(Знач ИмяИС, Знач ИдИС) 
	Возврат МодульОбъекта().ПолучитьСсылкуПоИдИС(ИмяИС, ИдИС); 
КонецФункции

&НаСервере
Процедура ДополнитьИнформациюОДокументе1С() 
	tUID = Новый ТаблицаЗначений;
	tUID.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка") );
    НовСтрока = tUID.Добавить();
	НовСтрока.UID = Идентификатор;
    МодульОбъекта = МодульОбъекта();
	ТаблицаСсылок = МодульОбъекта.СтатусыДокументовПолучитьСостоянияОбъектов(tUID);
	
	Если ТаблицаСсылок.Количество() > 0 Тогда 
		ЭтаФорма.Документ1С = get_prop(ТаблицаСсылок.Получить(0), "Link", Неопределено);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТабличнуюЧастьФормы( Действие, ДополнительныеПараметры ) Экспорт 
	Если ЗначениеЗаполнено(ДокументСБИС) Тогда 
		ДокументСБИС = ПрочитатьДокумент();
		ЗаполнитьШапкуПоДокументуСБИС(ДокументСБИС);
	КонецЕсли;	
	ЗаполнитьПрохождение(ДокументСБИС);
	ЗаполнитьВложения(ДокументСБИС);
	ДополнитьИнформациюОДокументе1С();	
	ОбновитьДанныеНаФорме(ЭтаФорма);
КонецПроцедуры

#Область include_core_base_Авторизация_Form_Вход_НеобходимоВвестиКодПодтверждения
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаЗагрузитьВСБИС
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключенияНаСервере
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаВыгрузитьВложенияИзСБИС
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьИдСБИС //&НаКлиенте
#КонецОбласти

&НаКлиенте
Функция СформироватьМассивВыгружаемыхДокументов1С()
	ВыгружаемыеДокументы = Новый Массив();
	Если ЗначениеЗаполнено(Документ1С) Тогда
		ВыгружаемыеДокументы.Добавить(Документ1С);
	КонецЕсли;
	Возврат ВыгружаемыеДокументы;	
КонецФункции

&НаКлиенте
Функция КнопкаВыгрузитьВ1С() 
	Возврат ПолучитьЭлементыФормы()["ВыгрузитьВ1С"];
КонецФункции	

#Область include_core_base_ВстраиваниеВФормы_КомандаВыгрузитьВ1С
#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

&НаКлиенте
Функция ФильтрДляКоманды()
	СписокОтмеченных = СписокОтмеченныхЗаписей();
	Selection = Новый Структура();
	Selection.Вставить("MarkedAll", Ложь);
	Selection.Вставить("Marked", СписокОтмеченных);
	Filter = Новый Структура("Selection", Selection);

	Возврат Filter;
КонецФункции

&НаКлиенте
Функция СписокОтмеченныхЗаписей(ЭтоСписокСсылок = Ложь)
	СписокОтмеченных = Новый Массив;
	СписокОтмеченных.Добавить(Новый Структура("ДокументСБИС, ДокументИС", ДокументСБИС, Документ1С));
	Возврат СписокОтмеченных;

КонецФункции

&НаКлиенте
Функция СписокОтмеченныхЗаписейИерархическийСписок(ЭтоСписокСсылок = Ложь)

	Возврат СписокОтмеченныхЗаписей();

КонецФункции

#Область include_core_base_ГлавноеОкно_Команды
#КонецОбласти

#Область include_core_base_ГлавноеОкно_КомандыТулбара
#КонецОбласти

#Область include_base_CommonModule_ИменаМодулейСервер
#КонецОбласти

&НаКлиенте
Функция СписокДоступныхИнишек(ИмяОбъектаИС)
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	мИниФайлов	= Новый Массив();
	мИниФайлов.Добавить(Новый Структура("type, name", "Система", "ОбъектыСинхBlockly"));
	params	= Новый Структура(
			"props, ini",
			Новый Структура("id, type_data, requested_ini_format", context_params.ConnectionUuid, 1, "Dom1C"), мИниФайлов);
	res = ТранспортИнтеграции.local_helper_integration_api(context_params, "IntegrationConnection.ReadConnection", params, "int-settings");
	ОбъектыИСОбъектыСБИС = get_prop(get_prop(get_prop(res, "data"), "ОбъектыСинхBlockly"), "data");
	ОбъектыИС = get_prop(ОбъектыИСОбъектыСБИС, "ОбъектыИС");
	// ОбъектыСБИС = get_prop(ОбъектыИСОбъектыСБИС, "Объекты");
	Если ОбъектыИС[ИмяОбъектаИС] = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;	
	Возврат ОбъектыИС[ИмяОбъектаИС];
КонецФункции

&НаКлиенте
Процедура ПослеОтправитьВСБИС( Действие, ДополнительныеПараметры ) Экспорт 
	ЭтаФорма.Закрыть();		
КонецПроцедуры

&НаКлиенте
Процедура HTMLВложенияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЭлементСобытия = ДанныеСобытия.srcElement;
	#Иначе
		ЭлементСобытия = ДанныеСобытия.Element;
	#КонецЕсли
	Если ЭлементСобытия["id"] = "Открыть" Тогда
		ЭлементыФормочки = ПолучитьЭлементыФормы(); 
		ТекущиеДанные = ЭлементыФормочки.Вложения.ТекущиеДанные; 
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;	
		ФайлДвоичныеДанные = ТранспортИнтеграции.local_helper_download_from_link(context_params, ТекущиеДанные.ФайлСсылка);
		// BSLLS:TempFilesDir-off Для совместимости с 8.2
		// BSLLS:UsingSynchronousCalls-off
		ИмяФайла = КаталогВременныхФайлов() + ТекущиеДанные.ФайлИмя;
		// BSLLS:TempFilesDir-on
		// BSLLS:UsingSynchronousCalls-on	
		ФайлДвоичныеДанные.Записать(ИмяФайла);
		// BSLLS:UsingSynchronousCalls-off Для совместимости с 8.2
		ЗапуститьПриложение(ИмяФайла);
		// BSLLS:UsingSynchronousCalls-on	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ИдСБИС = get_prop(Параметры, "ИдСБИС");
	ЭтаФорма.Идентификатор = get_prop(Параметры, "Идентификатор");
	ЭтаФорма.Название = get_prop(Параметры, "Название");
	ЭтаФорма.Подразделение = get_prop(Параметры, "Подразделение");
	ЭтаФорма.Примечание = get_prop(Параметры, "Примечание");
	ЭтаФорма.Сотрудник = get_prop(Параметры, "Сотрудник");
КонецПроцедуры

#Область include_core_base_ПросмотрДокумента_ВложенияВыбор
#КонецОбласти

&НаСервере
Функция МодульОбъектаСервер()
	// Зачем писали в компонентах градусника, заваорачиваем на общий код
	Возврат МодульОбъекта();
КонецФункции

&НаКлиенте
Функция ДиалогСохраненияФайла(ИмяФайла)
	Файл = Новый Файл(ИмяФайла);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.ПолноеИмяФайла = Файл.ПолноеИмя;
	Диалог.Расширение = Файл.Расширение;
	Диалог.Фильтр = НСтр("ru = 'Все файлы (*" + Файл.Расширение + ")|*" + Файл.Расширение + "'");
	Диалог.Заголовок = НСтр("ru='Выберите файл'");
	Диалог.МножественныйВыбор = Ложь;
	Возврат Диалог;
КонецФункции

&НаКлиенте
Процедура СохранитьФайлВложения(ИмяФайла, СсылкаНаФайл)
	Диалог = ДиалогСохраненияФайла(ИмяФайла);
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
		ФайлДвоичныеДанные = ТранспортИнтеграции.local_helper_download_from_link(context_params, СсылкаНаФайл);
		ФайлДвоичныеДанные.Записать(ПутьКФайлу);
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_Транспорт_ВидТранспорта
#КонецОбласти

#Область include_core_base_Транспорт_ИмяСвойстваТранспорта 
#КонецОбласти
