
&НаКлиенте
Перем ПутьКФормам, ДокументСБИС, КомандыПанели Экспорт;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПутьКФормам = ПутьКФормамОбработки();
КонецПроцедуры

&НаКлиенте
Процедура Показать(ДокСБИС, Док1С, cont_param, ДопПараметры = Неопределено) Экспорт
	ДокументСБИС = ДокСБИС;
	Документ1С = Док1С;
	context_param = cont_param;
	ЭтаФорма.Открыть();
	Если ЗначениеЗаполнено(ДокументСБИС) Тогда
		ЗаполнитьШапкуПоДокументуСБИС(ДокументСБИС);
	Иначе
		
	КонецЕсли;
	ЗаполнитьПрохождение(ДокументСБИС);
	ЗаполнитьВложения(ДокументСБИС);
	Если ДопПараметры <> Неопределено И ДопПараметры.Свойство("КомандыПанели") Тогда
		КомандыПанели = ДопПараметры.КомандыПанели;
		ОбновитьПанельОпераций("ПанельОпераций", КомандыПанели);
	Иначе
		КомандыПанели = Новый Массив();	
	Конецесли;
КонецПроцедуры

Процедура ЗаполнитьШапкуПоДокументуСБИС(СоставПакета)
	ЭтаФорма.Заголовок = СоставПакета["Название"];
	Номер = СоставПакета["Номер"];
	Дата = СоставПакета["Дата"];
	Если get_prop(СоставПакета, "НашаОрганизация") <> Неопределено Тогда
		Если get_prop(СоставПакета["НашаОрганизация"], "СвЮЛ") <> Неопределено Тогда
			Организация = СоставПакета["НашаОрганизация"]["СвЮЛ"]["Название"];
		ИначеЕсли get_prop(СоставПакета["НашаОрганизация"], "СвФЛ") <> Неопределено Тогда
			Организация = СоставПакета["НашаОрганизация"]["СвФЛ"]["Фамилия"] + " " + СоставПакета["НашаОрганизация"]["СвФЛ"]["Имя"] + " " + СоставПакета["НашаОрганизация"]["СвФЛ"]["Отчество"];
		КонецЕсли;
	КонецЕсли;
	Если get_prop(СоставПакета, "Примечание") <> Неопределено Тогда
		Комментарий = СоставПакета["Примечание"];
	Иначе
		Комментарий = "";
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьВложения(СоставПакета, ДопПараметры = Неопределено) Экспорт
	Вложения.Очистить();
	Если get_prop(СоставПакета,"Вложение") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодульОбъекта = ПолучитьМодульОбъекта();
	Для Каждого Вложение Из СоставПакета["Вложение"] Цикл
		Если get_prop(Вложение, "Служебный") = "Да" Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтр = Вложения.Добавить();
		НоваяСтр.Название = Вложение["Название"];
		Если ЗначениеЗаполнено(Вложение["СсылкаНаHTML"]) Тогда
			НоваяСтр.ТекстHTML = МодульОбъекта.local_helper_download_from_link(context_param, Вложение["СсылкаНаHTML"], "text");	
		Конецесли;
		Если get_prop(Вложение, "Подпись") <> Неопределено Тогда
			Для Каждого Подпись Из Вложение["Подпись"] Цикл
				НоваяСтр.Подпись = НоваяСтр.Подпись + ПолучитьПредставлениеСертификата(Подпись["Сертификат"], "[ФИО]., [Должность]., [Название]") + Символы.ПС;
			КонецЦикла;
		КонецЕсли;
		Если get_prop(Вложение, "Документы1С") <> Неопределено Тогда
			НоваяСтр.Документы1С = Вложение["Документы1С"];
			НоваяСтр.Документы1СНазвания = "";
			Для Каждого Док1С Из Вложение["Документы1С"] Цикл
				НоваяСтр.Документы1СНазвания = НоваяСтр.Документы1СНазвания + строка(Док1С.Значение)+Символы.ПС;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВложенияПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		УстановитьHTML("HTMLВложения", Элемент.ТекущиеДанные.ТекстHTML);
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_ПросмотрДокумента_ЛентаДокумента
#КонецОбласти

#Область include_core_base_ПросмотрДокумента_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСЭлементамиФормы
#КонецОбласти

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СкрытьКомандыПанели(КомандыПанели);
КонецПроцедуры

#Область include_core_base_ГлавноеОкно_ПанельОпераций
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьПрямуюСсылку
#КонецОбласти

&НаКлиенте
Процедура СформироватьМассивыДокументов(СписокДокументовСБИС, СписокДокументов1С) 
	Если ДокументСБИС = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если ТипЗнч(ДокументСБИС) = Тип("Соответствие") Тогда
		СтруктураДокСБИС = Новый Структура("Идентификатор, ПервичныйКлюч, Документ1С",
			ДокументСБИС["Идентификатор"], ДокументСБИС["ИдСБИС"], Документ1С);
		СписокДокументовСБИС.Добавить(СтруктураДокСБИС);
		Если ЗначениеЗаполнено(Документ1С) Тогда
			СписокДокументов1С.Добавить(Документ1С);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_ВстраиваниеВФормы_КомандаВыполнитьВSABY
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаОбновитьВSABY
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаОбновитьСтатусы
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаОткрытьСБИС
#КонецОбласти

&НаКлиенте
Функция ПолучитьОповещениеОбновлнияТаблицыФормы( Команда, ПараметрКоманды ) Экспорт 
	
    Возврат Неопределено; 
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТабличнуюЧастьФормы( Действие, ДополнительныеПараметры ) Экспорт 
	
КонецПроцедуры

#Область include_core_base_Авторизация_Form_Вход_НеобходимоВвестиКодПодтверждения
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаЗагрузитьВСБИС
#КонецОбласти

#Область include_core_base_Авторизация_ТребуетсяАутентификация
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключенияНаСервере
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаВыгрузитьВложенияИзСБИС
#КонецОбласти

&НаКлиенте
Функция СформироватьМассивВыгружаемыхДокументов() 
	ВыгружаемыеДокументы = Новый Массив();
	Если ДокументСБИС <> Неопределено Тогда
		ИмяСБИС = ДокументСБИС["Тип"];
		ПримечаниеСБИС = ДокументСБИС["Примечание"];
		ИдентификаторДокумента = ДокументСБИС["Идентификатор"];
		ИмяИзСБИСвАПИ3(ИмяСБИС, ПримечаниеСБИС, ИдентификаторДокумента);
		
		API3_ref = Новый Структура;
		API3_ref.Вставить("SbisId",		 ДокументСБИС["ИдСБИС"]);
		API3_ref.Вставить("SbisType",	ИмяСБИС);
		API3_ref.Вставить("Type",		ИмяСБИС);
		API3_ref.Вставить("Title",		ДокументСБИС["Название"]);
		ВыгружаемыеДокументы.Добавить(API3_ref);
	КонецЕсли;
	Возврат ВыгружаемыеДокументы;
КонецФункции

&НаКлиенте
Функция СформироватьМассивВыгружаемыхДокументов1С()
	ВыгружаемыеДокументы = Новый Массив();
	Если ЗначениеЗаполнено(Документ1С) Тогда
		ВыгружаемыеДокументы.Добавить(Документ1С);
	КонецЕсли;
	Возврат ВыгружаемыеДокументы;	
КонецФункции

&НаКлиенте
Функция КнопкаВыгрузитьВ1С() 
	Возврат ПолучитьЭлементыФормы()["ВыгрузитьВ1С"];
КонецФункции	

#Область include_core_base_ВстраиваниеВФормы_КомандаВыгрузитьВ1С
#КонецОбласти
