
#Область include_core_base_ГлавноеОкно_Переменные
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ПриОткрытии
#КонецОбласти

&НаКлиенте
Процедура ПолучитьРеквизитОбъектаДокумента()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ТипОбъектаДокумент = ТипЗнч(ЭлементыФормочки.АккордеонHTML.Документ);
	Если ТипОбъектаДокумент = Тип("COMОбъект") Тогда
		//IE
		ЭтаФорма.РеквизитОбъектаДокумента = "parentWindow";
	ИначеЕсли ТипОбъектаДокумент = Тип("ВнешнийОбъект") Тогда
		//WebKit
		ЭтаФорма.РеквизитОбъектаДокумента = "defaultView";
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереоткрытиеФормыОтправки( Результат, Параметры ) Экспорт
	// Используется в УФ обработке
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	МассивОтмеченныхДокументов = Новый Массив;
	Для Каждого ЭлементСписка Из Параметры.ОбъектыОтправки Цикл
		ОтмеченныйДокумент = Новый Структура;
		ОтмеченныйДокумент.Вставить("Отмечен", Истина);
		ОтмеченныйДокумент.Вставить("ДокументИС", ЭлементСписка);
		МассивОтмеченныхДокументов.Добавить(ОтмеченныйДокумент);
	КонецЦикла;

	МассивОбъектов = ОбъектыДляЗагрузки(МассивОтмеченныхДокументов);

	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("Источник", МассивОбъектов);
	Форма = ФормаОсновнойОбработки("ЗагрузкаДокументов", ПутьКФормамОбработки(), ПараметрыВызова, ЭтаФорма);
	Форма.Открыть();
КонецПроцедуры

#Область include_core_base_ГлавноеОкно_Аккордеон
#КонецОбласти

&НаКлиенте
Процедура ОбработатьДействиеНаКлиенте(ИмяДействия, Параметры)
	Если ИмяДействия = "ADDON_CLICK" Тогда
		Если Параметры = "addon_status_version" Тогда
			СбисОбновитьОбработкуНаКлиенте();
		ИначеЕсли Параметры = "addon_version" Тогда
			// BSLLS:UsingSynchronousCalls-off
			ЗапуститьПриложение(СтатусВерсии.СсылкаДляСкачивания);
			// BSLLS:UsingSynchronousCalls-on
		//ИначеЕсли Параметры = "addon_logo" Тогда //пока никак не обрабатывается
		Иначе
			Возврат;
		КонецЕсли
	ИначеЕсли ИмяДействия = "ADDON_NAVIGATE" Тогда
		ТекущийРаздел.Вставить("Идентификатор", Параметры);
		ПоказатьШаблон();
	Иначе
		ОбработатьДействие(ИмяДействия, Параметры);
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ОбработатьДействие(Знач ИмяДействия, Знач Параметры)
	МодульОбъекта = МодульОбъекта();
	Если ИмяДействия = "ADDON_READSYSTEMINFO" Тогда
		МодульОбъекта.API_ADDON_READSYSTEMINFO(Параметры);	
	Иначе
		ВызватьИсключение NewExtExceptionСтрока(,"Неизвестная команда", ИмяДействия);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

#Область include_core_base_ГлавноеОкно_ПоказатьШаблон
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ПлоскийСписок
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ИерархическийСписок
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ПанельОпераций
#КонецОбласти

#Область include_core_base_ГлавноеОкно_Фильтр
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандыОбщее
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаПоиск
#КонецОбласти

&НаСервере
Функция ОбъектыДляЗагрузки(Знач СписокОтмеченных)
	МассивОбъектов = Новый Массив();
	Для Каждого Строка Из СписокОтмеченных Цикл
		Если Строка.Отмечен Тогда
			API3_ref = Новый Структура;
			API3_ref.Вставить("UID",           NULL);
			API3_ref.Вставить("ИмяИни",        Неопределено);
			API3_ref.Вставить("Ссылка",        Строка.ДокументИС);
			API3_ref.Вставить("ТипМетаданных", Неопределено);
			API3_ref.Вставить("ТипОбъекта",    Неопределено);
			МассивОбъектов.Добавить(API3_ref);	
		КонецЕсли;
	КонецЦикла;
    Возврат МассивОбъектов;
КонецФункции

&НаКлиенте
Процедура ПослеВыполненияДействия(Результат)  Экспорт
	ОбновитьТабличнуюЧастьФормы( Неопределено, Результат );
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Элемент) Экспорт    
	
	ЗаписатьНастройкиНаСервере();
	Форма = ФормаОсновнойОбработки("Настройки", КэшФорм.ПутьКФормам, , ЭтаФорма);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВебИнтерфейс(Элемент) Экспорт
	ИмяСервиса = get_prop(context_params, "service");
	Если ЗначениеЗаполнено(ИмяСервиса) Тогда
		ИмяСервиса = ИмяСервиса + "-";
	Иначе
		ИмяСервиса = "";
	КонецЕсли;
	АдресСтраницы = "https://" + ИмяСервиса + "ie-1c.saby.ru/addon2/page/";
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок", "Веб-интерфейс");
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
	Форма = ФормаОсновнойОбработки("Browser", КэшФорм.ПутьКФормам, ПараметрыФормы, ЭтаФорма);
	Форма.Открыть();
КонецПроцедуры

#Область include_core_base_Настройки_ЗаписатьНастройки
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ОткрывалкаФорм
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ОбновлениеТабличнойЧастиФормы
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСЭлементамиФормы
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСерверСКлиента
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ОсобенностиПриложения
#КонецОбласти

&НаКлиенте
Процедура ПолучитьАктуальностьВерсии()
// Заглушка
КонецПроцедуры

#Область include_core_base_ПроверкаВерсии_ПолучитьСтатусВерсииНаФорме
#КонецОбласти

#Область include_core_base_ПроверкаВерсии_НаФормеОбновлениеОбработки
#КонецОбласти

#Область include_base_ОткрытьСтраницуИсторииИзменения
#КонецОбласти

#Область include_core_base_НалоговыйМониторинг
#КонецОбласти

#Область include_core_base_Настройки_ПрочитатьНастройки
#КонецОбласти

&НаКлиенте
Процедура ОбработкаОповещенияНаКлиенте(ИмяСобытия, Параметр, Источник)
	НазваниеПродукта = ЛокализацияНазваниеПродукта();
	ОбработкаОповещения(ИмяСобытия, Параметр, НазваниеПродукта);
	Если ИмяСобытия = НазваниеПродукта + "_ЗакрытиеФормыАвторизации" Тогда
		Если get_prop(Параметр, "АвторизацияУспешна", Ложь) = Ложь Тогда
			Если ЭтаФорма.Открыта() Тогда
				ЭтаФорма.Закрыть();
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = НазваниеПродукта + "_ЗакрытиеФормыАвторизации" Или ИмяСобытия = "Saby_НастройкиИзменены" Тогда
		Если ПроверитьНаличиеПараметровПодключенияНаСервере() = Неопределено Тогда
			ПоказатьОповещениеПользователя(
				"Функционал " + НазваниеПродукта + " недоступен.",
				Неопределено,
				"Для работы необходимо авторизоваться.",
				КартинкаОшибка(),
				СтатусОповещенияПользователя.Важное);
			Возврат;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекущийРаздел["Идентификатор"]) Тогда
			ПриОткрытииПослеАвторизации(Истина);
		Иначе
			ОбновитьЗаголовокФормы();
			ПоказатьШаблон();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, НазваниеПродукта)
	Если ИмяСобытия = НазваниеПродукта + "_ЗакрытиеФормыАвторизации" Или ИмяСобытия = "Saby_НастройкиИзменены" Тогда
		ЭтаФорма.context_params = СБИСПараметры();
	ИначеЕсли ИмяСобытия = "Saby_ЗавершениеВыполнитьДействие" Тогда
		ПослеВыполненияДействия(Параметр);
	ИначеЕсли ИмяСобытия = "SabySignOut" Тогда
		// Перечитаем настройки при выходе
		ЭтаФорма.context_params = СБИСПараметры();
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АккордеонДокументСформирован(Элемент)
	АккордеонОбновитьИнформациюОВерсии();
КонецПроцедуры

#Область include_core_base_Helpers_Картинки
#КонецОбласти

&НаКлиенте
Процедура УстановитьЗаголовокПодсказкуКнопкиВыйти()
// Заглушка
КонецПроцедуры

#Область include_core_base_Авторизация_СменаАккаунта
#КонецОбласти

#Область include_core_base_Авторизация_Выход
#КонецОбласти

&НаКлиенте
Процедура ВыйтиНажатие(Элемент)
	ВыйтиНаСервере();
	//ПолучитьАктуальностьВерсии();
	//УстановитьЗаголовокПодсказкуКнопкиВыйти();
	Сообщить("Сессия и пароль сброшены");
	Оповестить("SabySignOut");
	ОткрытьФормуОбработки("Вход",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьАккаунтНажатие(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементФормыДляВыпадающегоСписка = ЭлементыФормочки.Найти("МенюПриложения" + ТекущийРаздел["Шаблон"]);
	СменитьАккаунтВВыпадающемСписке(ЭлементФормыДляВыпадающегоСписка);
КонецПроцедуры

#Область include_core_base_Авторизация_ТребуетсяАутентификация
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаЗагрузитьВСБИС
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаОткрытьСБИС
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаВыгрузитьВложенияИзСБИС
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаОбновитьСтатусы
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаВыполнитьВSABY
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаВыгрузитьВ1С
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаОбновитьВSABY
#КонецОбласти

#Область include_core_base_Авторизация_Form_Вход_НеобходимоВвестиКодПодтверждения
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьПрямуюСсылку
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключенияНаСервере
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьИдСБИС //&НаКлиенте
#КонецОбласти

&НаКлиенте
Процедура ПослеОтправитьВСБИС( Действие, ДополнительныеПараметры ) Экспорт 
	ОбновитьТабличнуюЧастьФормы( Действие, ДополнительныеПараметры );		
КонецПроцедуры

&НаКлиенте
Процедура МенюПриложенияСтраницаЗаглушкаАвтоматическиеОперации(Кнопка)
	Форма = ФормаОсновнойОбработки("РоботСписок", КэшФорм.ПутьКФормам, , ЭтаФорма);
	Форма.Открыть();

КонецПроцедуры

#Область include_core_base_ДлительныеОперации_ГлавноеОкноОбработки
#КонецОбласти

&НаКлиенте
Функция ФильтрДляКоманды()
	СписокОтмеченных = СписокОтмеченныхЗаписей();
	Selection = Новый Структура();
	Selection.Вставить("MarkedAll", ОтмеченыВсе);
	Selection.Вставить("Marked", СписокОтмеченных);
	Filter = Новый Структура("Selection, Algorithm", Selection, ТекущийРаздел["Идентификатор"]);
	Для Каждого ЭлемФильтр Из ДанныеФильтра.Значения Цикл
		Filter.Вставить(ЭлемФильтр.Ключ, ЭлемФильтр.Значение);	
	КонецЦикла;
	Возврат Filter;
КонецФункции

#Область include_core_base_ГлавноеОкно_Команды
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

&НаКлиенте
Функция ЭтотОбъектНаКлиенте() 
	Возврат ЭтаФорма;
КонецФункции
