Функция СоздатьСтатус(Идентификатор)
	СпрОбъект = Справочники[ПрефиксПродукта() + "СостоянияОбъектов"].СоздатьЭлемент();
	СпрОбъект.ИдентификаторСБИС = Идентификатор;
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;
КонецФункции

Функция ПолучитьСтатусДокументаСБИС(Идентифкатор) Экспорт
	
	Статус = Справочники[ПрефиксПродукта() + "СостоянияОбъектов"].ПустаяСсылка();
	
	Запрос = Новый Запрос;
	ЗапросТекст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Спр.Ссылка КАК Статус
	|ИЗ
	|	Справочник.Saby_СостоянияОбъектов КАК Спр
	|ГДЕ
	|	Спр.ИдентификаторСБИС = &Идентификатор
	|";
	
	ЗапросТекст =  СтрЗаменить(ЗапросТекст, "Saby_", ПрефиксПродукта());
	Запрос.Текст = ЗапросТекст;
	Запрос.УстановитьПараметр("Идентификатор", Идентифкатор);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Статус = СоздатьСтатус(Идентифкатор);
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Статус = Выборка.Статус;
	КонецЕсли;	
	
	Возврат Статус;
КонецФункции

Функция СоздатьЭлементСправочника( Наименование, СтатусЭД, ИндексКартинки ) Экспорт
	НайденныйЭлемент	= Справочники[ПрефиксПродукта() + "СостоянияОбъектов"].НайтиПоРеквизиту("ИдентификаторСБИС", СтатусЭД);
	Если НайденныйЭлемент.Пустая() ТОгда
		НайденныйЭлементО					= Справочники[ПрефиксПродукта() + "СостоянияОбъектов"].СоздатьЭлемент();
		НайденныйЭлементО.ИдентификаторСБИС	= СтатусЭД;
	Иначе
		НайденныйЭлементО	= НайденныйЭлемент.ПолучитьОбъект();
	КонецЕсли;
	НайденныйЭлементО.Наименование		= Наименование; // Обновляем наименование
	НайденныйЭлементО.ИндексКартинки	= ИндексКартинки;
	НайденныйЭлементО.Записать();
	НайденныйЭлемент	= НайденныйЭлементО.Ссылка;
	Возврат НайденныйЭлемент;
КонецФункции

Процедура НачальнаяИнициализация() Экспорт
	СоздатьЭлементСправочника( "Документ не запущен в ЭДО " + ЛокализацияНазваниеПродукта(),	"0", 0);
	СоздатьЭлементСправочника( "Есть документ",						"1", 0);
	СоздатьЭлементСправочника( "Отправлено приглашение",			"2", 1);
	СоздатьЭлементСправочника( "Отправлен",							"3", 0);
	СоздатьЭлементСправочника( "Доставлен",							"4", 4);
	СоздатьЭлементСправочника( "Ошибка при загрузке документа в " + ЛокализацияНазваниеПродукта(),	"6", 3);
	СоздатьЭлементСправочника( "Обработка завершена положительно",	"7", 6);
	СоздатьЭлементСправочника( "Обработка завершена отрицательно",	"9", 5);
	СоздатьЭлементСправочника( "Документ на выполнении",			"10", 2);
	СоздатьЭлементСправочника( "Отозван мной",						"19", 8);
	СоздатьЭлементСправочника( "Удален контрагентом",				"20", 7);
	СоздатьЭлементСправочника( "Аннулирован по соглашению",			"22", 7);
	СоздатьЭлементСправочника( "Ожидает подписания",				"23", 9);
	СоздатьЭлементСправочника( "Ожидает аннулирования",				"27", 9);
КонецПроцедуры

#Область include_core_base_Helpers_ЛокализацияНазваниеПродукта
#КонецОбласти
	
#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти
