
Функция ПолучитьИмяФайлаИНомерТекущейВерсии() Экспорт
	МодульОбъекта = МодульОбъекта();
	Результат = Новый Массив(2);
	Результат[0] = "";
	Результат[1] = "00.0000.0";  
	КомментарийМетаданных = Saby_СтрРазделить82(МодульОбъекта.Метаданные().Комментарий, ":");
	РазмерКомментария = КомментарийМетаданных.Количество();
	Если  РазмерКомментария = 3 Тогда
		Результат[0] = КомментарийМетаданных[РазмерКомментария - 2];
		Результат[1] = КомментарийМетаданных[РазмерКомментария - 1];
	Иначе
		//Для VO2
		Попытка 
			СведенияОВнешнейОбработке = МодульОбъекта.СведенияОВнешнейОбработке();
			Результат[1] = get_prop(СведенияОВнешнейОбработке, "Версия", "");
		Исключение  
			Возврат Результат;
		КонецПопытки;
		//--	
	КонецЕсли;
	Возврат Результат;	
КонецФункции

Функция ПолучитьТипМетаданныхОбработки()
	Возврат "ВнешняяОбработка";
КонецФункции
