
&НаКлиенте
Функция ПолучитьСтатусВерсииНаФорме(Принудительно = Ложь) Экспорт
	//	Попытка
	context_params_tmp	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	Если context_params_tmp = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	СтатусВерсии	= ТранспортИнтеграции.ПолучитьСтатусВерсии(Принудительно);
	Возврат СтатусВерсии;

	//	Исключение
	//		ИнфОбОшибке = ИнформацияОбОшибке();
	//		Ошибка = ExtExceptionAnalyse(ИнфОбОшибке);
	//		Сообщить("Ошибка получения информации о версии: " + ExtExceptionToMessage(Ошибка));
	//		Возврат Неопределено;
	//	КонецПопытки;
КонецФункции

