
// BSLLS:UnusedLocalVariable-off Переменные используются в склеиваемых областях
&НаКлиенте
Перем ФормаОткрыта, ТранспортИнтеграции, BlocklyExecutor;
// BSLLS:UnusedLocalVariable-on

#Область include_core_base_locale_ЛокализацияДействиеПриОткрытии
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_ОсобенностиПродукта
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ИзмененаДатаОбновленияСтатусов = Ложь;
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ДобавитьИнформациюОВерсии(ЭлементыФормочки.ВерсияПродукта);
	
	ЗаполнитьСпискиВыбораРеквизитов();
	ЗаполнитьРеквизитыИзПубличныхНастроек();
	ЗаполнитьРеквизитыИзНастроекПодключения();
		
	ПрочитатьНастройкиПодсистемы("ЭПД");
	ПрочитатьНастройкиПодсистемы("КЭДО");
	ПрочитатьНастройкиПодсистемы("ЭЛН");
	
	ВидимостьЭлементовКЭДО = ЗначениеФункциональнойОпции("ИспользоватьКЭДО");
	ЭлементыФормочки.грПриглашение.Видимость			  = ВидимостьЭлементовКЭДО; 
	ЭлементыФормочки.run_docflow.Видимость				  = ВидимостьЭлементовКЭДО;
	ЭлементыФормочки.kedo_mark.Видимость				  = ВидимостьЭлементовКЭДО;
	ЭлементыФормочки.Вложения.Видимость					  = ВидимостьЭлементовКЭДО; 
	ЭлементыФормочки.ОткрытьКадровыеДокументы.Видимость	  = ВидимостьЭлементовКЭДО; 
	ЭлементыФормочки.ДекорацияЗадачиНативные.Видимость	  = ВидимостьЭлементовКЭДО; 
	ЭлементыФормочки.ОткрытьЗадачи.Видимость			  = ВидимостьЭлементовКЭДО; 
	ЭлементыФормочки.ОткрытьСтраницуПодключения.Видимость = ВидимостьЭлементовКЭДО; 
	
	ЭлементыФормочки.ДействиеСРегламентнымЗаданием.Заголовок = "Поиск регламентного задания";
	ЭтаФорма.Заголовок  = "Настройки "+ЛокализацияНазваниеПродукта();
	ЭлементыФормочки.download_attachments_on_update.Заголовок = "При загрузке документа из "+ЛокализацияНазваниеПродукта();
	ЭлементыФормочки.АдресСервера.Подсказка = "Адрес сервера "+ЛокализацияНазваниеПродукта();
	
	ПоказатьГруппуТранспорт();
	ПоказатьТекстСообщения();
	ЛокализацияДействиеПриОткрытии()
КонецПроцедуры

#Область include_core_base_Настройки_Form_Настройки_ЗаполнитьРеквизитыПриОткрытии
#КонецОбласти

&НаСервере
Функция ПолучитьКоличествоФункциональныхОпций()
	МодульОбъекта = МодульОбъекта();
	МетаданныеРасширения = МодульОбъекта.ПолучитьМетаданныеРасширения();
	КоличествоФО = 0;
	Если МетаданныеРасширения <> Неопределено Тогда 
		КоличествоФО = МетаданныеРасширения.ФункциональныеОпции.Количество();
	КонецЕсли;
	Возврат КоличествоФО;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();

	ФормаОткрыта = Истина;
	ПолучитьАктуальностьВерсии();
	
	СтатусВерсии = ПолучитьСтатусВерсииНаФорме(Истина);
	ДанныеОшибки = get_prop(СтатусВерсии, "ДанныеОшибки");
	ОписаниеОшибки = get_prop(ДанныеОшибки, "detail");
	ТребуетсяОткрытьФормуАвторизации = НеобходимоВвестиКодПодтверждения(ОписаниеОшибки);
	Если ТребуетсяОткрытьФормуАвторизации Тогда
		//В фонме настроек мы просто разлогинимся
		ВыйтиНаСервере();
	КонецЕсли;
	
	УстановитьЗаголовокПодсказкуКнопкиВыйти();
	УстановитьДоступностьПоляТипОтправкиПриглашения();
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ДействиеСРегламентнымЗаданием.Заголовок = "Поиск регламентного задания...";
	ПослеОткрытия();
КонецПроцедуры  


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ФормаОткрыта = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	АвторизацияВыполнена = Неопределено;
	Если ТипЗнч(context_params) = Тип("Структура") Тогда
		context_params.Свойство("session", АвторизацияВыполнена);
	КонецЕсли;
	АвторизацияВыполнена =	АвторизацияВыполнена <> Неопределено;
	Если НЕ АвторизацияВыполнена Тогда
		Оповестить("Saby_ЗакрытиеФормыАвторизации",
			Новый Структура("АвторизацияУспешна, ДальнейшееДействие, ФормаНастроек", Ложь, ""));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыйтиНажатие(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ЭлементыФормочки.Выйти.Заголовок = "Войти" Тогда
		ПроверкаВведенныхДанныхАутентификации = Новый ОписаниеОповещения("ОбработкаРезультатаЗакрытияФормыАвторизации",
																			ЭтаФорма);
		ОткрытьФормуОбработки("Вход",, ЭтаФорма,, ПроверкаВведенныхДанныхАутентификации);
	Иначе
		ВыйтиНаСервере();
		ПолучитьАктуальностьВерсии();
		УстановитьЗаголовокПодсказкуКнопкиВыйти();
		Сообщить("Сессия и пароль сброшены");
		Оповестить("SabySignOut");
		ЭтаФорма.context_params = СБИСПараметры();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СменитьАккаунтНажатие(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	СменитьАккаунтВВыпадающемСписке(ЭлементыФормочки.ПереключитьАккаунт);
КонецПроцедуры

#Область include_core_base_Настройки_ЗагрузитьСопоставления
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_ПриИзменении
#КонецОбласти

&НаКлиенте
Процедура ОбработкаРезультатаЗакрытияФормыАвторизации(Результат, Параметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	ПолучитьАктуальностьВерсии();
	УстановитьЗаголовокПодсказкуКнопкиВыйти();
	//А вот тут бы проверить куда мы дальше хотим идти, если есть такие указания в - Параметры
	//Это для команд открытия формы браузера.
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		ОповещениеМодуль = get_prop(Параметры,"Модуль");
		ОповещениеМетод = get_prop(Параметры,"Метод");
		Если ОповещениеМодуль = Неопределено ИЛИ ОповещениеМетод = Неопределено Тогда
			Возврат;
		КонецЕсли;
		МетодЗавершенияАвторизации = Новый ОписаниеОповещения(ОповещениеМетод, ОповещениеМодуль);
		ВыполнитьОбработкуОповещения(МетодЗавершенияАвторизации);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокПодсказкуКнопкиВыйти()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	saby_param = СБИСПараметры();
	АвторизацияВыполнена = ТранспортИнтеграции.УИДСессии(saby_param) <> Неопределено;
	Если АвторизацияВыполнена Тогда
		ЭлементыФормочки.Выйти.Заголовок = "Выйти";
		ЭлементыФормочки.Выйти.Подсказка = "Закрыть сессию в "+ЛокализацияНазваниеПродукта();
	Иначе
		ЭлементыФормочки.Выйти.Заголовок = "Войти";
		ЭлементыФормочки.Выйти.Подсказка = "Открыть сессию в "+ЛокализацияНазваниеПродукта();
	КонецЕсли;

	ЭлементыФормочки.ЛогинПользователя.Видимость	= АвторизацияВыполнена;
	ЭлементыФормочки.АдресСервера.Видимость			= АвторизацияВыполнена;
	
	СтруктураСессии = ТранспортИнтеграции.СтруктураСессии(saby_param);
	ЭлементыФормочки.ЛогинПользователя.Заголовок	= get_prop(СтруктураСессии, "user_fio");
	ЭлементыФормочки.АдресСервера.Заголовок			= get_prop(saby_param, "api_url");
	ЭлементыФормочки.ПереключитьАккаунт.Доступность = (ЭлементыФормочки.Выйти.Заголовок = "Выйти");
	ОбновитьДанныеНаФорме(ЭтаФорма);
КонецПроцедуры

#Область include_core_base_Настройки_ПрочитатьНастройки
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_ОткрытьВебСтраницы
#КонецОбласти

#Область include_core_base_НалоговыйМониторинг
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_СброситьКэш
#КонецОбласти

&НаСервере
Функция ПолучитьТекущийТранспорт()
	МодульОбъекта = МодульОбъекта();
	ЭтаФорма.context_params = МодульОбъекта.НастройкиПодключенияПрочитать();
	Возврат МодульОбъекта.ВидТранспорта(context_params);	
КонецФункции

&НаСервере
Процедура ЗаписатьОбщиеПараметрыНаСервере()
	МодульОбъекта = МодульОбъекта();
	ОбщиеНастройки	= МодульОбъекта.ОбщиеНастройкиПрочитать();
	ПубличныеОбщиеНастройки	= get_prop(ОбщиеНастройки, "public", Новый Структура);
	
	ПубличныеОбщиеНастройки.Вставить("download_attachments_on_complete",	download_attachments_on_complete);
	ПубличныеОбщиеНастройки.Вставить("download_attachments_on_update",		download_attachments_on_update);
	ПубличныеОбщиеНастройки.Вставить("refresh_statuses",					refresh_statuses);
	ПубличныеОбщиеНастройки.Вставить("run_docflow",							run_docflow);
	ПубличныеОбщиеНастройки.Вставить("kedo_mark",							kedo_mark);
	ПубличныеОбщиеНастройки.Вставить("send_invitations",					send_invitations);
	ПубличныеОбщиеНастройки.Вставить("send_type",							send_type);
	ПубличныеОбщиеНастройки.Вставить("send_completed_documents",			send_completed_documents);
	ПубличныеОбщиеНастройки.Вставить("pdf_attachments",						pdf_attachments);
	ПубличныеОбщиеНастройки.Вставить("auto_update",							auto_update);
	ПубличныеОбщиеНастройки.Вставить("web_interface",						web_interface);
	
	ОбщиеНастройки.Вставить("public", ПубличныеОбщиеНастройки);
	МодульОбъекта.ОбщиеНастройкиЗаписать(ОбщиеНастройки);  
	
	ЗаписатьНастройкиПодсистемы("ЭПД");
	ЗаписатьНастройкиПодсистемы("КЭДО");
	ЗаписатьНастройкиПодсистемы("ЭЛН");
	ПоказатьГруппуТранспорт();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыПользователя();
	МодульОбъекта = МодульОбъекта();
	context_params = МодульОбъекта.НастройкиПодключенияПрочитать();
	Если context_params = Неопределено Тогда 
		context_params = Новый Структура;
	КонецЕсли;	
	Если advanced_log Тогда
		context_params.Вставить("advanced_log", ТекущаяДатаСеанса());
	Иначе
		context_params.Вставить("advanced_log", Дата(1, 1, 1));
	КонецЕсли;
	context_params.Вставить("Тема", Тема);
	Если ИзмененаДатаОбновленияСтатусов Тогда 
		УстановитьДатуСобытияОбновленияСтатусов(context_params);
	КонецЕсли;
	context_params.Вставить(ИмяСвойстваТранспорта(), exchange_method);
	context_params.Вставить("SendDocNumberDeleteBasePrefix", SendDocNumberDeleteBasePrefix);
	context_params.Вставить("SendDocNumberDeleteUserPrefix", SendDocNumberDeleteUserPrefix);
	
	МодульОбъекта.НастройкиПодключенияЗаписать(context_params);
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяУказателяСтатусаПриИзменении(Элемент)
	ЭтаФорма.ИзмененаДатаОбновленияСтатусов = Истина;
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуСобытияОбновленияСтатусов(context_param)
	УказателиНаСобытие = Новый Структура();
	Если ДатаВремяУказателяСтатуса <> Дата(1,1,1) Тогда
		УказателиНаСобытие = Новый Структура("date", Формат(ДатаВремяУказателяСтатуса, "ДФ='dd.MM.yyyy HH.mm.ss'"));
	КонецЕсли;
	context_param.Вставить("last_event", УказателиНаСобытие);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиПодсистемы(ИмяПодсистемы, ОтображатьФО = Истина)
	
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	
	ИмяФО = "Saby_Использовать" + ИмяПодсистемы;
	Если Метаданные.ФункциональныеОпции.Найти(ИмяФО) = Неопределено Тогда
		ЭлементыФормочки[ИмяФО].Видимость = Ложь;
	Иначе
		ЭтаФорма[ИмяФО] = Константы[ИмяФО].Получить();
	КонецЕсли;
	ЭлементыФормочки[ИмяФО].Видимость = ЭлементыФормочки[ИмяФО].Видимость И ОтображатьФО;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиПодсистемы(ИмяПодсистемы)
	
	ИмяФО = "Saby_Использовать" + ИмяПодсистемы;
	Если Метаданные.ФункциональныеОпции.Найти(ИмяФО) <> Неопределено Тогда
		Если ИмяПодсистемы = "ЭЛН" И Константы[ИмяФО].Получить() = Ложь И ЭтаФорма[ИмяФО] = Истина Тогда
			ПриВключенииСЭДО();
		КонецЕсли;
		Константы[ИмяФО].Установить(ЭтаФорма[ИмяФО]);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриВключенииСЭДО()
    
    // Загружаем действующие МЧД по организациям у которых настроен обмен с СФР
    ИмяМодуля = "Saby_ЭДОСФСС";
    Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) <> Неопределено Тогда
        
        Попытка
            МодульКонфигурации = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
            МодульКонфигурации.ЗагрузитьМЧДСФР();
		Исключение
            Возврат Ложь;
        КонецПопытки;
        
    КонецЕсли;
    
    Возврат Истина;
    
КонецФункции

&НаСервере
Функция ТребуетсяВывестиСообщениеОНеобходимостиАвторизации()
	ОбработкаSABY = МодульОбъекта();
	Возврат ОбработкаSABY.ПроверитьНаличиеПараметровПодключения() = Неопределено;
КонецФункции

&НаКлиенте
Процедура ЗаписатьОбщиеПараметры()
	ТекущийТранспортИнтеграции = ПолучитьТекущийТранспорт();
	ЗаписатьПараметрыПользователя();
	ЗаписатьОбщиеПараметрыНаСервере();
	Оповестить("Saby_НастройкиИзменены");
	ОбновитьИнтерфейс(); //Обновление интерфейса после вкл/выкл функциональных опций
	Картинка = КартинкаОшибка();
	Если ТребуетсяВывестиСообщениеОНеобходимостиАвторизации() Тогда
		ПоказатьОповещениеПользователя(
			"Функционал "+ЛокализацияНазваниеПродукта()+" недоступен.",
			Неопределено,
			"Для работы необходимо авторизоваться.",
			Картинка,
			СтатусОповещенияПользователя.Важное);
	КонецЕсли;
	Если ТекущийТранспортИнтеграции <> exchange_method Тогда
		ВыйтиНаСервере();
		ПолучитьАктуальностьВерсии();
		УстановитьЗаголовокПодсказкуКнопкиВыйти();
	КонецЕсли;
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда) 
	ЗаписатьОбщиеПараметры();
	Закрыть(Истина);
КонецПроцедуры 

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьОбщиеПараметры();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗадачиНативныеНажатие(Элемент)
	ОткрытьФормуОбработки("Задачи",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РоботОперацииНажатие(Элемент)
	ОткрытьФормуОбработки("РоботСписок",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СпособОбменаПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметры, Источник)
	Если (ИмяСобытия = "Saby_ЗакрытиеФормыАвторизации" Или ИмяСобытия = ЛокализацияНазваниеПродукта() + "_ЗакрытиеФормыАвторизации") 
			И ФормаОткрыта Тогда
		Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("ФормаНастроек") Тогда
			// Процесс закрытия формы, ни чего не нужно выполнять
			Возврат;
		КонецЕсли;
		//Параметры не важны
		//АвторизацияУспешна = get_prop(Параметры, "АвторизацияУспешна", Ложь);
		//ДальнейшееДействие = get_prop(Параметры, "ДальнейшееДействие", "");
		//Важно перерисовать форму
		ПолучитьАктуальностьВерсии(ФормаОткрыта);
		УстановитьЗаголовокПодсказкуКнопкиВыйти();
		ЭтаФорма.context_params = СБИСПараметры();
	КонецЕсли;
	Если ИмяСобытия = "ПереносСтатусовSABY" Тогда
		ПоказатьТекстСообщения();
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область include_core_base_Авторизация_СменаАккаунта
#КонецОбласти

#Область include_core_base_Авторизация_Выход
#КонецОбласти

#Область include_base_ОткрытьСтраницуИсторииИзменения
#КонецОбласти

#Область include_core_base_ПроверкаВерсии_НаФорме
#КонецОбласти

#Область include_core_base_Авторизация_Form_Вход_НеобходимоВвестиКодПодтверждения
#КонецОбласти

#Область include_core_base_Транспорт_МодульФормы 
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСЭлементамиФормы
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОсобенностиПродукта
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

#Область include_core_base_СтатусыДокументов_ПоказатьТекстСообщения
#КонецОбласти

&НаКлиенте
Процедура СохранитьБесшовныйВход(Команда) 
	СохранитьДанныеАвторизацииНаСервере();
	ПереключитьПанель("Основная"); 
	ЭтаФорма.Заголовок =  "Настройки "+ ЛокализацияНазваниеПродукта();

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБесшовныйВходНажатие(Элемент)
	ПереключитьПанель("БесшовныйВход");	
	ЭтаФорма.Заголовок =  "Настройки бесшовной авторизации";
	Показать();
КонецПроцедуры

&НаКлиенте
Процедура КакНастроитьНажатие(Элемент)
	// BSLLS:UsingSynchronousCalls-off для вовместимости с 8.2
	ЗапуститьПриложение("https://sbis.ru/help/integration/app/add_app");
	// BSLLS:UsingSynchronousCalls-on
КонецПроцедуры

#Область include_core_base_Настройки_ЗапросПрофилейПользователей
#КонецОбласти


&НаКлиенте
Процедура Показать() Экспорт
	ТекстЗапроса = ТекстЗапросаПрофилейПользователей();
	ЗаполнитьДанныеФормы(ТекстЗапроса);
	ВидБесшовнойАвторизацииПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеАвторизацииНаСервере()
	// Вставить содержимое обработчика.
	Попытка
		Если ТипЗнч(ПрофилиПользователей) = Тип("ТаблицаЗначений") Тогда
			Профили = ПрофилиПользователей.Скопировать(Новый Структура("Отмечен", Истина), "Наименование");
		Иначе	
			Профили = ПрофилиПользователей.Выгрузить(Новый Структура("Отмечен", Истина), "Наименование");
		КонецЕсли;
		МодульОбъекта = МодульОбъекта();
		Профили = МодульОбъекта.ТаблицаЗначенийВМассив(Профили);
		ХранилищеОбщихНастроек.Сохранить("СБИС", "Авторизация", Новый Структура("Логин,Пароль,ИДПриложения,КлючПриложения,КлючАутентификации,Профили,ВидБесшовнойАвторизации",Логин, Пароль, ИДПриложения,КлючПриложения, КлючАутентификации, Профили, ВидБесшовнойАвторизации),,"ПользовательСБИС");
	Исключение
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеАвторизации(Команда)
	СохранитьДанныеАвторизацииНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеФормы(Знач ТекстЗапроса) 
	МодульОбъекта = МодульОбъекта();
	Попытка  
		ЭтаФорма.ВидБесшовнойАвторизации = 1;
		Настройки = ХранилищеОбщихНастроек.Загрузить("СБИС", "Авторизация",,"ПользовательСБИС");
		Если Настройки <> Неопределено Тогда  
			ЭтаФорма.ВидБесшовнойАвторизации = get_prop(Настройки, "ВидБесшовнойАвторизации", 1);
			ЭтаФорма.Логин = Настройки.Логин;
			ЭтаФорма.Пароль = Настройки.Пароль;
			Если Настройки.Свойство("Профили") И Настройки.Профили.Количество() > 0 Тогда
				ОтмеченныеПрофили = МодульОбъекта.МассивВТаблицуЗначений(Настройки.Профили);
				ОтмеченныеПрофили = ОтмеченныеПрофили.ВыгрузитьКолонку("Наименование");
			КонецЕсли;
			Если Настройки.Свойство("ИДПриложения") Тогда
				ЭтаФорма.ИДПриложения = Настройки.ИДПриложения;
				ЭтаФорма.КлючПриложения = Настройки.КлючПриложения;
				ЭтаФорма.КлючАутентификации = Настройки.КлючАутентификации;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			ТекстЗапросаПереопределяемый = СтрЗаменить(ТекстЗапроса, "ЛОЖЬ КАК Отмечен", 
											"ВЫБОР КОГДА Профили.Наименование В (&ОтмеченныеПрофили) Тогда Истина ИНАЧЕ Ложь КОНЕЦ КАК Отмечен");
			Профили = ПрофилиПользователей(ТекстЗапросаПереопределяемый, ОтмеченныеПрофили);
		КонецЕсли;
		Если Профили.Найти( Ложь, "Отмечен") = Неопределено Тогда
			ЭтаФорма.ОтметитьВсе = Истина;
		Иначе
			ЭтаФорма.ОтметитьВсе = Ложь;
		КонецЕсли;
	Исключение
		Ошибка = ОписаниеОшибки();
		Если Найти(Ошибка, "Нарушение прав доступа") Тогда
			Сообщить("Функционал доступен только администратору системы!");
			ПереключитьПанель("Основная");	
			Возврат Ложь;
		КонецЕсли;
		Сообщить(Ошибка);
	КонецПопытки;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	// отмечает все записи в таблице	
	ОтметитьВсе = Не ОтметитьВсе;
	Для Каждого Строка Из ПрофилиПользователей Цикл
		Строка.Отмечен = ОтметитьВсе;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВидБесшовнойАвторизацииПриИзменении(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ВидБесшовнойАвторизации = 2 Тогда
		ЭлементыФормочки.ГруппаБесшовнаяАвторизация.ТекущаяСтраница =  ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ГруппаБесшовнаяАвторизация, "ЛогинПароль");;
	Иначе
		ЭлементыФормочки.ГруппаБесшовнаяАвторизация.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ГруппаБесшовнаяАвторизация, "СервиснаяАвторизация");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ЭтотОбъектНаКлиенте() 
	Возврат ЭтаФорма;
КонецФункции

#Область include_core_base_Транспорт_ИмяСвойстваТранспорта 
#КонецОбласти

#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти
