 
// BSLLS:UnusedLocalVariable-off Переменные используются в склеиваемых областях
&НаКлиенте
Перем ФормаОткрыта, ТранспортИнтеграции, BlocklyExecutor;
// BSLLS:UnusedLocalVariable-on

#Область include_core_base_Настройки_Form_Настройки_ЛокализацияДействиеПриОткрытии
#КонецОбласти

#Область include_core_base_Helpers_ПоказатьОповещениеПользователя
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_ОсобенностиПродукта
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПередОткрытием();
	ЭтаФорма.ИзмененаДатаОбновленияСтатусов = Ложь;
	ЭтаФорма.ЭтоСинхронизация = Истина;
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ДобавитьИнформациюОВерсии(ЭлементыФормочки.ВерсияПродукта);
	
	ЭтаФорма.ИзмененыНастройкиПодключения = Ложь;
	
	ЗаполнитьСпискиВыбораРеквизитов();
	ЗаполнитьРеквизитыИзПубличныхНастроек();
	ЗаполнитьРеквизитыИзНастроекПодключения();
	
	ВидимостьЭлементовКЭДО = ЗначениеКонстанты("ИспользоватьКЭДО", Ложь);
	ЭлементыФормочки.грПриглашение.Видимость			  = ВидимостьЭлементовКЭДО; 
	ЭлементыФормочки.kedo_mark.Видимость				  = ВидимостьЭлементовКЭДО;
	ЭлементыФормочки.Вложения.Видимость					  = ВидимостьЭлементовКЭДО; 
	
#Область include_core_base_Настройки_Form_Настройки_ПодборПерсоналаВидимость
#КонецОбласти

	ПоказатьТекстСообщения();
	ОформлениеСтрокОбъектовСинхронизации();
КонецПроцедуры

#Область include_core_base_Настройки_Form_Настройки_ЗаполнитьРеквизитыПриОткрытии
#КонецОбласти

#Область include_core_base_Авторизация_ОткрытьФормуАвторизацииПриОтсутствииСессии
#КонецОбласти

&НаСервере
Функция ПолучитьКоличествоФункциональныхОпций()
	МодульОбъекта = МодульОбъекта();
	МетаданныеРасширения = МодульОбъекта.ПолучитьМетаданныеРасширения();
	КоличествоФО = 0;
	Если МетаданныеРасширения <> Неопределено Тогда 
		КоличествоФО = МетаданныеРасширения.ФункциональныеОпции.Количество();
	КонецЕсли;
	Возврат КоличествоФО;
КонецФункции

&НаКлиенте

Процедура ОбновитьПредставлениеПарметраРасширенногоЛогирования()
	СостояниеЛогирования = "Включить ";
	Если ЭтаФорма.advanced_log Тогда
		СостояниеЛогирования = "Выключить ";
	КонецЕсли;
	
	ККП = ПолучитьКнопкуКоманднойПанели("ГруппаКомандСИ", "ГруппаКомандыСИ");
	КомандаКП = ПолучитьКомандуПодменю(ККП, "ИзменитьРеквизитРасширенноеЛогирование");
	УстановитьЗаголовок(КомандаКП, СостояниеЛогирования + "расширенное логирование");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеОтключенияПользовательскихНастроек()
	//TODO проверить, что пользвательские настройки есть
	ОтключениеПользовательскихНастроек = "Отключить ";
	Если ЭтаФорма.DisableCustomAlgorithms Тогда
		ОтключениеПользовательскихНастроек = "Включить ";
	КонецЕсли;
	
	ККП = ПолучитьКнопкуКоманднойПанели("ГруппаКомандСИ", "ГруппаКомандыСИ");
	КомандаКП = ПолучитьКомандуПодменю(ККП, "ОтключитьПользовательскиеНастройки");
	УстановитьЗаголовок(КомандаКП, ОтключениеПользовательскихНастроек + "пользовательские настройки");
	
	ВывестиИнформациюОПользовательскихНастройках();
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Заголовок  = "Настройки " + ЛокализацияНазваниеПродукта();
    УстановитьЗаголовокСпособаОтправкиПриглашения("Как приглашать новых пользователей в " + ЛокализацияНазваниеПродукта());

	ЭлементыФормочки = ПолучитьЭлементыФормы();
	СтраницаПрограммыИнтеграционногоМодуля = ЭлементыФормочки.Найти(ПИМИмяОбластиЭлементов());  
	Если СтраницаПрограммыИнтеграционногоМодуля <> Неопределено Тогда 
		СтраницаПрограммыИнтеграционногоМодуля.Видимость = Ложь;
	КонецЕсли;
	ЭлементыФормочки.download_attachments_on_update.Заголовок = "При загрузке документа из " + ЛокализацияНазваниеПродукта();
	ЭлементыФормочки.РеквизитВыгружатьВложения.Заголовок = "Выгружать вложения " + ЛокализацияНазваниеПродукта()
		+" в присоединенные файлы документов 1С в фоновом режиме";
	
	ЭлементыФормочки.kedo_mark.Заголовок = "Загружать в " + ЛокализацияНазваниеПродукта() 
		+ " кадровые документы только по сотрудникам, подписавшим соглашение о КЭДО";
	
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();
	ФормаОткрыта = Истина;
	
	УстановитьДоступностьПоляТипОтправкиПриглашения();
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ДействиеСРегламентнымЗаданием.Заголовок = "Поиск регламентного задания...";
	ПослеОткрытия();
	ОбновитьПредставлениеПарметраРасширенногоЛогирования();
	ОбновитьПредставлениеОтключенияПользовательскихНастроек();
	ОбновитьСтраницуБесшовногоВхода();
	ВидБесшовнойАвторизацииПриИзменении(Неопределено);
	
	ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ПриОткрытииПослеАвторизации", ЭтаФорма);
	ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции, ОбработчикПослеАвторизации);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПослеАвторизации(Результат, ДопПараметры = Неопределено) Экспорт
	ПереключитьПанельАвторизации();
	
	Если Результат <> Неопределено Тогда
		context_params = Результат;
		Попытка
			ЗаполнитьДатуСобытияОбновленияСтатусов(context_params);
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
			Сообщение = Новый СообщениеПользователю;
			ТекстОшибки = "Ошибка: " + ОшибкаСтруктура.action + " " + ОшибкаСтруктура.message + " " + ОшибкаСтруктура.detail;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
    
	ПолучитьАктуальностьВерсии();
	СтатусВерсии = ПолучитьСтатусВерсииНаФорме(Истина);
	ДанныеОшибки = get_prop(СтатусВерсии, "ДанныеОшибки");
	ОписаниеОшибки = get_prop(ДанныеОшибки, "detail");
	ТребуетсяОткрытьФормуАвторизации = НеобходимоВвестиКодПодтверждения(ОписаниеОшибки);
	Если ТребуетсяОткрытьФормуАвторизации Тогда
		//В форме настроек мы просто разлогинимся
		ВыйтиНаСервере();
	КонецЕсли;

	ИзменениеИнтерфейсаФормыПриИзменениеПараметровАвторизации();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыПодключения()
	ЭтаФорма.НаименованиеПодключения = "";
	Если Не ЗначениеЗаполнено(РеквизитИдентификаторПодключения()) Тогда
		Возврат;
	КонецЕсли;
	
	МассивИНИ = Неопределено;
	ПараметрыОперации = Новый Структура("id, Версия, INI", РеквизитИдентификаторПодключения(), ЭтаФорма.Версия, МассивИНИ); 
	Попытка
		ИнформацияПодключения = ТранспортИнтеграции.local_helper_read_connection(ЭтаФорма.context_params, ПараметрыОперации);
	Исключение
		Картинка = КартинкаОшибка();
		ПоказатьОповещениеПользователя(
			"Функционал " + ЛокализацияНазваниеПродукта() + " недоступен.",
			Неопределено,
			"Для работы необходимо авторизоваться.",
			Картинка,
			СтатусОповещенияПользователя.Важное);
	КонецПопытки;
	ЭтаФорма.НаименованиеПодключения = get_prop(ИнформацияПодключения, "name_connection", "");                                         
	Data = get_prop(ИнформацияПодключения, "Data", Новый Соответствие);
	ЭтаФорма.DisableCustomAlgorithms = get_prop(Data, "DisableCustomAlgorithms", Ложь);
	ОбновитьПредставлениеОтключенияПользовательскихНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ФормаОткрыта = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	АвторизацияВыполнена = Неопределено;
	Если ТипЗнч(context_params) = Тип("Структура") Тогда
		АвторизацияВыполнена = ТранспортИнтеграции.СвойствоСессии(context_params, "session");
	КонецЕсли;
	АвторизацияВыполнена =	АвторизацияВыполнена <> Неопределено;
	Если НЕ АвторизацияВыполнена Тогда
		Оповестить(ЛокализацияНазваниеПродукта() + "_ЗакрытиеФормыАвторизации",
			Новый Структура("АвторизацияУспешна, ДальнейшееДействие, ФормаНастроек", Ложь, ""));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Выйти(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ВыйтиНаСервере();
	ПолучитьАктуальностьВерсии();
	Сообщить("Сессия и пароль сброшены");
	Оповестить("SabySignOut");
	ЭтаФорма.context_params = СБИСПараметры();

	ИзменениеИнтерфейсаФормыПриИзменениеПараметровАвторизации();
КонецПроцедуры

&НаКлиенте
Процедура Войти(Элемент)
	ПроверкаВведенныхДанныхАутентификации = 
		Новый ОписаниеОповещения("ОбработкаРезультатаЗакрытияФормыАвторизации", ЭтаФорма);
	ОткрытьФормуОбработки("Вход",, ЭтаФорма,, ПроверкаВведенныхДанныхАутентификации);
КонецПроцедуры

#Область include_core_base_Настройки_Form_Настройки_СкопироватьИдентификатори
#КонецОбласти

&НаКлиенте
Процедура ПереключитьАккаунтНастройки(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	ИзменениеИнтерфейсаФормыПриИзменениеПараметровАвторизации();
КонецПроцедуры

#Область include_core_base_Настройки_Form_Настройки_ПриИзменении
#КонецОбласти

&НаКлиенте
Процедура ОбработкаРезультатаЗакрытияФормыАвторизации(Результат, Параметры) Экспорт
	ПереключитьПанельАвторизации();
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	ЗаполнитьДатуСобытияОбновленияСтатусов(context_params);
	ПолучитьАктуальностьВерсии();
	//А вот тут бы проверить куда мы дальше хотим идти, если есть такие указания в - Параметры
	//Это для команд открытия формы браузера.
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		ОповещениеМодуль = get_prop(Параметры,"Модуль");
		ОповещениеМетод = get_prop(Параметры,"Метод");
		Если ОповещениеМодуль = Неопределено ИЛИ ОповещениеМетод = Неопределено Тогда
			Возврат;
		КонецЕсли;
		МетодЗавершенияАвторизации = Новый ОписаниеОповещения(ОповещениеМетод, ОповещениеМодуль);
		ВыполнитьОбработкуОповещения(МетодЗавершенияАвторизации);
	КонецЕсли;
	ИзменениеИнтерфейсаФормыПриИзменениеПараметровАвторизации();
КонецПроцедуры


&НаКлиенте

Процедура ПереключитьПанельАвторизацииСменаЗаголовка(ЭлементыФормочки, СтруктураСессии, АвторизацияВыполнена)
	ККП = ПолучитьКнопкуКоманднойПанели("ГруппаКомандРодитель", "ГруппаКомандВход");
	КомандаКП = ПолучитьКомандуПодменю(ККП, "КомандаПереключитьАккаунт");
	УстановитьЗаголовок(ККП, get_prop(СтруктураСессии, "UserFio", "Пользователь системы"));
	КомандаКП.Доступность = АвторизацияВыполнена;
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСостояниеПодключения(saby_param, СтруктураСессии, АвторизацияВыполнена)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	
	ЭлементыФормочки.СостояниеПодключения.ТекущаяСтраница = 
		ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СостояниеПодключения, "НетПодключения");
	ЭлементыФормочки.СтраницыКомандАвторизации.ТекущаяСтраница = 
	    	ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницыКомандАвторизации, "СтраницаВыход");
	Константа9 = 9;
	Если АвторизацияВыполнена Тогда
		ЭлементыФормочки.СтраницыКомандАвторизации.ТекущаяСтраница = 
	    	ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницыКомандАвторизации, "СтраницаВход");
		ЭлементыФормочки.СпособОбмена.Заголовок = get_prop(saby_param, "ExchangeMethod");
		ЭлементыФормочки.Сервис.Заголовок = Сред(get_prop(saby_param, "ApiUrl", ""), Константа9); 	
		ЭлементыФормочки.Аккаунт.Заголовок = get_prop(СтруктураСессии, "AccountTitle", "");
		ЭлементыФормочки.СостояниеПодключения.ТекущаяСтраница = 
			ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СостояниеПодключения, "ЕстьПодключение");
	КонецЕсли;
	
	ПереключитьПанельАвторизацииСменаЗаголовка(ЭлементыФормочки, СтруктураСессии, АвторизацияВыполнена);
КонецПроцедуры

&НаКлиенте

Процедура СменаСтраницыКомандАвторизации(Знач АвторизацияВыполнена)
	ПодсказкаТекст =	"Открыть сессию в " + ЛокализацияНазваниеПродукта();
	Если АвторизацияВыполнена Тогда
		ПодсказкаТекст =	"Закрыть сессию в " + ЛокализацияНазваниеПродукта();
	КонецЕсли;
	
	ККП = ПолучитьКнопкуКоманднойПанели("ГруппаКомандРодитель", "ГруппаКомандВход");
	КомандаКП = ПолучитьКомандуПодменю(ККП, "КомандаВыход");
	УстановитьЗаголовок(КомандаКП, ПодсказкаТекст);
КонецПроцедуры

&НаКлиенте

Процедура ПереключитьАккаунтНажатие(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ОповещениеПослеСменыАккаунта = Новый ОписаниеОповещения("ПереключитьАккаунтНастройки", ЭтаФорма);
	СменитьАккаунтВВыпадающемСписке(ЭлементыФормочки.ГруппаКомандРодитель, , ОповещениеПослеСменыАккаунта);
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеИнтерфейсаФормыПриИзменениеПараметровАвторизации()
	ЭтаФорма.context_params				= СБИСПараметры();
	ЭтаФорма.ИдентификаторПодключения = get_prop(context_params, "ConnectionUuid", Неопределено);
	
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ИдентификаторПодключения.Доступность = ЗначениеЗаполнено(ЭтаФорма.ИдентификаторПодключения);
	
	СтруктураСессии			= ТранспортИнтеграции.СтруктураСессии(ЭтаФорма.context_params);
	АвторизацияВыполнена	= ТранспортИнтеграции.УИДСессии(ЭтаФорма.context_params) <> Неопределено;
	
	СтруктураСессии = ТранспортИнтеграции.СтруктураСессии(ЭтаФорма.context_params);
	ОтобразитьСостояниеПодключения(ЭтаФорма.context_params, СтруктураСессии, АвторизацияВыполнена);
	СменаСтраницыКомандАвторизации(АвторизацияВыполнена);
	ОбновитьДанныеНаФорме(ЭтаФорма);
	
	ЗаполнитьПараметрыПодключения();
	ОбновитьАвтоматическиеОперации(Неопределено);
	ЗаполнитьИсториюОбмена();
	ЗаполнитьДеревоНастроек();
	СтраницаПрограммыИнтеграционногоМодуля = ЭлементыФормочки.Найти(ПИМИмяОбластиЭлементов());  
	Если СтраницаПрограммыИнтеграционногоМодуля <> Неопределено 
		И СтраницаПрограммыИнтеграционногоМодуля.Видимость = Истина Тогда
		СкрытьОтобразитьГруппуКопиюИзКаталогаНастройки();
		ЗаполнитьСписокПимФайлов();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция УПользователяПолныеПрава()
	Возврат РольДоступна("ПолныеПрава");
КонецФункции

&НаКлиенте
Процедура ПереключитьПанельАвторизации()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	saby_param = СБИСПараметры();
	СтруктураСессии = ТранспортИнтеграции.СтруктураСессии(saby_param);
	АвторизацияВыполнена = ТранспортИнтеграции.УИДСессии(saby_param) <> Неопределено;
	                                                             
	ЭлементыФормочки.СтраницыКомандАвторизации.ТекущаяСтраница = 
		ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницыКомандАвторизации, "СтраницаВыход");
	ЭлементыФормочки.СпособОбмена.Заголовок = "";
	ЭлементыФормочки.НетПодключенияНадпись.Заголовок = "Подключение к " + ЛокализацияНазваниеПродукта() + " отсутствует";
	ЭлементыФормочки.СостояниеПодключения.ТекущаяСтраница = 
		ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СостояниеПодключения, "НетПодключения");
	Если АвторизацияВыполнена Тогда
		ЭлементыФормочки.СтраницыКомандАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницыКомандАвторизации, "СтраницаВыход");
		ЭлементыФормочки.СпособОбмена.Заголовок = get_prop(saby_param, "ExchangeMethod");
		ЭлементыФормочки.Сервис.Заголовок = Сред(get_prop(saby_param, "ApiUrl", ""), 9); 	
		ЭлементыФормочки.СостояниеПодключения.ТекущаяСтраница = 
			ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СостояниеПодключения, "ЕстьПодключение");
		КонецЕсли;
	ПереключитьПанельАвторизацииСменаЗаголовка(ЭлементыФормочки, СтруктураСессии, АвторизацияВыполнена);
	ОбновитьДанныеНаФорме(ЭтаФорма);
КонецПроцедуры

#Область include_core_base_Настройки_ПрочитатьНастройки
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_ОткрытьВебСтраницы
#КонецОбласти

#Область include_core_base_НалоговыйМониторинг
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_СброситьКэш
#КонецОбласти

&НаСервере
Функция ПолучитьТекущийТранспорт()
	МодульОбъекта = МодульОбъекта();
	ЭтаФорма.context_params = МодульОбъекта.НастройкиПодключенияПрочитать();
	Возврат ВидТранспорта(context_params);	
КонецФункции

&НаСервере
Процедура ЗаписатьОбщиеПараметрыНаСервере()
	МодульОбъекта = МодульОбъекта();
	ОбщиеНастройки	= МодульОбъекта.ОбщиеНастройкиПрочитать();
	ПубличныеОбщиеНастройки	= get_prop(ОбщиеНастройки, "public", Новый Структура);
	
	ПубличныеОбщиеНастройки.Вставить("download_attachments_on_complete",	download_attachments_on_complete);
	ПубличныеОбщиеНастройки.Вставить("download_attachments_on_update",		download_attachments_on_update);
	ПубличныеОбщиеНастройки.Вставить("refresh_statuses",					refresh_statuses);
	ПубличныеОбщиеНастройки.Вставить("run_docflow",							run_docflow);
	ПубличныеОбщиеНастройки.Вставить("kedo_mark",							kedo_mark);
	ПубличныеОбщиеНастройки.Вставить("send_invitations",					send_invitations);
	ПубличныеОбщиеНастройки.Вставить("send_type",							send_type);
	ПубличныеОбщиеНастройки.Вставить("send_completed_documents",			send_completed_documents);
	ПубличныеОбщиеНастройки.Вставить("pdf_attachments",						pdf_attachments);
	ПубличныеОбщиеНастройки.Вставить("auto_update",							auto_update);
	
	AlgorithmsStorage = Неопределено;
	Если ЭтаФорма.ПИМИспользоватьКопиюИзКаталога = Истина 
		И ЗначениеЗаполнено(ЭтаФорма.ПИМПутьККаталогу) Тогда 
		AlgorithmsStorage = ЭтаФорма.ПИМПутьККаталогу;
	КонецЕсли;
	ПубличныеОбщиеНастройки.Вставить("UseLocalAlgorithmStorage", AlgorithmsStorage);
	
	ОбщиеНастройки.Вставить("public", ПубличныеОбщиеНастройки);
	МодульОбъекта.ОбщиеНастройкиЗаписать(ОбщиеНастройки);  
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыПользователя(Знач context_params_Записать);
	МодульОбъекта = МодульОбъекта();
	Если context_params = Неопределено Тогда 
		context_params = Новый Структура;
	КонецЕсли;
	Если context_params_Записать.Свойство("advanced_log") Тогда
		Если advanced_log Тогда
			context_params_Записать.Вставить("advanced_log", ТекущаяДатаСеанса());
		Иначе
			context_params_Записать.Вставить("advanced_log", Дата(1, 1, 1));
		КонецЕсли;
	КонецЕсли;
	Для каждого context_param_Записать Из context_params_Записать Цикл
		context_params.Вставить(context_param_Записать.Ключ, context_param_Записать.Значение);
	КонецЦикла;		
	МодульОбъекта.НастройкиПодключенияЗаписать(context_params);
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяУказателяСтатусаПриИзменении(Элемент)
	ЭтаФорма.ИзмененаДатаОбновленияСтатусов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуСобытияОбновленияСтатусов(context_param)
	УказателиНаСобытие = Новый Структура();
	ДатаВр = Формат(ДатаВремяУказателяСтатуса, "ДФ='dd.MM.yyyy HH.mm.ss'");
	Если ДатаВремяУказателяСтатуса <> Дата(1,1,1) Тогда
		УказателиНаСобытие = Новый Структура("date", ДатаВр);
	КонецЕсли;
	context_param.Вставить("last_event", УказателиНаСобытие);
	
	LastEventEdo = Новый Структура("id, datetime, doc_id", "", ДатаВр, "");
	last_event = Новый Структура("LastEventEdo", LastEventEdo); 
	last_event.Вставить("BrokerMarkEdo", Неопределено);
	update_public_params = Новый Структура("last_event", last_event);
	connection_uuid = get_prop(context_param, "ConnectionUuid", "");
	BlocklyExecutor.ЗаписатьПубличныеПараметрыПодключения(context_param, update_public_params, connection_uuid)
КонецПроцедуры

&НаСервере
Функция ПриВключенииСЭДО()
    
    // Загружаем действующие МЧД по организациям у которых настроен обмен с СФР
    ИмяМодуля = ПрефиксПродукта() + "ЭДОСФСС";
    Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) <> Неопределено Тогда
		МодульКонфигурации = ОбщийМодульЗначение(ИмяМодуля);
		МодульКонфигурации.ЗагрузитьМЧДСФР();
    КонецЕсли;
    
    Возврат Истина;
    
КонецФункции

&НаСервере
Функция ТребуетсяВывестиСообщениеОНеобходимостиАвторизации()
	ОбработкаSABY = МодульОбъекта();
	Возврат ОбработкаSABY.ПроверитьНаличиеПараметровПодключения() = Неопределено;
КонецФункции

&НаКлиенте
Процедура ЗаписатьОбщиеПараметры()
	ТекущийТранспортИнтеграции = ПолучитьТекущийТранспорт();
	Если ИзмененаДатаОбновленияСтатусов Тогда 
		УстановитьДатуСобытияОбновленияСтатусов(context_params);
	КонецЕсли;
	
	context_params_Записать = Новый Структура;
	context_params_Записать.Вставить("advanced_log", Неопределено);
	context_params_Записать.Вставить("DisableCustomAlgorithms", DisableCustomAlgorithms);
	context_params_Записать.Вставить("Тема", Тема);
	context_params_Записать.Вставить("SendDocNumberDeleteBasePrefix", SendDocNumberDeleteBasePrefix);
	context_params_Записать.Вставить("SendDocNumberDeleteUserPrefix", SendDocNumberDeleteUserPrefix);
	
	ЗаписатьПараметрыПользователя(context_params_Записать);
	ЗаписатьОбщиеПараметрыНаСервере();
	Оповестить("Saby_НастройкиИзменены");
	ОбновитьИнтерфейс(); //Обновление интерфейса после вкл/выкл функциональных опций
	Картинка = КартинкаОшибка();
	Если ТребуетсяВывестиСообщениеОНеобходимостиАвторизации() Тогда
		ПоказатьОповещениеПользователя(
			"Функционал " + ЛокализацияНазваниеПродукта() + " недоступен.",
			Неопределено,
			"Для работы необходимо авторизоваться.",
			Картинка,
			СтатусОповещенияПользователя.Важное);
	КонецЕсли;
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда) 
	Если ИзмененыНастройкиПодключения Тогда
		ЗаписатьПодключение();
		СброситьКэшНаСервере();
	КонецЕсли;
	ЗаписатьОбщиеПараметры();
	Закрыть(Истина);
	Если УПользователяПолныеПрава() Тогда
		СохранитьБесшовныйВход();
		ИзменитьНаправленияСинхронизации();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьОбщиеПараметры();
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьПодключение() 
	МассивINI = Новый Массив;
	props = Новый Структура;
	props.Вставить("id",	ЭтаФорма.ИдентификаторПодключения);
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("DisableCustomAlgorithms", ЭтаФорма.DisableCustomAlgorithms);
	props.Вставить("Data", ПараметрыПодключения);
	params = Новый Структура("props,ini", Props, МассивINI);
	Попытка
		res = ТранспортИнтеграции.local_helper_write_connection(context_params, params);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке));
	КонецПопытки;	
	Возврат res;
КонецФункции

&НаКлиенте
Процедура ДекорацияЗадачиНативныеНажатие(Элемент)
	ОткрытьФормуОбработки("Задачи",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПерсоналаНажатие(Элемент)
	ОткрытьФормуОбработки("ПодборПерсонала",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РоботОперацииНажатие(Элемент)
	ОткрытьФормуОбработки("РоботСписок",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметры, Источник)
	Если (ИмяСобытия = "Saby_ЗакрытиеФормыАвторизации" Или ИмяСобытия = ЛокализацияНазваниеПродукта() + "_ЗакрытиеФормыАвторизации") 
			И ФормаОткрыта Тогда
		Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("ФормаНастроек") Тогда
			// Процесс закрытия формы, ни чего не нужно выполнять
			Возврат;
		КонецЕсли;
		//Параметры не важны
		//АвторизацияУспешна = get_prop(Параметры, "АвторизацияУспешна", Ложь);
		//ДальнейшееДействие = get_prop(Параметры, "ДальнейшееДействие", "");
		//Важно перерисовать форму
		ПолучитьАктуальностьВерсии(ФормаОткрыта);
		ПриОткрытииПослеАвторизации(Неопределено);
		ЭтаФорма.context_params = СБИСПараметры();
	КонецЕсли;
	Если ИмяСобытия = "ОбновитьАвтоматическиеОперации" Тогда
		ОбновитьТаблицуАвтоматическиеОперации();
	КонецЕсли;
	Если ИмяСобытия = "ПИМОбновитьСписок" Тогда
		ПИМОбновить(Неопределено);
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область include_core_base_Авторизация_СменаАккаунта
#КонецОбласти

#Область include_core_base_Авторизация_Выход
#КонецОбласти

#Область include_base_ОткрытьСтраницуИсторииИзменения
#КонецОбласти

#Область include_core_base_ЗапускМодуля_ПроверкаВерсии_НаФорме
#КонецОбласти

#Область include_core_base_Авторизация_Form_Вход_НеобходимоВвестиКодПодтверждения
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСЭлементамиФормы
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОсобенностиПродукта
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

#Область include_core_base_СтатусыДокументов_ПоказатьТекстСообщения
#КонецОбласти

&НаСервере
Процедура СохранитьДанныеАвторизацииНаСервере()
	// Вставить содержимое обработчика.
	Попытка
		Если ТипЗнч(ПрофилиПользователей) = Тип("ТаблицаЗначений") Тогда
			Профили = ПрофилиПользователей.Скопировать(Новый Структура("Отмечен", Истина), "Наименование");
		Иначе	
			Профили = ПрофилиПользователей.Выгрузить(Новый Структура("Отмечен", Истина), "Наименование");
		КонецЕсли;
		МодульОбъекта = МодульОбъекта();
		Профили = МодульОбъекта.ТаблицаЗначенийВМассив(Профили);
		
		ПараметрыВрем = Новый Структура();
		ПараметрыВрем.Вставить("Логин", Логин);
		ПараметрыВрем.Вставить("Пароль", Пароль);
		ПараметрыВрем.Вставить("ИДПриложения", ИДПриложения);
		ПараметрыВрем.Вставить("КлючПриложения", КлючПриложения);
		ПараметрыВрем.Вставить("КлючАутентификации", КлючАутентификации);
		ПараметрыВрем.Вставить("Профили", Профили);
		ПараметрыВрем.Вставить("ВидБесшовнойАвторизации", ВидБесшовнойАвторизации);
		ЗаписатьВХранилище("СБИС", "Авторизация", ПараметрыВрем, , "ПользовательСБИС");
	Исключение
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеАвторизации(Команда)
	СохранитьДанныеАвторизацииНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеФормы(Знач ТекстЗапроса) 
	МодульОбъекта = МодульОбъекта();
	Попытка  
		ЭтаФорма.ВидБесшовнойАвторизации = 1;
		Настройки = ПрочитатьИзХранилища("СБИС", "Авторизация", , "ПользовательСБИС");
		Если Настройки <> Неопределено Тогда  
			ЭтаФорма.ВидБесшовнойАвторизации = get_prop(Настройки, "ВидБесшовнойАвторизации", 1);
			ЭтаФорма.Логин = Настройки.Логин;
			ЭтаФорма.Пароль = Настройки.Пароль;
			Если Настройки.Свойство("Профили") И Настройки.Профили.Количество() > 0 Тогда
				ОтмеченныеПрофили = МодульОбъекта.МассивВТаблицуЗначений(Настройки.Профили);
				ОтмеченныеПрофили = ОтмеченныеПрофили.ВыгрузитьКолонку("Наименование");
			КонецЕсли;
			Если Настройки.Свойство("ИДПриложения") Тогда
				ЭтаФорма.ИДПриложения = Настройки.ИДПриложения;
				ЭтаФорма.КлючПриложения = Настройки.КлючПриложения;
				ЭтаФорма.КлючАутентификации = Настройки.КлючАутентификации;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			ТекстЗапросаПереопределяемый = СтрЗаменить(ТекстЗапроса, "ЛОЖЬ КАК Отмечен", 
											"ВЫБОР КОГДА Профили.Наименование В (&ОтмеченныеПрофили) Тогда Истина ИНАЧЕ Ложь КОНЕЦ КАК Отмечен");
			Профили = ПрофилиПользователей(ТекстЗапросаПереопределяемый, ОтмеченныеПрофили);
		КонецЕсли;
		Если Профили.Найти( Ложь, "Отмечен") = Неопределено Тогда
			ЭтаФорма.ОтметитьВсе = Истина;
		Иначе
			ЭтаФорма.ОтметитьВсе = Ложь;
		КонецЕсли;
	Исключение
		Ошибка = ОписаниеОшибки();
		Если Найти(Ошибка, "Нарушение прав доступа") Тогда
			Сообщить("Функционал доступен только администратору системы!");
			ПереключитьПанель("Основная");	
			Возврат Ложь;
		КонецЕсли;
		Сообщить(Ошибка);
	КонецПопытки;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	// отмечает все записи в таблице	
	ОтметитьВсе = Не ОтметитьВсе;
	Для Каждого Строка Из ПрофилиПользователей Цикл
		Строка.Отмечен = ОтметитьВсе;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВидБесшовнойАвторизацииПриИзменении(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ВидБесшовнойАвторизации = 2 Тогда
		ЭлементыФормочки.ГруппаБесшовнаяАвторизация.ТекущаяСтраница = 
			ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ГруппаБесшовнаяАвторизация, "ЛогинПароль");
	Иначе
		ЭлементыФормочки.ГруппаБесшовнаяАвторизация.ТекущаяСтраница = 
			ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ГруппаБесшовнаяАвторизация, "СервиснаяАвторизация");
	КонецЕсли;	
КонецПроцедуры
	
&НаКлиенте
Функция ЭтотОбъектНаКлиенте() 
	Возврат ЭтаФорма;
КонецФункции

#Область include_core_base_Транспорт_ИмяСвойстваТранспорта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

&НаКлиенте
Процедура send_invitationsОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#Область Общие
#КонецОбласти

#Область АвтоматическиеОперации

#Область include_core_base_АвтоматическиеОперации_ВызовФорм_УдалениеУзлаОбмена
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ОбработчикиСобытийЭлементовТаблицаПодключений
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_СписокАвтоматическихОпераций //&НаКлиенте
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ПроверитьОтправку
#КонецОбласти

#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_РеквизитИдентификаторПодключения
#КонецОбласти

#Область ИсторияОбмена

#Область include_core_base_АвтоматическиеОперации_ИсторияОбмена
#КонецОбласти

#КонецОбласти

#Область ОбъектыСинхронизации

#Область include_core_base_АвтоматическиеОперации_ОбъектыОбмена
#КонецОбласти

#Область include_core_base_Настройки_ЗагрузитьСопоставления
#КонецОбласти

#КонецОбласти

&НаКлиенте
Процедура ИзменитьРеквизитРасширенноеЛогирование(Команда)
	ЭтаФорма.advanced_log = Не ЭтаФорма.advanced_log;
	ОбновитьПредставлениеПарметраРасширенногоЛогирования();
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВыгружатьВложенияПриИзменении(Элемент)
	РеквизитВыгружатьВложенияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РеквизитВыгружатьВложенияПриИзмененииНаСервере()
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ЭлементыФормочки.download_attachments_on_update.Доступность = ЭтаФорма.РеквизитВыгружатьВложения;
	ЭлементыФормочки.download_attachments_on_complete.Доступность = ЭтаФорма.РеквизитВыгружатьВложения;
	Если ЭтаФорма.РеквизитВыгружатьВложения = Ложь Тогда
		ЭтаФорма.download_attachments_on_update		= Ложь;
		ЭтаФорма.download_attachments_on_complete	= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура kedo_markПриИзменении(Элемент)
	kedo_markПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура kedo_markПриИзмененииНаСервере()
	// Метод нужен для совместимости с расширением и оф/уф обработками
	МодульОбъекта().СоздатьДополнительноеСвойствоКЭДО();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьDisableCustomAlgorithms(Команда)  Экспорт
	ЭтаФорма.DisableCustomAlgorithms = Не ЭтаФорма.DisableCustomAlgorithms;
	ЭтаФорма.ИзмененыНастройкиПодключения = Истина;
	ОбновитьПредставлениеОтключенияПользовательскихНастроек();
	ЗаписатьПодключение();
	СброситьКэшНаСервере();
	ЗаписатьПараметрыПользователя(Новый Структура("DisableCustomAlgorithms", DisableCustomAlgorithms));
КонецПроцедуры

&НаКлиенте
Процедура ВывестиИнформациюОПользовательскихНастройках()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ВидимостьСообщения = ЭтаФорма.DisableCustomAlgorithms;
	ЭлементыФормочки.КартинкаПользовательскиеНастройкиОтключены.Видимость = ВидимостьСообщения;
	ЭлементыФормочки.ПользовательскиеНастройкиОтключены.Видимость = ВидимостьСообщения;
	ЭлементыФормочки.ВключитьПользовательскиеНастройки.Видимость = ВидимостьСообщения;
КонецПроцедуры

#Область БесшовныйВход

&НаСервере
Процедура ПереключитьПанель(Название)
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	Если Название = "БесшовныйВход" Тогда   
		ЭлементыФормочки.СтраницыНастроек.ТекущаяСтраница = ПолучитьСтраницу(ЭлементыФормочки.СтраницыНастроек, "БесшовныйВход");	
	Иначе	
		ЭлементыФормочки.СтраницыНастроек.ТекущаяСтраница = ПолучитьСтраницу(ЭлементыФормочки.СтраницыНастроек, "Основная");	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьБесшовныйВход()
	СохранитьДанныеАвторизацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КакНастроитьНажатие(Элемент)
	ИнтернетСсылка = "https://sbis.ru/help/integration/app/add_app";
	#Если ВебКлиент Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Ссылка", ИнтернетСсылка);
		РасширениеРаботыСФайламиПодключить(ДопПараметры);
	#Иначе
		// BSLLS:UsingSynchronousCalls-off для вовместимости с 8.2
		ЗапуститьПриложение(ИнтернетСсылка);
		// BSLLS:UsingSynchronousCalls-on
	#КонецЕсли	
КонецПроцедуры

#Если ВебКлиент Тогда

&НаКлиенте 
Процедура РасширениеРаботыСФайламиПодключить(ДопПараметры) Экспорт
    НачатьПодключениеРасширенияРаботыСФайлами(
        Новый ОписаниеОповещения(
            "РасширениеРаботыСФайламиПослеПодключения",
            ЭтотОбъект,
            ДопПараметры));
КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСФайламиПослеПодключения(Подключено, ДопПараметры) Экспорт
	// Расширение работы с файлами подключено
	Если Подключено Тогда
		ОбработчикКакНастроитьЗавершение = SabyОписаниеОповещения("КакНастроитьЗавершить", ЭтаФорма);
        НачатьЗапускПриложения(ОбработчикКакНастроитьЗавершение, ДопПараметры.Ссылка);
		
	// Нужна установка расширения работы с файлами
	Иначе
		НачатьУстановкуРасширенияРаботыСФайлами(
			SabyОписаниеОповещения(
				"РасширениеРаботыСФайламиПодключить",
				ЭтотОбъект,
				ДопПараметры));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КакНастроитьЗавершить(Результат, ДопПараметры) Экспорт
	Возврат;
КонецПроцедуры

#КонецЕсли

#Область include_core_base_Настройки_ЗапросПрофилейПользователей
#КонецОбласти

&НаКлиенте
Процедура ОбновитьСтраницуБесшовногоВхода() Экспорт
	ЭлемФормы = ПолучитьЭлементыФормы();

	ЭлемФормы.БесшовныйВходКонтент.ТекущаяСтраница = 
		ПолучитьСтраницуНаКлиенте(ЭлемФормы.БесшовныйВходКонтент, "БесшовныйВходОграничения");
	Если УПользователяПолныеПрава() Тогда
		ТекстЗапроса = ТекстЗапросаПрофилейПользователей();
		ЗаполнитьДанныеФормы(ТекстЗапроса);
		ЭлемФормы.БесшовныйВходКонтент.ТекущаяСтраница = 
			ПолучитьСтраницуНаКлиенте(ЭлемФормы.БесшовныйВходКонтент, "БесшовныйВход");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область include_core_base_ПИМ_ДействияФормы
#КонецОбласти

#Область include_core_base_Транспорт_ВидТранспорта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти
