
&НаКлиенте
Процедура ЗагрузитьСопоставленияНажатие(Элемент)
	//Saby_КомандыОбменаДляФормыКлиент.ЗапуститьОповещениеПриНаличииСессии(Saby_КомандыОбменаДляФормыКлиент, "ЗагрузитьСопоставленияНа", Новый Структура());
	ЗапуститьОповещениеПриНаличииСессии("ЗагрузитьСопоставления", ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСопоставления(Результат = Неопределено, ДопПараметры = Неопределено) Экспорт
	connection_info = Неопределено;
	ТекстСообщения = "Загружены сопоставления по умолчанию.";
	Картинка = КартинкаУспешно();
	Попытка
		ЗагрузитьСопоставленияНаСервере(connection_info);
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		Картинка = КартинкаОшибка();
		ТекстСообщения = СтруктураОшибки.message;
	КонецПопытки;
	ПоказатьОповещениеПользователя("Сопоставление завершено",,
		ТекстСообщения,
		Картинка,
		СтатусОповещенияПользователя.Важное,
		Новый УникальныйИдентификатор);
КонецПроцедуры

