
&НаСервере
Функция ПараметрыЗапускаАлгоритма()
	
	dataСтрокой = "";
	ЭтоВнешняяОбработка = ЭтоВнешняяОбработка();
	Если ЭтоВнешняяОбработка Тогда
		ИмяОбработки = ИмяФайлаОбработки();
	Иначе
		ИмяОбработки = ИмяОбработки();
	КонецЕсли;	
	
	Модуль = ПолучитьМодульОбъекта();
	context_param = Модуль.НастройкиПодключенияПрочитать();
	Идентификатор = get_prop(context_param, "ConnectionId", Неопределено);
	
	СтруктураСоединения = Новый Структура;
	СтруктураСоединения.Вставить("connection_uuid", Идентификатор);
 	СтруктураСоединения.Вставить("operation_uuid",  Неопределено);
    context_param.Вставить("operation", СтруктураСоединения);

	
	ПараметрыОперации = Новый Соответствие();
	ПараметрыОперации.Вставить("Uuid", 					Идентификатор);
	ПараметрыОперации.Вставить("dataСтрокой",			dataСтрокой);
	ПараметрыОперации.Вставить("ИмяОбработки", 			ИмяОбработки);
	ПараметрыОперации.Вставить("ЭтоВнешняяОбработка", 	ЭтоВнешняяОбработка);
	ПараметрыОперации.Вставить("Uuid", 					Идентификатор);
	ПараметрыОперации.Вставить("Title", 				"");
	
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(ПараметрыОперации);
	ПараметрыВызова.Добавить(context_param);
	Возврат ПараметрыВызова;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьСопоставленияНажатие(Элемент)
	
	ЭтоВнешняяОбработка = ЭтоВнешняяОбработка();
	Если ЭтоВнешняяОбработка Тогда
		ИмяОбработки = ИмяФайлаОбработки();
	Иначе
		ИмяОбработки = ИмяОбработки();
	КонецЕсли;	
	
	ПараметрыВызова = ПараметрыЗапускаАлгоритма();
	
	ПараметрыДлительныеОперации = Новый Структура;
	ПараметрыДлительныеОперации.Вставить("ИмяОбработки",		ИмяОбработки);
	ПараметрыДлительныеОперации.Вставить("ИмяМетода",			"ЗагрузитьСопоставленияНаСервере");
	ПараметрыДлительныеОперации.Вставить("ПараметрыВыполнения",	ПараметрыВызова);
	ПараметрыДлительныеОперации.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка());

	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ПараметрыДлительныеОперации);   
	ПараметрыЗадания.Добавить("");   
	ЗаголовокФормы = "Загрузить сопоставления";
	ФормаВладелец = МодульФоновогоЗаданияКлиент();
	ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено;//Новый ОписаниеОповещения("ПослеВыполненияАлгоритма", ЭтотОбъект);
		
	МодульФоновогоЗаданияКлиент().ОткрытьФормуДлительнойОперации(ВыполняемыйМетод, ПараметрыЗадания, ЗаголовокФормы, Неопределено, ОповещениеОЗакрытииФормыФоновогоЗадания); 
КонецПроцедуры

