
&НаКлиенте
Процедура ЗагрузитьСопоставленияНажатие(Элемент)
	
	ИмяОбработки = ИмяОбработки();
	
	ПараметрыДлительныеОперации = Новый Структура;
	ПараметрыДлительныеОперации.Вставить("ИмяОбработки",		ИмяОбработки);
	ПараметрыДлительныеОперации.Вставить("ИмяМетода",			"ЗагрузитьСопоставленияНаСервере");
	ПараметрыДлительныеОперации.Вставить("ПараметрыВыполнения",	Неопределено);
	ПараметрыДлительныеОперации.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка());

	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ПараметрыДлительныеОперации);   
	ПараметрыЗадания.Добавить("");   
	ЗаголовокФормы = "Загрузка сопоставлений";
	ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено;//Новый ОписаниеОповещения("ПослеВыполненияАлгоритма", ЭтотОбъект);
	
	МодульФоновогоЗаданияКлиент().ОткрытьФормуДлительнойОперации(ВыполняемыйМетод, ПараметрыЗадания, ЗаголовокФормы, Неопределено, ОповещениеОЗакрытииФормыФоновогоЗадания); 
КонецПроцедуры

