
&НаСервере
Процедура ЗаполнитьСпискиВыбораРеквизитов()
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	
#Область include_core_base_Настройки_Form_Настройки_ВариантыДоставкиПриглашения
#КонецОбласти
	
	ЭлементыФормочки.send_type.СписокВыбора.Очистить();
	ЭлементыФормочки.send_type.СписокВыбора.Добавить("Email", "Email");
	ЭлементыФормочки.send_type.СписокВыбора.Добавить("SMS", "SMS");
	//ЭлементыФормочки.send_type.СписокВыбора.Добавить("WhatsApp", "WhatsApp");
	//ЭлементыФормочки.send_type.СписокВыбора.Добавить("Telegram", "Telegram");	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыИзПубличныхНастроек()
	МодульОбъекта	= ПолучитьМодульОбъекта();
	ОбщиеНастройки	= МодульОбъекта.ОбщиеНастройкиПрочитать();
	ПубличныеОбщиеНастройки	= get_prop(ОбщиеНастройки, "public");
	
	download_attachments_on_complete = get_prop(ПубличныеОбщиеНастройки, "download_attachments_on_complete", Ложь);
	download_attachments_on_update   = get_prop(ПубличныеОбщиеНастройки, "download_attachments_on_update",   Ложь);
	refresh_statuses                 = get_prop(ПубличныеОбщиеНастройки, "refresh_statuses",                 Ложь);
	send_invitations                 = get_prop(ПубличныеОбщиеНастройки, "send_invitations",                 Ложь);
	send_type                        = get_prop(ПубличныеОбщиеНастройки, "send_type",                        "Email");
	run_docflow                      = get_prop(ПубличныеОбщиеНастройки, "run_docflow",                      Истина);
	kedo_mark                        = get_prop(ПубличныеОбщиеНастройки, "kedo_mark",                        Ложь);
	send_completed_documents         = get_prop(ПубличныеОбщиеНастройки, "send_completed_documents",         Истина);
	web_interface	                 = get_prop(ПубличныеОбщиеНастройки, "web_interface",                    "1CBrowser");
	
	pdf_attachments	= get_prop(ПубличныеОбщиеНастройки, "pdf_attachments", Ложь);
 	auto_update = get_prop(ПубличныеОбщиеНастройки, "auto_update", Ложь);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыИзНастроекПодключения()
	context_param	= ПолучитьМодульОбъекта().НастройкиПодключенияПрочитать();
	Тема			= get_prop(context_param, "Тема");
	advanced_log	= get_prop(context_param, "advanced_log", Ложь);
	exchange_method	= get_prop(context_param, "exchange_method", "API");
	ЗаполнитьДатуСобытияОбновленияСтатусов(context_param);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатуСобытияОбновленияСтатусов(context_param)
	ПоследнееСобытие = get_prop(context_param, "last_event");
	ДатаСобытияСтрокой =  get_prop(ПоследнееСобытие, "date", "01.01.0001 00.00.00");
	Если Не ПустаяСтрока(ДатаСобытияСтрокой) Тогда
		МодульОбъекта = ПолучитьМодульОбъекта();
		ЭлементыДатыСобытия = МодульОбъекта.СтрРазделить82(СтрЗаменить(ДатаСобытияСтрокой, " ", "."), ".");
		//В ином случае нам тут делать нечего, скорее всего будет произвольный набор данных
		//на коротый мы не расчитывали
		Если ЭлементыДатыСобытия.Количество() = 6 Тогда
			Попытка
				ДатаВремяУказателяСтатуса = Дата(
					ЭлементыДатыСобытия[2],
					ЭлементыДатыСобытия[1],
					ЭлементыДатыСобытия[0],
					ЭлементыДатыСобытия[3],
					ЭлементыДатыСобытия[4],
					ЭлементыДатыСобытия[5]);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

