
&НаКлиенте
Процедура ЛокализацияДействиеПриОткрытии()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭтаФорма.exchange_method = "API";
	ЭлементыФормочки.РоботОперации.Видимость = Ложь;
	ЭлементыФормочки.send_type.СписокВыбора.Очистить();
	ЭлементыФормочки.send_type.СписокВыбора.Добавить("Email", "Email");
	
	ЭлементыФормочки.ОткрытьКадровыеДокументы.Подсказка = "Открыть реестр " + ЛокализацияНазваниеПродукта() + " ""Кадровые документы"" в браузере";
	ЭлементыФормочки.ОткрытьЗадачи.Подсказка = "Открыть реестр " + ЛокализацияНазваниеПродукта() + " ""Задачи"" в браузере";
	ЭлементыФормочки.ОткрытьЖурналДокументов.Подсказка = "Открыть реестр всех синхронизированных с " + ЛокализацияНазваниеПродукта() + " документов";
	ЭлементыФормочки.Выйти.Подсказка = "Закрыть сессию " + ЛокализацияНазваниеПродукта();
	ЭлементыФормочки.СтраницыSABY.Заголовок = "Страницы " + ЛокализацияНазваниеПродукта();
КонецПроцедуры
