
&НаКлиенте
Процедура ЗапуститьОповещениеПриНаличииСессии(ИмяОповещения, ОбъектОповещения = Неопределено, ПараметрыОповещения = Неопределено) Экспорт
	
	Если ОбъектОповещения = Неопределено Тогда
		ОбъектОповещения = ЭтаФорма;
	КонецЕсли;
	
	context_param = ПроверитьНаличиеПараметровПодключенияНаСервере();
	Если context_param = Неопределено Тогда
		
		ПараметрыОбратногоВызова = Новый Структура("ОбъектОповещения, ИмяОповещения, ПараметрыОповещения",
			ОбъектОповещения, ИмяОповещения, ПараметрыОповещения);
			
		Оповещение = Новый ОписаниеОповещения(
			"ЗапуститьОповещениеПриНаличииСессии_ПослеАутентификации", 
			ЭтаФорма, 
			ПараметрыОбратногоВызова);
			
		ОткрытьФормуОбработки("Вход",, ЭтаФорма,, Оповещение);
		
		Возврат; 
		
	КонецЕсли;
		
	Оповещение = Новый ОписаниеОповещения(ИмяОповещения, ОбъектОповещения, ПараметрыОповещения);
	ВыполнитьОбработкуОповещения(Оповещение, context_param);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОповещениеПриНаличииСессии_ПослеАутентификации(Результат, ПереданныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ЗапуститьОповещениеПриНаличииСессии(ПереданныеПараметры.ИмяОповещения, ПереданныеПараметры.ОбъектОповещения);
	КонецЕсли;
КонецПроцедуры

