
#Область include_core_base_СвойстваОбработкиПродукта
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСервер
#КонецОбласти

#Область include_core_base_ВзаимодействиеСРегламентнымиЗаданиями
#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_base_CommonModule_ИменаМодулейКлиент
#КонецОбласти

&НаКлиенте
Процедура ЗапуститьОповещениеПриНаличииСессии(ИмяОповещения, ОбъектОповещения = Неопределено)
	Если ОбъектОповещения = Неопределено Тогда
		ОбъектОповещения = МодульКомандыОбменаДляФормыКлиент();
	КонецЕсли;             
	МодульКомандыОбменаДляФормыКлиент().ЗапуститьОповещениеПриНаличииСессии(ОбъектОповещения, ИмяОповещения, Новый Структура());
КонецПроцедуры

&НаСервере
Процедура НачальнаяИнициализацияСправочников()
	Справочники[ПрефиксПродукта() + "СостоянияОбъектов"].НачальнаяИнициализация();
КонецПроцедуры

&НаСервере
Функция ЗначениеФункциональнойОпции(ИмяФО)
	ЗначениеФО = Ложь;
	ПолноеИмяФО = ПрефиксПродукта() + ИмяФО;
	Если Метаданные.ФункциональныеОпции.Найти(ПолноеИмяФО) <> Неопределено Тогда
        ЗначениеФО = ПолучитьФункциональнуюОпцию(ПолноеИмяФО);
	КонецЕсли;
	Возврат ЗначениеФО;
КонецФункции


