
#Область include_core_base_Helpers_РаботаСХранилищемЗначения
#КонецОбласти

#Область include_core_base_Helpers_ExtException
#КонецОбласти

#Область include_core_base_Helpers_ФормаСбросКеша
#КонецОбласти

#Область include_core_base_Helpers_ОбщийМодульКонфигурации
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСоСтроками
#КонецОбласти

Функция ПрофилиПользователей(ТекстЗапроса, ОтмеченныеПрофили)
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОтмеченныеПрофили", ОтмеченныеПрофили);
	Профили = РеквизитФормыВЗначение("ПрофилиПользователей"); // заполняем ПрофилиПользователей 
	Профили = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(Профили, "ПрофилиПользователей");
	Возврат Профили;
КонецФункции

#Область include_core_base_Helpers_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_ОформлениеЭлементовОбъектовСинхронизации
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ФильтрыРоботаПоУмолчанию //&НаКлиенте
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ДополнительныеПоляРоботаПоУмолчанию //&НаКлиенте
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ПолучитьАвтоматическиеОперации //&НаКлиенте
#КонецОбласти

Процедура ПередОткрытием()
	// Заглушка для ОФ
КонецПроцедуры

&НаКлиенте

Процедура УстановитьЗаголовокСпособаОтправкиПриглашения(ЗаголовокЭлемента)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.send_invitations.Заголовок = ЗаголовокЭлемента;
КонецПроцедуры

#Область include_core_base_ПИМ_ГрупповыеФункции //&НаКлиенте
#КонецОбласти

