   
Функция ПрофилиПользователей(ТекстЗапроса, ОтмеченныеПрофили)
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОтмеченныеПрофили", ОтмеченныеПрофили);
	ПрофилиПользователей = Запрос.Выполнить().Выгрузить();
	Возврат ПрофилиПользователей;
КонецФункции

Процедура ОформлениеСтрокОбъектовСинхронизации()
 // Нужна как заглушка УФ
КонецПроцедуры

Процедура ПередОткрытием()
	ТаблицаРегламентныеЗадания.Колонки.Добавить("Наименование");
	ТаблицаРегламентныеЗадания.Колонки.Добавить("Идентификатор");
	ТаблицаРегламентныеЗадания.Колонки.Добавить("Использование");
КонецПроцедуры

Процедура УстановитьЗаголовокСпособаОтправкиПриглашения(ЗаголовокЭлемента)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.send_type_caption.Заголовок = ЗаголовокЭлемента;
КонецПроцедуры

