
#Область include_core_base_СвойстваОбработкиПродукта
#КонецОбласти

#Область include_core_base_ВзаимодействиеСРегламентнымиЗаданиями
#КонецОбласти

&НаКлиенте
Процедура ЗапуститьОповещениеПриНаличииСессии(ИмяОповещения, ОбъектОповещения = Неопределено)
	Если ОбъектОповещения = Неопределено Тогда
		ОбъектОповещения = Saby_КомандыОбменаДляФормыКлиент;
	КонецЕсли;
	Saby_КомандыОбменаДляФормыКлиент.ЗапуститьОповещениеПриНаличииСессии(ОбъектОповещения, ИмяОповещения, Новый Структура());
КонецПроцедуры

&НаСервере
Процедура НачальнаяИнициализацияСправочников()
	Справочники.Saby_СостоянияОбъектов.НачальнаяИнициализация();
КонецПроцедуры

&НаСервере
Функция ЗначениеФункциональнойОпции(ИмяФО)
	ЗначениеФО = Ложь;
	ПолноеИмяФО = ПолучитьИмяПродукта() + "_" + ИмяФО;
	Если Метаданные.ФункциональныеОпции.Найти(ПолноеИмяФО) <> Неопределено Тогда
        ЗначениеФО = ПолучитьФункциональнуюОпцию(ПолноеИмяФО);
	КонецЕсли;
	Возврат ЗначениеФО;
КонецФункции
