   
Процедура ПереключитьПанель(Название)
	Если Название = "БесшовныйВход" Тогда   
		Панель.ТекущаяСтраница = Панель.Страницы.БесшовныйВход;	
	Иначе	
		Панель.ТекущаяСтраница = Панель.Страницы.Основная;	
	КонецЕсли;	
КонецПроцедуры

Функция ПрофилиПользователей(ТекстЗапроса, ОтмеченныеПрофили)
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОтмеченныеПрофили", ОтмеченныеПрофили);
	ПрофилиПользователей = Запрос.Выполнить().Выгрузить();
	Возврат ПрофилиПользователей;
КонецФункции
