
&НаКлиенте
Процедура ПослеОткрытия()
	ПоискРегламентногоЗадания();
КонецПроцедуры

#Область include_core_base_СвойстваОбработкиПродукта
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСервер
#КонецОбласти

#Область include_core_base_ВзаимодействиеСРегламентнымиЗаданиями
#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_base_CommonModule_ИменаМодулейКлиент
#КонецОбласти

&НаКлиенте
Процедура ЗапуститьОповещениеПриНаличииСессии(ИмяОповещения, ОбъектОповещения = Неопределено)
	Если ОбъектОповещения = Неопределено Тогда
		ОбъектОповещения = МодульКомандыОбменаДляФормыКлиент();
	КонецЕсли;             
	МодульКомандыОбменаДляФормыКлиент().ЗапуститьОповещениеПриНаличииСессии(ОбъектОповещения, ИмяОповещения, Новый Структура());
КонецПроцедуры

&НаСервере
Процедура НачальнаяИнициализацияСправочников()
	Справочники[ПрефиксПродукта() + "СостоянияОбъектов"].НачальнаяИнициализация();
КонецПроцедуры

&НаСервере
Функция ЗначениеКонстанты(ИмяФО, ЗначениеПриОтсутствии = Неопределено)
	ЗначениеФО = ЗначениеПриОтсутствии;
	ПолноеИмяФО = ПрефиксПродукта() + ИмяФО;
	Если Метаданные.Константы.Найти(ПолноеИмяФО) <> Неопределено Тогда
        ЗначениеФО = Константы[ПолноеИмяФО].Получить();
	КонецЕсли;
	Возврат ЗначениеФО;
КонецФункции
