   
Функция ПрофилиПользователей(ТекстЗапроса, ОтмеченныеПрофили)
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОтмеченныеПрофили", ОтмеченныеПрофили);
	ПрофилиПользователей = Запрос.Выполнить().Выгрузить();
	Возврат ПрофилиПользователей;
КонецФункции

Процедура ОформлениеСтрокОбъектовСинхронизации()
 // Нужна как заглушка УФ
КонецПроцедуры

Процедура ПередОткрытием()
	ТаблицаРегламентныеЗадания.Колонки.Добавить("Наименование");
	ТаблицаРегламентныеЗадания.Колонки.Добавить("Идентификатор");
	ТаблицаРегламентныеЗадания.Колонки.Добавить("Использование");

	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ЭлементыФормочки.РеквизитВыгружатьВложения.Видимость = Ложь;
	ЭлементыФормочки.download_attachments_on_update.Видимость = Ложь;
	ЭлементыФормочки.download_attachments_on_complete.Видимость = Ложь;
	ЭтаФорма.РеквизитВыгружатьВложения = Ложь;
	ЭтаФорма.download_attachments_on_update = Ложь;
	ЭтаФорма.download_attachments_on_complete = Ложь;
КонецПроцедуры

Процедура УстановитьЗаголовокСпособаОтправкиПриглашения(ЗаголовокЭлемента)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.грsend_invitations_caption.Заголовок = ЗаголовокЭлемента;
КонецПроцедуры

Процедура ОтобразитьСкрытьСтраницуПИМ(Отобразить)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	СтраницаПрограммыИнтеграционногоМодуля = ЭлементыФормочки.Найти(ПИМИмяОбластиЭлементов());  
	Если СтраницаПрограммыИнтеграционногоМодуля <> Неопределено Тогда 
		ЭлементыФормочки.СтраницыПараметров.Страницы[ПИМИмяОбластиЭлементов()].Видимость = Отобразить;
	КонецЕсли;					
КонецПроцедуры
