
#Область include_core_base_ВзаимодействиеСРегламентнымиЗаданиямиМетодыПубликации
#КонецОбласти

&НаКлиенте
Процедура ЗапуститьОповещениеПриНаличииСессии(ИмяОповещения, ОбъектОповещения = Неопределено)
	Если ОбъектОповещения = Неопределено Тогда
		ОбъектОповещения = Saby_КомандыОбменаДляФормыКлиент;
	КонецЕсли;
	Saby_КомандыОбменаДляФормыКлиент.ЗапуститьОповещениеПриНаличииСессии(ОбъектОповещения, ИмяОповещения, Новый Структура());
КонецПроцедуры

&НаСервере
Процедура НачальнаяИнициализацияСправочников()
	Справочники.Saby_СостоянияОбъектов.НачальнаяИнициализация();
КонецПроцедуры

