
#Область include_core_base_Настройки_ВзаимодействиеСРегламентнымиЗаданиями
#КонецОбласти

&НаКлиенте
Процедура ПослеОткрытия()
	ПослеОткрытияДляВнешнейОбработки();
    ЭтаФорма.СпособПодключения    = "Внешняя обработка управляемые формы";
	ПоискРегламентногоЗадания();
КонецПроцедуры

#Область include_core_base_Настройки_Form_Настройки_ОсобенностиОбработки
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ГлавноеОкноОбработки
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСерверСКлиента
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщие
#КонецОбласти
