
Процедура ПослеОткрытияДляВнешнейОбработки()
	ЭтаФорма.exchange_method = "API";
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ЭлементыФормочки.грПриглашение.Видимость			= Истина; 
	ЭлементыФормочки.run_docflow.Видимость				= Истина;
	ЭлементыФормочки.kedo_mark.Видимость				= Ложь;
	ЭлементыФормочки.Вложения.Видимость					= Истина; 
	ЭлементыФормочки.ОткрытьКадровыеДокументы.Видимость	= Ложь; 
	ЭлементыФормочки.ДекорацияЗадачиНативные.Видимость	= Ложь;
	ЭлементыФормочки.ОткрытьЗадачи.Видимость			= Истина;	
	Если ЭлементыФормочки.Найти("ОткрытьЖурналДокументов") <> Неопределено Тогда
		ЭлементыФормочки["ОткрытьЖурналДокументов"].Видимость	= Ложь;
	КонецЕсли;
	ЭлементыФормочки.ОткрытьСтраницуПодключения.Видимость		= Истина;
	ЭлементыФормочки.Обновление.Видимость				= Истина;
	ЭлементыФормочки.грТема.Видимость					= Истина;
	ЭлементыФормочки.грНомераДокументов.Видимость		= Истина;
	ЭлементыФормочки.ДействиеСРегламентнымЗаданием.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Функция ЗначениеФункциональнойОпции(ИмяФО)
	Возврат Истина;
КонецФункции

#Область include_core_base_Настройки_Form_Настройки_ОсобенностиОбработкиИРасширенияСЭДО
#КонецОбласти

Функция ЗначениеКонстанты(ИмяФО, ЗначениеПриОтсутствии = Неопределено)
	Возврат Истина;
КонецФункции
