
&НаКлиенте
Процедура ПослеОткрытия()
	ПослеОткрытияДляРасширенияСЭДО();
КонецПроцедуры

#Область include_core_base_Настройки_Form_Настройки_ОсобенностиРасширенияСЭДО
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ГлавноеОкноОбработки
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСерверСКлиента
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщие
#КонецОбласти

&НаСервере
Функция ЗначениеКонстанты(ИмяФО, ЗначениеПриОтсутствии = Неопределено)
	ЗначениеФО = ЗначениеПриОтсутствии;
	ПолноеИмяФО = ПрефиксПродукта() + ИмяФО;
	Если Метаданные.Константы.Найти(ПолноеИмяФО) <> Неопределено Тогда
        ЗначениеФО = Константы[ПолноеИмяФО].Получить();
	КонецЕсли;
	Возврат ЗначениеФО;
КонецФункции

