
Процедура ПослеОткрытияДляВнешнейОбработки()
	ЭтаФорма.exchange_method = "API";
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ЭлементыФормочки.грПриглашение.Видимость			= Истина; 
	ЭлементыФормочки.run_docflow.Видимость				= Истина;
	ЭлементыФормочки.kedo_mark.Видимость				= Ложь;
	ЭлементыФормочки.Вложения.Видимость					= Истина; 
	ЭлементыФормочки.ОткрытьКадровыеДокументы.Видимость	= Ложь; 
	ЭлементыФормочки.ДекорацияЗадачиНативные.Видимость	= Ложь;
	ЭлементыФормочки.ОткрытьЗадачи.Видимость			= Истина;	
	Если ЭлементыФормочки.Найти("ОткрытьЖурналДокументов") <> Неопределено Тогда
		ЭлементыФормочки["ОткрытьЖурналДокументов"].Видимость	= Ложь;
	КонецЕсли;
	ЭлементыФормочки.ОткрытьСтраницуПодключения.Видимость		= Истина;
	ЭлементыФормочки.Обновление.Видимость				= Истина;
	ЭлементыФормочки.грТема.Видимость					= Истина;
	ЭлементыФормочки.грНомераДокументов.Видимость		= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОповещениеПриНаличииСессии(ИмяОповещения, ОбъектОповещения = Неопределено) Экспорт
	
	ПараметрыОповещения = Новый Структура;
	Если ОбъектОповещения = Неопределено Тогда
		ОбъектОповещения = ЭтаФорма;
	КонецЕсли;
	
	context_param = ПроверитьНаличиеПараметровПодключенияНаСервере();
	Если context_param = Неопределено Тогда
		
		ПараметрыОбратногоВызова = Новый Структура("ОбъектОповещения, ИмяОповещения, ПараметрыОповещения",
			ОбъектОповещения, ИмяОповещения, ПараметрыОповещения);
			
		Оповещение = Новый ОписаниеОповещения(
			"ЗапуститьОповещениеПриНаличииСессии_ПослеАутентификации", 
			ЭтаФорма, 
			ПараметрыОбратногоВызова);
			
		ОткрытьФормуОбработки("Вход",, ЭтаФорма,, Оповещение);
		
		Возврат; 
		
	КонецЕсли;
		
	Оповещение = Новый ОписаниеОповещения(ИмяОповещения, ОбъектОповещения, ПараметрыОповещения);
	ВыполнитьОбработкуОповещения(Оповещение, context_param);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОповещениеПриНаличииСессии_ПослеАутентификации(Результат, ПереданныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ЗапуститьОповещениеПриНаличииСессии(ПереданныеПараметры.ИмяОповещения, ПереданныеПараметры.ОбъектОповещения);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ЗначениеФункциональнойОпции(ИмяФО)
	Возврат Истина;
КонецФункции

&НаСервере
Процедура НачальнаяИнициализацияСправочников()
	//Заглушка
КонецПроцедуры

