
&НаКлиенте
Процедура ПослеОткрытия()
	ЭтаФорма.СпособПодключения = "Расширение для 1С";
	ПослеОткрытияДляРасширенияСЭДО();
КонецПроцедуры

Процедура ПослеОткрытияДляРасширенияСЭДО()

	ЭтаФорма.exchange_method = "API";
	ЭтаФорма.auto_update     = Ложь;

	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();

	ЭлементыФормочки.грТема.Видимость                 = Ложь;
	ЭлементыФормочки.грПриглашение.Видимость          = Ложь;
	ЭлементыФормочки.АвтоматическиеОперации.Видимость = Ложь;
	ЭлементыФормочки.грРегламентныеЗадания.Видимость  = Ложь;

	ЭлементыФормочки.Обновление.Видимость = Истина;

	ЭлементыФормочки.ЗагрузитьСопоставления.Видимость = Ложь;

	ЭлементыФормочки.Обновление.Видимость = Ложь;

	ЭлементыФормочки.СтраницаАвтоматическиеОперации.Видимость = Ложь;
	ЭлементыФормочки.СтраницаПрограммыИнтеграционногоМодуля.Видимость = Ложь;
	ЭлементыФормочки.СтраницаОбъектыСинхронизации.Видимость = Ложь;
	ЭлементыФормочки.СтраницаИсторияОбмена.Видимость = Ложь;

	ЭтаФорма.Заголовок = "Настройки СЭДО";

КонецПроцедуры

#Область include_core_base_Настройки_Form_Настройки_ОсобенностиОбработкиИРасширенияСЭДО
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ГлавноеОкноОбработки
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСерверСКлиента
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщие
#КонецОбласти

&НаСервере
Функция ЗначениеКонстанты(ИмяФО, ЗначениеПриОтсутствии = Неопределено)
	ЗначениеФО = ЗначениеПриОтсутствии;
	ПолноеИмяФО = ПрефиксПродукта() + ИмяФО;
	Если Метаданные.Константы.Найти(ПолноеИмяФО) <> Неопределено Тогда
        ЗначениеФО = Константы[ПолноеИмяФО].Получить();
	КонецЕсли;
	Возврат ЗначениеФО;
КонецФункции

