
Процедура ПослеОткрытияДляРасширенияСЭДО()

	ЭтаФорма.exchange_method = "API";
	ЭтаФорма.ИспользоватьЭЛН = Истина;
	ЭтаФорма.auto_update     = Ложь;

	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();

	ЭлементыФормочки.грТема.Видимость                 = Ложь;
	ЭлементыФормочки.грПриглашение.Видимость          = Ложь;
	ЭлементыФормочки.грДокументы.Видимость            = Ложь;
	ЭлементыФормочки.АвтоматическиеОперации.Видимость = Ложь;
	ЭлементыФормочки.Группа_Подсистемы.Видимость      = Ложь;
	ЭлементыФормочки.грРегламентныеЗадания.Видимость  = Ложь;

	ЭлементыФормочки.ОткрытьКадровыеДокументы.Видимость   = Ложь;
	ЭлементыФормочки.ДекорацияЗадачиНативные.Видимость    = Ложь;
	ЭлементыФормочки.ОткрытьЗадачи.Видимость              = Ложь;
	ЭлементыФормочки.ПодборПерсонала.Видимость            = Ложь;
	ЭлементыФормочки.ОткрытьЖурналДокументов.Видимость    = Ложь;
	ЭлементыФормочки.ОткрытьНалоговыйМониторинг.Видимость = Ложь;
	ЭлементыФормочки.РоботОперации.Видимость = Ложь;

	ЭлементыФормочки.ОткрытьРедакторФайловНастроек.Видимость = Истина;

	ЭлементыФормочки.Обновление.Видимость = Истина;

	ЭлементыФормочки.ОткрытьСтраницуПодключения.Видимость = Ложь;
	ЭлементыФормочки.ЗагрузитьСопоставления.Видимость = Ложь;

	ЭлементыФормочки.Обновление.Видимость = Ложь;
	
	ЭтаФорма.Заголовок = "Настройки СЭДО";
	
КонецПроцедуры

&НаСервере
Функция ЗначениеФункциональнойОпции(ИмяФО)
	Если Найти(ИмяФО, "ИспользоватьЭЛН") > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

#Область include_core_base_Настройки_Form_Настройки_ОсобенностиОбработкиИРасширенияСЭДО
#КонецОбласти

