#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_ExtException
#КонецОбласти

#Область include_core_base_Helpers_ФормаСбросКеша
#КонецОбласти

#Область include_base_НазваниеПродукта
#КонецОбласти

&НаСервере
Процедура ПереключитьПанель(Название)
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	Если Название = "БесшовныйВход" Тогда   
		ЭлементыФормочки.СтраницыНастроек.ТекущаяСтраница = ПолучитьСтраницу(ЭлементыФормочки.СтраницыНастроек, "БесшовныйВход");	
	Иначе	
		ЭлементыФормочки.СтраницыНастроек.ТекущаяСтраница = ПолучитьСтраницу(ЭлементыФормочки.СтраницыНастроек, "Основная");	
	КонецЕсли;	
КонецПроцедуры

Функция ПрофилиПользователей(ТекстЗапроса, ОтмеченныеПрофили)
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОтмеченныеПрофили", ОтмеченныеПрофили);
	Профили = РеквизитФормыВЗначение("ПрофилиПользователей"); // заполняем ПрофилиПользователей 
	Профили = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(Профили, "ПрофилиПользователей");
	Возврат Профили;
КонецФункции

