
#Область include_core_base_Helpers_ConnectorLPP
#КонецОбласти

&НаКлиенте
Процедура ОткрытьРедакторФайловНастроекНажатие(Элемент)
	context_params = СБИСПараметры();
	Если get_prop(context_params, "session") <> Неопределено Тогда
		connector = КоннекторLPP(context_params);
		#Если ВебКлиент Тогда 
			connector="1C2";	
		#КонецЕсли	
		АдресСтраницы = context_params.api_url + "/blockly_editor_1c2/page/?connection_id=";
		АдресСтраницы = АдресСтраницы + context_params.ConnectionId; 
		АдресСтраницы = АдресСтраницы + "&connector=" + connector + "&command=" + connector;
	ИначеЕсли get_prop(context_params, "api_url") <> Неопределено Тогда
		АдресСтраницы = context_params.api_url + "/auth/";
	Иначе
		АдресСтраницы = "https://online.saby.ru/auth/";	
	КонецЕсли;
	ПараметрыФормыРедактора = Новый Структура();
	ПараметрыФормыРедактора.Вставить("Заголовок", "Транспортная страница");
	ПараметрыФормыРедактора.Вставить("АдресСтраницы", АдресСтраницы);
	ОткрытьФормуОбработки("Browser", ПараметрыФормыРедактора, ЭтаФорма, "Транспортная страница");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналДокументовНажатие(Элемент)
	ЭтаФорма.context_params = СБИСПараметры();
	ПараметрыФормыЖурнала = Новый Структура();
	ПараметрыФормыЖурнала.Вставить("Заголовок", "Задачи");
	ПараметрыФормыЖурнала.Вставить("context_param", ЭтаФорма.context_params);
	ОткрытьФормуОбработки("ДокументыКЭДО", ПараметрыФормыЖурнала,,"ДокументыКЭДО");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачиНажатие(Команда, ПараметрКоманды) Экспорт
	context_params = СБИСПараметры();
	Если get_prop(context_params, "session") <> Неопределено Тогда
		АдресСтраницы = context_params.api_url+"/page/tasks-in-work"; //integration-tasks?connector=1C
	ИначеЕсли get_prop(context_params, "api_url") <> Неопределено Тогда
		АдресСтраницы = context_params.api_url+"/auth/";
	Иначе
		АдресСтраницы = "https://ie-1c.saby.ru/auth/";	
	КонецЕсли;	
	ПараметрыФормыЗадач = Новый Структура();
	ПараметрыФормыЗадач.Вставить("Заголовок", "Задачи");
	ПараметрыФормыЗадач.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормыЗадач.Вставить("context_param", ЭтаФорма.context_params);
	ОткрытьФормуОбработки("Browser", ПараметрыФормыЗадач,,"Задачи");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКадровыеДокументыНажатие(Команда, ПараметрКоманды) Экспорт 
	context_params = СБИСПараметры();
	Если get_prop(context_params, "session") <> Неопределено Тогда
		АдресСтраницы = context_params.api_url+"/page/cadres?";
	ИначеЕсли get_prop(context_params, "api_url") <> Неопределено Тогда
		АдресСтраницы = context_params.api_url+"/auth/";
	Иначе
		АдресСтраницы = "https://ie-1c.saby.ru/auth/";	
	КонецЕсли;
	ПараметрыФормыКадровыеДокументы = Новый Структура();
	ПараметрыФормыКадровыеДокументы.Вставить("Заголовок", "Кадровые документы");
	ПараметрыФормыКадровыеДокументы.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормыКадровыеДокументы.Вставить("context_param", ЭтаФорма.context_params);
	ОткрытьФормуОбработки("Browser", ПараметрыФормыКадровыеДокументы,,"Кадровые документы")
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуПодключенияНажатие(Элемент)
	context_params = СБИСПараметры();
	АдресСтраницы = context_params.api_url+"/page/connection-card?connectionId="+context_params.ConnectionId;
	ПараметрыФормыЗадач = Новый Структура();
	ПараметрыФормыЗадач.Вставить("Заголовок", "Подключение");
	ПараметрыФормыЗадач.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормыЗадач.Вставить("context_param", ЭтаФорма.context_params);
	ОткрытьФормуОбработки("Browser", ПараметрыФормыЗадач,,"Подключение");
КонецПроцедуры

#Область include_core_base_Helpers_ПолучитьПрямуюСсылку
#КонецОбласти
