&НаКлиенте
Процедура ОткрытьРедакторФайловНастроекНажатие(Элемент)
	context_params = СБИСПараметры();
	Если get_prop(context_params, "session") <> Неопределено Тогда
		web_interface = get_prop(get_prop(context_params, "public"), "web_interface");
		Если web_interface = "BrowserSabyPlugin" Тогда
			connector="Lpp1C2";
		ИначеЕсли web_interface = "BrowserSaby" Тогда
			connector="1c-lppbl";
		Иначе
			connector="1C2";	
		КонецЕсли;		
		АдресСтраницы = context_params.api_url+"/blockly_editor_1c/page/?connection_id="+context_params.ConnectionId+"&connector="+connector+"&command="+connector;
	ИначеЕсли get_prop(context_params, "api_url") <> Неопределено Тогда
		АдресСтраницы = context_params.api_url+"/auth/";
	Иначе
		АдресСтраницы = "https://ie-1c.saby.ru/auth/";	
	КонецЕсли;
	ПараметрыФормыРедактора = Новый Структура();
	ПараметрыФормыРедактора.Вставить("Заголовок", "Редактор файлов настроек");
	ПараметрыФормыРедактора.Вставить("АдресСтраницы", АдресСтраницы);
	ОткрытьФормуОбработки("Browser", ПараметрыФормыРедактора,,"Редактор файлов настроек");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналДокументовНажатие(Элемент)
	ЭтаФорма.context_params = СБИСПараметры();
	ПараметрыФормыЖурнала = Новый Структура();
	ПараметрыФормыЖурнала.Вставить("Заголовок", "Задачи");
	ПараметрыФормыЖурнала.Вставить("context_param", ЭтаФорма.context_params);
	ОткрытьФормуОбработки("ДокументыКЭДО", ПараметрыФормыЖурнала,,"ДокументыКЭДО");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачиНажатие(Команда, ПараметрКоманды) Экспорт
	context_params = СБИСПараметры();
	Если get_prop(context_params, "session") <> Неопределено Тогда
		АдресСтраницы = context_params.api_url+"/page/tasks-in-work"; //integration-tasks?connector=1C
	ИначеЕсли get_prop(context_params, "api_url") <> Неопределено Тогда
		АдресСтраницы = context_params.api_url+"/auth/";
	Иначе
		АдресСтраницы = "https://ie-1c.saby.ru/auth/";	
	КонецЕсли;	
	ПараметрыФормыЗадач = Новый Структура();
	ПараметрыФормыЗадач.Вставить("Заголовок", "Задачи");
	ПараметрыФормыЗадач.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормыЗадач.Вставить("context_param", ЭтаФорма.context_params);
	ОткрытьФормуОбработки("Browser", ПараметрыФормыЗадач,,"Задачи");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКадровыеДокументыНажатие(Команда, ПараметрКоманды) Экспорт 
	context_params = СБИСПараметры();
	Если get_prop(context_params, "session") <> Неопределено Тогда
		АдресСтраницы = context_params.api_url+"/page/cadres?";
	ИначеЕсли get_prop(context_params, "api_url") <> Неопределено Тогда
		АдресСтраницы = context_params.api_url+"/auth/";
	Иначе
		АдресСтраницы = "https://ie-1c.saby.ru/auth/";	
	КонецЕсли;
	ПараметрыФормыКадровыеДокументы = Новый Структура();
	ПараметрыФормыКадровыеДокументы.Вставить("Заголовок", "Кадровые документы");
	ПараметрыФормыКадровыеДокументы.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормыКадровыеДокументы.Вставить("context_param", ЭтаФорма.context_params);
	ОткрытьФормуОбработки("Browser", ПараметрыФормыКадровыеДокументы,,"Кадровые документы")
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюОбменаНажатие(Элемент)
	context_params = СБИСПараметры();
	АдресСтраницы = context_params.api_url+"/integration_config/ext-sync-doc-list/page/?connectionId="+context_params.ConnectionId;
	АдресСтраницы = ПолучитьПрямуюССылку(АдресСтраницы);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	// BSLLS:UsingSynchronousCalls-off
	ЗапуститьПриложение(АдресСтраницы);
	// BSLLS:UsingSynchronousCalls-on
	#Иначе	
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);	
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура МастерНачальныхНастроек(Элемент)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("АдресСтраницы", context_params.api_url + "/");

	context_params = СБИСПараметры();
	АдресСтраницы = context_params.api_url+"/page/remainders";
	ПараметрыФормыЗадач = Новый Структура();
	ПараметрыФормыЗадач.Вставить("Заголовок", "Задачи");
	ПараметрыФормыЗадач.Вставить("АдресСтраницы", АдресСтраницы);
	ОткрытьФормуОбработки("Browser", ПараметрыФормыЗадач,,"Задачи");
КонецПроцедуры

#Область include_core_base_Helpers_ПолучитьПрямуюСсылку
#КонецОбласти
