
&НаСервере
Процедура УстановитьОформлениеЭлемента(ИмяЛевогоПоля, УсловияОтбора, ПоляОформленияСоЗначениями)
	
	ГруппаОтбора = Неопределено;
	ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
	Если УсловияОтбора.Количество() > 1 Тогда
		ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	 	ГруппаОтбора.ТипГруппы = УсловияОтбора[0].ВидСравненияГруппы;
	КонецЕсли;
 
	Для Каждого УсловиеОтбора Из УсловияОтбора Цикл
		Если ГруппаОтбора = Неопределено Тогда
			ОтборУО = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Иначе
			ОтборУО = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		КонецЕсли;
		ОтборУО.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных(ИмяЛевогоПоля);
		ОтборУО.ВидСравнения	= УсловиеОтбора.ВидСравненияПоля;
		ОтборУО.ПравоеЗначение	= УсловиеОтбора.Значение;
	КонецЦикла;
	
	Для Каждого ПолеОформления Из ПоляОформленияСоЗначениями Цикл
		ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ПолеОформления.ИмяПоля);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра(ПолеОформления.Реквизит, ПолеОформления.Значение);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОформлениеСтрокОбъектовСинхронизации()
	УсловноеОформление.Элементы.Очистить();

// BSLLS:NestedFunctionInParameters-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:DuplicateStringLiteral-off
	ИмяЛевогоПоля = "ДеревоНастроекПодключения.Направление";
	ВидСравненияГруппы = Неопределено;
	мУсловиеОформления = Новый Массив();
	мУсловиеОформления.Добавить(Новый Структура("ИмяПоля, ВидСравненияГруппы, ВидСравненияПоля, Значение",
		ИмяЛевогоПоля, ВидСравненияГруппы,	ВидСравненияКомпоновкиДанных.Равно, 1));
	мПолейОформления = Новый Массив();
	мПолейОформления.Добавить(	Новый Структура("ИмяПоля, Реквизит, Значение",
		"ДеревоНастроекПодключенияНаправление",	"Текст", "X"));
	УстановитьОформлениеЭлемента(ИмяЛевогоПоля, мУсловиеОформления, мПолейОформления);

	мУсловиеОформления = Новый Массив();
	мУсловиеОформления.Добавить(Новый Структура("ИмяПоля, ВидСравненияГруппы, ВидСравненияПоля, Значение",
		ИмяЛевогоПоля, ВидСравненияГруппы,	ВидСравненияКомпоновкиДанных.Равно, 2));
	мПолейОформления = Новый Массив();
	мПолейОформления.Добавить(	Новый Структура("ИмяПоля, Реквизит, Значение",
		"ДеревоНастроекПодключенияНаправление",	"Текст", "⇄"));
	УстановитьОформлениеЭлемента(ИмяЛевогоПоля, мУсловиеОформления, мПолейОформления);
	
	мУсловиеОформления = Новый Массив();
	мУсловиеОформления.Добавить(Новый Структура("ИмяПоля, ВидСравненияГруппы, ВидСравненияПоля, Значение",
		ИмяЛевогоПоля, ВидСравненияГруппы,	ВидСравненияКомпоновкиДанных.Равно, 3));
	мПолейОформления = Новый Массив();
	мПолейОформления.Добавить(	Новый Структура("ИмяПоля, Реквизит, Значение",
		"ДеревоНастроекПодключенияНаправление",	"Текст", "→"));
	УстановитьОформлениеЭлемента(ИмяЛевогоПоля, мУсловиеОформления, мПолейОформления);
	
	мУсловиеОформления = Новый Массив();
	мУсловиеОформления.Добавить(Новый Структура("ИмяПоля, ВидСравненияГруппы, ВидСравненияПоля, Значение",
		ИмяЛевогоПоля, ВидСравненияГруппы,	ВидСравненияКомпоновкиДанных.Равно, 4));
	мПолейОформления = Новый Массив();
	мПолейОформления.Добавить(	Новый Структура("ИмяПоля, Реквизит, Значение",
		"ДеревоНастроекПодключенияНаправление",	"Текст", "←"));
	УстановитьОформлениеЭлемента(ИмяЛевогоПоля, мУсловиеОформления, мПолейОформления);
	
	ИмяЛевогоПоля = "ДеревоНастроекПодключения.Объект";
	ВидСравненияГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	мУсловиеОформления = Новый Массив();
	мУсловиеОформления.Добавить(Новый Структура("ИмяПоля, ВидСравненияГруппы, ВидСравненияПоля, Значение",
		ИмяЛевогоПоля, ВидСравненияГруппы,	ВидСравненияКомпоновкиДанных.Равно, "Справочники"));
	мУсловиеОформления.Добавить(Новый Структура("ИмяПоля, ВидСравненияГруппы, ВидСравненияПоля, Значение",
		ИмяЛевогоПоля, ВидСравненияГруппы,	ВидСравненияКомпоновкиДанных.Равно, "Документы"));
	мПолейОформления = Новый Массив();
	мПолейОформления.Добавить(	Новый Структура("ИмяПоля, Реквизит, Значение",
		"ДеревоНастроекПодключенияНаправление",	"Текст", ""));
	УстановитьОформлениеЭлемента(ИмяЛевогоПоля, мУсловиеОформления, мПолейОформления);
// BSLLS:NestedFunctionInParameters-on
// BSLLS:NumberOfValuesInStructureConstructor-on
// BSLLS:DuplicateStringLiteral-on
КонецПроцедуры
