
&НаКлиенте
Процедура ПолучатьУведомленияОСбояхАОПриИзменении(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ДоступностьТранспортаПочта = ЭтаФорма.ПолучатьУведомленияОСбояхАО;
	Если  Не ДоступностьТранспортаПочта Тогда
		ДоступностьТранспортаПочта = Ложь;
		ЭтаФорма.ЭлектроннаяПочтаДляРассылки = "";
	КонецЕсли;
	ЭлементыФормочки.ЭлектроннаяПочтаДляРассылки.Доступность = ДоступностьТранспортаПочта;
	ЭлементыФормочки.ПроверитьОтправку.Доступность = ДоступностьТранспортаПочта;
КонецПроцедуры
