
&НаКлиенте
Процедура send_invitationsПриИзменении(Элемент)
	УстановитьДоступностьПоляТипОтправкиПриглашения();	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПоляТипОтправкиПриглашения()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлСпособОтправки = ЭлементыФормочки.Найти("грСпособОтправки");
	ВидимостьЭлементовКЭДО = ЗначениеКонстанты("ИспользоватьКЭДО", Ложь);
	ЭлСтрокаСпособОтправки = ЭлементыФормочки.Найти("грПриглашение1");
	
	Если ЭлСпособОтправки = Неопределено Тогда
		ЭлСпособОтправки = ЭлементыФормочки.Найти("send_type");
	КонецЕсли;
	
	Если  send_invitations = Ложь Тогда
		ЭтаФорма.send_type	 = "Email";
		Если ЭлСпособОтправки <> Неопределено Тогда
			ЭлСпособОтправки.Видимость = Ложь; 
		КонецЕсли;
		Если ЭлСтрокаСпособОтправки <> Неопределено Тогда
			ЭлСтрокаСпособОтправки.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Если ЭлСпособОтправки <> Неопределено Тогда
			ЭлСпособОтправки.Видимость = Истина И ВидимостьЭлементовКЭДО; 
		КонецЕсли;
		Если ЭлСтрокаСпособОтправки <> Неопределено Тогда
			ЭлСтрокаСпособОтправки.Видимость = Истина И ВидимостьЭлементовКЭДО;
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Функция ПроверкаНаличияКомпонентыSabyHttpsClient()
	Ответ = ИСТИНА;
	Попытка
		МодульОбъекта = МодульОбъекта();  
		МодульОбъекта.ПодключитьКомпонентуSabyHttpsClient(Неопределено);
	Исключение 
		Ответ = ЛОЖЬ; 
		ИнфОбОшибке = ИнформацияОбОшибке();
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ИнфОбОшибке.Описание;
		СообщениеПользователю.Сообщить();
	КонецПопытки;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура ТранспортПриИзменении(Элемент)
	Если exchange_method = "SabyHttpsClient" Тогда
		ЕстьКомпонентаSabyHttpsClient = ПроверкаНаличияКомпонентыSabyHttpsClient();
		Если Не ЕстьКомпонентаSabyHttpsClient Тогда
			exchange_method = "API";
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

