
&НаКлиенте
Процедура send_invitationsПриИзменении(Элемент)
	УстановитьДоступностьПоляТипОтправкиПриглашения();	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПоляТипОтправкиПриглашения()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлСпособОтправки = ЭлементыФормочки.Найти("грСпособОтправки");
	Если ЭлСпособОтправки = Неопределено Тогда
		ЭлСпособОтправки = ЭлементыФормочки.Найти("send_type");
	КонецЕсли;
	Если ЭлСпособОтправки <> Неопределено И send_invitations = Ложь Тогда
		ЭлСпособОтправки.Видимость = Ложь;
		send_type	 = "Email";
	Иначе
		ЭлементыФормочки.грСпособОтправки.Видимость = Истина;
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Функция ПроверкаНаличияКомпонентыSabyHttpsClient()
	Ответ = ИСТИНА;
	Попытка
		МодульОбъекта = ПолучитьМодульОбъекта();  
		Компонента = МодульОбъекта.ПодключитьКомпонентуSabyHttpsClient(Неопределено);
	Исключение 
		Ответ = ЛОЖЬ; 
		ИнфОбОшибке = ИнформацияОбОшибке();
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ИнфОбОшибке.Описание;
		СообщениеПользователю.Сообщить();
	КонецПопытки;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура ТранспортПриИзменении(Элемент)
	Если exchange_method = "SabyHttpsClient" Тогда
		ЕстьКомпонентаSabyHttpsClient = ПроверкаНаличияКомпонентыSabyHttpsClient();
		Если НЕ ЕстьКомпонентаSabyHttpsClient Тогда
			exchange_method = "API";
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

