
&НаКлиенте
Процедура СкопироватьИдентификаторПодключения(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт 
	#Если НЕ ВебКлиент Тогда
		СистемнаяИнформация = Новый СистемнаяИнформация;
		Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Или ТипПлатформы.Linux_x86_64 Тогда
			ОбъектКопирования = Новый COMОбъект("htmlfile"); 
			ОбъектКопирования.ParentWindow.ClipboardData.SetData("Text", ЭтаФорма.ИдентификаторПодключения);
			ПоказатьОповещениеПользователя(
				,
				,
				"Идентификатор операции помещен в буфер обмена",
				,
				СтатусОповещенияПользователя.Информация);
		КонецЕсли;
	#Иначе  
		ОписаниеПослеОтображенияID = Новый ОписаниеОповещения("ПослеВводаСтрокиБуфераОбмена", ЭтаФорма);
		ПоказатьВводСтроки(ОписаниеПослеОтображенияID, ЭтаФорма.ИдентификаторПодключения, "Идентификатор операции"); 
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьИдентификаторПодключенияНажатие(Команда)
	Если Не ЗначениеЗаполнено(ЭтаФорма.ИдентификаторПодключения) Тогда
		ПослеВыбораСохраненияАлгоритма = Новый ОписаниеОповещения("СкопироватьИдентификаторПодключения", ЭтаФорма);
		ТекстВопроса = НСтр("ru = 'Перед выполнением алгоритма необходимо сохранить настройки';");
		ПоказатьВопрос(ПослеВыбораСохраненияАлгоритма, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Да);

		ПоказатьОповещениеПользователя(
			,
			,
			"Сохраниете операцию робота",
			,
			СтатусОповещенияПользователя.Информация);
		Возврат;
	КонецЕсли;
	СкопироватьИдентификаторПодключения();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтрокиБуфераОбмена(Результат, ДополнительныеПараметры) Экспорт 
	Возврат;
КонецПроцедуры
