
//DynamicDirective

Функция ДополнительныеПоляРоботаПоУмолчанию() Экспорт
	ДопПоля = Новый Массив;	
	ДопПоля.Добавить("Format"); 
	ДопПоля.Добавить("Title"); 
	ДопПоля.Добавить("json_connection"); 
    ДопПоля.Добавить("ConfigId"); 
    ДопПоля.Добавить("SubsystemVersion"); 
    ДопПоля.Добавить("SystemId"); 
    ДопПоля.Добавить("NextRun"); 
    ДопПоля.Добавить("LastRun"); 
    ДопПоля.Добавить("Sync"); 
    ДопПоля.Добавить("StatusID"); 
	ДопПоля.Добавить("Data"); 
	ДопПоля.Добавить("ProductVersion");
    Возврат ДопПоля; 	
КонецФункции
