
&НаКлиенте
Процедура ОбновитьИсториюОбмена(Команда)
	ЗаполнитьИсториюОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОбменаТабличныйДокументПриАктивизации(Элемент)
	ЭлемФормы = ПолучитьЭлементыФормы();
	Если ЭлемФормы.ИсторияОбменаТабличныйДокумент.ТекущаяОбласть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекВерх = ЭлемФормы.ИсторияОбменаТабличныйДокумент.ТекущаяОбласть.Верх;
	Расположениеобласти2 = 2;
	Число3 = 3;
	Число16 = 16;
	
	ИсторияОбменаТабличныйДокумент = РеквизитИсторияОбмена();
	МассивОбластей = Новый Массив();
	Если ТекВерх = 1 Тогда 
		ЯчейкаСтрока =ИсторияОбменаТабличныйДокумент.Область(ТекВерх, 1, ТекВерх, Число16);
	Иначе
		ПоправкаРасположенияНачалоОбласти = ТекВерх % Число3;
		Если ПоправкаРасположенияНачалоОбласти = Расположениеобласти2 Тогда
			НачалоОбласти = ТекВерх;
		ИначеЕсли ПоправкаРасположенияНачалоОбласти = 1 Тогда
			НачалоОбласти = ТекВерх - Расположениеобласти2;
		Иначе 
			НачалоОбласти = ТекВерх - 1;
		КонецЕсли;
	    ЯчейкаСтрока =ИсторияОбменаТабличныйДокумент.Область(НачалоОбласти, 1, НачалоОбласти + Расположениеобласти2, Число16);
	КонецЕсли; 
    МассивОбластей.Добавить(ЯчейкаСтрока);
  	ЭлемФормы.ИсторияОбменаТабличныйДокумент.УстановитьВыделенныеОбласти(МассивОбластей);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОбменаТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	АдресСсылки = Область.Расшифровка;
	Если ЗначениеЗаполнено(Область.Расшифровка) Тогда
		ПараметрыОткрытияОкнаБраузера = Новый Структура;
		ПараметрыОткрытияОкнаБраузера.Вставить("АдресСтраницы", АдресСсылки);
		ПараметрыОткрытияОкнаБраузера.Вставить("Заголовок", "Страница синхронизации"); 
		ОткрытьФормуОбработки("Browser", ПараметрыОткрытияОкнаБраузера, , Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПостроитьОтчетИсторияОбмена(Знач МассивИсторииОбмена)
	МодульОбъекта = МодульОбъекта();
	ИсторияОбменаТабличныйДокумент = РеквизитИсторияОбмена();  
	ИсторияОбменаТабличныйДокумент.Очистить();
	ТаблицаИсторииОбмена = МодульОбъекта.МассивВТаблицуЗначений(МассивИсторииОбмена);	
	ВсегоБлоков = 10;
	Число2 = 2;
	Число4 = 4;
	Число5 = 5;
	Число8 = 8;
	Число12 = 12;
	
	ДатаПредыдущейЗаписи = Дата(1, 1, 1); 
	ТабличныйДокумент = Новый ТабличныйДокумент;
	МакетИсторияОбмена = ПолучитьМакетНаСервере("ИсторияОбмена");
	ОбластьШапка = МакетИсторияОбмена.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	СтрокаТаблицыПерваяОсновная = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Основная");
	СтрокаТаблицыВтораяОсновная = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыВторая|Основная");
	КолонкаКрасный = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Красный");
	КолонкаОранжевый = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Оранжевый");
	КолонкаСиний = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Синий");
	КолонкаЗеленый = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Зеленый");
	КолонкаФиолетовый = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Фиолетовый");
	КолонкаСерый = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Серый");
	КолонкаГолубой = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Голубой");
	ВремяПроцессаОбласть = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыВторая|ВремяПроцессаВертикальное");
	Для Каждого Запись Из ТаблицаИсторииОбмена Цикл  
		ТаблицаРаспределенияКубов = РаспределениеКубовИсторииОбмена(Запись, ВсегоБлоков);  
		СтрокаСинхронизации 	= context_params.ApiUrl+"/ext-sync-doc/page?extSyncDocId="+Запись.ExtSyncDocID;//+"&selectedTab=objects";
		ДатаЗаписи = Запись.Date;
		Если ТипЗнч(ДатаЗаписи) = Тип("Строка") Тогда 
			ДатаЗаписи 				= Дата(ПРАВ(Запись.Date, Число4),СРЕД(Запись.Date, Число4, Число2),ЛЕВ(Запись.Date, Число2));
		КонецЕсли;	
		ВремяЗаписи 			= ЛЕВ(Запись.Time, Число5);
		
		Если ДатаПредыдущейЗаписи <> ДатаЗаписи Тогда
			Если СтрокаТаблицыПерваяОсновная.ТекущаяОбласть <> Неопределено Тогда
				СтрокаТаблицыПерваяОсновная.ТекущаяОбласть.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
			КонецЕсли;
			СтрокаТаблицыПерваяОсновная.Параметры.ДатаЗаписи = Формат(ДатаЗаписи, "ДФ=dd.MM.yy") + "  ";
			СтрокаТаблицыВтораяОсновная.Параметры.ВремяЗаписи = ВремяЗаписи +"   ";
		Иначе  
			Если СтрокаТаблицыПерваяОсновная.ТекущаяОбласть <> Неопределено Тогда
				СтрокаТаблицыПерваяОсновная.ТекущаяОбласть.ЦветТекста = WebЦвета.ТусклоСерый;
			КонецЕсли;
			СтрокаТаблицыПерваяОсновная.Параметры.ДатаЗаписи = ВремяЗаписи + "  ";
			СтрокаТаблицыВтораяОсновная.Параметры.ВремяЗаписи = "";
		КонецЕсли;
		СтрокаТаблицыПерваяОсновная.Параметры.СтрокаСинхронизации = СтрокаСинхронизации;
		СтрокаТаблицыПерваяОсновная.Параметры.Название = Запись.Title;	
		СтрокаТаблицыПерваяОсновная.Параметры.КоличествоОбъектов = Запись.CountObjects;	
		СтрокаТаблицыПерваяОсновная.Параметры.Проценты = Строка(Запись.TotalPercent) + "%";
		ТабличныйДокумент.Вывести(СтрокаТаблицыПерваяОсновная);
		
		ВывестиБлокиВТабличныйДокумент("DonePercent", 	ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаЗеленый); 	
		ВывестиБлокиВТабличныйДокумент("WarningPercent", ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаОранжевый); 	
		ВывестиБлокиВТабличныйДокумент("WritePercent", 	ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаГолубой); 	
		ВывестиБлокиВТабличныйДокумент("PreparePercent", ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаСиний); 	
		ВывестиБлокиВТабличныйДокумент("ErrorPercent", ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаКрасный); 	
		ВывестиБлокиВТабличныйДокумент("IgnorePercent", ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаФиолетовый); 	
		ВывестиБлокиВТабличныйДокумент("WorkPercent", ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаСерый); 	
		
		СтрокаТаблицыВтораяОсновная.Параметры.СтрокаСинхронизации = СтрокаСинхронизации;
		ТабличныйДокумент.Вывести(СтрокаТаблицыВтораяОсновная);
		ВремяПроцессаОбласть.Параметры.СтрокаСинхронизации = СтрокаСинхронизации;
		ВремяПроцессаОбласть.Параметры.ВремяПроцесса = СРЕД(Запись.ElapsedTime, Число12, Число8);
		ТабличныйДокумент.Присоединить(ВремяПроцессаОбласть);
		
		ДатаПредыдущейЗаписи 	= ДатаЗаписи;  															
	КонецЦикла;
	ТабличныйДокумент.ФиксацияСверху = 1;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ИсторияОбменаТабличныйДокумент.Вывести(ТабличныйДокумент);
	ИсторияОбменаТабличныйДокумент.ФиксацияСверху = 1;
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьИсториюОбмена() 
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	СтраницыИстория = ЭлементыФормочки.СтраницаИсторияКонтент;
	СтраницыИстория.ТекущаяСтраница = 
        ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницаИсторияКонтент, "СтраницаИсторияПроцесс");
	Если Не ЗначениеЗаполнено(ЭтаФорма.ИдентификаторПодключения) Тогда
		Возврат;
	КонецЕсли;
	
	Фильтр = Новый Структура("ConnectionId", ЭтаФорма.ИдентификаторПодключения);
	СчетчикСтраниц = 0;
	МассивИсторииОбмена = Новый Массив;
	
	Пока Истина Цикл
		Попытка
			res = ТранспортИнтеграции.local_helper_api3_extsyncdoc_list(
				context_params, 
				Фильтр, 
				Неопределено, 
				Неопределено, 
				СчетчикСтраниц);
			Result =  get_prop(res, "Result");
			СтраницыИстория.ТекущаяСтраница =
		        ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницаИсторияКонтент, "СтраницаИстория");
		Исключение
			СтраницыИстория.ТекущаяСтраница =
		        ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницаИсторияКонтент, "СтраницаИсторияОграничения");
			Возврат;
		КонецПопытки;
		
		Если ТипЗнч(Result) = Тип("Массив") Тогда
			Для Каждого Запись Из Result Цикл   
				МассивИсторииОбмена.Добавить(Запись);
			КонецЦикла;	
		КонецЕсли;
		ДанныеНавигации = get_prop(res, "Navigation");
		Если get_prop(ДанныеНавигации, "HasMore") = Истина Тогда
			СчетчикСтраниц = СчетчикСтраниц + 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ПостроитьОтчетИсторияОбмена(МассивИсторииОбмена);
КонецПроцедуры

&НаСервере
Функция РаспределениеКубовИсторииОбмена(ЗаписьИсторииОбмена, ВсегоКубов)
	ТаблицаРаспределения = Новый ТаблицаЗначений;
	ТаблицаРаспределения.Колонки.Добавить("НазваниеЭтапа");
	ТаблицаРаспределения.Колонки.Добавить("ПроцентыЭтапа");
	ТаблицаРаспределения.Колонки.Добавить("КоличествоКубов");
	
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "DonePercent");
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "WarningPercent");
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "WritePercent");
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "PreparePercent");
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "ErrorPercent");
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "IgnorePercent");
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "WorkPercent");
	
	ТаблицаРаспределения.Сортировать("ПроцентыЭтапа");
	
	Число0 = 0;
	Число1 = 1;
	Число100 = 100;
	Для СчТаблицы = Число0 По ТаблицаРаспределения.Количество() - Число1 Цикл  
		СтрокаТаблицы = ТаблицаРаспределения.Получить(СчТаблицы);
		Если СчТаблицы = ТаблицаРаспределения.Количество() - Число1 Тогда
			СтрокаТаблицы.КоличествоКубов = ВсегоКубов - ТаблицаРаспределения.Итог("КоличествоКубов");
		ИначеЕсли СтрокаТаблицы.ПроцентыЭтапа > Число0 Тогда
			СтрокаТаблицы.КоличествоКубов = Окр(СтрокаТаблицы.ПроцентыЭтапа / Число100 * ВсегоКубов, Число0, РежимОкругления.Окр15как20);	
			Если СтрокаТаблицы.КоличествоКубов = Число0 Тогда
				СтрокаТаблицы.КоличествоКубов = Число1; 
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;	
	КонецЦикла;	
	Возврат ТаблицаРаспределения;
КонецФункции	


&НаСервере
Процедура ВывестиБлокиВТабличныйДокумент(НазваниеБлока, ТаблицаБлоков, ТабличныйДокумент, ОбластьБлока) 
	СтрокаБлока = ТаблицаБлоков.Найти(НазваниеБлока);
	Если СтрокаБлока <> Неопределено Тогда
		КоличествоКубов = СтрокаБлока.КоличествоКубов;
		Сч = 1;
		Пока Сч <= КоличествоКубов Цикл
			ТабличныйДокумент.Присоединить(ОбластьБлока);
			Сч = Сч + 1;
		КонецЦикла;	
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, НазваниеЭтапа)
	НоваяСтрока = ТаблицаРаспределения.Добавить(); 
	НоваяСтрока.НазваниеЭтапа = НазваниеЭтапа;
	Попытка 
		НоваяСтрока.ПроцентыЭтапа = ЗаписьИсторииОбмена[НазваниеЭтапа];
	Исключение 
		НоваяСтрока.ПроцентыЭтапа = 0;
	КонецПопытки;
	НоваяСтрока.КоличествоКубов = 0;	
КонецПроцедуры	
