
Процедура ВыполнитьАвтоматическиеОперации()
	СправочникДополнительныеОтчетыИОбработки = "ДополнительныеОтчетыИОбработки";
	Если Метаданные.Справочники.Найти(СправочникДополнительныеОтчетыИОбработки) = Неопределено Тогда
		ВызватьИсключение "Отсутствует справочник " + СправочникДополнительныеОтчетыИОбработки;
	КонецЕсли;
	ИмяОбработки = НаименованиеОбработкиВСправочнике();
	Обработка = Справочники[СправочникДополнительныеОтчетыИОбработки].НайтиПоНаименованию(ИмяОбработки, Истина); 
	Если Не ЗначениеЗаполнено(Обработка) Тогда
		ВызватьИсключение "В справочнике " + СправочникДополнительныеОтчетыИОбработки + " отсутствует обработка " + ИмяОбработки;
	КонецЕсли;	
	ЭтоВнешняяОбработка = Истина; 
	МодульОбъекта = МодульОбъекта();
	МодульОбъекта.ЗапуститьАвтоматическиеОперацииФоновыеЗадания(Обработка, ЭтоВнешняяОбработка);	
КонецПроцедуры
