
Процедура ВыполнитьАвтоматическиеОперации()
	СправочникДополнительныеОтчетыИОбработки = "ДополнительныеОтчетыИОбработки";
	ИмяОбработки = ЛокализацияНазваниеПродукта();
	Если Метаданные.Справочники.Найти(СправочникДополнительныеОтчетыИОбработки) <> Неопределено 
		И ЗначениеЗаполнено(Справочники[СправочникДополнительныеОтчетыИОбработки].НайтиПоНаименованию(ИмяОбработки))  Тогда 
		Обработка = Справочники[СправочникДополнительныеОтчетыИОбработки].НайтиПоНаименованию(ИмяОбработки);
		ЭтоВнешняяОбработка = Истина; 
		МодульОбъекта = МодульОбъекта();
		МодульОбъекта.ЗапуститьАвтоматическиеОперацииФоновыеЗадания(Обработка, ЭтоВнешняяОбработка);
	КонецЕсли;	
КонецПроцедуры
