
#Область include_core_base_АвтоматическиеОперации_ФильтрыРоботаПоУмолчанию
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ДополнительныеПоляРоботаПоУмолчанию
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ПолучитьАвтоматическиеОперации 
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_СписокАвтоматическихОпераций
#КонецОбласти

Функция ПреобразоватьСтрокуВДатуСЧасовымПоясом(знач Строка) Экспорт    
	Строка = СокрЛП(Строка);
	Если Прав(Строка,3) <> ":00" Тогда
		Строка = Строка + ":00";
	КонецЕсли;
	ДатаСтрокойВФорматеJSON = СтрЗаменить(Строка," ","T"); 
	Попытка 
		Дата = XMLЗначение(Тип("Дата"), ДатаСтрокойВФорматеJSON); 
	Исключение
		Дата = ПреобразоватьСтрокуВДату("yyyy-MM-dd HH:mm:ss",Строка);
	КонецПопытки;	
	Возврат Дата; 
КонецФункции

Процедура ПолучитьАвтоматическиеОперацииФоновыеЗадания(ПараметрыВыполнения, АдресРезультата) Экспорт 
 	Попытка
		Результат = ПолучитьАвтоматическиеОперации(ПараметрыВыполнения.context_param); 
	Исключение 
		Ошибка = ИнформацияОбОшибке();
		Результат = Ошибка;	
	КонецПопытки;	
	ПоместитьВоВременноеХранилище(Результат, ПараметрыВыполнения.АдресРезультата); 
КонецПроцедуры 

#Область include_core_base_АвтоматическиеОперации_ЗапускОперации
#КонецОбласти

Функция СообщениеПрогресса()
	Возврат "СтандартныеПодсистемы.ДлительныеОперации";
КонецФункции

Функция ОпределитьУзелПланаОбменаПоИдентификатору(ИдентификаторУзлаПланОбмена) Экспорт
	Для Каждого План Из ПланыОбмена Цикл
       Выборка = План.Выбрать();
	   Пока Выборка.Следующий() Цикл  
		   
           Если СокрЛП(Выборка.Ссылка.УникальныйИдентификатор()) = ИдентификаторУзлаПланОбмена Тогда
               Возврат Выборка.Ссылка;
           КонецЕсли;
       КонецЦикла;
   КонецЦикла; 	
   Возврат Неопределено;
КонецФункции

Процедура АктивироватьРегламентноеЗаданиеАвтоматическихОпераций() Экспорт 
	ИмяПродукта = ИмяПродукта(); 
	КлючЗадания = ИмяПродукта+"_ЗапускАвтоматическихОпераций";
	Отбор = Новый Структура("Ключ", КлючЗадания);
	НайденныеРегЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	Если НайденныеРегЗадания.Количество() > 0 Тогда 
		РегЗадание = НайденныеРегЗадания.Получить(0);
		Если РегЗадание.Использование = Ложь Тогда
			РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
			РасписаниеЗадания.ПериодПовтораДней = 1;
			РасписаниеЗадания.ПериодПовтораВТечениеДня = 3600; //Раз в час
			РегЗадание.Расписание = РасписаниеЗадания;
			РегЗадание.Использование = Истина;  
			Если НЕ ЗначениеЗаполнено(РегЗадание.ИмяПользователя) Тогда 
				РегЗадание.ИмяПользователя = ИмяПользователя();
			КонецЕсли;	
			РегЗадание.Записать();
        КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

