
&НаКлиенте
Процедура УстановитьНаправление(Команда)
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("2", "⇄  В обе стороны");
	СписокВыбора.Добавить("3", "→ В Saby");
	СписокВыбора.Добавить("4", "← В ИС");
	СписокВыбора.Добавить("1", "x  Отключить");
	ВыборИзСписка(СписокВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВложенныеНаправления(ОбъектОбмена, ПереданноеЗначение)	
	ОбъектОбмена.Направление = ПереданноеЗначение;  
	НаправленияВозможныеОткл	= 1;
	НаправленияВозможныеВОбе	= 2;

	ИзменитьМодифицированность(Истина);
	Если ОбъектОбмена.НаправленияВозможные = НаправленияВозможныеВОбе Тогда
		Возврат;
	КонецЕсли;	
	Если ОбъектОбмена.НаправленияВозможные = НаправленияВозможныеОткл Тогда
		ОбъектОбмена.Направление = НаправленияВозможныеОткл;
	КонецЕсли;	
	Если ОбъектОбмена.НаправленияВозможные <> ОбъектОбмена.Направление Тогда
		Если ОбъектОбмена.Направление = НаправленияВозможныеВОбе Тогда
			ОбъектОбмена.Направление = ОбъектОбмена.НаправленияВозможные;
		Иначе
			ОбъектОбмена.Направление = НаправленияВозможныеОткл;
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораВариантаУстановкиНаправления(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	ЭлементыДерева = СтрокиТаблицы(ДеревоНастроекПодключения);  
	Для Каждого ВеткаДерева ИЗ ЭлементыДерева Цикл   
		СтрокиДерева = СтрокиТаблицы(ВеткаДерева);
		Для Каждого СтрокаДерева Из СтрокиДерева Цикл  
			Если СтрокаДерева.Отметка = Ложь Тогда 
				Продолжить;
			КонецЕсли;
			ИзменитьВложенныеНаправления(СтрокаДерева, Результат.Значение);		
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПодключенияПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ЭлемФормы = ПолучитьЭлементыФормы();
	НаправленияВозможные0		= 0;
	НаправленияВозможныеОткл	= 1;
	НаправленияВозможныеВОбе	= 2;
	НаправленияВозможныеВСБИС	= 3;
	НаправленияВозможныеВИС		= 4;
	
// BSLLS:LineLength-off
	Если ТекущиеДанные <> Неопределено Тогда
		ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.СписокВыбора.Очистить();
		Если ТекущиеДанные.НаправленияВозможные = НаправленияВозможные0 Тогда
			ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.ТолькоПросмотр = Истина;
		Иначе
			ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.ТолькоПросмотр = Ложь;
			Если ТекущиеДанные.НаправленияВозможные = НаправленияВозможныеВОбе Тогда   
				СтрокаСостояния = "⇄  Синхронизировать в обе стороны";
				ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.СписокВыбора.Добавить(НаправленияВозможныеВОбе, СтрокаСостояния);	
			КонецЕсли;
			
			Если ТекущиеДанные.НаправленияВозможные = НаправленияВозможныеВСБИС
				ИЛИ ТекущиеДанные.НаправленияВозможные = НаправленияВозможныеВОбе Тогда
				СтрокаСостояния = "→ В Saby";
				ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.СписокВыбора.Добавить(НаправленияВозможныеВСБИС, СтрокаСостояния);	
			КонецЕсли;
			
			Если ТекущиеДанные.НаправленияВозможные = НаправленияВозможныеВИС 
				ИЛИ ТекущиеДанные.НаправленияВозможные = НаправленияВозможныеВОбе Тогда
				СтрокаСостояния = "← В ИС";
				ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.СписокВыбора.Добавить(НаправленияВозможныеВИС, СтрокаСостояния);	
			КонецЕсли;	
			СтрокаСостояния = "x  Отключено";
			ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.СписокВыбора.Добавить(НаправленияВозможныеОткл, СтрокаСостояния);
		КонецЕсли;		
	КонецЕсли;
// BSLLS:LineLength-on	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМодифицированность(Значение = Истина)
	ЭтаФорма.Модифицированность = Значение;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеревоНастроек()	
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	СтраницыОбъектыСинхронизации = ЭлементыФормочки.ОбъектыСинхронизацииКонтент;
	СтраницыОбъектыСинхронизации.ТекущаяСтраница =
        ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ОбъектыСинхронизацииКонтент, "ОбъектыСинхронизацииОграничения");	
	Если НЕ ЗначениеЗаполнено(РеквизитИдентификаторПодключения()) Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ТаблицаНастроек = BlocklyExecutor.НаправленияСинхронизации(context_params, РеквизитИдентификаторПодключения());
		ЗаполнитьДеревоНастроекНаСервере(ТаблицаНастроек);
		СтраницыОбъектыСинхронизации.ТекущаяСтраница =
	        ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ОбъектыСинхронизацииКонтент, "ОбъектыСинхронизации");	
	Исключение
		СтраницыОбъектыСинхронизации.ТекущаяСтраница =
	        ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ОбъектыСинхронизацииКонтент, "ОбъектыСинхронизацииОграничения");	
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция МассивИзмененныхНаправленийСинхронизации()
	ТаблицаОбъектовНаправлений = Новый ТаблицаЗначений;
	ТаблицаОбъектовНаправлений.Колонки.Добавить("ИмяОбъекта");
	НаправлениеСтрока = "Направление";
	ТаблицаОбъектовНаправлений.Колонки.Добавить(НаправлениеСтрока);
	ДеревоЗначений = ЭлементДеревоНастроекПодключения();
	Для Каждого Ветка ИЗ ДеревоЗначений.Строки Цикл
		Для Каждого СтрокаВетки ИЗ Ветка.Строки Цикл
			НоваяСтрока = ТаблицаОбъектовНаправлений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаВетки);
		КонецЦикла;	
	КонецЦикла;
	
	ТаблицаНаправлений = ТаблицаОбъектовНаправлений.Скопировать();
	ТаблицаНаправлений.Свернуть(НаправлениеСтрока);
	МассивРезультат = Новый Массив;
	Для Каждого ЗаписьНаправление ИЗ ТаблицаНаправлений Цикл	
		Если ЗаписьНаправление.Направление = 0 Тогда
			Продолжить;
		КонецЕсли;	
		ОтборТаблицы = Новый Структура(НаправлениеСтрока, ЗаписьНаправление.Направление);
		ОтборПоНаправлениям = ТаблицаОбъектовНаправлений.НайтиСтроки(ОтборТаблицы);
		МассивДляЗаписи = Новый Массив;
		Для Каждого ЗаписьОтбора ИЗ ОтборПоНаправлениям Цикл
			МассивДляЗаписи.Добавить(ЗаписьОтбора.ИмяОбъекта);
		КонецЦикла;			                                  
		Если МассивДляЗаписи.Количество() > 0 Тогда  	
			params = Новый Структура;
			params.Вставить("ConnectionId", 	РеквизитИдентификаторПодключения());
			params.Вставить("ListTypeObject", 	МассивДляЗаписи);
			params.Вставить("Direction", 		ЗаписьНаправление.Направление); 
			МассивРезультат.Добавить(params);
		КонецЕсли;	
	КонецЦикла;
	Возврат МассивРезультат;	
КонецФункции	

&НаКлиенте
Процедура ИзменитьНаправленияСинхронизации()
	Если ЭтоСинхронизация = Ложь Тогда 
		Возврат;
	КонецЕсли;
	МассивНаправленийСинхронизации = МассивИзмененныхНаправленийСинхронизации();
	Для Каждого params Из МассивНаправленийСинхронизации Цикл 
		ТранспортИнтеграции.local_helper_api3_typesyncobjectmasssetdirection(context_params, params);
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Функция РазобратьНаправлениеПоУмолчанию(ВозможныеНаправления)
	Если ТипЗнч(ВозможныеНаправления) <> Тип("Массив") Тогда
		Возврат 0;
	КонецЕсли;
	ТекущееЗначение = 0;
	Значение2 = 2;
	ОписаниеТипа = Новый ОписаниеТипов("Число");
	Для Каждого ЗначениеМассива Из ВозможныеНаправления Цикл
		Если ТипЗнч(ЗначениеМассива) <> Тип("Соответствие") Тогда 
			Продолжить;
		КонецЕсли;	
		Попытка 
			ЗначениеЧислом = ЗначениеМассива.Получить("key");
		Исключение  
			Продолжить;
		КонецПопытки;
		ЗначениеЧислом = ОписаниеТипа.ПривестиЗначение(ЗначениеЧислом);
		Если ЗначениеЧислом = Значение2 Тогда
			Возврат ЗначениеЧислом;
		КонецЕсли;	
		Если ЗначениеЧислом > ТекущееЗначение Тогда
			ТекущееЗначение = ЗначениеЧислом;	
		КонецЕсли;	
	КонецЦикла;	
	Возврат ТекущееЗначение;
КонецФункции	

&НаСервере
Процедура ЗаполнитьДеревоНастроекНаСервере(Знач ТаблицаНастроек)
	ДеревоЗначений = ЭлементДеревоНастроекПодключения();
	ДеревоЗначений.Строки.Очистить();
    Если ТаблицаНастроек.Количество() > 0 Тогда
		Для Каждого Запись ИЗ ТаблицаНастроек Цикл
			Если get_prop(Запись, "Parent@", Неопределено) = Истина Тогда
				НоваяВетка = ДеревоЗначений.Строки.Добавить();
				НоваяВетка.Объект = get_prop(Запись,"ObjectName","");
			Иначе	
			    НоваяСтрокаВетки = НоваяВетка.Строки.Добавить();
				НоваяСтрокаВетки.Объект 				= get_prop(Запись,"ObjectName","");
				НоваяСтрокаВетки.Направление 			= get_prop(Запись,"SyncStatus","");
				НоваяСтрокаВетки.НаправленияВозможные 	= РазобратьНаправлениеПоУмолчанию(get_prop(Запись,"PossibleStatus",""));
				НоваяСтрокаВетки.ИмяОбъекта 			= get_prop(Запись,"ObjId","");
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
	ОтобразитьДеревоНастроекПодключения(ДеревоЗначений);

КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоНастроекПодключения	

&НаКлиенте
Процедура ПроверитьРодителя(Родитель)
    Если Родитель <> Неопределено Тогда
        СтрокиРодителя = СтрокиТаблицы(Родитель);  
        Родитель.Отметка = Истина;
        Для Каждого СтрокаРодителя Из СтрокиРодителя Цикл
            Если СтрокаРодителя.Отметка = Ложь Тогда
                Родитель.Отметка = Ложь;   
                Прервать;
            КонецЕсли;    
        КонецЦикла;        
    КонецЕсли;        
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажки()  
	ЭлементыДерева = СтрокиТаблицы(ДеревоНастроекПодключения);
	Для Каждого ВеткаДерева ИЗ ЭлементыДерева Цикл   
		СтрокиДерева = СтрокиТаблицы(ВеткаДерева);
		Для Каждого СтрокаДерева Из СтрокиДерева Цикл 
			СтрокаДерева.Отметка = УстановитьСнятьФлажки;
		КонецЦикла;
		ВеткаДерева.Отметка = УстановитьСнятьФлажки;
		ПроверитьРодителя(ВеткаДерева);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПодключенияНаправлениеПриИзменении(Элемент)
	ИзменитьМодифицированность(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПодключенияОтметить(Команда) 
	УстановитьСнятьФлажки = НЕ УстановитьСнятьФлажки;
	УстановитьСнятьФлажки();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПодключенияПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ДанныеСтроки.Направление = 1 Тогда
		ОформлениеСтроки.Ячейки.НаправлениеОтображение.Значение = "x";
	ИначеЕсли ДанныеСтроки.Направление = 2 Тогда
		ОформлениеСтроки.Ячейки.НаправлениеОтображение.Значение = "⇄"; 
	ИначеЕсли ДанныеСтроки.Направление = 3 Тогда
		ОформлениеСтроки.Ячейки.НаправлениеОтображение.Значение = "→"; 
	ИначеЕсли ДанныеСтроки.Направление = 4 Тогда	
		ОформлениеСтроки.Ячейки.НаправлениеОтображение.Значение = "←";
	Иначе
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПодключенияПриИзмененииФлажка(Элемент, Колонка)
	Если Колонка.Имя = "Отметка" Тогда  
		ДеревоНастроекПодключенияОтметкаПриИзменении(Неопределено);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПодключенияОтметкаПриИзменении(Элемент)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ТекущиеДанные = ЭлемФормы.ДеревоНастроекПодключения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		СтрокиДерева = СтрокиТаблицы(ТекущиеДанные);;
		Для Каждого СтрокаДерева ИЗ СтрокиДерева Цикл
			СтрокаДерева.Отметка = ТекущиеДанные.Отметка;	
		КонецЦикла; 
		Родитель = ПолучитьРодителя(ТекущиеДанные);
		ИзменитьМодифицированность(Истина);
 		ПроверитьРодителя(Родитель);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

