
&НаКлиенте
Процедура ТаблицаПодключенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;  
	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("context_param", ЭтаФорма.context_params);	
	ПараметрыПередачи.Вставить("Ключ", Строка(Новый УникальныйИдентификатор));	
	ОткрытьФормуАвтоматическаяОперация(ПараметрыПередачи);	
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаПодключенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытиеЭлементаТаблицыПодключений();
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьАвтоматическиеОперации(Команда)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	
	СтраницыАвтоматическиеОперации = ЭлементыФормочки.АвтоматическиеОперацииКонтент;
	СтраницыАвтоматическиеОперации.ТекущаяСтраница = 
        ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.АвтоматическиеОперацииКонтент, "АвтоматическиеОперацииДлительныйПроцесс");	
	Если Не ЗначениеЗаполнено(РеквизитИдентификаторПодключения()) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОбновитьТаблицуАвтоматическиеОперации();	
		СтраницыАвтоматическиеОперации.ТекущаяСтраница =
	        ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.АвтоматическиеОперацииКонтент, "ГруппаОсновная");	
	Исключение
		СтраницыАвтоматическиеОперации.ТекущаяСтраница =
	        ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.АвтоматическиеОперацииКонтент, "АвтоматическиеОперацииОграничения");	
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОперацию(Команда)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ТекущиеДанные = ЭлемФормы.ТаблицаПодключений.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОповещениеОбУдаленииОперации = Новый ОписаниеОповещения("УдалениеОперации", ЭтаФорма, ТекущиеДанные.Идентификатор); 
		ТекстВопроса = "Вы действительно хотите удалить операцию?";	
		ПоказатьВопрос(ОповещениеОбУдаленииОперации, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УдалениеОперации(Ответ, ИдентификаторОперации) Экспорт  
	ЭлемФормы = ПолучитьЭлементыФормы();
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Результат = УдалитьОперациюНаСервере(ИдентификаторОперации);
		Если Результат = ИСТИНА Тогда
			ЭлемФормы.ТекстДлительнойОперации.Заголовок = "Удаляем автоматическую операцию...";
			ОбновитьТаблицуАвтоматическиеОперации();
		КонецЕсли; 
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция УдалитьОперациюНаСервере(Знач Идентификатор)
	МодульОбъекта = МодульОбъекта();
	params = Новый Структура("id",Идентификатор); 
	res = МодульОбъекта.local_helper_delete_connection(context_params, params);
	Если res = Истина Тогда 
		УзелПланаОбмена = МодульОбъекта.ОпределитьУзелПланаОбменаПоИдентификатору(Идентификатор); 
		Если УзелПланаОбмена <> Неопределено Тогда 
			Попытка 
				ОбменДаннымиСервер.УдалитьНастройкуСинхронизации(УзелПланаОбмена);
			Исключение	 
				УдалениеУзлаОбмена(УзелПланаОбмена);
			КонецПопытки;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат res;
КонецФункции

&НаКлиенте
Процедура ТаблицаПодключенийПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ОткрытиеЭлементаТаблицыПодключений();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодключенийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	УдалитьОперацию(Неопределено);	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуАвтоматическаяОперация(ПараметрыПередачи)
	Попытка
	    ОткрытьФормуОбработки("РоботОперация", ПараметрыПередачи, ЭтаФорма.ВладелецФормы, ПараметрыПередачи.Ключ);
		ПоказатьСкрытьОшибкуПолученияДанных(ЛОЖЬ, "");	
	Исключение  
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		Если ОшибкаСтруктура <> Неопределено Тогда
			ТекстОшибки = ExtExceptionToMessage(ОшибкаСтруктура); 
			ПоказатьСкрытьОшибкуПолученияДанных(ИСТИНА, ТекстОшибки);
		КонецЕсли;
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеЭлементаТаблицыПодключений()
	ЭлемФормы = ПолучитьЭлементыФормы();
	ТекущиеДанные = ЭлемФормы.ТаблицаПодключений.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда	
		ПараметрыПередачи = Новый Структура;
		ПараметрыПередачи.Вставить("context_param", 				ЭтаФорма.context_params);	
		ПараметрыПередачи.Вставить("Сервис",						ТекущиеДанные.Сервис); 
		ПараметрыПередачи.Вставить("Версия",						ТекущиеДанные.Версия);
		ПараметрыПередачи.Вставить("Подсистема",					ТекущиеДанные.Подсистема);
		ПараметрыПередачи.Вставить("Идентификатор",					ТекущиеДанные.Идентификатор);
		ПараметрыПередачи.Вставить("Ключ",							ТекущиеДанные.Идентификатор);
		ПоказатьСкрытьОшибкуПолученияДанных(ЛОЖЬ, "");
		ОткрытьФормуАвтоматическаяОперация(ПараметрыПередачи);	
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
Процедура ПоказатьСкрытьОшибкуПолученияДанных(Показать, ТекстОшибки) 
	Если Показать Тогда  
// BSLLS:DeprecatedMessage-off
		Сообщить(ТекстОшибки, СтатусСообщения.Внимание);
// BSLLS:DeprecatedMessage-on
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуАвтоматическиеОперации() 
	ТаблицаПодключений.Очистить();
	connection_uuid = get_prop(context_params, "ConnectionUuid");
	мИниФайлов = Неопределено;
	ЗначениеПраметра = Новый Структура("id", connection_uuid);
	params	= Новый Структура("props, ini", ЗначениеПраметра, мИниФайлов);
	res = ТранспортИнтеграции.local_helper_integration_api(
		context_params,
		"IntegrationConnection.ReadConnection",
		params,
		"int-settings");
    Parent = get_prop(res, "parent");
	Если ЗначениеЗаполнено(Parent) Тогда
		ТранспортИнтеграции.ЗаписатьСвойствоParent(context_params, , Parent);
	КонецЕсли;		
	АвтоматическиеОперации = ПолучитьАвтоматическиеОперации(context_params);
	ЗаполнитьОперации(АвтоматическиеОперации);
КонецПроцедуры

Процедура ЗаполнитьОперации(МассивОпераций)
	МодульОбъекта = МодульОбъекта();
	Число100 = 100;
	Если ТипЗнч(МассивОпераций) = Тип("Массив") Тогда
		Для Каждого Запись ИЗ МассивОпераций Цикл	
			НоваяСтрока = ТаблицаПодключений.Добавить();
			НоваяСтрока.Название = get_prop(Запись,"Title","");
			НоваяСтрока.Проблема = Ложь;
			НоваяСтрока.Активность = get_prop(Запись,"Sync",Ложь);
			НоваяСтрока.Идентификатор = get_prop(Запись,"Uuid","");
			НоваяСтрока.Сервис = get_prop(Запись,"Format","");
			НоваяСтрока.Подсистема = get_prop(Запись,"ConfigId","");
			НоваяСтрока.Версия = Формат(get_prop(Запись,"SubsystemVersion",""),"ЧГ=");
			NextRun = get_prop(Запись,"NextRun","");
			Если ЗначениеЗаполнено(NextRun) Тогда
				НоваяСтрока.СледующийЗапуск = МодульОбъекта.ПреобразоватьСтрокуВДатуСЧасовымПоясом(NextRun);
			КонецЕсли;
			LastRun = get_prop(Запись,"LastRun","");
			Если ЗначениеЗаполнено(LastRun) Тогда
				НоваяСтрока.ПоследнийЗапуск = МодульОбъекта.ПреобразоватьСтрокуВДатуСЧасовымПоясом(LastRun);
			КонецЕсли;
			Статус = get_prop(Запись,"StatusID",Неопределено);
			НоваяСтрока.Проблема = Ложь;
			Если Статус <> Неопределено И Статус > 0 И Статус <> Число100 Тогда 
				НоваяСтрока.Проблема = Истина;					
			КонецЕсли;	
		КонецЦикла;
	ИначеЕсли ТипЗнч(МассивОпераций) = Тип("ИнформацияОбОшибке") Тогда
		ОшибкаПолученияДанных = ExtExceptionToMessage(ExtExceptionAnalyse(МассивОпераций));
// BSLLS:DeprecatedMessage-off
		Сообщить(ОшибкаПолученияДанных, СтатусСообщения.Внимание);
// BSLLS:DeprecatedMessage-on
	Иначе
		Возврат;
	КонецЕсли;	
КонецПроцедуры

