
&НаСервере

Функция ПолучитьМакетНаСервере(ИмяМакета)  
	Обработка =  РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
КонецФункции

Функция РеквизитИсторияОбмена()
	Возврат ИсторияОбменаТабличныйДокумент;
КонецФункции

&НаКлиенте

Процедура ВыборИзСписка(СписокВыбора)
	ПослеВыбораВариантаУстановкиНаправления = Новый ОписаниеОповещения("ПослеВыбораВариантаУстановкиНаправления", ЭтаФорма);
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлементУстановитьСнятьФлажки = ЭлемФормы.ДеревоНастроекПодключенияУстановитьНаправление;
	ПоказатьВыборИзСписка(ПослеВыбораВариантаУстановкиНаправления, СписокВыбора, ЭлементУстановитьСнятьФлажки);	
КонецПроцедуры

&НаСервере

Процедура ОтобразитьДеревоНастроекПодключения(ДеревоЗначений)
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоНастроекПодключения");
	// Без этого кода дерево становится в свернутом виде после обновления формы
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере(); 
	ЭлемФормы.ДеревоНастроекПодключения.НачальноеОтображениеДерева = НачальноеОтображениеДерева.НеРаскрывать;	
	ЭлемФормы.ДеревоНастроекПодключения.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;	
КонецПроцедуры

&НаСервере

Функция ЭлементДеревоНастроекПодключения() 
	Возврат РеквизитФормыВЗначение("ДеревоНастроекПодключения");	
КонецФункции
