
Функция ПолучитьМакетНаСервере(ИмяМакета)  
	Макет = ЭтотОбъект.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
КонецФункции

Функция РеквизитИсторияОбмена()
    ЭлемФормы = ПолучитьЭлементыФормы();
    Возврат ЭлемФормы.ИсторияОбменаТабличныйДокумент;
КонецФункции

Процедура ВыборИзСписка(СписокВыбора)
	Результат = ВыбратьИзМеню(СписокВыбора, ЭлементыФормы.ДеревоНастроекПодключенияУстановитьНаправление);	
    ПослеВыбораВариантаУстановкиНаправления(Результат, Неопределено);
КонецПроцедуры

Процедура ОтобразитьДеревоНастроекПодключения(ДеревоЗначений) 
	ЭтаФорма.ДеревоНастроекПодключения = ДеревоЗначений;
КонецПроцедуры

&НаСервере
Функция ЭлементДеревоНастроекПодключения() 
	Возврат ЭтаФорма.ДеревоНастроекПодключения;	
КонецФункции
