
Функция ПолучитьМакетНаСервере(ИмяМакета)  
	Макет = ЭтотОбъект.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
КонецФункции

Функция РеквизитИсторияОбмена()
    ЭлемФормы = ПолучитьЭлементыФормы();
    Возврат ЭлемФормы.ИсторияОбменаТабличныйДокумент;
КонецФункции

Процедура ВыборИзСписка(СписокВыбора)
	Результат = ВыбратьИзМеню(СписокВыбора, ЭлементыФормы.ДеревоНастроекПодключенияУстановитьНаправление);	
    ПослеВыбораВариантаУстановкиНаправления(Результат, Неопределено);
КонецПроцедуры

Процедура ОтобразитьДеревоНастроекПодключения(ДеревоЗначений) 
	ЭтаФорма.ДеревоНастроекПодключения = ДеревоЗначений;
КонецПроцедуры

&НаСервере
Функция ЭлементДеревоНастроекПодключения() 
	Возврат ЭтаФорма.ДеревоНастроекПодключения;	
КонецФункции

Процедура ДеревоНастроекПодключенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя <> "НаправлениеОтображение" Тогда 
		Возврат;
	КонецЕсли;	
	СтандартнаяОбработка = Ложь;
	СписокВыбора = Новый СписокЗначений;
	Если ВыбраннаяСтрока.НаправленияВозможные <> 0 Тогда
		Если ВыбраннаяСтрока.НаправленияВозможные = 2 Тогда
			СтрокаСостояния = "⇄  Синхронизировать в обе стороны";
			СписокВыбора.Добавить(2,СтрокаСостояния);	
		КонецЕсли;
		
		Если ВыбраннаяСтрока.НаправленияВозможные = 3
			ИЛИ ВыбраннаяСтрока.НаправленияВозможные = 2 Тогда
			СтрокаСостояния = "→ В СБИС";
			СписокВыбора.Добавить(3,СтрокаСостояния);	
		КонецЕсли;
		
		Если ВыбраннаяСтрока.НаправленияВозможные = 4 
			ИЛИ ВыбраннаяСтрока.НаправленияВозможные = 2 Тогда
			СтрокаСостояния = "← в ИС";
			СписокВыбора.Добавить(4,СтрокаСостояния);	
		КонецЕсли;	
		СтрокаСостояния = "x  Отключено";
		СписокВыбора.Добавить(1,СтрокаСостояния);
	КонецЕсли;
	ВидОбмена = ВыбратьИзМеню(СписокВыбора,Элемент);  
	Если ВидОбмена <> Неопределено Тогда
		ВыбраннаяСтрока.Направление = ВидОбмена.Значение;
		Этаформа.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьРодителя(Элемент)
	Возврат Элемент.Родитель;
КонецФункции

