
//DynamicDirective

Функция ПолучитьАвтоматическиеОперации(context_param, ДополнительныйФильтр = Неопределено) Экспорт	
	Фильтры = ФильтрыРоботаПоУмолчанию(ДополнительныйФильтр); 
    ДопПоля = ДополнительныеПоляРоботаПоУмолчанию();
	СчетчикСтраниц = 0;
	ИтоговыйМассив = Новый Массив;
	Пока Истина Цикл  
		res = ТранспортИнтеграции.local_helper_api3_connection_list(context_param, Фильтры, ДопПоля, Неопределено, СчетчикСтраниц); 	
		Результат = res.Получить("Result");
		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			Для Каждого ЗаписьОперация Из Результат Цикл 
				Если ПроверкаПоДополнительномуФильтру(ЗаписьОперация, ДополнительныйФильтр) Тогда
	            	ИтоговыйМассив.Добавить(ЗаписьОперация);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		
		Если res.Получить("Navigation") <> Неопределено
			И res["Navigation"].Получить("HasMore") = Истина Тогда
			СчетчикСтраниц = СчетчикСтраниц + 1;
		Иначе
			Прервать;
		КонецЕсли;

	КонецЦикла;	
	Возврат ИтоговыйМассив;
КонецФункции
