
&НаКлиенте
Процедура ПроверитьОтправку(Команда)
	Если ПустаяСтрока(ЭтаФорма.ЭлектроннаяПочтаДляРассылки) Тогда
		ПоказатьОповещениеПользователя(
			"Ошибка отправки", ,
			"Укажите e-mail получателя"
			, ,СтатусОповещенияПользователя.Важное);
		Возврат;
	КонецЕсли;
	ФормаТранспорта = ПолучитьФормуТранспорта(ЭтаФорма.context_params);
	Попытка
		ФормаТранспорта.SabySendMail(
			"Тестовое письмо Автоматической операции",
			ЭтаФорма.ЭлектроннаяПочтаДляРассылки, "");
			
		ПоказатьОповещениеПользователя(
			"Письмо успешно отправлено", , ""
			, ,СтатусОповещенияПользователя.Важное);
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		ПоказатьОповещениеПользователя(
			"Ошибка отправки", ,
			СтруктураОшибки.message
			, ,СтатусОповещенияПользователя.Важное);
	КонецПопытки;
КонецПроцедуры

