
&НаКлиенте
Процедура ПроверитьОтправку(Команда)
	Если ПустаяСтрока(ЭтаФорма.ЭлектроннаяПочтаДляРассылки) Тогда
		ПоказатьОповещениеПользователя(
			"Укажите e-mail адрес(а) получателя", ,
			"Отсутствуют e-mail адреса"
			, ,СтатусОповещенияПользователя.Важное);
		Возврат;
	КонецЕсли;
	ФормаТранспорта = ПолучитьФормуТранспорта(ЭтаФорма.context_params);
	Попытка
		СтатусОтправки = "завершилась с ошибкой";
		Если ФормаТранспорта.SabySendMail(
			"Тестовое письмо Автоматической операции",
			ЭтаФорма.ЭлектроннаяПочтаДляРассылки, "") = Истина Тогда
			СтатусОтправки = "успешна";		
		КонецЕсли;
		ПоказатьОповещениеПользователя(
			"Тестовое письмо Автоматической операции", ,
			"Отправка e-mail " + СтатусОтправки
			, ,СтатусОповещенияПользователя.Важное);
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		ПоказатьОповещениеПользователя(
			"Произошла ошибка при попытке отправки e-mail", ,
			СтруктураОшибки.message
			, ,СтатусОповещенияПользователя.Важное);
	КонецПопытки;
КонецПроцедуры

