
Функция ЗапуститьАвтоматическиеОперацииФоновыеЗадания(ИмяОбработки, ЭтоВнешняяОбработка) Экспорт 
	УстановитьОтключениеБезопасногоРежима(ИСТИНА);
	context_param = ПроверитьНаличиеПараметровПодключения();
	
	Фильтры = ФильтрыРоботаПоУмолчанию(); 
	ДопПоля = ДополнительныеПоляРоботаПоУмолчанию();
	СписокФЗ = Новый Массив;
	СчетчикСтраниц = 0;
	ЕстьЕще = Истина;
	Пока ЕстьЕще Цикл  
		Попытка 
			res = local_helper_api3_connection_for_run(context_param, Фильтры, ДопПоля, Неопределено, СчетчикСтраниц);
		Исключение 
			ИнфОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение(ExtExceptionToMessage(ЗначениеИзСтрокиВнутр(ИнфОбОшибке.Описание)));
		КонецПопытки;
			
		Navigation = get_prop(res,"Navigation",Неопределено);
		ЕстьЕще = get_prop(Navigation,"HasMore",Ложь);	
		СчетчикСтраниц = СчетчикСтраниц + 1;
		Результат = res.Получить("Result");  
	
		Если ТипЗнч(Результат) <> Тип("Массив") Тогда  
			Продолжить;
		КонецЕсли;	
		ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("ИмяОбработки",			ИмяОбработки);
		ПараметрыЗадания.Вставить("ИмяМетода",				"ЗапуститьАвтоматическуюОперацию");
		ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка);
		Для Каждого ЗаписьОперация ИЗ Результат Цикл
			ЗаписьОперация.Вставить("ИмяОбработки", 		ИмяОбработки);
			ЗаписьОперация.Вставить("ЭтоВнешняяОбработка",  ЭтоВнешняяОбработка);
			ПараметрыФоновогоЗадания = Новый Массив;
			ПараметрыФоновогоЗадания.Добавить(ЗаписьОперация);
			ПараметрыФоновогоЗадания.Добавить(context_param);
			ПараметрыЗадания.Вставить("ПараметрыВыполнения",	ПараметрыФоновогоЗадания);
			
			УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор;	
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификаторЗадания);
			ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение "+ЛокализацияНазваниеПродукта()+" "+ЗаписьОперация.Получить("Title")+"'");
			ПараметрыВыполнения.ЗапуститьВФоне = Истина;
			ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификаторЗадания); 	
			Результат = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);  
			
			// TO DO 
			ИдентификаторЗадания = get_prop(Результат,"ИдентификаторЗадания", Неопределено); 
			Если ИдентификаторЗадания = Неопределено Тогда 
				Продолжить;
			КонецЕсли;	
			ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
			Если ФоновоеЗадание <> Неопределено Тогда
				СписокФЗ.Добавить(ФоновоеЗадание);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	УстановитьОтключениеБезопасногоРежима(ЛОЖЬ);	
	Возврат СписокФЗ;
КонецФункции

