
Процедура ЗапуститьАвтоматическуюОперациюФоновымЗаданием(ПараметрыЗадания, СписокФЗ, ВыполняемыйМетод, НаименованиеФоновогоЗадания) 
	УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор;	
	ИмяМодуляДлительныеОперации = ИмяМодуляДлительныеОперации();
	Если ИмяМодуляДлительныеОперации = Неопределено Тогда
		ВызватьИсключение "Отсутствует модуль для запуска длительной операции (Saby)";
	КонецЕсли;
	ДлительныеОперацииОбщийМодуль = ОбщийМодульЗначение(ИмяМодуляДлительныеОперации);	
	
	ПараметрыВыполнения = ДлительныеОперацииОбщийМодуль.ПараметрыВыполненияВФоне(УникальныйИдентификаторЗадания);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификаторЗадания); 	
	Результат = ДлительныеОперацииОбщийМодуль.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);  
	
	// TO DO 
	ИдентификаторЗадания = get_prop(Результат, "ИдентификаторЗадания", Неопределено); 
	Если ИдентификаторЗадания = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если ФоновоеЗадание <> Неопределено Тогда
		СписокФЗ.Добавить(ФоновоеЗадание);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокЗависшихАвтоматическиеОперации(context_param)
	ФильтрЗависшихЗадач = Новый Структура("StatusID", 50);
 	АвтоматическиеОперации = ПолучитьАвтоматическиеОперации(context_param, ФильтрЗависшихЗадач);
    Возврат АвтоматическиеОперации;
КонецФункции

Функция ФоновоеЗаданиеЗапущено(НаименованиеФоновогоЗадания) 
	Отбор = Новый Структура("Наименование, Состояние", НаименованиеФоновогоЗадания, СостояниеФоновогоЗадания.Активно);
	СписокФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если СписокФоновыхЗаданий.Количество() > 0 Тогда 
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;	
КонецФункции   

Функция НаименованиеАвтоматическойОперации(АвтоматическаяОперация)  
	НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение " + ЛокализацияНазваниеПродукта( )+ " " + АвтоматическаяОперация.Получить("Title") + "'");
	Возврат НаименованиеФоновогоЗадания;	
КонецФункции

Процедура ПроверкаВыполненияАвтоматическихОперацийВ1С(МассивАвтоматическихОпераций)
	СчетчикАвтоматическихОпераций = МассивАвтоматическихОпераций.Количество() - 1;
	Пока СчетчикАвтоматическихОпераций >= 0 Цикл  
		АвтоматическаяОперация = МассивАвтоматическихОпераций.Получить(СчетчикАвтоматическихОпераций); 
		НаименованиеФоновогоЗадания = НаименованиеАвтоматическойОперации(АвтоматическаяОперация);
		Если ФоновоеЗаданиеЗапущено(НаименованиеФоновогоЗадания) Тогда 
			МассивАвтоматическихОпераций.Удалить(СчетчикАвтоматическихОпераций);	
		КонецЕсли;  
		СчетчикАвтоматическихОпераций = СчетчикАвтоматическихОпераций - 1;
	КонецЦикла;
КонецПроцедуры

Функция ПоследняяОперацияОбменаНаПодключении(Подключение, context_params)          
	ConnectionId = get_prop(Подключение, "Uuid");
	Если ConnectionId = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	
	Фильтр = Новый Структура("ConnectionId", get_prop(Подключение, "Uuid")); 
	Результат = local_helper_exec_integration_list_method(context_params, "API3.ExtSyncDocList", "integration-sync", Фильтр, 0, 1, Неопределено, Неопределено);
	СписокОпераций =  get_prop(Результат, "Result");
	Если ТипЗнч(СписокОпераций) = Тип("Массив") И СписокОпераций.Количество() > 0 Тогда
		Операция = СписокОпераций.Получить(0);
		Возврат Операция;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Процедура ЗаполнитьСостояниеОбмена(МассивАвтоматическихОпераций, context_params)
	Для Каждого Подключение Из МассивАвтоматическихОпераций Цикл 
		ПоследняяОперация = get_prop(Подключение, "ПоследняяОперация"); 
		Если ПоследняяОперация = Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		ОбъектовОбработано = 0;  
		ExtSyncDocID = get_prop(ПоследняяОперация, "ExtSyncDocId");    
		
		result = ТранспортИнтеграции.local_helper_extsyncdoc_read(context_params, ExtSyncDocID);
		ОбъектовПроигнорировано = get_prop(result, "CountIgnored", 0);
		ОбъектовСОшибками = get_prop(result, "CountErrors", 0);
		ОбъектовЗагружено = get_prop(result, "CountConfirmed", 0);  
		ОбъектовОбработано = ОбъектовПроигнорировано + ОбъектовСОшибками + ОбъектовЗагружено; 
		Если get_prop(Подключение, "ОбъектовОбработано") = Неопределено Тогда 
			Подключение.Вставить("ОбъектовОбработано", ОбъектовОбработано);
		Иначе
			Подключение.Вставить("ОбъектовОбработаноСпустяМинуту", ОбъектовОбработано);
		КонецЕсли;	
	КонецЦикла; 		
КонецПроцедуры

Процедура ЗаполнитьСостояниеПоследнейВыполненнойОперации(МассивАвтоматическихОпераций, context_params) 
	// Заполняем последние операции
	Для Каждого Запись Из МассивАвтоматическихОпераций Цикл
		ПоследняяОперация = ПоследняяОперацияОбменаНаПодключении(Запись, context_params);	
		Запись.Вставить("ПоследняяОперация", ПоследняяОперация);
	КонецЦикла;		
КонецПроцедуры

Процедура ПроверкаВыполненияАвтоматическихОперацийНаБЛ(МассивАвтоматическихОпераций, context_params)
	ЗаполнитьСостояниеПоследнейВыполненнойОперации(МассивАвтоматическихОпераций, context_params); 
	ЗаполнитьСостояниеОбмена(МассивАвтоматическихОпераций, context_params);
	ТранспортИнтеграции.local_helper_pause(61);	
	ЗаполнитьСостояниеОбмена(МассивАвтоматическихОпераций, context_params);
	СчетчикАвтоматическихОпераций = МассивАвтоматическихОпераций.Количество() - 1;
	Пока СчетчикАвтоматическихОпераций >= 0 Цикл  
		АвтоматическаяОперация = МассивАвтоматическихОпераций.Получить(СчетчикАвтоматическихОпераций); 
		Если get_prop(АвтоматическаяОперация, "ОбъектовОбработано") <> get_prop(АвтоматическаяОперация, "ОбъектовОбработаноСпустяМинуту") Тогда
			МассивАвтоматическихОпераций.Удалить(СчетчикАвтоматическихОпераций);	
		КонецЕсли;		
		СчетчикАвтоматическихОпераций = СчетчикАвтоматическихОпераций - 1;
	КонецЦикла;
КонецПроцедуры	

Функция КодыЗавершенныеСтатусыОбмена()  
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(10); // При первом успешном завершении операции
	МассивСтатусов.Добавить(21); // Завершена операция интеграции
	МассивСтатусов.Добавить(101); // При первом успешном завершении операции 
	Возврат МассивСтатусов; 
КонецФункции

Процедура ПроверкаВыполненияАвтоматическихОпераций(МассивАвтоматическихОпераций, context_params) 
	ПроверкаВыполненияАвтоматическихОперацийВ1С(МассивАвтоматическихОпераций);
	ПроверкаВыполненияАвтоматическихОперацийНаБЛ(МассивАвтоматическихОпераций, context_params);	
КонецПроцедуры	

Процедура ПерезапуститьЗависшиеАвтоматическиеОперации(context_params, ИмяОбработки, ЭтоВнешняяОбработка, СписокФЗ)  Экспорт
	АвтоматическиеОперации = ПолучитьСписокЗависшихАвтоматическиеОперации(context_params); 
	ПроверкаВыполненияАвтоматическихОпераций(АвтоматическиеОперации, context_params); 
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяОбработки",					ИмяОбработки); 
	Если ТипЗнч(ИмяОбработки) <> Тип("Строка") Тогда
		ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка",	ИмяОбработки); 	
	КонецЕсли;
	ПараметрыЗадания.Вставить("ИмяМетода",				"ЗапуститьАвтоматическуюОперацию");
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка);
	ИмяМодуляДлительныеОперации = ИмяМодуляДлительныеОперации();
	Если ИмяМодуляДлительныеОперации = Неопределено Тогда
		ВызватьИсключение "Отсутствует модуль для запуска длительной операции (Saby)";
	КонецЕсли;
	ВыполняемыйМетод = ИмяМодуляДлительныеОперации + ".ВыполнитьПроцедуруМодуляОбъектаОбработки";
	Для Каждого ЗаписьОперация Из АвтоматическиеОперации Цикл
		Если get_prop(ЗаписьОперация, "StatusID") <> 50 Тогда  
			Продолжить;
		КонецЕсли;	   
		ЗаписьОперация.Вставить("ИмяОбработки", 		ИмяОбработки);
		ЗаписьОперация.Вставить("ЭтоВнешняяОбработка",  ЭтоВнешняяОбработка);
		ПоследняяОперация = get_prop(ЗаписьОперация, "ПоследняяОперация"); 
		ContextId = get_prop(ПоследняяОперация, "ExtSyncDocId");
		ПараметрыВыполнения = Новый Массив;
		ПараметрыВыполнения.Добавить(ЗаписьОперация);
		ПараметрыВыполнения.Добавить(context_params);
		ПараметрыВыполнения.Добавить(ContextId);
		
		Попытка       
			ПараметрыЗадания.Вставить("ПараметрыВыполнения",	ПараметрыВыполнения);  
			НаименованиеФоновогоЗадания = НаименованиеАвтоматическойОперации(ЗаписьОперация);
			ЗапуститьАвтоматическуюОперациюФоновымЗаданием(ПараметрыЗадания, СписокФЗ, ВыполняемыйМетод, НаименованиеФоновогоЗадания);
		Исключение 
			ЗапуститьАвтоматическуюОперацию(ПараметрыВыполнения, Строка(Новый УникальныйИдентификатор));
		КонецПопытки;	
	КонецЦикла;	
КонецПроцедуры	
	
Функция ПараметрыЗаданияАвтоматическойОперации(ИмяОбработки, ЭтоВнешняяОбработка) 
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяОбработки",					ИмяОбработки); 
	Если ТипЗнч(ИмяОбработки) <> Тип("Строка") Тогда
		ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка",	ИмяОбработки); 	
	КонецЕсли;
	ПараметрыЗадания.Вставить("ИмяМетода",				"ЗапуститьАвтоматическуюОперацию");
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка);
	Возврат ПараметрыЗадания;	
КонецФункции	
	
Процедура ПроверитьВозможностьЗапускаАвтоматическихОперацийФоновымЗаданием(context_param)  
	Если context_param = Неопределено Тогда
		ВызватьИсключение "Не заполнены параметры подключения к Saby";
	КонецЕсли;
	ДопустимыеВидыТранспорта = Новый Массив;
	ДопустимыеВидыТранспорта.Добавить("API"); 
	ДопустимыеВидыТранспорта.Добавить("SabyHttpsClient"); 
	ТекущийВидТранспорта = ВидТранспорта(context_param); 
	
	Если ДопустимыеВидыТранспорта.Найти(ТекущийВидТранспорта) = Неопределено Тогда
		ВызватьИсключение "Выполнение автоматических операций возможно только при способах обмена API и SabyHttpsClient";
	КонецЕсли;	
КонецПроцедуры
	
Функция ЗапуститьАвтоматическиеОперацииФоновыеЗадания(ИмяОбработки, ЭтоВнешняяОбработка) Экспорт 
	
	#Область include_core_base_Helpers_УстановитьОтключениеБезопасногоРежимаИстина
	#КонецОбласти

	ОбновитьНастройкиПодключенияПриНачалеРаботы();
	context_params = ПроверитьНаличиеПараметровПодключения();
	
	ПроверитьВозможностьЗапускаАвтоматическихОперацийФоновымЗаданием(context_params);
	
	СписокФЗ = Новый Массив;
	
	ПерезапуститьЗависшиеАвтоматическиеОперации(context_params, ИмяОбработки, ЭтоВнешняяОбработка, СписокФЗ);
	
	Фильтры = ФильтрыРоботаПоУмолчанию(); 
	ДопПоля = ДополнительныеПоляРоботаПоУмолчанию();
	СчетчикСтраниц = 0;
	ЕстьЕще = Истина;
	ИмяМодуляДлительныеОперации = ИмяМодуляДлительныеОперации();
	Если ИмяМодуляДлительныеОперации = Неопределено Тогда
		ВызватьИсключение "Отсутствует модуль для запуска длительной операции (Saby)";
	КонецЕсли;
	СтатусыОбменаЗавершенные = КодыЗавершенныеСтатусыОбмена();
	ВыполняемыйМетод = ИмяМодуляДлительныеОперации + ".ВыполнитьПроцедуруМодуляОбъектаОбработки";
	Пока ЕстьЕще Цикл  
		Попытка 
			res = local_helper_api3_connection_for_run(context_params, Фильтры, ДопПоля, Неопределено, СчетчикСтраниц);
		Исключение 
			ИнфОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение(ExtExceptionToMessage(ЗначениеИзСтрокиВнутр(ИнфОбОшибке.Описание)));
		КонецПопытки;
			
		Navigation = get_prop(res,"Navigation",Неопределено);
		ЕстьЕще = get_prop(Navigation,"HasMore",Ложь);	
		СчетчикСтраниц = СчетчикСтраниц + 1;
		АвтоматическиеОперации = res.Получить("Result");  
	
		Если ТипЗнч(АвтоматическиеОперации) <> Тип("Массив") Тогда  
			Продолжить;
		КонецЕсли;
		ПроверкаВыполненияАвтоматическихОпераций(АвтоматическиеОперации, context_params); 
	
		ПараметрыЗадания = ПараметрыЗаданияАвтоматическойОперации(ИмяОбработки, ЭтоВнешняяОбработка);
		Для Каждого ЗаписьОперация ИЗ АвтоматическиеОперации Цикл
			ЗаписьОперация.Вставить("ИмяОбработки", 		ИмяОбработки);
			ЗаписьОперация.Вставить("ЭтоВнешняяОбработка",  ЭтоВнешняяОбработка);
			ПараметрыВыполнения = Новый Массив;
			ПараметрыВыполнения.Добавить(ЗаписьОперация);
			ПараметрыВыполнения.Добавить(context_params);
			ПоследняяОперация = get_prop(ЗаписьОперация, "ПоследняяОперация"); 
			Status = get_prop(ПоследняяОперация, "Status");
			Если ПоследняяОперация <> Неопределено И СтатусыОбменаЗавершенные.Найти(Status) = Неопределено Тогда
				ContextId = get_prop(ПоследняяОперация, "ExtSyncDocId");
				ПараметрыВыполнения.Добавить(ContextId);
			КонецЕсли;

			Попытка       
				НаименованиеФоновогоЗадания = НаименованиеАвтоматическойОперации(ЗаписьОперация);
				ПараметрыЗадания.Вставить("ПараметрыВыполнения",	ПараметрыВыполнения);
				ЗапуститьАвтоматическуюОперациюФоновымЗаданием(ПараметрыЗадания, СписокФЗ, ВыполняемыйМетод, НаименованиеФоновогоЗадания);
			Исключение 
				ЗапуститьАвтоматическуюОперацию(ПараметрыВыполнения, Строка(Новый УникальныйИдентификатор));
			КонецПопытки;	
		КонецЦикла;
		
	КонецЦикла;	
	Возврат СписокФЗ;
КонецФункции
