
Процедура ЗапуститьАвтоматическуюОперациюФоновымЗаданием(ПараметрыЗадания, СписокФЗ, ВыполняемыйМетод, НаименованиеФоновогоЗадания) 
	УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор;	
	ДлительныеОперацииОбщийМодуль = ОбщийМодульЗначение("ДлительныеОперации");	
	
	ПараметрыВыполнения = ДлительныеОперацииОбщийМодуль.ПараметрыВыполненияВФоне(УникальныйИдентификаторЗадания);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификаторЗадания); 	
	Результат = ДлительныеОперацииОбщийМодуль.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);  
	
	// TO DO 
	ИдентификаторЗадания = get_prop(Результат, "ИдентификаторЗадания", Неопределено); 
	Если ИдентификаторЗадания = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если ФоновоеЗадание <> Неопределено Тогда
		СписокФЗ.Добавить(ФоновоеЗадание);
	КонецЕсли;
	
КонецПроцедуры


Функция ЗапуститьАвтоматическиеОперацииФоновыеЗадания(ИмяОбработки, ЭтоВнешняяОбработка) Экспорт 
	#Область include_core_base_Helpers_УстановитьОтключениеБезопасногоРежимаИстина
	#КонецОбласти
	context_param = ПроверитьНаличиеПараметровПодключения();
	
	Фильтры = ФильтрыРоботаПоУмолчанию(); 
	ДопПоля = ДополнительныеПоляРоботаПоУмолчанию();
	СписокФЗ = Новый Массив;
	СчетчикСтраниц = 0;
	ЕстьЕще = Истина;
	Пока ЕстьЕще Цикл  
		Попытка 
			res = local_helper_api3_connection_for_run(context_param, Фильтры, ДопПоля, Неопределено, СчетчикСтраниц);
		Исключение 
			ИнфОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение(ExtExceptionToMessage(ЗначениеИзСтрокиВнутр(ИнфОбОшибке.Описание)));
		КонецПопытки;
			
		Navigation = get_prop(res,"Navigation",Неопределено);
		ЕстьЕще = get_prop(Navigation,"HasMore",Ложь);	
		СчетчикСтраниц = СчетчикСтраниц + 1;
		Результат = res.Получить("Result");  
	
		Если ТипЗнч(Результат) <> Тип("Массив") Тогда  
			Продолжить;
		КонецЕсли;	
		ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("ИмяОбработки",					ИмяОбработки); 
		Если ТипЗнч(ИмяОбработки) <> Тип("Строка") Тогда
			ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка",	ИмяОбработки); 	
		КонецЕсли;
		ПараметрыЗадания.Вставить("ИмяМетода",				"ЗапуститьАвтоматическуюОперацию");
		ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка);
		Для Каждого ЗаписьОперация ИЗ Результат Цикл
			ЗаписьОперация.Вставить("ИмяОбработки", 		ИмяОбработки);
			ЗаписьОперация.Вставить("ЭтоВнешняяОбработка",  ЭтоВнешняяОбработка);
			ПараметрыВыполнения = Новый Массив;
			ПараметрыВыполнения.Добавить(ЗаписьОперация);
			ПараметрыВыполнения.Добавить(context_param);
			
			Попытка       
				НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение "+ЛокализацияНазваниеПродукта()+" "+ЗаписьОперация.Получить("Title")+"'");
				ПараметрыЗадания.Вставить("ПараметрыВыполнения",	ПараметрыВыполнения);
				ЗапуститьАвтоматическуюОперациюФоновымЗаданием(ПараметрыЗадания, СписокФЗ, ВыполняемыйМетод, НаименованиеФоновогоЗадания);
			Исключение 
				ЗапуститьАвтоматическуюОперацию(ПараметрыВыполнения, Строка(Новый УникальныйИдентификатор));
			КонецПопытки;	
		КонецЦикла;
		
	КонецЦикла;	
	Возврат СписокФЗ;
КонецФункции

