
Процедура ЗапуститьАвтоматическуюОперациюФоновымЗаданием(ПараметрыЗадания, СписокФЗ, ВыполняемыйМетод, НаименованиеФоновогоЗадания) 
	УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор;	
	ИмяМодуляДлительныеОперации = ИмяМодуляДлительныеОперации();
	Если ИмяМодуляДлительныеОперации = Неопределено Тогда
		ВызватьИсключение "Отсутствует модуль для запуска длительной операции (Saby)";
	КонецЕсли;
	ДлительныеОперацииОбщийМодуль = ОбщийМодульЗначение(ИмяМодуляДлительныеОперации);	
	
	ПараметрыВыполнения = ДлительныеОперацииОбщийМодуль.ПараметрыВыполненияВФоне(УникальныйИдентификаторЗадания);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификаторЗадания); 	
	Результат = ДлительныеОперацииОбщийМодуль.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);  
	
	// TO DO 
	ИдентификаторЗадания = get_prop(Результат, "ИдентификаторЗадания", Неопределено); 
	Если ИдентификаторЗадания = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если ФоновоеЗадание <> Неопределено Тогда
		СписокФЗ.Добавить(ФоновоеЗадание);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокЗависшихАвтоматическиеОперации(context_param)
	ФильтрЗависшихЗадач = Новый Структура("StatusID", 50);
 	АвтоматическиеОперации = ПолучитьАвтоматическиеОперации(context_param, ФильтрЗависшихЗадач);
    Возврат АвтоматическиеОперации;
КонецФункции

Функция ФоновоеЗаданиеЗапущено(НаименованиеФоновогоЗадания) 
	Отбор = Новый Структура("Наименование, Состояние", НаименованиеФоновогоЗадания, СостояниеФоновогоЗадания.Активно);
	СписокФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если СписокФоновыхЗаданий.Количество() > 0 Тогда 
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;	
КонецФункции	

Процедура ПерезапуститьЗависшиеАвтоматическиеОперации(context_param, ИмяОбработки, ЭтоВнешняяОбработка, СписокФЗ)  Экспорт
	АвтоматическиеОперации = ПолучитьСписокЗависшихАвтоматическиеОперации(context_param);
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяОбработки",					ИмяОбработки); 
	Если ТипЗнч(ИмяОбработки) <> Тип("Строка") Тогда
		ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка",	ИмяОбработки); 	
	КонецЕсли;
	ПараметрыЗадания.Вставить("ИмяМетода",				"ЗапуститьАвтоматическуюОперацию");
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка);
	ИмяМодуляДлительныеОперации = ИмяМодуляДлительныеОперации();
	Если ИмяМодуляДлительныеОперации = Неопределено Тогда
		ВызватьИсключение "Отсутствует модуль для запуска длительной операции (Saby)";
	КонецЕсли;
	ВыполняемыйМетод = ИмяМодуляДлительныеОперации + ".ВыполнитьПроцедуруМодуляОбъектаОбработки";
	Для Каждого ЗаписьОперация Из АвтоматическиеОперации Цикл
		Если get_prop(ЗаписьОперация, "StatusID") <> 50 Тогда  
			Продолжить;
		КонецЕсли;	   
		НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение "+ ЛокализацияНазваниеПродукта()+ " " + ЗаписьОперация.Получить("Title") + "'");
		Если ФоновоеЗаданиеЗапущено(НаименованиеФоновогоЗадания) Тогда 
			Продолжить;
		КонецЕсли;
		ЗаписьОперация.Вставить("ИмяОбработки", 		ИмяОбработки);
		ЗаписьОперация.Вставить("ЭтоВнешняяОбработка",  ЭтоВнешняяОбработка);
		Data = get_prop(ЗаписьОперация, "Data");
		ExtSyncDoc = get_prop(Data, "ExtSyncDoc");
		ContextId = get_prop(ExtSyncDoc, "Uuid");
		ПараметрыВыполнения = Новый Массив;
		ПараметрыВыполнения.Добавить(ЗаписьОперация);
		ПараметрыВыполнения.Добавить(context_param);
		ПараметрыВыполнения.Добавить(ContextId);
		
		Попытка       
			ПараметрыЗадания.Вставить("ПараметрыВыполнения",	ПараметрыВыполнения);
			ЗапуститьАвтоматическуюОперациюФоновымЗаданием(ПараметрыЗадания, СписокФЗ, ВыполняемыйМетод, НаименованиеФоновогоЗадания);
		Исключение 
			ЗапуститьАвтоматическуюОперацию(ПараметрыВыполнения, Строка(Новый УникальныйИдентификатор));
		КонецПопытки;	
	КонецЦикла;	
КонецПроцедуры	
	
Функция ПараметрыЗаданияАвтоматическойОперации(ИмяОбработки, ЭтоВнешняяОбработка) 
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяОбработки",					ИмяОбработки); 
	Если ТипЗнч(ИмяОбработки) <> Тип("Строка") Тогда
		ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка",	ИмяОбработки); 	
	КонецЕсли;
	ПараметрыЗадания.Вставить("ИмяМетода",				"ЗапуститьАвтоматическуюОперацию");
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка);
	Возврат ПараметрыЗадания;	
КонецФункции	
	
Процедура ПроверитьВозможностьЗапускаАвтоматическихОперацийФоновымЗаданием(context_param)  
	Если context_param = Неопределено Тогда
		ВызватьИсключение "Не заполнены параметры подключения к Saby";
	КонецЕсли;
	ДопустимыеВидыТранспорта = Новый Массив;
	ДопустимыеВидыТранспорта.Добавить("API"); 
	ДопустимыеВидыТранспорта.Добавить("SabyHttpsClient"); 
	ТекущийВидТранспорта = ВидТранспорта(context_param); 
	
	Если ДопустимыеВидыТранспорта.Найти(ТекущийВидТранспорта) = Неопределено Тогда
		ВызватьИсключение "Выполнение автоматических операций возможно только при способах обмена API и SabyHttpsClient";
	КонецЕсли;	
КонецПроцедуры
	
Функция ЗапуститьАвтоматическиеОперацииФоновыеЗадания(ИмяОбработки, ЭтоВнешняяОбработка) Экспорт 
	#Область include_core_base_Helpers_УстановитьОтключениеБезопасногоРежимаИстина
	#КонецОбласти
	context_param = ПроверитьНаличиеПараметровПодключения();
	
	ПроверитьВозможностьЗапускаАвтоматическихОперацийФоновымЗаданием(context_param);
	
	СписокФЗ = Новый Массив;
	
	ПерезапуститьЗависшиеАвтоматическиеОперации(context_param, ИмяОбработки, ЭтоВнешняяОбработка, СписокФЗ);
	
	Фильтры = ФильтрыРоботаПоУмолчанию(); 
	ДопПоля = ДополнительныеПоляРоботаПоУмолчанию();
	СчетчикСтраниц = 0;
	ЕстьЕще = Истина;
	ИмяМодуляДлительныеОперации = ИмяМодуляДлительныеОперации();
	Если ИмяМодуляДлительныеОперации = Неопределено Тогда
		ВызватьИсключение "Отсутствует модуль для запуска длительной операции (Saby)";
	КонецЕсли;
	ВыполняемыйМетод = ИмяМодуляДлительныеОперации + ".ВыполнитьПроцедуруМодуляОбъектаОбработки";
	Пока ЕстьЕще Цикл  
		Попытка 
			res = local_helper_api3_connection_for_run(context_param, Фильтры, ДопПоля, Неопределено, СчетчикСтраниц);
		Исключение 
			ИнфОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение(ExtExceptionToMessage(ЗначениеИзСтрокиВнутр(ИнфОбОшибке.Описание)));
		КонецПопытки;
			
		Navigation = get_prop(res,"Navigation",Неопределено);
		ЕстьЕще = get_prop(Navigation,"HasMore",Ложь);	
		СчетчикСтраниц = СчетчикСтраниц + 1;
		Результат = res.Получить("Result");  
	
		Если ТипЗнч(Результат) <> Тип("Массив") Тогда  
			Продолжить;
		КонецЕсли;	
		ПараметрыЗадания = ПараметрыЗаданияАвтоматическойОперации(ИмяОбработки, ЭтоВнешняяОбработка);
		Для Каждого ЗаписьОперация ИЗ Результат Цикл
			ЗаписьОперация.Вставить("ИмяОбработки", 		ИмяОбработки);
			ЗаписьОперация.Вставить("ЭтоВнешняяОбработка",  ЭтоВнешняяОбработка);
			ПараметрыВыполнения = Новый Массив;
			ПараметрыВыполнения.Добавить(ЗаписьОперация);
			ПараметрыВыполнения.Добавить(context_param);
			Data = get_prop(ЗаписьОперация, "Data");
			ExtSyncDoc = get_prop(Data, "ExtSyncDoc");
			Status = get_prop(ExtSyncDoc, "Status");
			Если Status = 50 Тогда
				ContextId = get_prop(ExtSyncDoc, "Uuid");
				ПараметрыВыполнения.Добавить(ContextId);
			КонецЕсли;

			Попытка       
				НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение "+ЛокализацияНазваниеПродукта()+" "+ЗаписьОперация.Получить("Title")+"'");
				ПараметрыЗадания.Вставить("ПараметрыВыполнения",	ПараметрыВыполнения);
				ЗапуститьАвтоматическуюОперациюФоновымЗаданием(ПараметрыЗадания, СписокФЗ, ВыполняемыйМетод, НаименованиеФоновогоЗадания);
			Исключение 
				ЗапуститьАвтоматическуюОперацию(ПараметрыВыполнения, Строка(Новый УникальныйИдентификатор));
			КонецПопытки;	
		КонецЦикла;
		
	КонецЦикла;	
	Возврат СписокФЗ;
КонецФункции
