
Процедура ВыполнитьРегламентнуюЗадачуРасширения(ИдентификаторКоманды) Экспорт
	
	ИмяОбработки = ИмяОбработки();
	ЛокализацияНазвание = ЛокализацияНазваниеПродукта(); 
	
	Если Врег(ИдентификаторКоманды) = Врег(ЛокализацияНазвание + "_АвтоматическоеОбновлениеСтатусов") Тогда
		
		context_params	= ПроверитьНаличиеПараметровПодключения();
		МодульФоновогоЗаданияСервер().АвтоматическоеОбновлениеСтатусов(context_params);
		
	// ЭПД	
	ИначеЕсли Найти(ИдентификаторКоманды, "ЭПД") > 0 Тогда
						
		ИмяМодуля = ПрефиксПродукта() + "ТНОбщегоНазначенияСервер";						
		Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) <> Неопределено Тогда
			
			МодульКонфигурации = ПолучитьОбъектОбработки().ОбщийМодульЗначение(ИмяМодуля);        
			МодульКонфигурации.ВыполнитьРегламентноеЗаданиеЭПД(ИдентификаторКоманды);
			
		КонецЕсли;		
	ИначеЕсли Врег(ИдентификаторКоманды) = Врег(ЛокализацияНазвание + "_ЗапускАвтоматическихОпераций") Тогда
		ЭтоВнешняяОбработка = Ложь;
		Если Метаданные.Обработки.Найти(ИмяОбработки) <> Неопределено Тогда 
			МодульОбработки = Обработки[ИмяОбработки].Создать();  
			МодульОбработки.ЗапуститьАвтоматическиеОперацииФоновыеЗадания(ИмяОбработки, ЭтоВнешняяОбработка);
		Иначе
			ВызватьИсключение "Отсутствует обработка " + ИмяОбработки;
		КонецЕсли;			
	Иначе		
		Возврат;
	КонецЕсли;

	
КонецПроцедуры

#Область include_core_base_АвтоматическиеОперации_РегламентныеЗаданияСведения
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_РегламентныеЗаданияПараметры
#КонецОбласти

Процедура ИнициализацияРегламентныхЗаданий()
	
	УстановитьПривилегированныйРежим(Истина); //Необходимо пользователям с отсутствием полных прав
	МассивРегламентныхЗаданий = МассивРегламентныхЗаданий();
	ОбщийМодульРегламентныеЗаданияСервер = ПолучитьОбъектОбработки().ОбщийМодульЗначение("РегламентныеЗаданияСервер"); 
	Если ОбщийМодульРегламентныеЗаданияСервер = Неопределено Тогда  
		Возврат;
	КонецЕсли;	
	Для Каждого Задание Из МассивРегламентныхЗаданий Цикл
		Отбор = Новый Структура("Ключ", Задание.Ключ);
		НайденныеРегЗадания = ОбщийМодульРегламентныеЗаданияСервер.НайтиЗадания(Отбор);
		Если НайденныеРегЗадания.Количество() = 0 Тогда
			ПараметрыЗадания = ПараметрыРегЗадания(Задание);
			ОбщийМодульРегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

