
Функция ОбщиеНастройкиПрочитатьНаСервере()
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.ОбщиеНастройкиПрочитать();
КонецФункции

//DynamicDirective

Функция ФильтрыРоботаПоУмолчанию() Экспорт 
	Фильтры = Новый Структура;	
	ОбщиеПараметры = ОбщиеНастройкиПрочитатьНаСервере();
	parent = get_prop(ОбщиеПараметры, "parent", Неопределено);
    Фильтры.Вставить("Parent", parent); 
    Фильтры.Вставить("Connector", "Robot1C"); 
    Возврат Фильтры; 
КонецФункции	

//DynamicDirective

Функция ДополнительныеПоляРоботаПоУмолчанию() Экспорт
	ДопПоля = Новый Массив;	
	ДопПоля.Добавить("Format"); 
	ДопПоля.Добавить("Title"); 
	ДопПоля.Добавить("json_connection"); 
    ДопПоля.Добавить("ConfigId"); 
    ДопПоля.Добавить("SubsystemVersion"); 
    ДопПоля.Добавить("SystemId"); 
    ДопПоля.Добавить("NextRun"); 
    ДопПоля.Добавить("LastRun"); 
    ДопПоля.Добавить("Sync"); 
    ДопПоля.Добавить("StatusID"); 
	ДопПоля.Добавить("Data"); 
    Возврат ДопПоля; 	
КонецФункции

//DynamicDirective

Функция ПолучитьАвтоматическиеОперации(context_param) Экспорт	
	Фильтры = ФильтрыРоботаПоУмолчанию(); 
    ДопПоля = ДополнительныеПоляРоботаПоУмолчанию();
	СчетчикСтраниц = 0;
	ИтоговыйМассив = Новый Массив;
	Пока Истина Цикл  
		res = ТранспортИнтеграции.local_helper_api3_connection_list(context_param, Фильтры, ДопПоля, Неопределено, СчетчикСтраниц); 	
		Результат = res.Получить("Result");
		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			Для Каждого ЗаписьОперация ИЗ Результат Цикл
	            ИтоговыйМассив.Добавить(ЗаписьОперация);
			КонецЦикла;
		КонецЕсли;
		
		Если res.Получить("Navigation") <> Неопределено
			И res["Navigation"].Получить("HasMore") = ИСТИНА Тогда
			СчетчикСтраниц = СчетчикСтраниц + 1;
		Иначе
			Прервать;
		КонецЕсли;

	КонецЦикла;	
	Возврат ИтоговыйМассив;
КонецФункции
