
Функция ОбщиеНастройкиПрочитатьНаСервере()
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.ОбщиеНастройкиПрочитать();
КонецФункции

//DynamicDirective

Функция ПроверкаПоДополнительномуФильтру(ЗаписьОперация, ДополнительныйФильтр)  
	Если ДополнительныйФильтр  <> Неопределено Тогда  
		Для Каждого КлючЗначение Из ДополнительныйФильтр Цикл
			ЗначениеКлючаОперации = get_prop(ЗаписьОперация, КлючЗначение.Ключ);
			Если ЗначениеКлючаОперации <> КлючЗначение.Значение Тогда
				Возврат Ложь;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	Возврат Истина;	
КонецФункции

