
//DynamicDirective

Функция ФильтрыРоботаПоУмолчанию(ДополнительныйФильтр = Неопределено) Экспорт 
	Фильтры = Новый Структура;	
	ОбщиеПараметры = ОбщиеНастройкиПрочитатьНаСервере();
	parent = get_prop(ОбщиеПараметры, "parent", Неопределено);
    Фильтры.Вставить("Parent", parent); 
    Фильтры.Вставить("Connector", "Robot1C");
	Если ТипЗнч(ДополнительныйФильтр) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из ДополнительныйФильтр Цикл
			Фильтры.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение); 
		КонецЦикла;	
	КонецЕсли;	
    Возврат Фильтры; 
КонецФункции
