
// Публичное АПИ для межмодульного вызова

// Функция - конструктор объекта SABY
//
// Параметры:
//  ВходящиеПараметры	 - Строка	 - тип наследника от базового объекта
//  ДопПараметры	 - Структура	 - дополнительные параметры
// 
// Возвращаемое значение:
//  ОбъектSABY - Структура с предопределенными свойствами
//
//DynamicDirective
Функция Saby_НовыйОбъектSABY(ВходящиеПараметры = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	Возврат НовыйОбъектSABY(ВходящиеПараметры, ДопПараметры);
	
КонецФункции

// Функция - базовая выгрузка объекта.
//
// Параметры:
//  ОбъектSABY				 - ОбъектSABY			 - Структура, с преопределенными полями
//  ФорматВыгрузкиОбъекта	 - Неопределено, Строка	 - варианты выгрузки
// 
// Возвращаемое значение:
//  Структура - выгруженный объект
//
//DynamicDirective
Функция Saby_ОбъектSABY_Выгрузить(ОбъектSABY, ФорматВыгрузкиОбъекта = Неопределено) Экспорт

	Возврат ОбъектSABY_Выгрузить(ОбъектSABY, ФорматВыгрузкиОбъекта);
	
КонецФункции	

// Функция - Объект SABY скопировать
//
// Параметры:
//  ОбъектSABY		 - ОбъектSABY				 - текущий объект
//  ДопПараметры	 - Неопределено, Структура	 - расширение
// 
// Возвращаемое значение:
//  Структура - поверхностная копия объекта Saby
//
//DynamicDirective
Функция Saby_ОбъектSABY_Скопировать(ОбъектSABY, ДопПараметры = Неопределено) Экспорт
	
	Возврат ОбъектSABY_Скопировать(ОбъектSABY, ДопПараметры);
	
КонецФункции

// Функция - Проверка типа в упрощенном виде. Если объект не SABY, то должен совпадать тип и ТипПроверитьВх.
//
// Параметры:
//  ОбъектSABY		 - ОбъектSABY			 - Структура, с преопределенными полями
//  ТипПроверитьВх	 - Строка, ОбъектSABY	 - Имя типа SABY/ ОбъектSABY для сравнения
// 
// Возвращаемое значение:
//  Булево - результат проверки того, является ли текущий объект типом проверки
//
//DynamicDirective
Функция Saby_ОбъектSABY_ЭтоТип(ОбъектSABY, ТипПроверитьВх)  Экспорт 
	
	Возврат ОбъектSABY_ЭтоТип(ОбъектSABY, ТипПроверитьВх);
	
КонецФункции

// Процедура - Объект SABY установить
//
// Параметры:
//  ОбъектSABY		 - ОбъектSABY			 - текущий объект
//  КлючДобавить	 - Неопределено, Строка	 - ключ устанавливаемого свойства. Если Строка, то должен быть оформлен по формату ключа Структуры
//  ЗначениеДобавить - Произвольный			 - устанавливаемое значение
//
//DynamicDirective
Процедура Saby_ОбъектSABY_Установить(ОбъектSABY, КлючДобавить = Неопределено, ЗначениеДобавить = Неопределено) Экспорт 
	
	ОбъектSABY_Установить(ОбъектSABY, КлючДобавить, ЗначениеДобавить);
	
КонецПроцедуры

// Функция - Базовый get-метод
//
// Параметры:
//  ОбъектSABY	 		 - ОбъектSABY	 - Структура, с преопределенными полями
//  КлючПолучить		 - Строка				 - Ключ свойства
// 
// Возвращаемое значение:
//  Произвольный - свойство класса
//
//DynamicDirective
Функция Saby_ОбъектSABY_Получить(ОбъектSABY, КлючПолучить) Экспорт 

	Возврат ОбъектSABY_Получить(ОбъектSABY, КлючПолучить);
	
КонецФункции	

