
Процедура СоздатьЭлементФормы(Название, ТипЗначения, Счетчик = 0, Значение, Представление)
	ШагРеквизита = 23;
	
	НовыйЭлемент = ЭтаФорма.ЭлементыФормы.Добавить(Тип("Надпись"),Название+"Надпись",Истина);
	НовыйЭлемент.Заголовок = Представление;
	НовыйЭлемент.Верх = 8 + ШагРеквизита * (Счетчик-1);
	НовыйЭлемент.Лево = 20;
	НовыйЭлемент.Ширина = 113;
	НовыйЭлемент.Высота = 18;
	
	НовыйЭлемент = ЭтаФорма.ЭлементыФормы.Добавить(Тип("ПолеВвода"),Название,Истина);
	НовыйЭлемент.Верх = 8 + ШагРеквизита * (Счетчик-1);
	НовыйЭлемент.Лево = 136;
	НовыйЭлемент.Ширина = 180;
	НовыйЭлемент.Высота = 18;
	НовыйЭлемент.Данные = "Фильтр"+Счетчик;
	НовыйЭлемент.ИзменяетДанные = Истина; 
	НовыйЭлемент.КнопкаВыбора = Истина;
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.КнопкаОткрытия = Истина; 
	
	Если ЭтаФорма.Высота - ШагРеквизита < НовыйЭлемент.Верх + НовыйЭлемент.Высота  Тогда 
		ЭтаФорма.Высота = ЭтаФорма.Высота + ШагРеквизита;	
	КонецЕсли;	
	
	Массив = Новый Массив(); 
	Массив.Добавить(Тип(ТипЗначения)); 
	ОписаниеТипа = Новый ОписаниеТипов(Массив);
	НовыйЭлемент.ОграничениеТипа = ОписаниеТипа;
	ЭтаФорма[НовыйЭлемент.Данные] = ОписаниеТипа.ПривестиЗначение(ЭтаФорма[НовыйЭлемент.Данные]); 
	
	Если Значение <> Неопределено Тогда
		ЭтаФорма[НовыйЭлемент.Данные] = Значение; 
	КонецЕсли;

КонецПроцедуры

Процедура СобратьФильтры(Фильтр, ПредставлениеФильтра) 
	МодульОбъекта = МодульОбъекта(); 
	Счетчик = 1;
	Для Каждого ЗаписьФильтр Из МассивФильтров Цикл
		НазваниеФильтра = get_prop(ЗаписьФильтр,"Название");	
		ЗначениеФильтра = ЭтаФорма["Фильтр"+Счетчик];
		Если ЗначениеЗаполнено(ЗначениеФильтра) Тогда
			ПредставлениеФильтра = ПредставлениеФильтра +НазваниеФильтра+": "+ Строка(ЗначениеФильтра)+"; ";
			Api3Object = МодульОбъекта.Api3Object(ЗначениеФильтра,Неопределено,ИСТИНА);	
			Если Фильтр.Получить(НазваниеФильтра) = Неопределено Тогда
				Фильтр.Вставить(НазваниеФильтра, Новый Соответствие);
			КонецЕсли;  
			Фильтр[НазваниеФильтра].Вставить("Api3Link",Api3Object);
		Иначе 	
			Фильтр.Удалить(НазваниеФильтра);		
		КонецЕсли;	
		Счетчик = Счетчик + 1;
	КонецЦикла; 
	
КонецПроцедуры

	
