
Функция ПроисходилЛиОбменДокументов( МассивСсылокНаДокументы, ДопПараметры=Неопределено) Экспорт 
	
	РезультатЗапроса = СтатусыДокументовОтобратьПоСпискуОбъектов(МассивСсылокНаДокументы);
	Результат	= Новый Структура("БылОбмен,ОбменаНебыло", Новый Массив, Новый Массив);
	УдаленныеВОтдельныйМассив = get_prop(ДопПараметры, "УдаленныеВОтдельныйМассив", Ложь);
	Если УдаленныеВОтдельныйМассив = Истина Тогда
		Результат.Вставить("Удаленные", Новый Массив);
	КонецЕсли;
	Для Каждого СтрокаЗПР Из РезультатЗапроса Цикл
		
		Если СтрокаЗПР.Объект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если УдаленныеВОтдельныйМассив = Истина 
			И СтрокаЗПР.Объект.ПометкаУдаления = Истина Тогда
			Результат.Удаленные.Добавить(СтрокаЗПР.Объект);
			Продолжить;
		КонецЕсли;
		
		ЗаписьОбъекта = Новый Структура("Ссылка, UID, ТипМетаданных, Сервис, Аккаунт, Состояние, СостояниеИдСБИС, UID, SbisId, ТипОбъекта, ИмяИни");
		ЗаполнитьЗначенияСвойств(ЗаписьОбъекта, СтрокаЗПР);
		ЗаписьОбъекта.Ссылка = СтрокаЗПР.Объект; 
		
		Если ЗначениеЗаполнено(ДопПараметры) Тогда
			ЗаписьОбъекта.ИмяИни = ДопПараметры.ИмяИни;
		КонецЕсли;
		
		Если СтрокаЗПР.ОбменСоСбис Тогда
			Результат.БылОбмен.Добавить(ЗаписьОбъекта);
		Иначе
			Результат.ОбменаНебыло.Добавить(ЗаписьОбъекта);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат; 
	
КонецФункции 

// Получаем сообщение об ошибке чтения документа
//
// Параметры:
//  ИнфоОбОшибке - Структура - ИнформацияОбОшибке().
//  result - Структура - структура для получения сообшения.
//	ДокументИсточник - Ссылка - читаемый документ
//
// Возвращаемое значение:
//  Строка - Сообшение об ошибке
//
//DynamicDirective
Функция ОбработатьОшибкуЧтенияДокумента(ИнфоОбОшибке, result, ДокументИсточник) 
	СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
	Детали              = get_prop(СтруктураОшибки,	"detail", Неопределено);
	ДеталиОшибка		=  get_prop(Детали, 			"error", Неопределено);
	ДеталиОшибкаДетали	=  get_prop(ДеталиОшибка,		"details", "");
	СообщениеОбОшибке = "";
	Если СтруктураОшибки.type = "NotFound" Тогда
		СообщениеОбОшибке	= result["error"]["details"];	
	ИначеЕсли Найти(СтруктураОшибки.message + ДеталиОшибкаДетали, "Не найден документ с идентификатором") > 0 Тогда
		//Из задач и из журнала описание ошибки приходит из разных полей структуры
		ДокументаUID	= ДокументИсточник.UID;
		Если НЕ ПустаяСтрока(ДокументаUID) ТОгда
			СтатусыДокументовУдалитьПоUID(ДокументаUID);
		Иначе 
			СтатусыДокументовУдалить(ДокументИсточник.Ссылка);
		КонецЕсли;
		СообщениеОбОшибке	= "Документ был удалён в "+ЛокализацияНазваниеПродукта();
	Иначе
		ВызватьИсключение NewExtExceptionСтрока(ИнфоОбОшибке);
	КонецЕсли;
	Возврат СообщениеОбОшибке;
КонецФункции

// Читает документы в интеграции
// возвращает 2 массива обработки успешно и ошибок
//
// Параметры:
//  МассивИсточникДанных - Массив - источник данных.
//  ПолучитьТикет - Булево - признак.
//
// Возвращаемое значение:
//  Структура - 2 массива = "ОбработаноУспешно, ОбработаноСОшибкой"
//
//DynamicDirective
Функция ПолучитьССылкиНаДокументыВИнтеграции(МассивИсточникДанных, ПолучитьТикет = Ложь ) Экспорт
	
	context_params= НастройкиПодключенияПрочитать();
	
	Результат = Новый Структура("ОбработаноУспешно, ОбработаноСОшибкой", Новый Массив(), Новый Массив());
	МассивУспехов = Новый Массив;
	НаименованиеДействия = "OpenInSaby";
	НоваяЗапись = Новый Структура("Ссылка, UID, Сообщение",,,"Ошибка получения URL");
 	//Пока, что дергаем каждый документ в отдельности
	Для Каждого ДокументИсточник Из МассивИсточникДанных Цикл
		
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ДокументИсточник, "Ссылка, UID");
		
		Попытка
			result = ТранспортИнтеграции.local_helper_read_document(context_params, Новый Структура("Идентификатор",ДокументИсточник.UID));
		Исключение
			ИнфоОбОшибке = ИнформацияОбОшибке();
			СообщениеОбОшибке = ОбработатьОшибкуЧтенияДокумента(ИнфоОбОшибке, result, ДокументИсточник);
			НоваяЗапись.Сообщение = СообщениеОбОшибке;
			Результат.ОбработаноСОшибкой.Добавить(НоваяЗапись);
		КонецПопытки; 
		
		Если result <> Неопределено И ТипЗнч(result["СсылкаДляНашаОрганизация"]) = Тип("Строка") Тогда
			Тикет = "";
			Если ПолучитьТикет = Истина Тогда
	 			Тикет = ТранспортИнтеграции.ТикетТекущейСессии(context_params);
			КонецЕсли;
			АдресHTML = СформироватьУРЛСТикетом(result["СсылкаДляНашаОрганизация"], Тикет);
			НоваяЗапись.Вставить("Заголовок",СокрЛП(ДокументИсточник.Ссылка));
			НоваяЗапись.Вставить("АдресСтраницы",АдресHTML);
			Результат.ОбработаноУспешно.Добавить(НоваяЗапись);
			ТипСБИС	= get_prop(result, "Тип", "");
			ЭлементСтатистики	= ТранспортИнтеграции.local_helper_element_action(НаименованиеДействия, ТипСБИС, Новый Структура(), 1);
 			МассивУспехов.Добавить(ЭлементСтатистики);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивУспехов.Количество() > 0 Тогда
		ТранспортИнтеграции.local_helper_register_actions(context_params, МассивУспехов);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Процедура СтатусыДокументовИнициализация(context_params = Неопределено, Регламент = "") Экспорт
	
	Перем Сервис, ТекущийСервис;
	
	МодульОбъекта = МодульОбъекта();
	Если context_params = Неопределено Тогда
		context_params = НастройкиПодключенияПрочитать();
	КонецЕсли;
	
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		ИнтеграцияСтатусыДокументов = Новый Структура;
		ИнтеграцияСтатусыДокументов.Вставить("ИмяРегистраСвойствОбъектов", СтатусыДокументовИмяРегистраСвойствОбъектов());
		ИнтеграцияСтатусыДокументов.Вставить("ИмяПланаВидовХарактеристикСвойствОбъектов",
			СтатусыДокументовИмяПланаВидовХарактеристикСвойствОбъектов());
		ИнтеграцияСтатусыДокументов.Вставить("СправочникСвойствОбъектов", СтатусыДокументовИмяСправочникаСвойствОбъектов());
		
		СвойстваВРазрезеКодаСервиса = Новый СписокЗначений;
		СвойстваВРазрезеКодаСервиса.Добавить("документсбис_ид",				"ДокументСБИС_Ид");
		СвойстваВРазрезеКодаСервиса.Добавить("документсбис_статус",			"ДокументСБИС_Статус");
		СвойстваВРазрезеКодаСервиса.Добавить("документсбис_текущийэтап",	"ДокументСБИС_ТекущийЭтап");
		ИнтеграцияСтатусыДокументов.Вставить("СвойстваВРазрезеКодаСервиса", СвойстваВРазрезеКодаСервиса);
		
		ИнтеграцияСтатусыДокументов.Вставить("КэшСвойствОбъектов", Новый Соответствие);
		
		ИнтеграцияСтатусыДокументов.Вставить("Сервис", "---undefine---"); // Обновится при 1-ом запуске
		ИнтеграцияСтатусыДокументов.Вставить("Аккаунт", "");
		
		context_params.Вставить("ИмяРегистраСтатусов", ИнтеграцияСтатусыДокументов.ИмяРегистраСвойствОбъектов);
		НастройкиПодключенияЗаписать(context_params);
	КонецЕсли;
	
	// Сервис может меняться, если перелогиниться
	Сервис = СтатусыДокументовСервис(context_params);
	ИнтеграцияСтатусыДокументов.Свойство("Сервис", ТекущийСервис);
	Если Сервис <> ТекущийСервис Тогда
		ИнтеграцияСтатусыДокументов.Вставить("Сервис", Сервис);
		// При первом запуске надо создать записи в ПВХ для хранения статусов и идентификаторов в регистрах сведений
		Если ЗначениеЗаполнено(ИнтеграцияСтатусыДокументов.ИмяПланаВидовХарактеристикСвойствОбъектов) Тогда
			СтатусыДокументовДобавитьЗаписиВПланВидовХарактеристик(Регламент);
		КонецЕсли;
		ИнтеграцияСтатусыДокументов.Вставить("Аккаунт", МодульОбъекта.СвойствоСессии(context_params, "account") );
	КонецЕсли;
	
КонецПроцедуры

// Добавляет записи в план видов характеристик, необходимые для хранения статусов и идентификаторов в регистрах сведений
//
// Параметры:
// 	Регламент - Строка - имя регламента документа
// 
Процедура СтатусыДокументовДобавитьЗаписиВПланВидовХарактеристик(Регламент = "")
	
	ИмяПланаВидовХарактеристикСвойствОбъектов 	= ИнтеграцияСтатусыДокументов.ИмяПланаВидовХарактеристикСвойствОбъектов;
	
	Если Метаданные.ПланыВидовХарактеристик.Найти(ИмяПланаВидовХарактеристикСвойствОбъектов) = Неопределено Тогда
		ВызватьИсключение("В конфигурации отсутствует план видов характеристик "
			+ ИмяПланаВидовХарактеристикСвойствОбъектов + ".");
	КонецЕсли;  
	
	Префикс = ПрефиксДокументаПоДопСведениям(Регламент, ИнтеграцияСтатусыДокументов.Сервис);
	
	СтатусыДокументовДобавитьЗаписьВПланВидовХарактеристик(Новый Структура("Имя", Префикс + "_Ид"));
	СтатусыДокументовДобавитьЗаписьВПланВидовХарактеристик(Новый Структура("Имя", Префикс + "_Статус"));
	СтатусыДокументовДобавитьЗаписьВПланВидовХарактеристик(Новый Структура("Имя", Префикс + "_ТекущийЭтап"));
		
КонецПроцедуры

// Функция добавляет запись в план видов характеристик
//
// Параметры:
//  ОписаниеСвойства - Структура - описание свойства.
//
// Возвращаемое значение:
//   ПланВидовХарактеристикСсылка - ссылка на элемент
//
Функция СтатусыДокументовДобавитьЗаписьВПланВидовХарактеристик(ОписаниеСвойства)
	Перем НазначениеСвойства;
	
	КлючСвойства = СтатусыДокументовПолучитьКлючСвойстваДокумента(ОписаниеСвойства);
	ОписаниеСвойства.Свойство("Назначение", НазначениеСвойства);
	ИмяПланаВидовХарактеристикСвойствОбъектов = ИнтеграцияСтатусыДокументов.ИмяПланаВидовХарактеристикСвойствОбъектов;
	
	НайденнаяЗапись = СтатусыДокументовПолучитьСвойствоОбъекта(ОписаниеСвойства);
	Если НЕ НайденнаяЗапись.Пустая() Тогда
		Возврат НайденнаяЗапись;
	КонецЕсли;
	
	Попытка
		
		СвойствоОбъект = ПланыВидовХарактеристик[ИмяПланаВидовХарактеристикСвойствОбъектов].СоздатьЭлемент();
		СвойствоОбъект.Наименование = КлючСвойства;
		СвойствоОбъект.ТипЗначения  = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки());		
		
		Если get_prop(СвойствоОбъект, "Имя") <> Неопределено Тогда
			СвойствоОбъект.Имя = КлючСвойства;
		КонецЕсли;
		
		Если get_prop(СвойствоОбъект, "Заголовок") <> Неопределено Тогда
			СвойствоОбъект.Заголовок = КлючСвойства;
		КонецЕсли;	
		
		Если get_prop(СвойствоОбъект, "ЭтоДополнительноеСведение") <> Неопределено Тогда
			СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		КонецЕсли;

		Попытка
			
			Если get_prop(СвойствоОбъект, "НазначениеСвойства") <> Неопределено Тогда				
				Если ЗначениеЗаполнено(НазначениеСвойства) Тогда
					СвойствоОбъект.НазначениеСвойства = НазначениеСвойства;
				Иначе
					СвойствоОбъект.НазначениеСвойства = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы;
				КонецЕсли;				
			КонецЕсли;
			
		Исключение
			ВызватьИсключение("Не удалось установить назначение дополнительного свойства " + НазначениеСвойства 
				+ ". Детально: " + ОписаниеОшибки());
		КонецПопытки;
		
		СвойствоОбъект.УстановитьНовыйКод();
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		СвойствоОбъект.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		// BSLLS:SetPrivilegedMode-on
		Возврат СвойствоОбъект.Ссылка;
		
	Исключение
		ВызватьИсключение("Не удалось создать дополнительное свойство " + КлючСвойства + ". Детально: "
			+ ОписаниеОшибки());
	КонецПопытки;
		
КонецФункции

// Функция возвращает ключ свойства с учетом регамлента и установленного кода сервиса на сервере
//
// Параметры:
//  ОписаниеСвойства - Структура - описание свойства.
//
// Возвращаемое значение:
//   Строка - ключ свойства
//
Функция СтатусыДокументовПолучитьКлючСвойстваДокумента(ОписаниеСвойства)
	
	Перем СбисРегламент;
	КлючСвойства = ОписаниеСвойства.Имя;
	Если Не ИнтеграцияСтатусыДокументов.СвойстваВРазрезеКодаСервиса.НайтиПоЗначению(НРег(КлючСвойства))
			= Неопределено Тогда
		КлючСвойства = ИнтеграцияСтатусыДокументов.Сервис + КлючСвойства;
	КонецЕсли;
	
	Если ОписаниеСвойства.Свойство("Регламент", СбисРегламент)
		И ЗначениеЗаполнено(СбисРегламент) Тогда
		КлючСвойства = СбисРегламент + "_" + КлючСвойства;
	КонецЕсли;
	
	Возврат КлючСвойства;
	
КонецФункции

// Функция получает свойство объекта с учетом кода сервиса и статуса.
//
// Параметры:
//  ОписаниеСвойства - Структура - описание свойства.
//
// Возвращаемое значение:
//   ПланВидовХарактеристикСсылка - ссылка на элемент
//
Функция СтатусыДокументовПолучитьСвойствоОбъекта(ОписаниеСвойства)
	
	КлючСвойства = СтатусыДокументовПолучитьКлючСвойстваДокумента(ОписаниеСвойства);
	СсылкаНаСвойство = ИнтеграцияСтатусыДокументов.КэшСвойствОбъектов.Получить(КлючСвойства);
	Если СсылкаНаСвойство = Неопределено Тогда
		СсылкаНаСвойство = СтатусыДокументовИзвлечьСвойствоПоОписанию(КлючСвойства);
	КонецЕсли;
	
	Возврат СсылкаНаСвойство;
	
КонецФункции

// Функция получает свойство объекта с учетом кода сервиса и статуса.
//
// Параметры:
//  КлючСвойства - Строка - ключ свойства.
//
// Возвращаемое значение:
//   ПланВидовХарактеристикСсылка - ссылка на элемент
//
Функция СтатусыДокументовИзвлечьСвойствоПоОписанию(КлючСвойства)
	
	ИмяПВХ           = ИнтеграцияСтатусыДокументов.ИмяПланаВидовХарактеристикСвойствОбъектов;
	СсылкаНаСвойство = ПланыВидовХарактеристик[ИмяПВХ].НайтиПоНаименованию(КлючСвойства, Истина).Ссылка;
			
	ИнтеграцияСтатусыДокументов.КэшСвойствОбъектов.Вставить(КлючСвойства, СсылкаНаСвойство);
	
	Возврат СсылкаНаСвойство;
	
КонецФункции

Функция СтатусДокументаПоДопСведениям(UID, Объект, Сервис, Аккаунт, АктивныйЭтап, Состояние, ИмяИС = "", ИдИС = "", СбисИд = "", Регламент = "")
	
	СтруктураСтатуса = Новый Структура;
	СтруктураСтатуса.Вставить("UID",          UID);
	СтруктураСтатуса.Вставить("Сервис",       Сервис);
	СтруктураСтатуса.Вставить("Аккаунт",      Аккаунт);
	СтруктураСтатуса.Вставить("АктивныйЭтап", АктивныйЭтап);
	СтруктураСтатуса.Вставить("Состояние",    Состояние);
	СтруктураСтатуса.Вставить("Объект",       Объект);
	СтруктураСтатуса.Вставить("ИмяИС",        ИмяИС);
	СтруктураСтатуса.Вставить("ИдИС",         ИдИС);
	СтруктураСтатуса.Вставить("СбисИд",       СбисИд);
	СтруктураСтатуса.Вставить("Регламент",    Регламент);
		
	Возврат СтруктураСтатуса;
	
КонецФункции

Функция СтатусыДокументовПоДопСведениямПолучитьСостоянияОбъектов(УИДТЗ, Сервис = "", Аккаунт = "", Регламент = "") Экспорт
	
	// Входящие параметры - таблица значений ИдСБИС
	УстановитьПривилегированныйРежим(Истина);
	
	АккаунтСтрокой = СокрЛП(Аккаунт);
	
	// Собираем все ИД + с заполненным аккаунтом
	МассивИД = Новый Массив;
	Если ЗначениеЗаполнено(АккаунтСтрокой) Тогда
		Для Каждого Стр Из УИДТЗ Цикл
			МассивИД.Добавить(Стр.UID + "_" + АккаунтСтрокой);
		КонецЦикла;
	Иначе
		МассивИД = УИДТЗ.ВыгрузитьКолонку("UID");
	КонецЕсли;
	
	// Ищем документы по свойству ДокументСБИС_Ид				
	Префикс    = ПрефиксДокументаПоДопСведениям(Регламент, Сервис);	
	СвойствоИД = СтатусыДокументовИзвлечьСвойствоПоОписанию(Префикс + "_Ид");
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить(СвойствоИД);
	
	// Находим все документы с ИД + Аккаунт
	РезультатЗапросаТЗ = ТаблицаСвойствОбъектов(МассивИД, МассивСвойств, Истина);	
			
	Результат =  Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("UID",      Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("LINK");
	Результат.Колонки.Добавить("APPROVED", Новый ОписаниеТипов("Булево, Null"));
	Результат.Колонки.Добавить("ИдСБИС",   Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Сервис",   Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Аккаунт",  Новый ОписаниеТипов("Строка"));
	
	Для Каждого СтрокаСвойство Из РезультатЗапросаТЗ Цикл
		
	    СтрUID = СтрЗаменить(СтрокаСвойство.Значение, "_", Символы.ПС);
		UID    = СтрПолучитьСтроку(СтрUID, 1);		
		
		НовСтрока = Результат.Добавить();		
		НовСтрока.UID      = UID;
		НовСтрока.APPROVED = get_prop(СтрокаСвойство.Объект, "Проведен", Null);
		НовСтрока.LINK     = СтрокаСвойство.Объект;
		НовСтрока.ИдСБИС   = UID;
		НовСтрока.Сервис   = Сервис;
		НовСтрока.Аккаунт  = АккаунтСтрокой;
		
	КонецЦикла;
	
	// Перенесем все исходные УИД, которые не были найдены
	Для Каждого УИД Из МассивИД Цикл
		
		СтрUID = СтрЗаменить(УИД, "_", Символы.ПС);
		СтрUID = СтрПолучитьСтроку(СтрUID, 1);
		НашлиСтр = Результат.Найти(СтрUID, "UID");
		
		Если НашлиСтр = Неопределено Тогда
			
			НовСтрока = Результат.Добавить();
			НовСтрока.UID      = СтрUID;
			НовСтрока.APPROVED = Null;
			НовСтрока.LINK     = Неопределено;
			НовСтрока.ИдСБИС   = НовСтрока.UID;
			НовСтрока.Сервис   = Сервис;
			НовСтрока.Аккаунт  = АккаунтСтрокой;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыДокументовПоДопСведениямПрочитатьПоОбъекту(ОбъектИС, Сервис = "", Аккаунт = "", Регламент = "") Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Объект",       ОбъектИС);
	Результат.Вставить("Сервис",       Сервис);
	Результат.Вставить("АктивныйЭтап", "");
	Результат.Вставить("Состояние",    Неопределено);
	Результат.Вставить("UID",          "");
	Результат.Вставить("SbisId",       "");
	Результат.Вставить("Аккаунт",      Аккаунт);
	
	УстановитьПривилегированныйРежим (Истина);
	
	// Ищем свойства по документу		
	ВсеСвойства = ВсеСвойстваСтатусовДокументаПоДопСведениям(Регламент, Сервис);
			
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить(ВсеСвойства.СвойствоИД);
	МассивСвойств.Добавить(ВсеСвойства.СвойствоСтатус);
	МассивСвойств.Добавить(ВсеСвойства.СвойствоЭтап);
	
	РезультатЗапросаТЗ = ТаблицаСвойствОбъектов(ОбъектИС, МассивСвойств);
	
	// Находим все свойства
	Если РезультатЗапросаТЗ.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого ВыборкаДетальныеЗаписи Из РезультатЗапросаТЗ Цикл
		
		Если ВыборкаДетальныеЗаписи.Свойство = ВсеСвойства.СвойствоИД Тогда
			
			СтрUID = СтрЗаменить(ВыборкаДетальныеЗаписи.Значение, "_", Символы.ПС);
			UID    = СтрПолучитьСтроку(СтрUID, 1);
			
			Результат.Вставить("UID",    UID);
			Результат.Вставить("SbisId", UID);
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = ВсеСвойства.СвойствоСтатус Тогда
			Результат.Вставить("Состояние", ВыборкаДетальныеЗаписи.Значение);
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = ВсеСвойства.СвойствоЭтап Тогда
			Результат.Вставить("АктивныйЭтап", ВыборкаДетальныеЗаписи.Значение);
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СтатусыДокументовПоДопСведениямУдалить(Объект, Сервис = "", Аккаунт = "", Регламент = "") Экспорт
	
	Префикс = ПрефиксДокументаПоДопСведениям(Регламент, Сервис);
	
	СтатусыДокументовПоДопСведениямУдалитьСвойствоОбъекта(Префикс + "_Ид",          Объект);
	СтатусыДокументовПоДопСведениямУдалитьСвойствоОбъекта(Префикс + "_Статус",      Объект);
	СтатусыДокументовПоДопСведениямУдалитьСвойствоОбъекта(Префикс + "_ТекущийЭтап", Объект);
	
КонецПроцедуры

Процедура СтатусыДокументовПоДопСведениямУдалитьПоUID(СтатусДокумента, Регламент = "") Экспорт
		
	Если СтатусДокумента.Объект = Неопределено Тогда
		
		Если СтатусДокумента.ИмяИС <> Неопределено 
			И СтатусДокумента.ИдИС <> Неопределено Тогда
			
			Объект = ПолучитьСсылкуПоИдИС(СтатусДокумента.ИмяИС, СтатусДокумента.ИдИС);
			СтатусыДокументовПоДопСведениямУдалить(Объект, СтатусДокумента.Сервис, СтатусДокумента.Аккаунт, Регламент);
			
		Иначе
			
			//Обновление нескольких Объектов с одинаковым - UID
			Выборка = СтатусыДокументовПоДопСведениямПрочитатьПоUID(
				СтатусДокумента.UID, СтатусДокумента.Сервис, СтатусДокумента.Аккаунт);
				
			Пока Выборка.Следующий() Цикл
				СтатусыДокументовПоДопСведениямУдалить(Выборка.Объект, СтатусДокумента.Сервис, СтатусДокумента.Аккаунт, Регламент);
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе 	
		СтатусыДокументовПоДопСведениямУдалить(СтатусДокумента.Объект, СтатусДокумента.Сервис, СтатусДокумента.Аккаунт, Регламент);
	КонецЕсли;
	
КонецПроцедуры

Функция СтатусыДокументовПоДопСведениямПрочитатьПоUID(Знач UID, Сервис = "", Аккаунт = "", Регламент = "") Экспорт
		
	УИДТЗ = Новый ТаблицаЗначений;
	УИДТЗ.Колонки.Добавить("UID");
	
	НоваяСтрока = УИДТЗ.Добавить();
	НоваяСтрока.UID = UID;
	
	// Получим объекты по ИД
	ОбъектыТЗ = СтатусыДокументовПоДопСведениямПолучитьСостоянияОбъектов(УИДТЗ, Сервис, Аккаунт, Регламент);
	
	МассивТипов = Новый Массив;
	Для Каждого Стр Из ОбъектыТЗ Цикл
		МассивТипов.Добавить(ТипЗнч(Стр.LINK));
	КонецЦикла;
	ОписаниеТиповОбъекта = Новый ОписаниеТипов(МассивТипов);	
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Объект",       ОписаниеТиповОбъекта);
	Результат.Колонки.Добавить("Сервис",       Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("АктивныйЭтап", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Состояние",    Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("UID",          Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("SbisId",       Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Аккаунт",      Новый ОписаниеТипов("Строка"));
	
	Результат.Индексы.Добавить("Объект");
	Для Каждого Стр Из ОбъектыТЗ Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Объект = Стр.LINK;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим (Истина);
	
	// Ищем свойства по документу				
	ВсеСвойства = ВсеСвойстваСтатусовДокументаПоДопСведениям(Регламент, Сервис);
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить(ВсеСвойства.СвойствоИД);
	МассивСвойств.Добавить(ВсеСвойства.СвойствоСтатус);
	МассивСвойств.Добавить(ВсеСвойства.СвойствоЭтап);
	
	// Находим все свойства
	Объекты = ОбъектыТЗ.ВыгрузитьКолонку("LINK");	
	
	РезультатЗапросаТЗ = ТаблицаСвойствОбъектов(Объекты, МассивСвойств);				
	Для Каждого ВыборкаДетальныеЗаписи Из РезультатЗапросаТЗ Цикл
		
		ПараметрыОтбора = Новый Структура("Объект", ВыборкаДетальныеЗаписи.Объект);
		НашлиСтроки = Результат.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого НашлиСтр Из НашлиСтроки Цикл
			
			Если ВыборкаДетальныеЗаписи.Свойство = ВсеСвойства.СвойствоИД Тогда
				
				СтрUID = СтрЗаменить(ВыборкаДетальныеЗаписи.Значение, "_", Символы.ПС);
				UID    = СтрПолучитьСтроку(СтрUID, 1);
				
				НашлиСтр.UID    = UID;
				НашлиСтр.SbisId = UID;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = ВсеСвойства.СвойствоСтатус Тогда
				НашлиСтр.Состояние = ВыборкаДетальныеЗаписи.Значение;
			ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = ВсеСвойства.СвойствоЭтап Тогда
				НашлиСтр.АктивныйЭтап = ВыборкаДетальныеЗаписи.Значение;
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// TODO: плохо по производительности, лучше сделать в предыдущем запросе
	
	// Сделаем возврат выборки, как в оригинале
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "
			|ВЫБРАТЬ
			|	ТЗДок.*
			|ПОМЕСТИТЬ тВрем
			|ИЗ
			|	&тОбъекты КАК ТЗДок
			|;
			|
			|ВЫБРАТЬ
			|	тВрем.*
			|ИЗ
			|	тВрем КАК тВрем
			|;
			|";
		Запрос.УстановитьПараметр("тОбъекты", Результат);
		Результат = Запрос.Выполнить().Выбрать();
	Исключение
		// Сделаем пустую выборку, если типы не определить и будет исключение!
		//   такое случается когда нет данных
		Запрос = Новый Запрос;
		Запрос.Текст = "
			|ВЫБРАТЬ
			|	ИСТИНА КАК ИмяПоля
			|ГДЕ
			|	ЛОЖЬ
			|;
			|";
		Запрос.УстановитьПараметр("тОбъекты", Результат);
		Результат = Запрос.Выполнить().Выбрать();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаСвойствОбъектов(Объект, МассивСвойств, ЭтоИдентификаторы = Ложь)
	
	Если ТипЗнч(Объект) = Тип("Массив") Тогда
		МассивОбъектов = Объект;
	Иначе
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект);
		
	КонецЕсли;	
	
    // Находим все свойства
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объекты",       МассивОбъектов);
	Запрос.УстановитьПараметр("МассивСвойств", МассивСвойств);
	
	ЗапросТекст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Объект,
	|	ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	|	ЗначенияСвойствОбъектов.Свойство.Наименование КАК Наименование,
	|	ЗначенияСвойствОбъектов.Значение КАК Значение
	|ИЗ
	|	&РегистрСведений_СвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ	
	|	ЗначенияСвойствОбъектов.Свойство В(&МассивСвойств)";
		
	ИмяРегистра  = "РегистрСведений." + ИнтеграцияСтатусыДокументов.ИмяРегистраСвойствОбъектов;
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "&РегистрСведений_СвойствОбъектов", ИмяРегистра);
	Если ЭтоИдентификаторы Тогда
		ЗапросТекст = ЗапросТекст + Символы.ПС + "И ЗначенияСвойствОбъектов.Значение В (&Объекты)";
	Иначе	
		ЗапросТекст = ЗапросТекст + Символы.ПС + "И ЗначенияСвойствОбъектов.Объект В(&Объекты)";
	КонецЕсли;	
		
	Запрос.Текст = ЗапросТекст;
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура СтатусыДокументовПоДопСведениямОбновитьПоUID(СтатусДокумента) Экспорт
	
	Если СтатусДокумента.Объект = Неопределено Тогда
		
		Если СтатусДокумента.ИмяИС <> Неопределено 
			И СтатусДокумента.ИдИС <> Неопределено Тогда
			
			СтатусДокумента.Объект = ПолучитьСсылкуПоИдИС(СтатусДокумента.ИмяИС, СтатусДокумента.ИдИС);
			СтатусыДокументовПоДопСведениямОбновить(СтатусДокумента);
			
		Иначе
			
			Выборка = СтатусыДокументовПоДопСведениямПрочитатьПоUID(
				СтатусДокумента.UID,
				СтатусДокумента.Сервис,
				СтатусДокумента.Аккаунт,
				СтатусДокумента.Регламент);
				
			Пока Выборка.Следующий() Цикл
				
				СтатусДокумента.Объект = Выборка.Объект;			
				СтатусыДокументовПоДопСведениямОбновить(СтатусДокумента);
						
			КонецЦикла;
			
		КонецЕсли;	
		
	Иначе
		СтатусыДокументовПоДопСведениямОбновить(СтатусДокумента);		
	КонецЕсли;
		
КонецПроцедуры

Процедура СтатусыДокументовПоДопСведениямОбновить(Данные) Экспорт
		
	Префикс = ПрефиксДокументаПоДопСведениям(Данные.Регламент, Данные.Сервис);
	
	Если ЗначениеЗаполнено(Данные.Аккаунт) Тогда
		УИД_Документа = СокрЛП(Данные.UID) + "_" + СокрЛП(Данные.Аккаунт);
	Иначе
		УИД_Документа = Данные.UID;
	КонецЕсли;
	
	Если Данные.Состояние = Неопределено Тогда
		СостояниеСтрокой = "";
	Иначе
		СостояниеСтрокой = СокрЛП(Данные.Состояние);
	КонецЕсли;
		
	СтатусыДокументовПоДопСведениямДобавитьСвойствоОбъекта(Префикс + "_Ид",          УИД_Документа,       Данные.Объект);			
	СтатусыДокументовПоДопСведениямДобавитьСвойствоОбъекта(Префикс + "_Статус",      СостояниеСтрокой,    Данные.Объект);		
	СтатусыДокументовПоДопСведениямДобавитьСвойствоОбъекта(Префикс + "_ТекущийЭтап", Данные.АктивныйЭтап, Данные.Объект);
	
КонецПроцедуры

Функция ПрефиксДокументаПоДопСведениям(Регламент, Сервис)
	
	Префикс = СокрЛП(Сервис) + "ДокументСБИС";	
	Если ЗначениеЗаполнено(Регламент) Тогда
		Префикс = Регламент + "_" + Префикс;
	КонецЕсли;
	
	Возврат Префикс;
	
КонецФункции

Функция ВсеСвойстваСтатусовДокументаПоДопСведениям(Регламент, Сервис)
	
	// Ищем свойства по документу	
	Префикс = ПрефиксДокументаПоДопСведениям(Регламент, Сервис);
		
	СвойствоИД     = СтатусыДокументовИзвлечьСвойствоПоОписанию(Префикс + "_Ид");
	СвойствоСтатус = СтатусыДокументовИзвлечьСвойствоПоОписанию(Префикс + "_Статус");
	СвойствоЭтап   = СтатусыДокументовИзвлечьСвойствоПоОписанию(Префикс + "_ТекущийЭтап");
		
    Структура = Новый Структура;
	Структура.Вставить("СвойствоИД",     СвойствоИД);
	Структура.Вставить("СвойствоСтатус", СвойствоСтатус);
	Структура.Вставить("СвойствоЭтап",   СвойствоЭтап);
	
	Возврат Структура;
	
КонецФункции

// Удалени/добавление/обновление свойств в регистре доп.сведений конфигурации

// Удаление свойства из рег.сведений, где хранятся статусы и идентификаторы СБИС
//
// Параметры:
//  ИмяСвойства - Строка - имя свойства.
//  ДокументСсылка - ДокументСсылка - ссылка на документ.
//
Процедура СтатусыДокументовПоДопСведениямУдалитьСвойствоОбъекта(ИмяСвойства, ДокументСсылка) Экспорт
	
	ИмяПВХ = ИнтеграцияСтатусыДокументов.ИмяПланаВидовХарактеристикСвойствОбъектов;
	ЗначениеСвойства = ПланыВидовХарактеристик[ИмяПВХ].НайтиПоНаименованию(ИмяСвойства, Истина).Ссылка;
	
	// удаляет значение параметра из регистра сведений	
	ИмяРегистраСвойствОбъектов = ИнтеграцияСтатусыДокументов.ИмяРегистраСвойствОбъектов;
	НаборЗаписей = РегистрыСведений[ИмяРегистраСвойствОбъектов].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ДокументСсылка);
	НаборЗаписей.Отбор.Свойство.Установить(ЗначениеСвойства);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда	
		Попытка
			НаборЗаписей.Очистить(); 
			НаборЗаписей.Записать();
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,,, "Удаление статуса");
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Запись свойства в рег.сведений, где хранятся статусы и идентификаторы СБИС
//
// Параметры:
//  ИмяСвойства - Строка - имя свойства.
//  ЗначениеСвойства - Произвольный - значение свойства.
//  ДокументСсылка - ДокументСсылка - ссылка на документ.
//
// Возвращаемое значение:
//  Булево - Истина
//
Функция СтатусыДокументовПоДопСведениямДобавитьСвойствоОбъекта(ИмяСвойства, ЗначениеСвойства, ДокументСсылка) Экспорт
	
	СвойствоСсылка = СтатусыДокументовИзвлечьСвойствоПоОписанию(ИмяСвойства);
	
	// устанавливает значение параметра в регистре сведений	
	ОбновлятьЗначение = Истина;
	
	ИмяРегистраСвойствОбъектов = ИнтеграцияСтатусыДокументов.ИмяРегистраСвойствОбъектов;
	НаборЗаписей = РегистрыСведений[ИмяРегистраСвойствОбъектов].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ДокументСсылка);
	НаборЗаписей.Отбор.Свойство.Установить(СвойствоСсылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		НоваяЗаписьНабора = НаборЗаписей.Добавить();
		НоваяЗаписьНабора.Объект = ДокументСсылка;
		НоваяЗаписьНабора.Свойство = СвойствоСсылка;
	Иначе
		НоваяЗаписьНабора = НаборЗаписей.Получить(0);	
	КонецЕсли;
	
	Если ОбновлятьЗначение Тогда
		Попытка
			НоваяЗаписьНабора.Значение = ЗначениеСвойства;
			НаборЗаписей.Записать();
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,,, "Обновление статуса");
		КонецПопытки;
	КонецЕсли;
	
	Возврат ОбновлятьЗначение;
	
КонецФункции

#Область include_core_base_СтатусыДокументов_ОсобенностиПродукта
#КонецОбласти
