
// Возвращает имя справочника, где хранятся свойства для статусов и идентификаторов СБИС
//
// Возвращаемое значение:
//  Строка - имя
//
Функция СтатусыДокументовИмяСправочникаСвойствОбъектов()
	Если Метаданные.Справочники.Найти("ЗначенияСвойствОбъектов") <> Неопределено Тогда
		Возврат "ЗначенияСвойствОбъектов";
	ИначеЕсли Метаданные.РегистрыСведений.Найти("Saby_Состояние") <> Неопределено Тогда
		Возврат "Saby_СостоянияОбъектов";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Возвращает имя регистра, где хранятся статусы и идентификаторы СБИС
//
// Возвращаемое значение:
//  Строка - имя
//
// BSLLS:TooManyReturns-off
Функция СтатусыДокументовИмяРегистраСвойствОбъектов()
	Если Метаданные.РегистрыСведений.Найти("ДополнительныеСведения") <> Неопределено Тогда
		Возврат "ДополнительныеСведения";
	ИначеЕсли Метаданные.РегистрыСведений.Найти("ЗначенияСвойствОбъектов") <> Неопределено Тогда
		Возврат "ЗначенияСвойствОбъектов";
	ИначеЕсли Метаданные.РегистрыСведений.Найти("Saby_Состояние") <> Неопределено Тогда
		Возврат "Saby_Состояние";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
// BSLLS:TooManyReturns-on

// Возвращает имя плана видов характеристик, где хранятся названия дополнительных свойств
//
// Возвращаемое значение:
//  Строка - имя
//
// BSLLS:TooManyReturns-off
Функция СтатусыДокументовИмяПланаВидовХарактеристикСвойствОбъектов()
	Если Метаданные.ПланыВидовХарактеристик.Найти("ДополнительныеРеквизитыИСведения") <> Неопределено Тогда
		Возврат "ДополнительныеРеквизитыИСведения";
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Найти("СвойстваОбъектов") <> Неопределено Тогда
		Возврат "СвойстваОбъектов";
	ИначеЕсли Метаданные.РегистрыСведений.Найти("Saby_Состояние") <> Неопределено Тогда
		Возврат "";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
// BSLLS:TooManyReturns-on

// Заглушки интерфейса регистра Saby_Состояние

Функция СтатусыДокументовПолучитьСостоянияОбъектов(tUID, Регламент = "") Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Результат = СтатусыДокументовПоДопСведениямПолучитьСостоянияОбъектов(tUID, Сервис, Аккаунт);
	
	Если Не ЗначениеЗаполнено(Результат) и ИнтеграцияСтатусыДокументов.ИмяРегистраСвойствОбъектов = "Saby_Состояние" Тогда
		Результат = РегистрыСведений["Saby_Состояние"].ПолучитьСостоянияОбъектов(tUID, Сервис, Аккаунт);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция СтатусыДокументовОтобратьПоСпискуОбъектов(мОбъекты, Регламент = "") Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Результат = СтатусыДокументовПоДопСведениямОтобратьПоСпискуОбъектов(мОбъекты, Сервис, Аккаунт);
	
	Если Не ЗначениеЗаполнено(Результат) и ИнтеграцияСтатусыДокументов.ИмяРегистраСвойствОбъектов = "Saby_Состояние" Тогда
		Результат = РегистрыСведений["Saby_Состояние"].ОтобратьПоСпискуОбъектов(мОбъекты, Сервис, Аккаунт);
	КонецЕсли;
	Возврат ТаблицаЗначенийВМассив(Результат);
КонецФункции

Функция СтатусыДокументовПрочитатьПоОбъекту(ОбъектИС, Регламент = "") Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Результат = СтатусыДокументовПоДопСведениямПрочитатьПоОбъекту(ОбъектИС, Сервис, Аккаунт);
	
	Если Не ЗначениеЗаполнено(Результат) и ИнтеграцияСтатусыДокументов.ИмяРегистраСвойствОбъектов = "Saby_Состояние" Тогда
		Результат = РегистрыСведений["Saby_Состояние"].ПрочитатьПоОбъекту(ОбъектИС, Сервис, Аккаунт);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура СтатусыДокументовУдалить(Объект, Регламент = "") Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	СтатусыДокументовПоДопСведениямУдалить(Объект, Сервис, Аккаунт);
	
	Если ИнтеграцияСтатусыДокументов.ИмяРегистраСвойствОбъектов = "Saby_Состояние" Тогда
		РегистрыСведений["Saby_Состояние"].Удалить(Объект, Сервис, Аккаунт);
	КонецЕсли;
	
КонецПроцедуры

Процедура СтатусыДокументовУдалитьПоUID(UID, АктивныйЭтап = "", Состояние = Неопределено,
		Объект = Неопределено, ИмяИС = Неопределено, ИдИС = Неопределено, Регламент = "") Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	СтатусДокумента = СтатусДокументаПоДопСведениям(UID, Объект, Сервис, Аккаунт, АктивныйЭтап, Состояние, ИмяИС, ИдИС, , Регламент);	
	СтатусыДокументовПоДопСведениямУдалитьПоUID(СтатусДокумента);
		
	Если ИнтеграцияСтатусыДокументов.ИмяРегистраСвойствОбъектов = "Saby_Состояние" Тогда
		РегистрыСведений["Saby_Состояние"].УдалитьПоUID(UID, Сервис, Аккаунт, АктивныйЭтап, Состояние,
			Объект, ИмяИС, ИдИС);
	КонецЕсли;
	
КонецПроцедуры

Функция СтатусыДокументовПрочитатьПоUID(UID, Регламент = "") Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Результат = СтатусыДокументовПоДопСведениямПрочитатьПоUID(UID, Сервис, Аккаунт, Регламент);
	
	Если ИнтеграцияСтатусыДокументов.ИмяРегистраСвойствОбъектов = "Saby_Состояние" Тогда
		Результат = РегистрыСведений["Saby_Состояние"].ПрочитатьПоUID(UID, Сервис, Аккаунт);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура СтатусыДокументовОбновитьПоUID(UID, АктивныйЭтап = "", Состояние = Неопределено,
		Объект = Неопределено, ИмяИС = Неопределено, ИдИС = Неопределено, СбисИд = Неопределено, Регламент = "") Экспорт
		
	Перем Сервис, Аккаунт;
	
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	СтатусДокумента = СтатусДокументаПоДопСведениям(UID, Объект, Сервис, Аккаунт, АктивныйЭтап, Состояние,  ИмяИС, ИдИС, СбисИд, Регламент);		
	СтатусыДокументовПоДопСведениямОбновитьПоUID(СтатусДокумента);
	
	Если ИнтеграцияСтатусыДокументов.ИмяРегистраСвойствОбъектов = "Saby_Состояние" Тогда
		РегистрыСведений["Saby_Состояние"].ОбновитьПоUID(UID, Сервис, Аккаунт, АктивныйЭтап, Состояние, Объект,
			ИмяИС, ИдИС, СбисИд);
	КонецЕсли;
	
КонецПроцедуры

Процедура СтатусыДокументовОбновить(UID, Объект, СбисИд, АктивныйЭтап = "", Состояние = Неопределено, Регламент = "") Экспорт
	Перем Сервис, Аккаунт;
	
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	СтатусДокумента = СтатусДокументаПоДопСведениям(UID, Объект, Сервис, Аккаунт, АктивныйЭтап, Состояние, , , СбисИд, Регламент);		
	СтатусыДокументовПоДопСведениямОбновить(СтатусДокумента);
		
	Если ИнтеграцияСтатусыДокументов.ИмяРегистраСвойствОбъектов = "Saby_Состояние" Тогда
		РегистрыСведений["Saby_Состояние"].Обновить(UID, Объект, СбисИд, Сервис, Аккаунт, АктивныйЭтап, Состояние, , , , , Регламент);
	КонецЕсли;
	
КонецПроцедуры

// Интерфейс регистра Saby_Состояние в регистре доп.сведений конфигурации

Функция СтатусыДокументовПоДопСведениямОтобратьПоСпискуОбъектов(ОбъектыДляОтбора, Сервис = "", Аккаунт = "", Регламент = "") Экспорт
	
	ТаблицаОбъекты = Новый ТаблицаЗначений;
	ТаблицаОбъекты.Колонки.Добавить("Объект");
	ТаблицаОбъекты.Колонки.Добавить("ОбменСоСбис", Новый ОписаниеТипов("Булево"));
	ТаблицаОбъекты.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка"));
	ТаблицаОбъекты.Колонки.Добавить("СостояниеИдСБИС", Новый ОписаниеТипов("Число"));
	Для Каждого ДокументСсылка Из ОбъектыДляОтбора Цикл
		НовСтрока = ТаблицаОбъекты.Добавить();
		НовСтрока.Объект = ДокументСсылка;
		НовСтрока.ОбменСоСбис = Ложь;
	КонецЦикла;
	ТаблицаОбъекты.Индексы.Добавить("Объект");
	
	УстановитьПривилегированныйРежим (Истина);
	
	// Ищем документы по свойству ДокументСБИС_Ид
	Префикс    = ПрефиксДокументаПоДопСведениям(Регламент, Сервис);
	СвойствоИД = СтатусыДокументовИзвлечьСвойствоПоОписанию(Префикс + "_Ид");
	СвойствоСтатус = СтатусыДокументовИзвлечьСвойствоПоОписанию(Префикс + "_Статус");

	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить(СвойствоИД);
	МассивСвойств.Добавить(СвойствоСтатус);
		
	РезультатЗапросаТЗ = ТаблицаСвойствОбъектов(ОбъектыДляОтбора, МассивСвойств);	
			
	// Находим все документы
	Для Каждого СтрокаСвойство Из РезультатЗапросаТЗ Цикл
		ПараметрыОтбора = Новый Структура("Объект", СтрокаСвойство.Объект);
		НашлиСтроки = ТаблицаОбъекты.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокаСвойство.Наименование = Префикс + "_Ид" Тогда
			СтрUID = СтрЗаменить(СтрокаСвойство.Значение, "_", Символы.ПС);
			UID    = СтрПолучитьСтроку(СтрUID, 1);
			Для Каждого НашлиСтр Из НашлиСтроки Цикл
				НашлиСтр.ОбменСоСбис = Истина;
				НашлиСтр.UID = UID;
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		Если СтрокаСвойство.Наименование = Префикс + "_Статус" Тогда			
			Статус = СтрокаСвойство.Значение;
			Для Каждого НашлиСтр Из НашлиСтроки Цикл
				НашлиСтр.СостояниеИдСБИС = Статус;
			КонецЦикла;
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	//На недалёкое будущее
	//РезультатЗапроса.Колонки.Добавить("ТипМетаданных", Новый ОписаниеТипов("Строка") );
	//РезультатЗапроса.Колонки.Добавить("ТипОбъекта", Новый ОписаниеТипов("Строка") );
	//Для Каждого СтрокаРЗ ИЗ РезультатЗапроса Цикл
	//	СтрокаРЗ.ТипМетаданных	= ОпределитьТипМетаданных(СтрокаРЗ.Объект) ;
	//	СтрокаРЗ.ТипОбъекта		= СтрокаРЗ.Объект.Метаданные().Имя;
	//КонецЦикла;
	
	Возврат ТаблицаОбъекты;
	
КонецФункции	

