
// Возвращает имя справочника, где хранятся свойства для статусов и идентификаторов СБИС
//
// Возвращаемое значение:
//  Строка - имя
//
Функция СтатусыДокументовИмяСправочникаСвойствОбъектов()
	Если Метаданные.Справочники.Найти("ЗначенияСвойствОбъектов") <> Неопределено Тогда
		Возврат "ЗначенияСвойствОбъектов";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Возвращает имя регистра, где хранятся статусы и идентификаторы СБИС
//
// Возвращаемое значение:
//  Строка - имя
//
// BSLLS:TooManyReturns-off
Функция СтатусыДокументовИмяРегистраСвойствОбъектов()
	Если Метаданные.РегистрыСведений.Найти("ДополнительныеСведения") <> Неопределено Тогда
		Возврат "ДополнительныеСведения";
	ИначеЕсли Метаданные.РегистрыСведений.Найти("ЗначенияСвойствОбъектов") <> Неопределено Тогда
		Возврат "ЗначенияСвойствОбъектов";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
// BSLLS:TooManyReturns-on

// Возвращает имя плана видов характеристик, где хранятся названия дополнительных свойств
//
// Возвращаемое значение:
//  Строка - имя
//
// BSLLS:TooManyReturns-off
Функция СтатусыДокументовИмяПланаВидовХарактеристикСвойствОбъектов()
	Если Метаданные.ПланыВидовХарактеристик.Найти("ДополнительныеРеквизитыИСведения") <> Неопределено Тогда
		Возврат "ДополнительныеРеквизитыИСведения";
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Найти("СвойстваОбъектов") <> Неопределено Тогда
		Возврат "СвойстваОбъектов";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
// BSLLS:TooManyReturns-on

// Заглушки интерфейса регистра Saby_Состояние

Функция СтатусыДокументовПолучитьСостоянияОбъектов(tUID, Регламент = "") Экспорт
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	Результат = СтатусыДокументовПоДопСведениямПолучитьСостоянияОбъектов(tUID, Сервис, Аккаунт);
	Возврат Результат;
КонецФункции

Функция СтатусыДокументовОтобратьПоСпискуОбъектов(мОбъекты, Регламент = "") Экспорт
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	Результат = СтатусыДокументовПоДопСведениямОтобратьПоСпискуОбъектов(мОбъекты, Сервис, Аккаунт);
	Возврат ТаблицаЗначенийВМассив(Результат);
КонецФункции

Функция СтатусыДокументовПрочитатьПоОбъекту(ОбъектИС, Регламент = "") Экспорт
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	Результат = СтатусыДокументовПоДопСведениямПрочитатьПоОбъекту(ОбъектИС, Сервис, Аккаунт);
	Возврат Результат;
КонецФункции

Процедура СтатусыДокументовУдалить(Объект, Регламент = "") Экспорт
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	СтатусыДокументовПоДопСведениямУдалить(Объект, Сервис, Аккаунт);
КонецПроцедуры

Процедура СтатусыДокументовУдалитьПоUID(UID, АктивныйЭтап = "", Состояние = Неопределено,
		Объект = Неопределено, ИмяИС = Неопределено, ИдИС = Неопределено, Регламент = "") Экспорт
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	СтатусДокумента = СтатусДокументаПоДопСведениям(UID, Объект, Сервис, Аккаунт, АктивныйЭтап, Состояние, ИмяИС, ИдИС, , Регламент);	
	СтатусыДокументовПоДопСведениямУдалитьПоUID(СтатусДокумента);		
КонецПроцедуры

Функция СтатусыДокументовПрочитатьПоUID(UID, Регламент = "") Экспорт
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	Результат = СтатусыДокументовПоДопСведениямПрочитатьПоUID(UID, Сервис, Аккаунт, Регламент);
	Возврат Результат;
КонецФункции

Процедура СтатусыДокументовОбновитьПоUID(UID, АктивныйЭтап = "", Состояние = Неопределено,
		Объект = Неопределено, ИмяИС = Неопределено, ИдИС = Неопределено, СбисИд = Неопределено, Регламент = "") Экспорт
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	СтатусДокумента = СтатусДокументаПоДопСведениям(UID, Объект, Сервис, Аккаунт, АктивныйЭтап, Состояние,  ИмяИС, ИдИС, СбисИд, Регламент);		
	СтатусыДокументовПоДопСведениямОбновитьПоUID(СтатусДокумента);		
КонецПроцедуры

Процедура СтатусыДокументовОбновить(UID, Объект, СбисИд, АктивныйЭтап = "", Состояние = Неопределено, Регламент = "") Экспорт
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	СтатусДокумента = СтатусДокументаПоДопСведениям(UID, Объект, Сервис, Аккаунт, АктивныйЭтап, Состояние, , , СбисИд, Регламент);		
	СтатусыДокументовПоДопСведениямОбновить(СтатусДокумента);			
КонецПроцедуры

// Интерфейс регистра Saby_Состояние в регистре доп.сведений конфигурации

Функция СтатусыДокументовПоДопСведениямОтобратьПоСпискуОбъектов(ОбъектыДляОтбора, Сервис = "", Аккаунт = "", Регламент = "") Экспорт
	
	ТаблицаСтатусыОбъекты = Новый ТаблицаЗначений;
	ТаблицаСтатусыОбъекты.Колонки.Добавить("Объект");
	ТаблицаСтатусыОбъекты.Колонки.Добавить("ОбменСоСбис", Новый ОписаниеТипов("Булево"));
	ТаблицаСтатусыОбъекты.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка"));
	ТаблицаСтатусыОбъекты.Колонки.Добавить("СостояниеИдСБИС", Новый ОписаниеТипов("Число"));
	Для Каждого ДокументСсылка Из ОбъектыДляОтбора Цикл
		НовСтрока = ТаблицаСтатусыОбъекты.Добавить();
		НовСтрока.Объект = ДокументСсылка;
		НовСтрока.ОбменСоСбис = Ложь;
	КонецЦикла;
	ТаблицаСтатусыОбъекты.Индексы.Добавить("Объект");
	
	УстановитьПривилегированныйРежим (Истина);
	// Ищем документы по свойству ДокументСБИС_Ид
	Префикс    = ПрефиксДокументаПоДопСведениям(Регламент, Сервис);
	СвойствоИД = СтатусыДокументовИзвлечьСвойствоПоОписанию(Префикс + "_Ид");
	СвойствоСтатус = СтатусыДокументовИзвлечьСвойствоПоОписанию(Префикс + "_Статус");

	МассивСвойствОбъекта = Новый Массив;
	МассивСвойствОбъекта.Добавить(СвойствоИД);
	МассивСвойствОбъекта.Добавить(СвойствоСтатус);
		
	СвойстваОбъектовТЗ = ТаблицаСвойствОбъектов(ОбъектыДляОтбора, МассивСвойствОбъекта);	
			
	// Находим все документы
	Для Каждого СтрокаСвойство Из СвойстваОбъектовТЗ Цикл
		ПараметрыОтбора = Новый Структура("Объект", СтрокаСвойство.Объект);
		НашлиСтроки = ТаблицаСтатусыОбъекты.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокаСвойство.Наименование = Префикс + "_Ид" Тогда
			СтрUID = СтрЗаменить(СтрокаСвойство.Значение, "_", Символы.ПС);
			UID    = СтрПолучитьСтроку(СтрUID, 1);
			Для Каждого НашлиСтр Из НашлиСтроки Цикл
				НашлиСтр.ОбменСоСбис = Истина;
				НашлиСтр.UID = UID;
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		Если СтрокаСвойство.Наименование = Префикс + "_Статус" Тогда			
			Статус = СтрокаСвойство.Значение;
			Для Каждого НашлиСтр Из НашлиСтроки Цикл
				НашлиСтр.СостояниеИдСБИС = Статус;
			КонецЦикла;
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	//На недалёкое будущее
	//РезультатЗапроса.Колонки.Добавить("ТипМетаданных", Новый ОписаниеТипов("Строка") );
	//РезультатЗапроса.Колонки.Добавить("ТипОбъекта", Новый ОписаниеТипов("Строка") );
	//Для Каждого СтрокаРЗ ИЗ РезультатЗапроса Цикл
	//	СтрокаРЗ.ТипМетаданных	= ОпределитьТипМетаданных(СтрокаРЗ.Объект) ;
	//	СтрокаРЗ.ТипОбъекта		= СтрокаРЗ.Объект.Метаданные().Имя;
	//КонецЦикла;
	
	Возврат ТаблицаСтатусыОбъекты;
	
КонецФункции	

