
// Возвращает имя справочника, где хранятся свойства для статусов и идентификаторов СБИС
//
// Возвращаемое значение:
//  Строка - имя
//
Функция СтатусыДокументовИмяСправочникаСвойствОбъектов()
	Если Метаданные.Справочники.Найти("ЗначенияСвойствОбъектов") <> Неопределено Тогда
		Возврат "ЗначенияСвойствОбъектов";
	Иначе
		ВызватьИсключение("Не найден справочник для хранения статусов и идентификаторов СБИС");
	КонецЕсли;
КонецФункции

// Возвращает имя регистра, где хранятся статусы и идентификаторы СБИС
//
// Возвращаемое значение:
//  Строка - имя
//
Функция СтатусыДокументовИмяРегистраСвойствОбъектов()
	Если Метаданные.РегистрыСведений.Найти("ДополнительныеСведения") <> Неопределено Тогда
		Возврат "ДополнительныеСведения";
	ИначеЕсли Метаданные.РегистрыСведений.Найти("ЗначенияСвойствОбъектов") <> Неопределено Тогда
		Возврат "ЗначенияСвойствОбъектов";
	Иначе
		ВызватьИсключение("Не найден регистр для хранения статусов и идентификаторов СБИС");
	КонецЕсли;
КонецФункции 

// Возвращает имя плана видов характеристик, где хранятся названия дополнительных свойств
//
// Возвращаемое значение:
//  Строка - имя
//
Функция СтатусыДокументовИмяПланаВидовХарактеристикСвойствОбъектов()
	Если Метаданные.ПланыВидовХарактеристик.Найти("ДополнительныеРеквизитыИСведения") <> Неопределено Тогда
		Возврат "ДополнительныеРеквизитыИСведения";
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Найти("СвойстваОбъектов") <> Неопределено Тогда
		Возврат "СвойстваОбъектов";
	Иначе
		ВызватьИсключение("Не найден план дополнительных свойств для настройки "
			+ "хранения статусов и идентификаторов СБИС");
	КонецЕсли;
КонецФункции

// Заглушки интерфейса регистра Saby_Состояние

Функция СтатусыДокументовПолучитьСостоянияОбъектов(tUID) Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Возврат РегистрыСведений[ПрефиксПродукта() + "Состояние"].ПолучитьСостоянияОбъектов(tUID, Сервис, Аккаунт);
	
КонецФункции

Функция СтатусыДокументовОтобратьПоСпискуОбъектов(мОбъекты) Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	// TODO 25.2100 Результат1 = ТаблицаЗначенийВМассив(СтатусыДокументовПоДопСведениямОтобратьПоСпискуОбъектов(мОбъекты, Сервис, Аккаунт));
	Возврат   ТаблицаЗначенийВМассив(РегистрыСведений[ПрефиксПродукта() + "Состояние"].ОтобратьПоСпискуОбъектов(мОбъекты, Сервис, Аккаунт));
КонецФункции

Функция СтатусыДокументовПрочитатьПоОбъекту(ОбъектИС) Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Возврат РегистрыСведений[ПрефиксПродукта() + "Состояние"].ПрочитатьПоОбъекту(ОбъектИС, Сервис, Аккаунт);
	
КонецФункции

Функция СтатусыДокументовУдалить(Объект) Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Возврат РегистрыСведений[ПрефиксПродукта() + "Состояние"].Удалить(Объект, Сервис, Аккаунт);
	
КонецФункции

Процедура СтатусыДокументовУдалитьПоUID(UID, АктивныйЭтап = "", Состояние = Неопределено,
		Объект = Неопределено, ИмяИС = Неопределено, ИдИС = Неопределено) Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	РегистрыСведений[ПрефиксПродукта() + "Состояние"].УдалитьПоUID(UID, Сервис, Аккаунт, АктивныйЭтап, Состояние,
		Объект, ИмяИС, ИдИС);
	
КонецПроцедуры

Функция СтатусыДокументовПрочитатьПоUID(UID, Регламент = "") Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Результат = РегистрыСведений[ПрефиксПродукта() + "Состояние"].ПрочитатьПоUID(UID, Сервис, Аккаунт);
	Если Не ЗначениеЗаполнено(Результат) Тогда 
		Результат = СтатусыДокументовПоДопСведениямПрочитатьПоUID(UID, Сервис, Аккаунт, Регламент);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура СтатусыДокументовОбновитьПоUID(UID, АктивныйЭтап = "", Состояние = Неопределено,
		Объект = Неопределено, ИмяИС = Неопределено, ИдИС = Неопределено, СбисИд = Неопределено, Регламент = "") Экспорт
		
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	РегистрыСведений[ПрефиксПродукта() + "Состояние"].ОбновитьПоUID(UID, Сервис, Аккаунт, АктивныйЭтап, Состояние, Объект,
		ИмяИС, ИдИС, СбисИд);
		
	СтатусДокумента = СтатусДокументаПоДопСведениям(UID, Объект, Сервис, Аккаунт, АктивныйЭтап, Состояние,  ИмяИС, ИдИС, СбисИд, Регламент);		
	СтатусыДокументовПоДопСведениямОбновитьПоUID(СтатусДокумента);	
КонецПроцедуры

Процедура СтатусыДокументовОбновить(UID, Объект, СбисИд, АктивныйЭтап = "", Состояние = Неопределено) Экспорт	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	РегистрыСведений[ПрефиксПродукта() + "Состояние"].Обновить(UID, Объект, СбисИд, Сервис, Аккаунт, АктивныйЭтап, Состояние);
	
КонецПроцедуры

// Интерфейс регистра Saby_Состояние в регистре доп.сведений конфигурации

Функция СтатусыДокументовПоДопСведениямОтобратьПоСпискуОбъектов(ОбъектыДляОтбора, Сервис = "", Аккаунт = "", Регламент = "") Экспорт
	
	ТаблицаОбъекты = Новый ТаблицаЗначений;
	ТаблицаОбъекты.Колонки.Добавить("Объект");
	ТаблицаОбъекты.Колонки.Добавить("ОбменСоСбис", Новый ОписаниеТипов("Булево"));
	ТаблицаОбъекты.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка"));
	Для Каждого ДокументСсылка Из ОбъектыДляОтбора Цикл
		НовСтрока = ТаблицаОбъекты.Добавить();
		НовСтрока.Объект = ДокументСсылка;
		НовСтрока.ОбменСоСбис = Ложь;
	КонецЦикла;
	ТаблицаОбъекты.Индексы.Добавить("Объект");
	
	УстановитьПривилегированныйРежим (Истина);
	
	// Ищем документы по свойству ДокументСБИС_Ид
	Префикс    = ПрефиксДокументаПоДопСведениям(Регламент, Сервис);
	СвойствоИД = СтатусыДокументовИзвлечьСвойствоПоОписанию(Префикс + "_Ид");
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить(СвойствоИД);
		
	РезультатЗапросаТЗ = ТаблицаСвойствОбъектов(ОбъектыДляОтбора, МассивСвойств);	
			
	// Находим все документы
	Для Каждого СтрокаСвойство Из РезультатЗапросаТЗ Цикл
		
		СтрUID = СтрЗаменить(СтрокаСвойство.Значение, "_", Символы.ПС);
		UID    = СтрПолучитьСтроку(СтрUID, 1);
		
		ПараметрыОтбора = Новый Структура("Объект", СтрокаСвойство.Объект);
		НашлиСтроки = ТаблицаОбъекты.НайтиСтроки(ПараметрыОтбора);
		Для Каждого НашлиСтр Из НашлиСтроки Цикл
			НашлиСтр.ОбменСоСбис = Истина;
			НашлиСтр.UID = UID;
		КонецЦикла;
		
	КонецЦикла;
	
	//На недалёкое будущее
	//РезультатЗапроса.Колонки.Добавить("ТипМетаданных", Новый ОписаниеТипов("Строка") );
	//РезультатЗапроса.Колонки.Добавить("ТипОбъекта", Новый ОписаниеТипов("Строка") );
	//Для Каждого СтрокаРЗ ИЗ РезультатЗапроса Цикл
	//	СтрокаРЗ.ТипМетаданных	= ОпределитьТипМетаданных(СтрокаРЗ.Объект) ;
	//	СтрокаРЗ.ТипОбъекта		= СтрокаРЗ.Объект.Метаданные().Имя;
	//КонецЦикла;
	
	Возврат ТаблицаОбъекты;
	
КонецФункции	

