
Процедура СтатусыДокументовИнициализация(context_params = Неопределено) Экспорт
	
	Перем Сервис, ТекущийСервис;
	
	Если context_params = Неопределено Тогда
		context_params = НастройкиПодключенияПрочитать();
	КонецЕсли;
	
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		ИнтеграцияСтатусыДокументов = Новый Структура;
		ИнтеграцияСтатусыДокументов.Вставить("Сервис", "---undefine---"); // Обновится при 1-ом запуске
		ИнтеграцияСтатусыДокументов.Вставить("Аккаунт", "");
	КонецЕсли;
	
	// Сервис может меняться, если перелогиниться
	Сервис = СтатусыДокументовСервис(context_params);
	ИнтеграцияСтатусыДокументов.Свойство("Сервис", ТекущийСервис);
	Если Сервис <> ТекущийСервис Тогда
		ИнтеграцияСтатусыДокументов.Вставить("Сервис", Сервис);
		ИнтеграцияСтатусыДокументов.Вставить("Аккаунт", get_prop(context_params, "account", "") );
	КонецЕсли;
	
КонецПроцедуры

// Заглушки интерфейса регистра Saby_Состояние

Функция СтатусыДокументовПолучитьСостоянияОбъектов(tUID) Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Возврат РегистрыСведений.Saby_Состояние.ПолучитьСостоянияОбъектов(tUID, Сервис, Аккаунт);
	
КонецФункции

Функция СтатусыДокументовОтобратьПоСпискуОбъектов(мОбъекты) Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Возврат ТаблицаЗначенийВМассив(РегистрыСведений.Saby_Состояние.ОтобратьПоСпискуОбъектов(мОбъекты, Сервис, Аккаунт));
	
КонецФункции

Функция СтатусыДокументовПрочитатьПоОбъекту(ОбъектИС) Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Возврат РегистрыСведений.Saby_Состояние.ПрочитатьПоОбъекту(ОбъектИС, Сервис, Аккаунт);
	
КонецФункции

Функция СтатусыДокументовУдалить(Объект) Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Возврат РегистрыСведений.Saby_Состояние.Удалить(Объект, Сервис, Аккаунт);
	
КонецФункции

Процедура СтатусыДокументовУдалитьПоUID(UID, АктивныйЭтап = "", Состояние = Неопределено,
		Объект = Неопределено, ИмяИС = Неопределено, ИдИС = Неопределено) Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	РегистрыСведений.Saby_Состояние.УдалитьПоUID(UID, Сервис, Аккаунт, АктивныйЭтап, Состояние,
		Объект, ИмяИС, ИдИС);
	
КонецПроцедуры

Функция СтатусыДокументовПрочитатьПоUID(UID) Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	Возврат РегистрыСведений.Saby_Состояние.ПрочитатьПоUID(UID, Сервис, Аккаунт);
	
КонецФункции

Процедура СтатусыДокументовОбновитьПоUID(UID, АктивныйЭтап = "", Состояние = Неопределено,
		Объект = Неопределено, ИмяИС = Неопределено, ИдИС = Неопределено, СбисИд = Неопределено) Экспорт
		
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	РегистрыСведений.Saby_Состояние.ОбновитьПоUID(UID, Сервис, Аккаунт, АктивныйЭтап, Состояние, Объект,
		ИмяИС, ИдИС, СбисИд);
	
КонецПроцедуры

Процедура СтатусыДокументовОбновить(UID, АктивныйЭтап = "", Состояние = Неопределено,
		Объект, СбисИд) Экспорт
	
	Перем Сервис, Аккаунт;
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация()
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	РегистрыСведений.Saby_Состояние.Обновить(UID, Сервис, Аккаунт, АктивныйЭтап, Состояние, Объект, СбисИд);
	
КонецПроцедуры

