
Процедура Saby_ОбработчикРезультатаЗакрытияОкнаАвторизации(Результат, Параметры) Экспорт
	Если Результат <> Неопределено Тогда
		Saby_ОбработчикКоманды(Параметры.ФормаОтчета, Параметры.Команда, Параметры.Результат);
	КонецЕсли;
КонецПроцедуры
	
&После("ОбработчикКоманды")
Процедура Saby_ОбработчикКоманды(ФормаОтчета, Команда, Результат) Экспорт
	
	ДлиннаПрефикса = СтрДлина(ПрефиксПродукта());
	Если Врег(Лев(Команда.Имя, ДлиннаПрефикса)) <> Врег(Лев(ПрефиксПродукта(), ДлиннаПрефикса)) Тогда
		Возврат;
	КонецЕсли;
	
	context_params	= МодульCoreКлиент().ПроверитьНаличиеПараметровПодключения();
	Если context_params = Неопределено Тогда
		ВходящиеПараметры	= Новый Структура("ФормаОтчета, Команда, Результат",ФормаОтчета,Команда,Результат);
		ПроверкаВведенныхДанныхАутентификации = Новый ОписаниеОповещения("Saby_ОбработчикРезультатаЗакрытияОкнаАвторизации", ОтчетыКлиентПереопределяемый, ВходящиеПараметры);
		ОткрытьФорму("Обработка." + ПрефиксПродукта() + "SABY.Форма.Вход",,,,,, ПроверкаВведенныхДанныхАутентификации);
		Возврат;
	КонецЕсли;
	
	#Область include_core_base_ВстраиваниеВФормы_ПереопределениеОбработчиков_ОтчетыОбработчикКомандыЗаглушка
    #КонецОбласти
КонецПроцедуры

