
#Область ОписаниеПеременных
// BSLLS:ExportVariables-off Необходимо для считывания из формы потомка
&НаКлиенте
Перем ТранспортИнтеграции Экспорт; 
// BSLLS:ExportVariables-on 
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСерверСКлиента
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

#Область include_core_base_Авторизация_ОткрытьФормуАвторизацииПриОтсутствииСессии
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Этаформа.ЭтоВнешняяОбработка = ЭтоВнешняяОбработка();
	Этаформа.ИмяОбработки = ИмяОбработки();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Заполнитьcontext_param();
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ПослеАвторизации", ЭтаФорма);
	ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции, ОбработчикПослеАвторизации);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьАвтоматическиеОперации" Тогда
		ОбновитьТаблицуАвтоматическиеОперации();
	ИначеЕсли ИмяСобытия = "SabySignOut" Тогда
		Закрыть();
	Иначе
		Возврат;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_РеквизитИдентификаторПодключения
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ОбработчикиСобытийЭлементовТаблицаПодключений
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеАвторизации(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда 
		ЭтаФорма.Закрыть();
		Возврат;
	КонецЕсли;
	Заполнитьcontext_param();
	ПродолжитьОткрытие();
КонецПроцедуры

&НаСервере
Процедура Заполнитьcontext_param()
	МодульОбъекта = МодульОбъекта(); 
	Этаформа.context_params = МодульОбъекта.ПроверитьНаличиеПараметровПодключения();	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОткрытие()
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	ПутьОбработкиДляВыполненияФоновогоЗадания();
	ОбновитьТаблицуАвтоматическиеОперации(); 	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОперацииНаСервере() 
	ТаблицаПодключений.Очистить();
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЗаполнитьОперации(Результат);
	УдалитьИзВременногоХранилища(АдресРезультата);	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьГруппуДлительныйПроцесс() 
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаИнтерфейса.ТекущаяСтраница 			= ЭлемФормы.ГруппаИнтерфейса.ПодчиненныеЭлементы.ГруппаДлительныйПроцесс;
	ЭлемФормы.ТаблицаПодключенийДобавить.Видимость 		= ЛОЖЬ;
	ЭлемФормы.ТаблицаПодключенийОбновить.Видимость 		= ЛОЖЬ;
	ЭлемФормы.ТаблицаПодключенийРедактировать.Видимость = ЛОЖЬ;
	ЭлемФормы.ТаблицаПодключенийУдалить.Видимость 		= ЛОЖЬ;
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОсновнуюГруппу()
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаИнтерфейса.ТекущаяСтраница 			= ЭлемФормы.ГруппаИнтерфейса.ПодчиненныеЭлементы.ГруппаОсновная;	
	ЭлемФормы.ТаблицаПодключенийДобавить.Видимость 		= ИСТИНА;
	ЭлемФормы.ТаблицаПодключенийОбновить.Видимость 		= ИСТИНА;
	ЭлемФормы.ТаблицаПодключенийРедактировать.Видимость = ИСТИНА;
	ЭлемФормы.ТаблицаПодключенийУдалить.Видимость		= ИСТИНА;
КонецПроцедуры	

&НаСервереБезКонтекста
Функция СостояниеФоновогоЗаданияНаСервере(Знач ИдентификаторЗадания)   
	Результат = Новый Структура;
	Результат.Вставить("Статус", "Выполняется");
	Результат.Вставить("КраткоеПредставлениеОшибки", Неопределено);
	Результат.Вставить("ПодробноеПредставлениеОшибки", Неопределено);
	Результат.Вставить("Прогресс", Неопределено);
	Результат.Вставить("Сообщения", Неопределено);
	Результат.Вставить("Наименование", Неопределено);
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно 
		Или Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		Результат.Статус = "Ошибка";
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		Результат.Статус = "Выполнено";
	Иначе 
		Возврат Результат;
	КонецЕсли; 
	Возврат Результат;	
КонецФункции

&НаКлиенте
Процедура ПроверкаВыполненияФоновогоЗадания()  
	Задание = СостояниеФоновогоЗаданияНаСервере(ИдентификаторЗадания);
	Если Задание = Неопределено
		ИЛИ Задание.Свойство("Статус") = ЛОЖЬ 
		ИЛИ Задание.Статус <> "Выполняется" Тогда
		ОтключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания");
		ОтобразитьОсновнуюГруппу();
		ОбновитьОперацииНаСервере();
	КонецЕсли; 	
КонецПроцедуры


#Область include_core_base_АвтоматическиеОперации_Form_РоботСписок_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ВызовФорм
#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ВызовФорм_УдалениеУзлаОбмена
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключенияНаСервере
#КонецОбласти

#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_Helpers_КартинкиУспешноОшибка
#КонецОбласти

#Область include_core_base_Транспорт_ВидТранспорта
#КонецОбласти

#Область include_core_base_Транспорт_ИмяСвойстваТранспорта 
#КонецОбласти
