


&НаКлиенте
Процедура ОбновитьТаблицуАвтоматическиеОперации()
	АдресРезультата=ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("context_param", ЭтаФорма.context_params);
	ПараметрыЗадания.Вставить("АдресРезультата",АдресРезультата);
	НаименованиеФоновогоЗадания = НСтр("ru = 'Получить список "+ЛокализацияНазваниеПродукта()+" подключений'");
	
	ИмяОбработки = ПутьОбработкиДляВыполненияФоновогоЗадания();
	ПараметрыДлительныеОперации = Новый Структура;
	Если ТипЗнч(ИмяОбработки) = Тип("Строка") Тогда
		ПараметрыДлительныеОперации.Вставить("ИмяОбработки",					ИмяОбработки); 
	Иначе     
		ПараметрыДлительныеОперации.Вставить("ДополнительнаяОбработкаСсылка",	ИмяОбработки); 	
	КонецЕсли;
	ПараметрыДлительныеОперации.Вставить("ИмяМетода",			"ПолучитьАвтоматическиеОперацииФоновыеЗадания");
	ПараметрыДлительныеОперации.Вставить("ПараметрыВыполнения",	ПараметрыЗадания);
	ПараметрыДлительныеОперации.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка());
	
	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ПараметрыДлительныеОперации);
	ПараметрыЗадания.Добавить("");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("ФоновоеЗаданиеИмяМетода", 	ВыполняемыйМетод);
	ПараметрыФоновогоЗадания.Вставить("ФоновоеЗаданиеПараметры", 	ПараметрыЗадания);
	ПараметрыФоновогоЗадания.Вставить("ФоновоеЗаданиеНаименование", НаименованиеФоновогоЗадания);
	ПараметрыФоновогоЗадания.Вставить("ИдентификаторЗадания", 	Новый УникальныйИдентификатор);
	
	
	ЗапуститьФоновоеЗаданиеСервер(ПараметрыФоновогоЗадания);
		
	ОтобразитьГруппуДлительныйПроцесс();
	ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 1, ЛОЖЬ);

КонецПроцедуры

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_ExtException
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_ПараметрыСеанса
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_Сервер
#КонецОбласти
