


&НаКлиенте
Процедура ОбновитьТаблицуАвтоматическиеОперации()
	АдресРезультата=ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("context_param", context_param);
	ПараметрыЗадания.Вставить("АдресРезультата",АдресРезультата);
	НаименованиеФоновогоЗадания = НСтр("ru = 'Получить список "+ЛокализацияНазваниеПродукта()+" подключений'");
	ЗаполнитьПутьОбработкиДляВыполненияФоновогоЗадания();	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания, "ПолучитьАвтоматическиеОперацииФоновыеЗадания", НаименованиеФоновогоЗадания);
		
	ОтобразитьГруппуДлительныйПроцесс();
	ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 1, ЛОЖЬ);

КонецПроцедуры

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_ExtException
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

