
//DynamicDirective

Процедура ЗаписатьСессию(context_params, СтруктураПараметров) Экспорт
	ИмяПараметраСессии = ИмяПараметраСессииПоВидуТранспорта(context_params);
	СтруктураСессии = СтруктураСессии(context_params);
	Если СтруктураСессии = Неопределено Тогда
		СтруктураСессии = Новый Структура;
	КонецЕсли;
	Если ТипЗнч(СтруктураСессии) = Тип("Строка") Тогда 
		Значение = СтруктураСессии;
		СтруктураСессии = Новый Структура;
		СтруктураСессии.Вставить("session", Значение);	
	КонецЕсли;
	Для Каждого Запись Из СтруктураПараметров Цикл
		СтруктураСессии.Вставить(Запись.Ключ, Запись.Значение);
	КонецЦикла; 
	context_params.Вставить(ИмяПараметраСессии, СтруктураСессии);
КонецПроцедуры

//DynamicDirective

Функция СтруктураСессии(context_params) Экспорт
	ИмяПараметраСессии = ИмяПараметраСессииПоВидуТранспорта(context_params);
	Возврат get_prop(context_params, ИмяПараметраСессии);		
КонецФункции


//DynamicDirective

Функция СвойствоСессии(context_params, Свойство) Экспорт
	Сессия = СтруктураСессии(context_params);
	
	Возврат get_prop(Сессия, Свойство);		
КонецФункции

//DynamicDirective

Процедура ОчиститьСессию(context_params) Экспорт
	ИмяПараметраСессии = ИмяПараметраСессииПоВидуТранспорта(context_params);
	context_params.Вставить(ИмяПараметраСессии, Неопределено);
КонецПроцедуры

//DynamicDirective

Функция ИмяПараметраСессииПоВидуТранспорта(context_params) 
	ВидТранспорта = ВидТранспорта(context_params);
	Если ВидТранспорта = "ExtSdk" Или ВидТранспорта = "ExtSdkCrypto" Или ВидТранспорта = "SabyPluginConnector"  Тогда
		Возврат "SessionExtSdk";
	КонецЕсли;	
	Возврат "Session";
КонецФункции

//DynamicDirective

Функция УИДСессии(context_params) Экспорт
	ИмяПараметраСессии = ИмяПараметраСессииПоВидуТранспорта(context_params);
	session = get_prop(context_params, ИмяПараметраСессии);	
	Возврат get_prop(session, "session");		
КонецФункции
