
&НаКлиенте
Процедура ОткрытьАдресВФормеБраузера(АдресСтраницы, Заголовок)
	context_params = МодульCoreКлиент().ПроверитьНаличиеПараметровПодключения();
	АдресСДоменом = МодульCoreКлиент().get_prop(context_params, "ApiUrl", "") + АдресСтраницы;
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок", Заголовок);
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСДоменом);
	ПараметрыФормы.Вставить("context_param", context_params);
	ОткрытьФорму("Обработка." + ПрефиксПродукта() + "SABY.Форма.Browser", ПараметрыФормы, , Заголовок);
КонецПроцедуры

