
#Область include_base_CommonModule_ИменаМодулейСервер
#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти  

#Область include_core_base_Helpers_ПолучитьОбработку
#КонецОбласти

#Область include_base_InformationRegister_ИмяРегистраСостояние
#КонецОбласти

#Область include_core_base_Helpers_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_ВстраиваемыеОбъектыВТиповыхРеестрах
#КонецОбласти

#Область ОбщиеИСервисныеМетоды

// Получить тип ссылки по объекту метаданных
//
// Параметры:
//  ОбъектМетаданных - Метаданные - объект метаданных
//
// Возвращаемое значение:
//   Тип - тип ссылки
//
Функция ПолучитьТипСсылкиПоМетаданным(ОбъектМетаданных) 
	ТипСсылки = Неопределено;
	Если ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
		ТипСсылки = Тип("ДокументСсылка."+ОбъектМетаданных.Имя);
	ИначеЕсли ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
		ТипСсылки = Тип("СправочникСсылка."+ОбъектМетаданных.Имя);
	Иначе
		Возврат ТипСсылки;
	КонецЕсли;
	Возврат ТипСсылки;
КонецФункции // ПолучитьТипСсылкиПоМетаданным()

Функция ИмяТипаМетаданных(ТипИсточника) Экспорт
	Имя = "";
	ТипОбъекта = Метаданные.НайтиПоТипу(ТипИсточника);
	Если ТипОбъекта	<> Неопределено Тогда
		Имя	=  ТипОбъекта.Имя;
	КонецЕсли;
	Возврат Имя;
КонецФункции

Функция ИмяТипаПервогоОбъекта(Контекст) Экспорт
	Имя	= Неопределено;
	// Определяем по первому элементу. т.к. смешанных списков быть не должно то и
	// документы не могут быть по определению в одном списке со справочниками
	Для Каждого ТипИсточника Из Контекст.ТипыИсточников Цикл
		Имя = ИмяТипаМетаданных(ТипИсточника);
		Прервать;
	КонецЦикла;	
	Возврат Имя;
КонецФункции

// BSLLS:Typo-off
// Корректное имя метода

Функция ТипМетаданного(ТипИсточника) Экспорт
	ТипОбъекта	= Неопределено;
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипИсточника); 
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		ТипОбъекта	=  "Справочник";
	КонецЕсли;
	Если ТипОбъекта = Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		ТипОбъекта	=  "Документ";
	КонецЕсли;
	Возврат ТипОбъекта;
КонецФункции
// BSLLS:Typo-on

Функция ТипМетаданныхПервогоОбъекта(Контекст) Экспорт
	ТипОбъекта	= Неопределено;
	// Определяем по первому элементу. т.к. смешанных списков быть не должно то и
	// документы не могут быть по определению в одном списке со справочниками
	Для Каждого ТипИсточника Из Контекст.ТипыИсточников Цикл
		ТипОбъекта	= ТипМетаданного(ТипИсточника);
		Прервать;
	КонецЦикла;	
	Возврат ТипОбъекта;
КонецФункции

Функция ПринадлежитОбъектМетаданныхПодсистеме(ТипОбъекта, Подсистема)
	Возврат Подсистема.Состав.Содержит( Метаданные.НайтиПоТипу(ТипОбъекта) );
КонецФункции


// Изменяет запрос и добавляет колонки в динамический список
//
// Параметры:
//  Форма - Форма
//  ОтборыСписка - Произвольный
//  ДляВыбораСотрудников - Произвольный
//  ИмяРеквизитаСписок - Строка
//
Процедура УстановитьЗапросДинамическогоСписка(Форма, ОтборыСписка, ДляВыбораСотрудников, ИмяРеквизитаСписок) Экспорт
	МодульCore = МодульCore();
	Если
		ЭтоФормаИсключения(Форма) 
		ИЛИ Не МодульCore.ТекущемуПользователюМожноРаботатьСРасширением() 
		Тогда 
		Возврат; 
	КонецЕсли;
	//А затем наш код	
	ДобавитьКолонкиВДинамическийСписокПриИзмененииЗапроса(Форма, ИмяРеквизитаСписок);
КонецПроцедуры

Процедура ЗаполнитьТипыОбъектовОповещения(Форма)
	//Для конфигурация без полного использования функций БСП
	Если МодульCore().get_prop(Форма, "ТипыОбъектовОповещения") = Неопределено Тогда
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТипыОбъектовОповещения", Новый ОписаниеТипов("СписокЗначений")));
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Иначе
		Возврат;
	КонецЕсли;

	ТипОбъекта = ТипЗнч(ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Форма.ИмяФормы));
	МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипОбъекта);

	Для Каждого РегистрируемыйДокумент Из МетаданныеОбъекта.РегистрируемыеДокументы Цикл
		Форма.ТипыОбъектовОповещения.Добавить(
			ТипЗнч(ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(РегистрируемыйДокумент.ПолноеИмя()).ПустаяСсылка()));
	КонецЦикла;
КонецПроцедуры

Процедура ПодготовитьСтруктуруОписанияФормыЖурналДокументов(Форма,ОписаниеФормы) 
	Попытка
		ТипыОбъектовОповещения = Форма.ТипыОбъектовОповещения;
	Исключение
		ТипыОбъектовОповещения = Новый Массив;
	КонецПопытки;
	Для каждого ТипМетаданных Из ТипыОбъектовОповещения Цикл
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипМетаданных.Значение);
		Если ОбъектМетаданных = Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		ТипСсылки = ПолучитьТипСсылкиПоМетаданным(ОбъектМетаданных);
		Если ТипСсылки <> Неопределено Тогда
			ОписаниеФормы.ТипыИсточников.Добавить(ТипСсылки);
		КонецЕсли;
	КонецЦикла;  	
КонецПроцедуры	

// Подготовка структуры описания формы
//
// Параметры:
//  Форма - Форма
//  ПараметрыРазмещения - Произвольный - параметры
//
// Возвращаемое значение:
//   Структура - описание формы
//
// BSLLS:TooManyReturns-off
Функция ПодготовитьСтруктуруОписанияФормы(Форма, ПараметрыРазмещения = Неопределено) Экспорт
		ОписаниеФормы = Новый Структура;
	ОписаниеФормы.Вставить("ИмяФормы",			Форма.ИмяФормы);
	ОписаниеФормы.Вставить("ТипыИсточников",	Новый Массив);
	ОписаниеФормы.Вставить("Форма",				Форма);
	
	Попытка
		ТипОбъекта			= ТипЗнч(ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Форма.ИмяФормы));
	Исключение
		// Ловим исключение когда открываем общие формы без менеджера объекта
		Возврат ОписаниеФормы;
	КонецПопытки;
	ОбъектМетаданных	= Метаданные.НайтиПоТипу(ТипОбъекта);
	ЭтоЖурналДокументов	= ОбщегоНазначения.ЭтоЖурналДокументов(ОбъектМетаданных);
	
	Если ЭтоЖурналДокументов Тогда
		ЗаполнитьТипыОбъектовОповещения(Форма);
		ПодготовитьСтруктуруОписанияФормыЖурналДокументов(Форма,ОписаниеФормы);
		Возврат ОписаниеФормы;
	КонецЕсли; 
	
	ТипСсылки = ПолучитьТипСсылкиПоМетаданным(ОбъектМетаданных);
	Если ТипСсылки <> Неопределено Тогда
		ОписаниеФормы.ТипыИсточников.Добавить(ТипСсылки);
		Возврат ОписаниеФормы;
	КонецЕсли;
	// КОРП 
	Если Форма.ИмяФормы = "Обработка.СписокСотрудников.Форма.ФормаСпискаСотрудников" Тогда
		// если мы тут то и тип справочника присутсвует
		ОписаниеФормы.ТипыИсточников.Добавить(Тип("СправочникСсылка.Сотрудники"));
	КонецЕсли;
	МассивЖурналов = Новый Массив;
	МассивЖурналов.Добавить("Обработка.ЖурналДокументовАвансовыеОтчеты.Форма.СписокДокументов");
	МассивЖурналов.Добавить("Обработка.ЖурналДокументовЗакупки.Форма.СписокДокументов"); 
	МассивЖурналов.Добавить("Обработка.ЖурналДокументовБезналичныеПлатежи.Форма.ФормаСписка"); 
	Если МассивЖурналов.Найти(Форма.ИмяФормы) = Неопределено Тогда
		Возврат ОписаниеФормы;
	КонецЕсли;	
	
	Если get_prop(ПараметрыРазмещения, "Источники") = Неопределено Или ТипЗнч(ПараметрыРазмещения.Источники) <> Тип("ОписаниеТипов") Тогда
		Возврат ОписаниеФормы;
	КонецЕсли;
	ТипыИсточников = ПараметрыРазмещения.Источники.Типы();
	Для Каждого ТипИсточника Из ТипыИсточников Цикл
		ОписаниеФормы.ТипыИсточников.Добавить(ТипИсточника);
	КонецЦикла;	
	
	Возврат ОписаниеФормы;

КонецФункции // ПодготовитьСтруктуруОписанияФормы()
// BSLLS:TooManyReturns-on

// Ищем в элементах формы таблицу значений с типом данных Динамический список
//
// Параметры:
//  Форма - Форма
//
// Возвращаемое значение:
//   Строка - имя элемента формы
//
Функция ПолучитьНаименованиеРеквизитаСписка(Форма) Экспорт
	ИмяЭлементаСписка = "";
	ИменаСписков = Новый Массив;
	
	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		Если ТипЗнч(ЭлементФормы) <> Тип("ТаблицаФормы") Тогда 
			Продолжить	
		КонецЕсли;	
		Если НЕ ЭлементФормы.Видимость ИЛИ Найти(ЭлементФормы.ПутьКДанным, ".") > 0 Тогда Продолжить; КонецЕсли;
		Если ТипЗнч(Форма.ЭтотОбъект[ЭлементФормы.ПутьКДанным]) = Тип("ДинамическийСписок") Тогда
			ИменаСписков.Добавить(ЭлементФормы.Имя);
		КонецЕсли;
	КонецЦикла;
	//Мы договорились, что колонки добавляются только на форму с одним динамическим списком
	Если ИменаСписков.Количество() = 0 Тогда 
		Возврат ИмяЭлементаСписка;
	КонецЕсли;	
	ИмяЭлементаСписка = ИменаСписков[0];
	Если ИменаСписков.Количество() = 1 Тогда 
		Возврат ИмяЭлементаСписка;
	КонецЕсли;	
	//Ести видимых динамических списков на форме несколько 
	//отдадим предпочтение первому у кого в названии встречается слово - "Список"
	Для каждого ИмяСписка Из ИменаСписков Цикл
		Если Найти(ИмяСписка, "Список") > 0 Тогда
			ИмяЭлементаСписка = ИмяСписка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ИмяЭлементаСписка;
КонецФункции // ПолучитьНаименованиеРеквизитаСписка()

Функция ЭтоФормаИсключения(Форма) Экспорт
	ИмяОбработки = ИмяОбработки();
	ФормыИсключения = Новый Массив();
 	ФормыИсключения.Добавить("ОбщаяФорма.ОсновнаяФормаРабочегоСтола");
 	ФормыИсключения.Добавить("Справочник.Сотрудники.ФормаСписка");
 	ФормыИсключения.Добавить("Справочник.Сотрудники.ФормаВыбора");
	// Закомментировано по 1192727003
 	// ФормыИсключения.Добавить("ЖурналДокументов.Взаимодействия.Форма.ФормаСписка"); //ERP на главном экране
 	ФормыИсключения.Добавить("Обработка."+ИмяОбработки+".Форма.ДокументыКЭДО");
	Результат = ФормыИсключения.Найти(Форма.ИмяФормы) <> Неопределено;
	Возврат Результат;
КонецФункции

Функция ЭтоФормаСписка(Форма) Экспорт
	Результат = Найти(Форма.ИмяФормы, ".ФормаСписка") > 0;
	Результат = Результат ИЛИ Найти(Форма.ИмяФормы, ".СписокДокументов") > 0;
 	Результат = Результат ИЛИ Форма.ИмяФормы = "Обработка.ЖурналДокументовАвансовыеОтчеты.Форма.СписокДокументов";
 	Результат = Результат ИЛИ Форма.ИмяФормы = "Обработка.ЖурналДокументовЗакупки.Форма.СписокДокументов";
	Возврат Результат;
КонецФункции

// Инициализация структуры доп.таблицы
//
// Возвращаемое значение:
//   Структура
//
Функция ИнициализироватьСтруктуруДопТаблицы()
	СтруктураДопТаблицы = Новый Структура;
	СтруктураДопТаблицы.Вставить("ВременнаяТаблица", 	"");
	СтруктураДопТаблицы.Вставить("ТаблицаДанных");
	СтруктураДопТаблицы.Вставить("Псевдоним");
	СтруктураДопТаблицы.Вставить("СтруктураКолонок");
	СтруктураДопТаблицы.Вставить("ПостфиксКолонок",		"_");  //было НазваниеПродукта+"_Колонки_"
	СтруктураДопТаблицы.Вставить("ПоляСоединения",		Новый Структура());
	СтруктураДопТаблицы.Вставить("ИмяСпискаНаФорме",	"Список");
	
	Возврат СтруктураДопТаблицы;
КонецФункции

#КонецОбласти

Процедура	ВстроитьЭлементыИнтеграцииНаФорму(Форма, ПараметрыРазмещения, КомандыТаблица) Экспорт
	// Проверка на возможноть добавить колонки
	// Добавление колонок
	ДобавитьКолонкиВДинамическийСписок(Форма, ПараметрыРазмещения);
	
	// Проверка на возможноть добавить команды
	// Добавим команды
	ДобавитьКомандыНаФорму(Форма, ПараметрыРазмещения, КомандыТаблица);
КонецПроцедуры

#Область Команды

// *************************************
// Группа комманд 

Функция ПанельКомандФормы(Форма)
	
	// Доработанная форма от 1С
	ОсновнаяКоманднаяПанель = Форма.Элементы.Найти("ОсновнаяКоманднаяПанель");
	Если ОсновнаяКоманднаяПанель = Неопределено Тогда
		// Простая форма от 1С (Объект)
		ОсновнаяКоманднаяПанель = Форма.Элементы.Найти("ГруппаКнопкиКоманднойПанели");
	КонецЕсли;
	Если ОсновнаяКоманднаяПанель = Неопределено Тогда
		// Простая форма от 1С (Список/журнал)
		ОсновнаяКоманднаяПанель = Форма.Элементы.Найти("КоманднаяПанельФормы");
	КонецЕсли;
	Если ОсновнаяКоманднаяПанель = Неопределено Тогда
		// Простая форма от 1С в журналах / обработках
		ОсновнаяКоманднаяПанель = Форма.Элементы.Найти("ГруппаГлобальныеКоманды");
	КонецЕсли;
	Если ОсновнаяКоманднаяПанель = Неопределено Тогда
		// БУХ - ПодразделенияОрганизаций
		ОсновнаяКоманднаяПанель = Форма.Элементы.Найти("ГруппаКоманднаяПанель");
	КонецЕсли;
	Если ОсновнаяКоманднаяПанель = Неопределено Тогда
		// БУХ - Должности
		ОсновнаяКоманднаяПанель = Форма.Элементы.Найти("КоманднаяПанель");
	КонецЕсли;
	Если ОсновнаяКоманднаяПанель = Неопределено Тогда
		// КАМИН
		ОсновнаяКоманднаяПанель = Форма.Элементы.Найти("ФормаКоманднаяПанель");
	КонецЕсли;
	// Пробуем найчти меню - Печать
	Если ОсновнаяКоманднаяПанель = Неопределено Тогда
		КоманднаяПанельПечать = Форма.Элементы.Найти("ПодменюПечать");
		Если КоманднаяПанельПечать <> Неопределено Тогда
			ОсновнаяКоманднаяПанель = КоманднаяПанельПечать.Родитель;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый СТруктура("Панель, Элемент", ОсновнаяКоманднаяПанель, КоманднаяПанельПечать);
КонецФункции

Процедура СозданиеЭлементовУправленияНазначениеДействий(Форма, Команды)

	ГруппаИнтеграция = Форма.Элементы.Найти("ИнтеграцияГруппаКоманд");
	Если ГруппаИнтеграция = Неопределено Тогда
		ДанныеДобавленияПанели = ПанельКомандФормы(Форма);
		ГруппаИнтеграция = Форма.Элементы.Вставить(
			"ИнтеграцияГруппаКоманд", 
			Тип("ГруппаФормы"),
			ДанныеДобавленияПанели.Панель,
			ДанныеДобавленияПанели.Элемент);
	КонецЕсли;
	
	НазваниеПродукта = ЛокализацияНазваниеПродукта();
	ГруппаИнтеграция.Заголовок = НазваниеПродукта;
	
	Для Каждого Команда Из Команды Цикл
		Если Команда.Назначение <>  НазваниеПродукта Тогда
			Продолжить;
		КонецЕсли;
		
		// Создание команды формы
		ИмяКоманды = Команда.ИмяВФорме;
		НоваяКоманда = Форма.Команды.Найти(ИмяКоманды);
		Если НоваяКоманда = Неопределено Тогда
			НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Заголовок = Команда.Представление;
			НоваяКоманда.Действие = "Подключаемый_ВыполнитьКоманду";
		КонецЕсли;
		
		// Создание кнопки на форме и назначение ей команды
		Кнопка = Форма.Элементы.Найти(ИмяКоманды);
		Если Кнопка = Неопределено Тогда
			Кнопка = Форма.Элементы.Вставить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаИнтеграция, Неопределено);
			Кнопка.ИмяКоманды = ИмяКоманды;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

Процедура ДобавитьКомандыНаФорму(Форма, ПараметрыРазмещения, КомандыПустаяТаблица)
    #Если Не ТолстыйКлиентОбычноеПриложение Тогда 
	СтруктураОписаниеФормы		= ПодготовитьСтруктуруОписанияФормы(Форма, ПараметрыРазмещения);
	
	МодульВстраиваниеВСтандартныеФормы = МодульВстраиваниеВСтандартныеФормы(); 
	МодульCore = МодульCore();
	
	УсловиеДЛяОтказаВывода = 
		// Форма исключения
		МодульВстраиваниеВСтандартныеФормы.ЭтоФормаИсключения(СтруктураОписаниеФормы)
		// Проверка прав
		Или НЕ МодульCore.ТекущемуПользователюМожноРаботатьСРасширением()
		// Проверка функциональной опции
		// Обънект с которым мы НЕ поддерживаем обмен
		Или НЕ МодульВстраиваниеВСтандартныеФормы.ЭтоВстраиваемыйОбъектМетаданных(СтруктураОписаниеФормы);
	Если УсловиеДЛяОтказаВывода Тогда 
		Возврат;
	КонецЕсли;	

// BSLLS:MissingTempStorageDeletion-off
// Удалять ни чего нельзя, нарушим работу подсистему команд
	КомандыТаблицаВрем = ПолучитьИзВременногоХранилища(Форма.ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд);
// BSLLS:MissingTempStorageDeletion-on	
	Если КомандыТаблицаВрем = Неопределено Тогда
		КомандыТаблицаВрем = КомандыПустаяТаблица;
	КонецЕсли;
	ДобавитьКоманды(СтруктураОписаниеФормы, СтруктураОписаниеФормы.ТипыИсточников, Неопределено, КомандыТаблицаВрем);
	ПоместитьВоВременноеХранилище(КомандыТаблицаВрем, Форма.ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд);
	
	СозданиеЭлементовУправленияНазначениеДействий(Форма, КомандыТаблицаВрем);
	#КонецЕсли
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
// BSLLS:CommentedCode-off

Процедура ДобавитьКоманды(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	ПолучитьСписокКоманд(НастройкиФормы["ТипыИсточников"], Команды);
КонецПроцедуры

// BSLLS:CommentedCode-on

Процедура ЗаполнитьКомандыМеню(КомандыМеню, МассивПунктовМеню, Порядок) 
	Для Каждого ПунктМеню Из МассивПунктовМеню Цикл 
		ИмяПунктаМеню = get_prop(ПунктМеню, "Name", get_prop(ПунктМеню, "NAME"));
		Действие = get_prop(ПунктМеню, "Action", get_prop(ПунктМеню, "ACTION"));
		Если Не ЗначениеЗаполнено(ИмяПунктаМеню) Или Не ЗначениеЗаполнено(Действие) Тогда
			Продолжить;
		КонецЕсли;	
		Если КомандыМеню[ИмяПунктаМеню] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		ПунктМеню.Вставить("Порядок", Порядок);
		КомандыМеню.Вставить(ИмяПунктаМеню, ПунктМеню);
		Порядок = Порядок + 1;
	КонецЦикла;	
КонецПроцедуры

// BSLLS:Typo-off
// Опечатка в названии метода отсутствует

Функция КомандаПунктаТулбара(ДействиеКоманды)
	ИмяКомандыОбменаДляФормыКлиент = ИмяКомандыОбменаДляФормыКлиент();
	ИмяКоманды = Неопределено;
	ActionСтрокой = "Action";
	Если ДействиеКоманды[ActionСтрокой] <> Неопределено Тогда
		ИмяКоманды = ИмяКомандыОбменаДляФормыКлиент + "." + ДействиеКоманды[ActionСтрокой];
	Иначе
		ACTION = ДействиеКоманды["ACTION"];
		ИмяКоманды = ПрефиксПродукта() + "КомандыОбменаДляФормыКлиент." + ACTION;
	КонецЕсли;
	Возврат ИмяКоманды;
КонецФункции
// BSLLS:Typo-on

Процедура ПолучитьСписокКомандИзНастроекПодключения(Источники, Команды, ВстраиваемоеМеню)
	КомандыМеню = Новый Соответствие;
	Порядок = 0;
	Для Каждого ТипЗначения Из Источники Цикл
		ОбъектМетаданных			= Метаданные.НайтиПоТипу(ТипЗначения);
		Если ОбъектМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ИмяОбъектаМетаданных = ОбъектМетаданных.Имя;
		МассивПунктовМеню = ВстраиваемоеМеню[ИмяОбъектаМетаданных];
		Если МассивПунктовМеню = Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		ЗаполнитьКомандыМеню(КомандыМеню, МассивПунктовМеню, Порядок);
	КонецЦикла;
	Если КомандыМеню.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивКомандМеню = Новый Массив;
	Для Каждого КомандаМеню Из КомандыМеню Цикл 
		Порядок = КомандаМеню.Значение["Порядок"];
		Если МассивКомандМеню.Количество() > Порядок Тогда
			МассивКомандМеню.Установить(Порядок,КомандаМеню.Значение);
		Иначе
			МассивКомандМеню.Вставить(Порядок,КомандаМеню.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	Порядок = 1;
	Для Каждого КомандаМеню Из МассивКомандМеню Цикл 
		
		ИмяКоманды = КомандаПунктаТулбара(КомандаМеню);
		Если ИмяКоманды = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяКоманда = Новый Структура;
		НоваяКоманда.Вставить("Имя",       get_prop(КомандаМеню, "NAME"));
		НоваяКоманда.Вставить("Заголовок", get_prop(КомандаМеню, "TITLE"));
		НоваяКоманда.Вставить("Действие",  ИмяКоманды);
		НоваяКоманда.Вставить("Отключена", Ложь);
		НоваяКоманда.Вставить("Порядок",   Неопределено);
		НоваяКоманда.Вставить("ИмяИни",    Неопределено);
		НоваяКоманда.Вставить("ПараметрыВызова",  КомандаМеню);
		
		ДобавитьКомандуНаФорму1С(НоваяКоманда, Команды, Порядок);
        Порядок = Порядок + 1;
	КонецЦикла;
КонецПроцедуры

Процедура ПолучитьСписокКоманд( Источники, Команды ) Экспорт 

	ЕстьКомандыДляСправочников = Ложь;
	ЕстьКомандыДляСпрСотрудники = Ложь;
	ЕстьКомандыДляСпрФизЛица 	= Ложь;
	ЕстьКомандыДляДокументов   = Ложь;
	ВставитьКнопку	         = Ложь;
	ПорядокСчет = 1;
	
	Для Каждого ТипЗначения Из Источники Цикл
		
		ОбъектМетаданных			= Метаданные.НайтиПоТипу(ТипЗначения);
		ЕстьКомандыДляСправочников	= Метаданные.Справочники.Содержит(ОбъектМетаданных);
		Если ЕстьКомандыДляСправочников Тогда
			ЕстьКомандыДляСпрСотрудники = Найти(ОбъектМетаданных.Имя, "Сотрудники") > 0;
			ЕстьКомандыДляСпрФизЛица = Найти(ОбъектМетаданных.Имя, "ФизическиеЛица") > 0;
		КонецЕсли;
		ЕстьКомандыДляДокументов	= ЕстьКомандыДляДокументов ИЛИ Метаданные.Документы.Содержит(ОбъектМетаданных);
		Если ЕстьКомандыДляСправочников или ЕстьКомандыДляДокументов Тогда
			ВставитьКнопку = Истина;	
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	НазваниеПродукта = ЛокализацияНазваниеПродукта();
	ИмяКомандыОбменаДляФормыКлиент = ИмяКомандыОбменаДляФормыКлиент();
	
	Если ВставитьКнопку = Ложь Тогда
		Возврат;
	КонецЕсли;	
		
	ИмяИни		= "ИмяИни";
	Имя			= "Имя";
	Заголовок	= "Заголовок";
	Действие	= "Действие";
	Отключена	= "Отключена";
	Порядок		= "Порядок";
	
	ПорядокСчет = ПорядокСчет + 1;			
	НоваяКоманда = Новый Структура;
	НоваяКоманда.Вставить(Имя,       НазваниеПродукта + "_ЗагрузкаДокументов");
	НоваяКоманда.Вставить(Заголовок, "Загрузить в " + ЛокализацияНазваниеПродукта()); 
	НоваяКоманда.Вставить(Действие,  ИмяКомандыОбменаДляФормыКлиент + ".ЗагрузитьВСБИС");
	НоваяКоманда.Вставить(Отключена, Ложь);
	НоваяКоманда.Вставить(Порядок,   ПорядокСчет);
	НоваяКоманда.Вставить(ИмяИни,    Неопределено);
	
	ДобавитьКомандуНаФорму1С(НоваяКоманда, Команды, ПорядокСчет);
	
	ПорядокСчет = ПорядокСчет + 1;
	НоваяКоманда = Новый Структура;
	НоваяКоманда.Вставить(Имя,       НазваниеПродукта + "_ОткрытьВСБИС");
	НоваяКоманда.Вставить(Заголовок, "Открыть в " + ЛокализацияНазваниеПродукта()); 
	НоваяКоманда.Вставить(Действие,  ИмяКомандыОбменаДляФормыКлиент + ".ПриНажатииОткрытьВСБИСПолучитьUID");
	НоваяКоманда.Вставить(Отключена, Ложь);
	НоваяКоманда.Вставить(Порядок,   ПорядокСчет);
	НоваяКоманда.Вставить(ИмяИни,    Неопределено);
	
	ДобавитьКомандуНаФорму1С(НоваяКоманда, Команды, ПорядокСчет);		
	
	Если ЕстьКомандыДляСпрСотрудники ИЛИ НЕ ЕстьКомандыДляСправочников Тогда
		ПорядокСчет = ПорядокСчет + 1;
		НоваяКоманда = Новый Структура;			
		НоваяКоманда.Вставить(Имя,       НазваниеПродукта + "_ВыгрузитьВложенияИзСБИС");
		НоваяКоманда.Вставить(Заголовок, "Выгрузить вложения из " + ЛокализацияНазваниеПродукта()); 
		НоваяКоманда.Вставить(Действие,  ИмяКомандыОбменаДляФормыКлиент + ".ПриНажатииВыгрузитьВложенияИзСБИС");
		НоваяКоманда.Вставить(Отключена, Ложь);
		НоваяКоманда.Вставить(Порядок,   ПорядокСчет);
		НоваяКоманда.Вставить(ИмяИни,    Неопределено);
		
		ДобавитьКомандуНаФорму1С(НоваяКоманда, Команды, ПорядокСчет);
	КонецЕсли;

	Если ЕстьКомандыДляДокументов Тогда
		
		ПорядокСчет = ПорядокСчет + 1;
		НоваяКоманда = Новый Структура;			
		НоваяКоманда.Вставить(Имя,       НазваниеПродукта + "_ОбновитьСтатусы");
		НоваяКоманда.Вставить(Заголовок, "Обновить статусы"); 
		НоваяКоманда.Вставить(Действие,  ИмяКомандыОбменаДляФормыКлиент + ".ПриНажатииОбновитьСтатусы");
		НоваяКоманда.Вставить(Отключена, Ложь);
		НоваяКоманда.Вставить(Порядок,   ПорядокСчет);
		НоваяКоманда.Вставить(ИмяИни,    Неопределено);
		
		ДобавитьКомандуНаФорму1С(НоваяКоманда, Команды, ПорядокСчет);
		
	КонецЕсли;	
	
	Если ЕстьКомандыДляСпрСотрудники Тогда
		ПорядокСчет = ПорядокСчет + 1;	
		НоваяКоманда = Новый Структура;
		НоваяКоманда.Вставить(Имя,       НазваниеПродукта + "_УчаствуетВКЭДО");
		НоваяКоманда.Вставить(Заголовок, "Установить/Снять признак КЭДО"); 
		НоваяКоманда.Вставить(Действие,  ИмяКомандыОбменаДляФормыКлиент + ".УстановитьПризнакУчаствуетВКЭДО");
		НоваяКоманда.Вставить(Отключена, Ложь);
		НоваяКоманда.Вставить(Порядок,   ПорядокСчет);
		НоваяКоманда.Вставить(ИмяИни,    Неопределено);
		
		ДобавитьКомандуНаФорму1С(НоваяКоманда, Команды, ПорядокСчет);
		
		ПорядокСчет = ПорядокСчет + 1;	
		НоваяКоманда = Новый Структура;
		НоваяКоманда.Вставить(Имя,       НазваниеПродукта + "_ПолучитьПризнакКЭДО");
		НоваяКоманда.Вставить(Заголовок, "Получить признак КЭДО из " + НазваниеПродукта); 
		НоваяКоманда.Вставить(Действие,  ИмяКомандыОбменаДляФормыКлиент + ".ПолучитьПризнакУчаствуетВКЭДО");
		НоваяКоманда.Вставить(Отключена, Ложь);
		НоваяКоманда.Вставить(Порядок,   ПорядокСчет);
		НоваяКоманда.Вставить(ИмяИни,    Неопределено);
		
		ДобавитьКомандуНаФорму1С(НоваяКоманда, Команды, ПорядокСчет);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьКомандуНаФорму1С(Команда, Команды, Порядок)

	НазваниеПродукта = ЛокализацияНазваниеПродукта();
	НайденныеКоманды = Команды.НайтиСтроки(Новый Структура("Представление", Команда.Заголовок));
	Если НайденныеКоманды.Количество() > 0 Тогда 
		Возврат;
	КонецЕсли;
	ПодключаемаяКоманда = Команды.Добавить();
	ПодключаемаяКоманда.Вид                      = НазваниеПродукта+"_КОМАНДЫ"; //ВидПодключаемойКоманды();
	ПодключаемаяКоманда.Представление            = Команда.Заголовок;
	ПодключаемаяКоманда.Порядок                  = Порядок;
	ПодключаемаяКоманда.ТолькоВоВсехДействиях    = Ложь;
	ПодключаемаяКоманда.ТипПараметра             = Новый ОписаниеТипов(Новый Массив());
	ПодключаемаяКоманда.Назначение               = НазваниеПродукта;
	ПодключаемаяКоманда.ФункциональныеОпции      = "";
	ПодключаемаяКоманда.УсловияВидимости         = Новый Массив(); 
	ПодключаемаяКоманда.ИзменяетВыбранныеОбъекты = Ложь;
	ПодключаемаяКоманда.МножественныйВыбор       = Истина;
	ПодключаемаяКоманда.РежимЗаписи              = "НеЗаписывать";
	ПодключаемаяКоманда.ТребуетсяРаботаСФайлами  = Ложь;
	ПодключаемаяКоманда.ИзменяетВыбранныеОбъекты = Ложь;
	ПодключаемаяКоманда.Менеджер                 = "";
	ПодключаемаяКоманда.ИмяФормы                 = "";
	ПодключаемаяКоманда.ИмяВФорме        		 = ПодключаемаяКоманда.Вид + "_" + СтрЗаменить(Команда.Действие, ".", "_");
	ПодключаемаяКоманда.ИмяПараметраФормы        = "";
	ПодключаемаяКоманда.ПараметрыФормы           = Новый Структура("ИмяИни", Команда.ИмяИни);

	ПодключаемаяКоманда.Обработчик               = Команда.Действие;
	ПодключаемаяКоманда.ДополнительныеПараметры  = Новый Структура("ПараметрыВызова", get_prop(Команда, "ПараметрыВызова"));

КонецПроцедуры	

Функция ПроисходилЛиОбменДокументов( МассивСсылокНаДокументы, ДопПараметры=Неопределено) Экспорт 
	Обработка = Обработки[ИмяОбработки()].Создать();	
	Результат = Обработка.ПроисходилЛиОбменДокументов(МассивСсылокНаДокументы, ДопПараметры);	
	Возврат Результат; 
КонецФункции

Функция ПрочитатьСписокИнишекПоТипуИС(ТипИС, Действие = Неопределено) Экспорт 

	// Метод на вход будет получать ИмяИС и искать все инишки согласно блоку WORKSPACE META.
	// в нем будет передаваться title с красивым названием и в дальнейшем это название будет пришиваться к кнопке
	// например "Загрузить в СБИС", "Загрузить в СБИС как сотрудник 

	Результат = Новый Массив;
	Если ТипИС = "Сотрудники" Тогда
		ТранспортБлокли = Обработки[ИмяОбработки()].Создать();
		
		context_params = ТранспортБлокли.НастройкиПодключенияПрочитать();
		мИниФайлов	= Новый Массив();
		мИниФайлов.Добавить(Новый Структура("type, name", "Blockly", "Blockly_Сотрудники_read")); 
		мИниФайлов.Добавить(Новый Структура("type, name", "Blockly", "Blockly_ПрочийКадровыйДокументСотрудники_read"));
		
		params	= Новый Структура("props, ini", 
			Новый Структура("id, type_data", 
				context_params.ConnectionUuid,
				1),
			мИниФайлов);
		res = ТранспортБлокли.local_helper_integration_api(context_params, "IntegrationConnection.ReadConnection", params, "int-settings");
		
		Для Каждого _ини Из res["data"] Цикл
			title = СтрЗаменить(СтрЗаменить(_ини.Значение["data_name"],"Blockly_",""),"_read","");
			ini_name = СтрЗаменить(СтрЗаменить(_ини.Значение["data_name"],"Blockly_",""),"_read","");
			Результат.Добавить(Новый Структура("title,ini_name,xml",title,ini_name,_ини.Значение["data"] ));
		КонецЦикла;	 
		
	Иначе
		Результат.Добавить(Новый Структура); // здесь будут инишки в случае документов. Сейчас такого нет.
	КонецЕсли;

	Возврат Результат;

КонецФункции	

Функция ПолучитьССылкиНаДокументыВИнтеграции(МассивИсточникДанных, ПолучитьТикет = Ложь ) Экспорт

	Обработка	= Обработки[ИмяОбработки()].Создать();
	Результат = Обработка.ПолучитьССылкиНаДокументыВИнтеграции(МассивИсточникДанных, ПолучитьТикет);

	Возврат Результат;

КонецФункции

Функция ПолучитьДействияДляОбъекта(СсылкаНаОбъект, context_params) Экспорт

	Обработка = Обработки[ИмяОбработки()].Создать();
	Результат = Обработка.ПолучитьДействияДляОбъекта(СсылкаНаОбъект, context_params);
	
	Возврат Результат;

КонецФункции

#Область include_core_base_Helpers_ПолучитьФормуОбработки
#КонецОбласти

#Область include_kedo_base_ПодготовкаДанных_РасчетныйЛисток
#КонецОбласти

#КонецОбласти

#Область КолонкиСостояния

/////********************************************
// КОЛОНКИ СОСТОЯНИЯ

//Точка Входа - ДобавитьКолонкиВДинамическийСписок

// Подготовка структуры объединяемых данных ФизЛица
//
// Параметры:
//  Контекст - Произвольный - контекст
//  НаименованиеРеквизитаСписок - Произвольный - список наименований реквизитов
//  ПараметрыДопТаблицыФизЛица - Структура - параметры доп.таблицы
//

Процедура ЗаполнитьСтруктуруПолейДляКолонкиСтатусФизЛица(Контекст, НаименованиеРеквизитаСписок, ПараметрыДопТаблицыФизЛица)
	ПоляСоединения = Новый Соответствие;
	ПоляСоединения.Вставить(ПараметрыДопТаблицыФизЛица.ИмяКолонкиЛевогоСоединения, "ФизЛицо");
	ПараметрыДопТаблицыФизЛица.Вставить("ПоляСоединения", ПоляСоединения);

	МассивКолонок = Новый Массив;
	КолонкаДопТаблицыФЛ = Новый Структура;
	КолонкаДопТаблицыФЛ.Вставить("Имя",				"СтатусФизЛица");
	КолонкаДопТаблицыФЛ.Вставить("ПутьКДанным",		"ЕСТЬNULL(" + ПараметрыДопТаблицыФизЛица.Псевдоним + ".СтатусФизЛица, """")");
	КолонкаДопТаблицыФЛ.Вставить("Заголовок",			"Статус кандидата");
	КолонкаДопТаблицыФЛ.Вставить("ОтображатьНаФорме",	Истина);
	МассивКолонок.Добавить(КолонкаДопТаблицыФЛ);

	ПараметрыДопТаблицыФизЛица.Вставить("СтруктураКолонок", МассивКолонок);
КонецПроцедуры

// Подготовка структуры объединяемых данных КЭДО
//
// Параметры:
//  Контекст - Произвольный - контекст
//  НаименованиеРеквизитаСписок - Произвольный - список наименований реквизитов
//  ПараметрыДопТаблицыКЭДО - Структура - параметры доп.таблицы
//

Процедура ЗаполнитьСтруктуруПолейДляКолонкиКЭДО(Контекст, НаименованиеРеквизитаСписок, ПараметрыДопТаблицыКЭДО)
	ПоляКЭДОСоединения = Новый Соответствие;
	ПоляКЭДОСоединения.Вставить(ПараметрыДопТаблицыКЭДО.ИмяКолонкиЛевогоСоединения, "Сотрудник");
	ПараметрыДопТаблицыКЭДО.Вставить("ПоляСоединения", ПоляКЭДОСоединения);
	НазваниеПродукта = ЛокализацияНазваниеПродукта();    
	
	МассивКолонок = Новый Массив;
	КолонкаДопТаблицыКЭДО = Новый Структура;
	КолонкаДопТаблицыКЭДО.Вставить("ПутьКДанным",    "ЕСТЬNULL(" + ПараметрыДопТаблицыКЭДО.Псевдоним + ".ИндексКартинки, 0)" );
	КолонкаДопТаблицыКЭДО.Вставить("Заголовок",      "КЭДО");
	КолонкаДопТаблицыКЭДО.Вставить("Имя",        "КартинкаКЭДО");
	КолонкаДопТаблицыКЭДО.Вставить("Картинка",      БиблиотекаКартинок[НазваниеПродукта + "_Bird"]);
	КолонкаДопТаблицыКЭДО.Вставить("ОтображатьНаФорме", Истина);
	МассивКолонок.Добавить(КолонкаДопТаблицыКЭДО);

	КолонкаДопТаблицыКЭДО = Новый Структура;
	КолонкаДопТаблицыКЭДО.Вставить("ПутьКДанным",
		"Выразить(ЕСТЬNULL(" + ПараметрыДопТаблицыКЭДО.Псевдоним + ".КЭДО, Ложь) КАК БУЛЕВО)");
	КолонкаДопТаблицыКЭДО.Вставить("Имя",        "УчастникКЭДО");
	КолонкаДопТаблицыКЭДО.Вставить("Заголовок",      "КЭДО");
	КолонкаДопТаблицыКЭДО.Вставить("ОтображатьНаФорме", Ложь);
	КолонкаДопТаблицыКЭДО.Вставить("Картинка",      Неопределено);
	МассивКолонок.Добавить(КолонкаДопТаблицыКЭДО); 
	
	ПараметрыДопТаблицыКЭДО.Вставить("СтруктураКолонок", МассивКолонок);
КонецПроцедуры

Процедура ДобавитьКолонкиСтатусаФизЛица(Контекст, НаименованиеРеквизитаСписок, 
	ИмяКолонкиЛевогоСоединения = "Сотрудник", context_params = Неопределено)
// BSLLS:QueryParseError-off
	ТекстЗапросаСтатусФизЛица = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ДС.Объект КАК Справочник.ФизическиеЛица) КАК ФизЛицо,
	|	ВЫРАЗИТЬ(ДС.Значение КАК СТРОКА(1024)) КАК СтатусФизЛица
	|ПОМЕСТИТЬ СвойстваСтатус
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДС
	|ГДЕ
	|	НЕ ДС.Объект ЕСТЬ NULL
	|	И ДС.Свойство = &СвойствоОтбора
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ * ИЗ 
    |";
// BSLLS:QueryParseError-on	

	ПараметрыДопТаблицы = ИнициализироватьСтруктуруДопТаблицы();
	ПараметрыДопТаблицы.Вставить("ТаблицаДанных",		"СвойстваСтатус");
// BSLLS:UsingFindElementByString-off
	СвойствоОтбора = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СтатусФизЛица");
// BSLLS:UsingFindElementByString-on	
	Фильтр = Новый Массив;
	Фильтр.Добавить(Новый Структура("Параметр, Значение", "СвойствоОтбора", СвойствоОтбора));
	ПараметрыДопТаблицы.Вставить("Фильтр",	Фильтр);
	ПараметрыДопТаблицы.Вставить("Псевдоним",			"СвойстваСтатус");
	ПараметрыДопТаблицы.Вставить("ИмяСпискаНаФорме",	НаименованиеРеквизитаСписок);
	ПараметрыДопТаблицы.Вставить("ВременнаяТаблица",	ТекстЗапросаСтатусФизЛица);
	ПараметрыДопТаблицы.Вставить("ИмяКолонкиЛевогоСоединения",	ИмяКолонкиЛевогоСоединения);
	ЗаполнитьСтруктуруПолейДляКолонкиСтатусФизЛица(Контекст, НаименованиеРеквизитаСписок, ПараметрыДопТаблицы);
	УспешноеВыполнение = ОбновитьЗапросДинамическогоСписка(Контекст.Форма, ПараметрыДопТаблицы);
	Если УспешноеВыполнение Тогда
		УспешноеВыполнение = ДобавитьКолонкиНаФорму(Контекст.Форма, ПараметрыДопТаблицы);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьКолонкиСтатусаКЭДО(Контекст, НаименованиеРеквизитаСписок,
	ИмяКолонкиЛевогоСоединения = "Сотрудник", context_params = Неопределено)
	ТекстЗапросаКЭДО = 
// BSLLS:QueryParseError-off
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ДС.Объект КАК Справочник.Сотрудники) КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ДС.Значение = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндексКартинки,
	|	ДС.Значение КАК КЭДО
	|ПОМЕСТИТЬ СвойстваКЭДО
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДС
	|ГДЕ
	|	НЕ ДС.Объект ЕСТЬ NULL
	|	И ДС.Свойство = &СвойствоОтбора
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ * ИЗ 
    |";
// BSLLS:QueryParseError-on

	ПараметрыДопТаблицы = ИнициализироватьСтруктуруДопТаблицы();
	ПараметрыДопТаблицы.Вставить("ТаблицаДанных",		"СвойстваКЭДО");
// BSLLS:UsingFindElementByString-off
	СвойствоОтбора = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("КЭДО");
// BSLLS:UsingFindElementByString-on	
	Фильтр = Новый Массив;
	Фильтр.Добавить(Новый Структура("Параметр, Значение", "СвойствоОтбора", СвойствоОтбора));
	ПараметрыДопТаблицы.Вставить("Фильтр",	Фильтр);
	ПараметрыДопТаблицы.Вставить("Псевдоним",			"СвойстваКЭДО");
	ПараметрыДопТаблицы.Вставить("ИмяСпискаНаФорме",	НаименованиеРеквизитаСписок);
	ПараметрыДопТаблицы.Вставить("ВременнаяТаблица",	ТекстЗапросаКЭДО);
	ПараметрыДопТаблицы.Вставить("ИмяКолонкиЛевогоСоединения",	ИмяКолонкиЛевогоСоединения);
	ЗаполнитьСтруктуруПолейДляКолонкиКЭДО(Контекст, НаименованиеРеквизитаСписок, ПараметрыДопТаблицы);
	УспешноеВыполнение = ОбновитьЗапросДинамическогоСписка(Контекст.Форма, ПараметрыДопТаблицы);
	Если УспешноеВыполнение Тогда
		УспешноеВыполнение = ДобавитьКолонкиНаФорму(Контекст.Форма, ПараметрыДопТаблицы);
	КонецЕсли;
КонецПроцедуры


// Подготовка структуры объединяемых данных СостоянияОбъектов
//
// Параметры:
//  Контекст - Произвольный - контекст
//  НаименованиеРеквизитаСписок - Произвольный - список наименований реквизитов
//  ПараметрыДопТаблицыСО - Структура - параметры доп.таблицы
//
Процедура ЗаполнитьСтруктуруПолейДляКолонокСостоянияОбъектов(Контекст, НаименованиеРеквизитаСписок, ПараметрыДопТаблицыСО)
	ПоляСостОбСоединения		= Новый Соответствие;
	ПоляСостОбСоединения.Вставить(ПараметрыДопТаблицыСО.ИмяКолонкиЛевогоСоединения, "Объект");
	ПараметрыДопТаблицыСО.Вставить("ПоляСоединения", ПоляСостОбСоединения);
	
	МассивКолонок		= Новый Массив;
	НазваниеПродукта = ЛокализацияНазваниеПродукта();
	
	КолонкаДопТаблицыСО  = Новый Структура;
	КолонкаДопТаблицыСО.Вставить("Заголовок",      НазваниеПродукта);
	КолонкаДопТаблицыСО.Вставить("Имя",        "СостояниеКартинка");
	КолонкаДопТаблицыСО.Вставить("ПутьКДанным",	
		"ЕСТЬNULL(" + ПараметрыДопТаблицыСО.Псевдоним + ".Состояние.ИндексКартинки, 10)");
	КолонкаДопТаблицыСО.Вставить("Картинка",
		БиблиотекаКартинок[НазваниеПродукта + "_Состояния"]);
	КолонкаДопТаблицыСО.Вставить("ОтображатьНаФорме",  Истина);
	МассивКолонок.Добавить(КолонкаДопТаблицыСО);

	КолонкаДопТаблицыСО  = Новый Структура;
	КолонкаДопТаблицыСО.Вставить("Имя",        "СтатусВ_" + НазваниеПродукта);
	КолонкаДопТаблицыСО.Вставить("Заголовок",      "Статус в " + НазваниеПродукта);
	КолонкаДопТаблицыСО.Вставить("ПутьКДанным",
		"ЕСТЬNULL(" + ПараметрыДопТаблицыСО.Псевдоним + ".Состояние, НЕОПРЕДЕЛЕНО)");
	КолонкаДопТаблицыСО.Вставить("ОтображатьНаФорме",  Ложь);
	МассивКолонок.Добавить(КолонкаДопТаблицыСО);

	ПараметрыДопТаблицыСО.Вставить("СтруктураКолонок", МассивКолонок);
КонецПроцедуры

// Подготовка структуры объединяемых данных ТекущийЭтап
//
// Параметры:
//  Контекст - Произвольный - контекст
//  НаименованиеРеквизитаСписок - Произвольный - список наименований реквизитов
//  ПараметрыДопТаблицыТЭ - Структура - параметры доп.таблицы
//
Процедура ЗаполнитьСтруктуруПолейДляКолонокТекущийЭтап(Контекст, НаименованиеРеквизитаСписок, ПараметрыДопТаблицыТЭ)
	ПоляТЭСоединения		= Новый Соответствие;
	ПоляТЭСоединения.Вставить(ПараметрыДопТаблицыТЭ.ИмяКолонкиЛевогоСоединения, "Объект");
	ПараметрыДопТаблицыТЭ.Вставить("ПоляСоединения", ПоляТЭСоединения);
	
	МассивКолонок		= Новый Массив;
	КолонкаДопТаблицыТЭ = Новый Структура;
	КолонкаДопТаблицыТЭ.Вставить("ОтображатьНаФорме",  Истина);
	КолонкаДопТаблицыТЭ.Вставить("ПутьКДанным",    "ЕСТЬNULL(" + ПараметрыДопТаблицыТЭ.Псевдоним + ".Значение, НЕОПРЕДЕЛЕНО)" );
	КолонкаДопТаблицыТЭ.Вставить("Заголовок",      "Активный этап");
	КолонкаДопТаблицыТЭ.Вставить("Имя",        "АктивныйЭтап");
	МассивКолонок.Добавить(КолонкаДопТаблицыТЭ);
	
	ПараметрыДопТаблицыТЭ.Вставить("СтруктураКолонок", МассивКолонок);
КонецПроцедуры

Функция ТекстЗапросаСвойстваПоВидамОбъектов(МассивТиповОбъепктов, Знач ИмяПараметра, Знач ИмяВременнойТаблицы)
// BSLLS:QueryParseError-off
// Собираем запрос частями

	Результат = "";
	СтрокаИмяВрТаблицы = "ПОМЕСТИТЬ " + ИмяВременнойТаблицы;
	СтрокаОбъединитьВсе = "ОБЪЕДИНИТЬ ВСЕ";
	МассивРезультат = Новый Массив;
	
	СчетСтрок = 0;
	Для Каждого ТипЗахвОбъекта Из МассивТиповОбъепктов Цикл
		СчетСтрок = СчетСтрок + 1;
		Если СчетСтрок = МассивТиповОбъепктов.Количество() Тогда
			СтрокаОбъединитьВсе = "";
		КонецЕсли;
		
		ТипМД = ТипМетаданного(ТипЗахвОбъекта);
		ИмяМД = ИмяТипаМетаданных(ТипЗахвОбъекта);
		
		МассивРезультат.Добавить(
					"ВЫБРАТЬ    
		           |	ВЫРАЗИТЬ(ДС.Объект КАК " + ТипМД + "." + ИмяМД + ") КАК Объект,
		           |	ДС.Значение КАК Значение");
		Если ЗначениеЗаполнено(СтрокаИмяВрТаблицы) Тогда
			МассивРезультат.Добавить(СтрокаИмяВрТаблицы);
		КонецЕсли;
		МассивРезультат.Добавить(
		           "ИЗ
		           |	РегистрСведений.ДополнительныеСведения КАК ДС
		           |ГДЕ
		           |	ДС.Свойство = &ИмяПараметра
				   |	И НЕ ВЫРАЗИТЬ(ДС.Объект КАК " + ТипМД + "." + ИмяМД + ") ЕСТЬ NULL");
		Если ЗначениеЗаполнено(СтрокаОбъединитьВсе) Тогда
			МассивРезультат.Добавить(СтрокаОбъединитьВсе);
		КонецЕсли;
	                   
		СтрокаИмяВрТаблицы = "";
	КонецЦикла;
	
	МассивРезультат.Добавить(
	           "
               |ИНДЕКСИРОВАТЬ ПО
               |	Объект
               |");
	Результат = СтрСоединить82(МассивРезультат, Символы.ПС);
	Результат = СтрЗаменить(Результат, "&ИмяПараметра", "&" + ИмяПараметра);
	Возврат Результат;
// BSLLS:QueryParseError-on	
КонецФункции

Процедура ДобавитьКолонкиСтатусаСостояния(ДанныеФормы, НаименованиеРеквизитаСписок, 
	ИмяКолонкиЛевогоСоединения = "Документ", context_params = Неопределено)
	МодульCore = МодульCore();
	СервисИнтеграции = МодульCore.get_prop(context_params, "service", "");
// BSLLS:UsingFindElementByString-off
	СвойствоСостояние = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(
		СервисИнтеграции + "ДокументСБИС_Статус");
// BSLLS:UsingFindElementByString-on	
	
    мСтрокиЗапроса = Новый Массив();
	мИменаВременныхТаблиц = Новый Массив();
	мИменаВременныхТаблиц.Добавить("Integration_States_v1");
	ТипыИсточников = get_prop(ДанныеФормы, "ТипыИсточников", Новый Массив);
	ЧастьТекстаЗапроса = ТекстЗапросаСвойстваПоВидамОбъектов(
		ТипыИсточников,
		"СвойствоСостояние",
		мИменаВременныхТаблиц[мИменаВременныхТаблиц.Количество() - 1]);
	мСтрокиЗапроса.Добавить(ЧастьТекстаЗапроса);
// BSLLS:QueryParseError-off
	ЧастьТекстаЗапроса = 
		"
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
	мСтрокиЗапроса.Добавить(ЧастьТекстаЗапроса);
	
	СтрокаТаблицаДанных = "Integration_States";
	мИменаВременныхТаблиц.Добавить(СтрокаТаблицаДанных);
	ЧастьТекстаЗапроса = 
		"
       |ВЫБРАТЬ
       |	СтатусДокумента.Объект КАК Объект,
       |	МАКСИМУМ(СостоянияОбмена.Ссылка) КАК Состояние
       |ПОМЕСТИТЬ " + мИменаВременныхТаблиц[мИменаВременныхТаблиц.Количество() - 1] + "
       |ИЗ
       |	Integration_States_v1 КАК СтатусДокумента
       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Saby_СостоянияОбъектов КАК СостоянияОбмена
       |		ПО СтатусДокумента.Значение = СостоянияОбмена.ИдентификаторСБИС
       |
       |СГРУППИРОВАТЬ ПО
       |	СтатусДокумента.Объект
       |
       |ИНДЕКСИРОВАТЬ ПО
       |	Объект
	   |";
	мСтрокиЗапроса.Добавить(ЧастьТекстаЗапроса);
					   
	ЧастьТекстаЗапроса = 
		"////////////////////////////////////////////////////////////////////////////////
		|;
		|
		|ВЫБРАТЬ * ИЗ 
		|";
// BSLLS:QueryParseError-on
	
	мСтрокиЗапроса.Добавить(ЧастьТекстаЗапроса);
	ТекстЗапросаКЭДО = СтрСоединить82(мСтрокиЗапроса, Символы.ПС);
	ТекстЗапросаКЭДО = СтрЗаменить(ТекстЗапросаКЭДО, "Saby_СостоянияОбъектов", ПрефиксПродукта() + "СостоянияОбъектов");
						
	ПрмДопТаблицы = ИнициализироватьСтруктуруДопТаблицы();
	ПрмДопТаблицы.Вставить("ТаблицаДанных",		СтрокаТаблицаДанных);
	ПрмДопТаблицы.Вставить("Псевдоним",			СтрокаТаблицаДанных);
	ПрмДопТаблицы.Вставить("ИмяСпискаНаФорме",	НаименованиеРеквизитаСписок);
	ПрмДопТаблицы.Вставить("ВременнаяТаблица",	ТекстЗапросаКЭДО);
	ПрмДопТаблицы.Вставить("ИмяКолонкиЛевогоСоединения",	ИмяКолонкиЛевогоСоединения);
	
	Фильтр	= Новый Массив();
	// Сервис
	Фильтр.Добавить(Новый Структура("Параметр, Значение", "СвойствоСостояние", СвойствоСостояние));
	// Отбор временной талицы
	ПрмДопТаблицы.Вставить("Фильтр",	Фильтр);
	
	ЗаполнитьСтруктуруПолейДляКолонокСостоянияОбъектов(ДанныеФормы, НаименованиеРеквизитаСписок, ПрмДопТаблицы);
	УспешноеВыполнение = ОбновитьЗапросДинамическогоСписка(ДанныеФормы.Форма, ПрмДопТаблицы);
	Если УспешноеВыполнение Тогда
		УспешноеВыполнение = ДобавитьКолонкиНаФорму(ДанныеФормы.Форма, ПрмДопТаблицы);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьКолонкиТекущийЭтап(Контекст, НаименованиеРеквизитаСписок, 
	ИмяКолонкиЛевогоСоединения = "Документ", context_params = Неопределено)
	
	МодульCore = МодульCore();
	СервисИнтеграции = МодульCore.get_prop(context_params, "service", "");
// BSLLS:UsingFindElementByString-off
	СвойствоАктивныйЭтап = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(
		СервисИнтеграции + "ДокументСБИС_ТекущийЭтап");
// BSLLS:UsingFindElementByString-on	

	СтрокаТаблицаДанных = "Integration_States_v2";
    мСтрокиЗапроса = Новый Массив();
	мИменаВременныхТаблиц = Новый Массив();
	мИменаВременныхТаблиц.Добавить(СтрокаТаблицаДанных);
	ТипыИсточников = get_prop(Контекст, "ТипыИсточников", Новый Массив);
	ЧастьТекстаЗапроса = ТекстЗапросаСвойстваПоВидамОбъектов(
		ТипыИсточников,
		"СвойствоАктивныйЭтап",
		мИменаВременныхТаблиц[мИменаВременныхТаблиц.Количество() - 1]);
	мСтрокиЗапроса.Добавить(ЧастьТекстаЗапроса);
	ЧастьТекстаЗапроса = 
// BSLLS:QueryParseError-off
		"////////////////////////////////////////////////////////////////////////////////
		|;
		|
		|ВЫБРАТЬ * ИЗ 
		|";
// BSLLS:QueryParseError-on
	
	мСтрокиЗапроса.Добавить(ЧастьТекстаЗапроса);
	ТекстЗапросаКЭДО = СтрСоединить82(мСтрокиЗапроса, Символы.ПС);
	ТекстЗапросаКЭДО = СтрЗаменить(ТекстЗапросаКЭДО, "Saby_СостоянияОбъектов", ПрефиксПродукта() + "СостоянияОбъектов");
						
	ПараметрыДопТаблицы = ИнициализироватьСтруктуруДопТаблицы();
	ПараметрыДопТаблицы.Вставить("ТаблицаДанных",		СтрокаТаблицаДанных);
	ПараметрыДопТаблицы.Вставить("Псевдоним",			СтрокаТаблицаДанных);
	ПараметрыДопТаблицы.Вставить("ИмяСпискаНаФорме",	НаименованиеРеквизитаСписок);
	ПараметрыДопТаблицы.Вставить("ВременнаяТаблица",	ТекстЗапросаКЭДО);
	ПараметрыДопТаблицы.Вставить("ИмяКолонкиЛевогоСоединения",	ИмяКолонкиЛевогоСоединения);
	
	Фильтр	= Новый Массив();
	// Аккаунт
	Фильтр.Добавить(Новый Структура("Параметр, Значение", "СвойствоАктивныйЭтап", СвойствоАктивныйЭтап));
	// Отбор временной талицы
	ПараметрыДопТаблицы.Вставить("Фильтр",	Фильтр);
	
	ЗаполнитьСтруктуруПолейДляКолонокТекущийЭтап(Контекст, НаименованиеРеквизитаСписок, ПараметрыДопТаблицы);
	УспешноеВыполнение = ОбновитьЗапросДинамическогоСписка(Контекст.Форма, ПараметрыДопТаблицы);
	Если УспешноеВыполнение Тогда
		УспешноеВыполнение = ДобавитьКолонкиНаФорму(Контекст.Форма, ПараметрыДопТаблицы);
	КонецЕсли;

КонецПроцедуры

#Область include_core_base_ВстраиваниеВФормы_ИмяПоляСтыковки
#КонецОбласти

// Добавляет колонки в динамический список при изменении запроса
//
// Параметры:
//   Форма - Форма
//   ИмяРеквизитаСписок - Строка - имя реквизита
//
Процедура ДобавитьКолонкиВДинамическийСписокПриИзмененииЗапроса(Форма, ИмяРеквизитаСписок) Экспорт
	Если НЕ ЗначениеЗаполнено(ИмяРеквизитаСписок) Тогда Возврат; КонецЕсли;
	СтруктураОписаниеФормы		= ПодготовитьСтруктуруОписанияФормы(Форма, Неопределено);
	Если НЕ ЭтоВстраиваемыйОбъектМетаданных(СтруктураОписаниеФормы) Тогда 
			// Обънект с которым мы не поддерживаем обмен
		Возврат;
	КонецЕсли;
	context_params= МодульCore().НастройкиПодключенияПрочитать();
	
	ТипОбъекта	= ТипМетаданныхПервогоОбъекта(СтруктураОписаниеФормы);
	ИмяТипа		= ИмяТипаПервогоОбъекта(СтруктураОписаниеФормы);
	НаименованиеРеквизитаСписок	= ПолучитьНаименованиеРеквизитаСписка(Форма);

	ПолеСтыковкиКЭДОСпр			= ИмяПолеСтыковкиКЭДОСпр();
	ПолеСтыковкиСостоянияСпр	= ИмяПолеСтыковкиСостоянияСпр();
	
	ПолеСтыковкиКЭДОДок			= ИмяПолеСтыковкиКЭДОДок();
	ПолеСтыковкиСостоянияДок	= ИмяСтыковкиСостоянияДок();
	
	Если Форма.ИмяФормы = "Документ.Совмещение.Форма.ФормаСписка" 
		ИЛИ Форма.ИмяФормы = "Документ.ОтменаСовмещения.Форма.ФормаСписка" Тогда
		ПолеСтыковкиСотрудник = "СовмещающийСотрудник";
	КонецЕсли;
	Если ТипОбъекта = "Справочник" Тогда
		Если ИмяТипа = "Сотрудники" Тогда
			ДобавитьКолонкиСтатусаКЭДО(СтруктураОписаниеФормы, НаименованиеРеквизитаСписок, ПолеСтыковкиКЭДОСпр, context_params);
		КонецЕсли;
		Если ИмяТипа = "ФизическиеЛица" Тогда
			ДобавитьКолонкиСтатусаФизЛица(СтруктураОписаниеФормы, НаименованиеРеквизитаСписок, ПолеСтыковкиСостоянияСпр, context_params);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипОбъекта = "Документ" Тогда
		ДобавитьКолонкиСтатусаКЭДО(СтруктураОписаниеФормы, НаименованиеРеквизитаСписок, ПолеСтыковкиКЭДОДок, context_params);
		ДобавитьКолонкиСтатусаСостояния(СтруктураОписаниеФормы, НаименованиеРеквизитаСписок, ПолеСтыковкиСостоянияДок, context_params);
		ДобавитьКолонкиТекущийЭтап(СтруктураОписаниеФормы, НаименованиеРеквизитаСписок, ПолеСтыковкиСостоянияДок, context_params);
	КонецЕсли;
КонецПроцедуры

Функция УсловияДобавленияКолонокВыполнены(Форма)
	МодульВстраиваниеВСтандартныеФормы = МодульВстраиваниеВСтандартныеФормы(); 
	МодульCore = МодульCore();
	
	УсловиеДляДобавленияКолонокНЕВыполнено = Не МодульВстраиваниеВСтандартныеФормы.ЭтоФормаСписка(Форма)
		ИЛИ МодульВстраиваниеВСтандартныеФормы.ЭтоФормаИсключения(Форма)
		// Проверка прав
		ИЛИ НЕ МодульCore.ТекущемуПользователюМожноРаботатьСРасширением();
		
	Если УсловиеДляДобавленияКолонокНЕВыполнено Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Процедура ДобавитьКолонкиВДинамическийСписок(Форма, ПараметрыРазмещения = Неопределено) Экспорт
	// Добавление колонок
	МодульCore = МодульCore();
	Если НЕ УсловияДобавленияКолонокВыполнены(Форма) Тогда
		Возврат;                                                            
	КонецЕсли;
	
	СтруктураОписаниеФормы		= ПодготовитьСтруктуруОписанияФормы(Форма, ПараметрыРазмещения);
	Если Не ЭтоВстраиваемыйОбъектМетаданных(СтруктураОписаниеФормы) Тогда 
			// Обънект с которым мы не поддерживаем обмен
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаСписок	= ПолучитьНаименованиеРеквизитаСписка(Форма);
	Если Не ЗначениеЗаполнено(ИмяРеквизитаСписок) Тогда 
		Возврат; 
	КонецЕсли;
	ДобавитьКолонкиВДинамическийСписокПриИзмененииЗапроса(Форма, ИмяРеквизитаСписок);
КонецПроцедуры

Функция ЛевоеПолеСоединенияНайдено(Знач ДоступныеПоля, Знач ПолноеИмяПоля)
	ПолеНайдено 	= Ложь;
	мПолей			= СтрРазделить(ПолноеИмяПоля, ".", Ложь);
	НайденноеПоле	= ДоступныеПоля.Найти(мПолей[0]);
	Если НайденноеПоле <> Неопределено Тогда
		ПолеНайдено		= Истина;
		ВырезаемоеПоле	= мПолей[0] + ?(мПолей.Количество()>0,".","");
		ПолеДляПроверки	= Прав(ПолноеИмяПоля, СтрДлина(ПолноеИмяПоля) - СтрДлина(ВырезаемоеПоле));
		Если Не ПустаяСтрока(ПолеДляПроверки) Тогда
			ПолеНайдено = ЛевоеПолеСоединенияНайдено(НайденноеПоле.Поля, ПолеДляПроверки);
		КонецЕсли;
	КонецЕсли;
	Возврат ПолеНайдено;
КонецФункции

Функция ЭлементСписокФормы(Контекст, СтруктураПараметров)
	ЭлементФормы				= Контекст.Элементы.Найти(СтруктураПараметров.ИмяСпискаНаФорме);
	Если ЭлементФормы  = Неопределено Тогда
		// Заглушка от падения при переходе по ссылкам формы
		Список	= Неопределено;
	Иначе
		Список	= Контекст[СтруктураПараметров.ИмяСпискаНаФорме];
	КонецЕсли;
	Если ТипЗнч(Список) <> Тип("ДинамическийСписок") Тогда
		Список	= Неопределено;
	КонецЕсли;
	Возврат Список;
КонецФункции

Функция СхемаСОбновленнымТекстом(Список, Контекст, СтруктураПараметров)
	Схема = Новый СхемаЗапроса();
	Если Найти(Список.ТекстЗапроса, СтруктураПараметров.ТаблицаДанных) = 0 Тогда
		Если НЕ Список.ПроизвольныйЗапрос Тогда
			// BSLLS:QueryParseError-off
			Схема.УстановитьТекстЗапроса(СтруктураПараметров.ВременнаяТаблица + Список.ОсновнаяТаблица);
			// BSLLS:QueryParseError-on
		Иначе
			// Удалим последнюю строку, обход аудита
			ТДокумент = Новый ТекстовыйДокумент;
			ТДокумент.УстановитьТекст(СтруктураПараметров.ВременнаяТаблица);
			ТДокумент.УдалитьСТроку(ТДокумент.КоличествоСтрок());
			Схема.УстановитьТекстЗапроса(ТДокумент.ПолучитьТекст() + Список.ТекстЗапроса);
		КонецЕсли;
	Иначе
		Схема.УстановитьТекстЗапроса(Список.ТекстЗапроса);
	КонецЕСли;
	Если Схема.ПакетЗапросов.Количество()=0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Схема;
КонецФункции

Функция ОсновнойИсточникЗапроса(Список, ОператорВыбрать)
	ОсновнойИсточник = Неопределено;
	КорневыеИсточники = ОператорВыбрать.Источники.ПолучитьКорневыеИсточники();
	Для каждого Источник Из КорневыеИсточники Цикл
		Если ТипЗнч(Источник.Источник)=Тип("ТаблицаСхемыЗапроса")
			И ВРег(Источник.Источник.ИмяТаблицы)=ВРег(Список.ОсновнаяТаблица)
			Тогда
			ОсновнойИсточник = Источник;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОсновнойИсточник=Неопределено И КорневыеИсточники.Количество() > 0 Тогда
		ОсновнойИсточник = КорневыеИсточники[0];
	КонецЕсли;
	Возврат ОсновнойИсточник;
КонецФункции

Функция СоединениеТаблицУспешно(СтруктураПараметров, ОсновнойИсточник, ПсевдонимДопТаблицы, ИсточникДопДанные)
	Условие = "";
	Для каждого ИменаПолей Из СтруктураПараметров.ПоляСоединения Цикл
		Если Не ЛевоеПолеСоединенияНайдено(ОсновнойИсточник.Источник.ДоступныеПоля, ИменаПолей.Ключ) Тогда
			Возврат Ложь;
		КонецЕсли;
		ЧастьУсловия1 = "";
		Если ЗначениеЗаполнено(Условие) Тогда
			ЧастьУсловия1 = Условие + " И ";
		КонецЕсли;
		ШаблонСтр = "%1." + ИменаПолей.Ключ + " = " + ПсевдонимДопТаблицы + "." + ИменаПолей.Значение;
		Условие =  ЧастьУсловия1 + СтрШаблон(ШаблонСтр, ОсновнойИсточник.Источник.Псевдоним);
	КонецЦикла;
	
	Если Не ОсновнойИсточник.Соединения.Добавить(ИсточникДопДанные, Условие) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Процедура ИсправлениеПсевдонимовПолей(ОператорВыбрать)
	// Исправление псевдонимов полей СКД после обработки запроса через объект "СхемаЗапроса"
	Для каждого ВыражениеОтбораСКД Из ОператорВыбрать.ВыраженияОтбораКомпоновкиДанных Цикл
		ПсевдонимПоле = СтрНайти(ВыражениеОтбораСКД.Псевдоним, "Поле");
		Если ПсевдонимПоле = 1 Тогда
			ПостфиксПсевдонима = СтрЗаменить(ВыражениеОтбораСКД.Псевдоним, "Поле", "");
			Если СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ПостфиксПсевдонима) <> Неопределено Тогда
				// При успешном приведении к числу сбросим псевдоним
				ВыражениеОтбораСКД.Псевдоним = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьОтборВНовомЗапросе(СтруктураПараметров, Список, Схема, ОсновнойИсточник, 
		ОператорВыбрать, ПсевдонимДопТаблицы, ОсновнаяТаблица)
	Соединение				= ОсновнойИсточник.Соединения.НайтиПоПсевдониму(ПсевдонимДопТаблицы);
	Соединение.ТипСоединения= ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
	Список.ТекстЗапроса		= Схема.ПолучитьТекстЗапроса();
	
	Список.ОсновнаяТаблица	= ОсновнаяТаблица;
	// Установим фильтр при наличии такого
	Фильтр = МодульCore().get_prop(СтруктураПараметров, "Фильтр", Новый Массив);
	Для Каждого ЭлементФильтра Из Фильтр Цикл
		ПараметрОтбора = Список.Параметры.Элементы.Найти(ЭлементФильтра.Параметр);
		Если ПараметрОтбора <> Неопределено Тогда
			ПараметрОтбора.Значение = ЭлементФильтра.Значение;
			ПараметрОтбора.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Добавляем к основному запросу динамического списка данные о КЭДО и состоянии объектов
//
// Параметры:
//  Контекст - Произвольный - Структура с реквизитом формы
//  СтруктураПараметров - Структура - Дополонительные параметры
//
// Возвращаемое значение:
//  Булево - Истина
//
// BSLLS:TooManyReturns-off
Функция ОбновитьЗапросДинамическогоСписка(Контекст, СтруктураПараметров)
	УспешноеВыполнение = Ложь;

	Список = ЭлементСписокФормы(Контекст, СтруктураПараметров);
	Если Список = Неопределено Тогда
		Возврат УспешноеВыполнение;
	КонецЕсли;
	ОсновнаяТаблица 	= Список.ОсновнаяТаблица;

	Схема= СхемаСОбновленнымТекстом(Список, Контекст, СтруктураПараметров);
	Если Схема = Неопределено Тогда
		Возврат УспешноеВыполнение;
	КонецЕсли;

	Запрос = Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Если Запрос.Операторы.Количество()=0 Тогда
		Возврат УспешноеВыполнение;
	КонецЕсли;
	ОператорВыбрать = Запрос.Операторы[0];
	
	ОсновнойИсточник = ОсновнойИсточникЗапроса(Список, ОператорВыбрать);
	Если ОсновнойИсточник = Неопределено Тогда
		Возврат УспешноеВыполнение;
	КонецЕсли;
	
	ДопТаблицаДанных	= СтруктураПараметров.ТаблицаДанных;
	ПсевдонимДопТаблицы	= СтруктураПараметров.Псевдоним;
	ПостфиксКолонок		= СтруктураПараметров.ПостфиксКолонок;
	
	ИсточникДопДанные	= ОператорВыбрать.Источники.НайтиПоИмени(ДопТаблицаДанных);
	Если ИсточникДопДанные = Неопределено Тогда
		// Обход ошибки повторных вызовов
		ИсточникДопДанные	= ОператорВыбрать.Источники.Добавить(ДопТаблицаДанных, ПсевдонимДопТаблицы);
	КонецЕсли;
	ИсточникДопДанные.Соединения.Очистить();

	Если НЕ СоединениеТаблицУспешно(СтруктураПараметров, ОсновнойИсточник, ПсевдонимДопТаблицы, ИсточникДопДанные) Тогда 
		Возврат УспешноеВыполнение;
	КонецЕсли;
	

	Соединение					= ОсновнойИсточник.Соединения.НайтиПоПсевдониму(ПсевдонимДопТаблицы);
	Соединение.ТипСоединения	= ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;

	Для каждого ДопКолонка Из СтруктураПараметров.СтруктураКолонок Цикл
		Если ОператорВыбрать.ВыбираемыеПоля.Найти(ДопКолонка.ПутьКДанным) = Неопределено Тогда
			Поле				= ОператорВыбрать.ВыбираемыеПоля.Добавить(ДопКолонка.ПутьКДанным);
			Колонка				= Запрос.Колонки.Найти(Поле);
			Колонка.Псевдоним	= ПостфиксКолонок+ДопКолонка.Имя;
		КонецЕсли;
	КонецЦикла;
	
	ИсправлениеПсевдонимовПолей(ОператорВыбрать);
	УстановитьОтборВНовомЗапросе(СтруктураПараметров, 
		Список, 
		Схема, 
		ОсновнойИсточник, 
		ОператорВыбрать, 
		ПсевдонимДопТаблицы, 
		ОсновнаяТаблица);
	
	Если Контекст.ИмяФормы = "Обработка.СписокСотрудников.Форма.ФормаСпискаСотрудников" Тогда
		// КОРП, необходимо включить для этой формы
		Список.АвтоЗаполнениеДоступныхПолей  = Истина;
	КонецЕсли;
	Для каждого ДопКолонка Из СтруктураПараметров.СтруктураКолонок Цикл
		Список.УстановитьОбязательноеИспользование(ПостфиксКолонок + ДопКолонка.Имя, Истина);
	КонецЦикла;
	
	УспешноеВыполнение		= Истина;
	Возврат УспешноеВыполнение;
КонецФункции
// BSLLS:TooManyReturns-on

// Добавляем колонки на форму
//
// Параметры:
//  Контекст - Произвольный - Структура с реквизитом формы
//  СтруктураПараметров - Структура - Дополонительные параметры
//
// Возвращаемое значение:
//  Булево - Истина, если колонки были добавлены, Ложь - если нет
//
Функция ДобавитьКолонкиНаФорму(Контекст, СтруктураПараметров)
	КолонкиУспешноДобавлены = Ложь;
	ПостфиксКолонок = СтруктураПараметров.ПостфиксКолонок;
	
	Для каждого ДопКолонка Из СтруктураПараметров.СтруктураКолонок Цикл
		Если Не ДопКолонка.ОтображатьНаФорме Тогда Продолжить; КонецЕсли;
		Попытка
			Если Контекст.Элементы.Найти(ПостфиксКолонок+ДопКолонка.Имя) = Неопределено Тогда
				Элемент = Контекст.Элементы.Добавить(ПостфиксКолонок+ДопКолонка.Имя,Тип("ПолеФормы"),Контекст.Элементы[СтруктураПараметров.ИмяСпискаНаФорме]);
			Иначе
				// Поле уже существует
				Продолжить;
			КонецЕСли;
		Исключение
			КолонкиУспешноДобавлены = Ложь;
			Прервать;
		КонецПопытки;
		Если ДопКолонка.Свойство("Картинка") Тогда 
			Элемент.Вид					= ВидПоляФормы.ПолеКартинки;
			Элемент.Ширина				= 1;
			Элемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.КартинкаЗначений	= ДопКолонка.Картинка;
		КонецЕсли;
		Элемент.ПутьКДанным			= СтруктураПараметров.ИмяСпискаНаФорме+"."+ПостфиксКолонок+ДопКолонка.Имя;
		Элемент.Заголовок			= ДопКолонка.Заголовок;
		Элемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Авто;
		КолонкиУспешноДобавлены = Истина;
	КонецЦикла;
	Возврат КолонкиУспешноДобавлены; 
КонецФункции

#КонецОбласти

#Область ФильтрыДинамическогоСписка

// Фильтр на форме динамического списка
// Добавляет действия на панель задач формы
//
// Параметры:
//  Форма - Форма
//  НаименованиеРеквизитаСписок - Строка - имя реквизита
//  ГруппаНастроек - Произвольный - группа настроек
//  ПараметрыКритерияОтбора - Произвольный - параметры
//  ГруппаПараметровКритерияОтбора - Строка - группа параметров
//  КолонкиДобавлены - Булево - признак добавления колонок
//
Процедура УстановитьФильтры(Форма, НаименованиеРеквизитаСписок, ГруппаНастроек, ПараметрыКритерияОтбора, ГруппаПараметровКритерияОтбора, КолонкиДобавлены) Экспорт
// Код оставлен на будущее!
//	дСписок	= Форма[НаименованиеРеквизитаСписок];
//	
//	ЭлементОтбора =  дСписок.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СостояниеСБИС");
//	ЭлементОтбора.ПравоеЗначение = Неопределено;
//	ЭлементОтбора.Использование = Ложь;
КонецПроцедуры

#КонецОбласти

#Область УсловноеОформление

// Раскрасим форму/список 
//
// Параметры:
//  Форма - Форма
//  НаименованиеРеквизитаСписок - Строка - имя реквизита
//  ГруппаНастроек - Произвольный - группа настроек
//  ПараметрыКритерияОтбора - Произвольный - параметры
//  ГруппаПараметровКритерияОтбора - Строка - группа параметров
//  КолонкиДобавлены - Булево - признак добавления колонок
//
Процедура УстановитьУсловноеОформление(Форма, НаименованиеРеквизитаСписок, ГруппаНастроек, ПараметрыКритерияОтбора, ГруппаПараметровКритерияОтбора, КолонкиДобавлены) Экспорт

КонецПроцедуры

#КонецОбласти 

#Область include_core_base_ОсобенностиПлатформы_РаботаСоСтроками
#КонецОбласти

#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти
