
#Область include_core_base_ТехническаяИнформация_Form_ТехИнформация_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_Helpers_ПоказатьОповещениеПользователя
#КонецОбласти

#Область include_core_base_Helpers_Картинки
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МодульОбъекта = МодульОбъекта();
	// BSLLS:UnusedLocalVariable-off // Заполнение переменных формы
	context_params = МодульОбъекта.НастройкиПодключенияПрочитать();
	// BSLLS:UnusedLocalVariable-on
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницу(Номер = 1)
	ЭтаФорма.НомерСтраницы = Номер;
	ЭлемФормы = ПолучитьЭлементыФормы();
	ПанельКонтент = ЭлемФормы.ПанельКонтент;
	СтраницаТехИнформация = ПолучитьСтраницуНаКлиенте(ПанельКонтент, "СтраницаТехИнформация");
	СтраницаРезультатСбораТехИнформации = ПолучитьСтраницуНаКлиенте(ПанельКонтент, "СтраницаРезультатСбораТехИнформации");
	Если Номер = 2 Тогда
		СтраницаТехИнформация.Видимость = Ложь;
		СтраницаРезультатСбораТехИнформации.Видимость = Истина;
		ПанельКонтент.ТекущаяСтраница = СтраницаРезультатСбораТехИнформации;
	Иначе
		СтраницаРезультатСбораТехИнформации.Видимость = Ложь;
		СтраницаТехИнформация.Видимость = Истина;
		ПанельКонтент.ТекущаяСтраница = СтраницаТехИнформация;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии()
	ЗаполнитьЗначенияРеквизитовФормы();
	ПоказатьСтраницу(ЭтаФорма.НомерСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФормуПоОшибке(ИнфоПоОшибке, Заголовок)
	СтруктураОшибки = ExtExceptionAnalyse(ИнфоПоОшибке);
	ЭтаФорма.Информация = Заголовок;
	ЭтаФорма.РасшифровкаИнформации = СтруктураОшибки.message;
	ЗаполнитьЗначенияРеквизитовФормы();
	ПоказатьСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФормуПоОшибкеВЭтойФорме(ИнфоПоОшибке, Заголовок)
	ЭтаФорма.Информация = Заголовок;
	ЭтаФорма.РасшифровкаИнформации = ИнфоПоОшибке.Описание;
	ЗаполнитьЗначенияРеквизитовФормы();
	ПоказатьСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВебСсылку(ВебСсылка)
	Если НЕ ЗначениеЗаполнено(ВебСсылка) Тогда
		Возврат;
	КонецЕсли;
	#Если ТолстыйКлиентОбычноеПриложение Тогда 
		// BSLLS:UsingSynchronousCalls-off // Предложенное сонаром НачатьЗапускПриложения нам не подходит
		ЗапуститьПриложение(ВебСсылка); 
		// BSLLS:UsingSynchronousCalls-on
	#Иначе	
		ПерейтиПоНавигационнойСсылке(ВебСсылка);	
	#КонецЕсли		
КонецПроцедуры

&НаКлиенте
Процедура НадписьИнструкцияНажатие(Элемент)
	// Обработки версии 2
	Если Лев(НРег(НазваниеПродукта()), 7) = "vo2_1c_" Тогда
		ВебСсылка = "https://saby.ru/help/integration/1C_set/modul/typical_errors";
	// Расширения, обработки версии 3 и кодпайс
	Иначе
		ВебСсылка = "https://link.saby.ru/article/cdf5e25d-67df-4841-a09a-8eec1f82a06a/1885dd23-288c-4aab-bc56-bcd12c08ff53";
	КонецЕсли;
	ОткрытьВебСсылку(ВебСсылка);
КонецПроцедуры

&НаКлиенте
Процедура НадписьЧатНажатие(Элемент)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("АдресСтраницы", context_params.ApiUrl + "/addon4/page/?ext_chat_id=" + НазваниеПродукта());
	ФормаБраузера = ФормаОсновнойОбработки("Browser", ПутьКФормамОбработки(), ПараметрыФормы, ЭтаФорма);
	ФормаБраузера.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура НадписьСобратьТехИнфоНажатие(Элемент)
	Попытка
		ЭтаФорма.СсылкаНаАрхив = СобратьТехническуюИнформацию(Истина); // Архив с адресом на СБИС-диске
		Картинка = КартинкаУспешно();
		ТекстСообщения = "Выполнено";
		ПоказатьСтраницу(2); // Показываем ссылку на собранную информацию
	Исключение
		Картинка = КартинкаОшибка();
		ТекстСообщения = "Ошибка выполнения";
		ЭтаФорма.СсылкаНаАрхив = "";
		ОбновитьФормуПоОшибкеВЭтойФорме(ИнформацияОбОшибке(), "Ошибка сбора технической информации");
	КонецПопытки;
	// Доп. окно оповещения справа внизу
	ПоказатьВажноеОповещениеПользователя(
		"Сбор технической информации",
		СсылкаНаАрхив,
		ТекстСообщения,
		Картинка);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаАрхивНажатие(Элемент)
	ОткрытьВебСсылку(СсылкаНаАрхив);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСсылкуИЗакрытьОкноНажатие(Команда)
	#Если НЕ ВебКлиент Тогда
		СистемнаяИнформация = Новый СистемнаяИнформация;
		// Linux
		Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86
				ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
			ВызватьДиалогДляСохраненияВБуферОбмена(СсылкаНаАрхив);
		// Windows
		Иначе
			// BSLLS:UsingObjectNotAvailableUnix-off // Сонар не понимает, что линукс учтен в условии выше
			ОбъектКопирования = Новый COMОбъект("htmlfile"); 
			ОбъектКопирования.ParentWindow.ClipboardData.SetData("Text", СсылкаНаАрхив);
			// BSLLS:UsingObjectNotAvailableUnix-on
			ЭтаФорма.Закрыть();
		КонецЕсли;
	#Иначе
		ВызватьДиалогДляСохраненияВБуферОбмена(СсылкаНаАрхив);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ВызватьДиалогДляСохраненияВБуферОбмена(ТекстДляСохранения) Экспорт 
	#Если ТолстыйКлиентОбычноеПриложение Тогда 
		// BSLLS:UsingSynchronousCalls-off // Сонар не понимает, что вызов для обычного клиента
		ВвестиСтроку(ТекстДляСохранения, "Сохраните в буфер обмена");
		// BSLLS:UsingSynchronousCalls-on	
		ЭтаФорма.Закрыть();
	#Иначе
		ОписаниеПослеВводаСтрокиВБуферОбмена = Новый ОписаниеОповещения("ПослеВводаСтрокиВБуферОбмена", ЭтаФорма);
		ПоказатьВводСтроки(ОписаниеПослеВводаСтрокиВБуферОбмена, ТекстДляСохранения, "Сохраните в буфер обмена"); 
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтрокиВБуферОбмена(Результат, ДополнительныеПараметры) Экспорт 
	ЭтаФорма.Закрыть();
КонецПроцедуры

#Область include_core_base_Helpers_ОбновитьСтруктуру //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_РежимЗапускаПриложенияНаКлиенте
#КонецОбласти

#Область include_core_base_ТехническаяИнформация_СобратьТехническуюИнформациюНаКлиенте
#КонецОбласти

