
#Область include_base_НазваниеПродукта
#КонецОбласти

#Область include_core_base_Helpers_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_core_base_Helpers_ExtException
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти     

#Область include_core_base_Helpers_РаботаСХранилищемЗначения
#КонецОбласти

#Область include_core_base_Helpers_РаботаСХранилищемСистемныхНастроек
#КонецОбласти

#Область include_core_base_ТехническаяИнформация_ДополнительнаяТехническаяИнформацияНастройки
#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьЗначенияРеквизитовФормы()
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.Информация.Заголовок = ЭтаФорма.Информация;
	ЭлемФормы.РасшифровкаИнформации.Заголовок = ЭтаФорма.РасшифровкаИнформации;
КонецПроцедуры

