
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьЭлементыФормы();
	ФильтрУстановитьВидимость();
	Если ЗначениеЗаполнено(ConnectionID) Тогда
		ЭтаФорма.Заголовок = "Выберите фильтры";
		ПолучитьЭлементыФормы().Отобрать.Заголовок = "Сохранить";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтарыйФильтр(ИмяФильтра)
	// Поля нового фильтра должны соответствовать старому, если используется старый фильтр
	Если ИмяФильтра = "ФильтрДатаНач" Тогда
		Попытка
			ЭтаФорма.ВладелецФормы.ДанныеФильтра.Значения.Дата_From = ПолучитьЗначениеЭлемента(ИмяФильтра);
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;
	Если ИмяФильтра = "ФильтрДатаКнц" Тогда
		Попытка
			ЭтаФорма.ВладелецФормы.ДанныеФильтра.Значения.Дата_To   = ПолучитьЗначениеЭлемента(ИмяФильтра);
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНовыйФильтр(ИмяФильтра)
	// Поля старого фильтра должны соответствовать новому, если используется новый фильтр
	Попытка
		ЭтаФорма.ВладелецФормы.ДанныеФильтра.Значения.ФильтрДатаНач = ПолучитьЗначениеЭлемента(ИмяФильтра + "_From");
		ЭтаФорма.ВладелецФормы.ДанныеФильтра.Значения.ФильтрДатаКнц = ПолучитьЗначениеЭлемента(ИмяФильтра + "_To");
	Исключение
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьНажатие(Элемент)
	Для Каждого Поле Из ДанныеФильтра.ПараметрыОтображения Цикл
		ИмяФильтра = get_prop(Поле, "NAME", get_prop(Поле, "Name"));
		TEMPLATE = get_prop(Поле, "TEMPLATE");
		Если TEMPLATE = "filter_period" Тогда  
			ЭтаФорма.ВладелецФормы.ДанныеФильтра.Значения.Вставить(ИмяФильтра + "_Период", ПолучитьЗначениеЭлемента(ИмяФильтра + "_Период"));	
			ЭтаФорма.ВладелецФормы.ДанныеФильтра.Значения.Вставить(ИмяФильтра + "_From", ПолучитьЗначениеЭлемента(ИмяФильтра + "_From"));	
			ЭтаФорма.ВладелецФормы.ДанныеФильтра.Значения.Вставить(ИмяФильтра + "_To", ПолучитьЗначениеЭлемента(ИмяФильтра + "_To"));
			ОбработатьНовыйФильтр(ИмяФильтра);
			Продолжить;
		КонецЕсли;
		Если TEMPLATE = "filter_enumeration_with_date" Тогда  
			ЭтаФорма.ВладелецФормы.ДанныеФильтра.Значения.Вставить(ИмяФильтра + "_Date", ПолучитьЗначениеЭлемента(ИмяФильтра + "_Date"));
		КонецЕсли;
		Если TEMPLATE = "filter_chips" Тогда  
			Продолжить;
		КонецЕсли;
		ЭтаФорма.ВладелецФормы.ДанныеФильтра.Значения.Вставить(ИмяФильтра, ПолучитьЗначениеЭлемента(ИмяФильтра));
		ОбработатьСтарыйФильтр(ИмяФильтра);
	КонецЦикла;
	ЭтаФорма.ВладелецФормы.ПрименитьФильтр();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Элем = ПолучитьЭлементыФормы();
	ЗначениеФильтрПериод = ПолучитьЗначениеЭлемента(Элемент.Имя);
	МассивПараметров = СтрРазделить82(Элемент.Имя, "_");
	ИмяФильтра = МассивПараметров.Получить(0);
	ИмяНачалоПериода = ИмяФильтра + "_From";	
	ИмяКонецПериода = ИмяФильтра + "_To";
	Элем[ИмяНачалоПериода].Видимость = Ложь;
	Элем[ИмяКонецПериода].Видимость = Ложь;
	Если Элем.Найти("Надпись"+ИмяНачалоПериода) <> Неопределено Тогда
		Элем["Надпись"+ИмяНачалоПериода].Видимость = Ложь;
		Элем["Надпись"+ИмяКонецПериода].Видимость = Ложь;
	КонецЕсли;
	
	Если (ЗначениеФильтрПериод = "За весь период") Тогда
    	УстановитьЗначениеЭлемента(ИмяНачалоПериода, "");
		УстановитьЗначениеЭлемента(ИмяКонецПериода, ""); 
		Возврат;
	КонецЕсли;   
	// BSLLS:DeprecatedCurrentDate-off
	ТекущаяДата = ТекущаяДата();
	// BSLLS:DeprecatedCurrentDate-on
	Если (ЗначениеФильтрПериод = "За сегодня") Тогда 
		УстановитьЗначениеЭлемента(ИмяНачалоПериода, НачалоДня(ТекущаяДата));
		УстановитьЗначениеЭлемента(ИмяКонецПериода, КонецДня(ТекущаяДата)); 
		Возврат;	
	КонецЕсли; 
	Если (ЗначениеФильтрПериод = "За последний месяц") Тогда 
		УстановитьЗначениеЭлемента(ИмяНачалоПериода, НачалоДня(ДобавитьМесяц(ТекущаяДата,-1)));
		УстановитьЗначениеЭлемента(ИмяКонецПериода, КонецДня(ТекущаяДата)); 
		Возврат;	
	КонецЕсли;
	Если (ЗначениеФильтрПериод = "За последние полгода") Тогда 
		УстановитьЗначениеЭлемента(ИмяНачалоПериода, НачалоДня(ДобавитьМесяц(ТекущаяДата,-6)));
		УстановитьЗначениеЭлемента(ИмяКонецПериода, КонецДня(ТекущаяДата)); 
		Возврат;	
	КонецЕсли;
	Если (ЗначениеФильтрПериод = "За последний год") Тогда 
		УстановитьЗначениеЭлемента(ИмяНачалоПериода, НачалоДня(ДобавитьМесяц(ТекущаяДата,-12)));
		УстановитьЗначениеЭлемента(ИмяКонецПериода, КонецДня(ТекущаяДата)); 
		Возврат;	
	КонецЕсли;
	Элем[ИмяНачалоПериода].Видимость = Истина;
	Элем[ИмяКонецПериода].Видимость = Истина;	
	Если Элем.Найти("Надпись"+ИмяНачалоПериода) <> Неопределено Тогда
		Элем["Надпись"+ИмяНачалоПериода].Видимость = Истина;
		Элем["Надпись"+ИмяКонецПериода].Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПериодПриИзменении(Элемент)
	ФильтрУстановитьВидимость();
	// BSLLS:DeprecatedCurrentDate-off
	Если(ФильтрПериод="За весь период") Тогда
		ЭтаФорма["ФильтрДатаНач"]="";
		ЭтаФорма["ФильтрДатаКнц"]="";
		Возврат;
	КонецЕсли;
	Если(ФильтрПериод="За сегодня") Тогда
		ЭтаФорма["ФильтрДатаНач"] = ТекущаяДата();
		ЭтаФорма["ФильтрДатаКнц"] = ТекущаяДата();
		Возврат;
	КонецЕсли;
	Если(ФильтрПериод = "За последний месяц") Тогда
		ЭтаФорма["ФильтрДатаКнц"] = ТекущаяДата();
		ЭтаФорма["ФильтрДатаНач"] = ДобавитьМесяц(ФильтрДатаКнц,-1);
		Возврат;
	КонецЕсли;
	Если(ФильтрПериод = "За последние полгода") Тогда
		ЭтаФорма["ФильтрДатаКнц"] = ТекущаяДата();
		ЭтаФорма["ФильтрДатаНач"] = ДобавитьМесяц(ФильтрДатаКнц,-6);
		Возврат;
	КонецЕсли;
	Если(ФильтрПериод = "За последний год") Тогда
		ЭтаФорма["ФильтрДатаКнц"] = ТекущаяДата();
		ЭтаФорма["ФильтрДатаНач"] = ДобавитьМесяц(ФильтрДатаКнц,-12);
		Возврат;
	КонецЕсли;
	// BSLLS:DeprecatedCurrentDate-on
КонецПроцедуры

&НаКлиенте
Процедура ФильтрУстановитьВидимость()
	ЭлемФормы = ПолучитьЭлементыФормы();
	Если(ФильтрПериод="За период") Тогда
		ЭлемФормы.ПанельСПо.Видимость = Истина;
	Иначе
		ЭлемФормы.ПанельСПо.Видимость = Ложь;
	КонецЕсли;  
	
	Для Каждого Поле Из ДанныеФильтра.ПараметрыОтображения Цикл
	
		TEMPLATE = get_prop(Поле, "TEMPLATE", Неопределено);
		Если TEMPLATE <> "filter_period" Тогда  
			Продолжить;
		КонецЕсли;
		ИмяФильтра = get_prop(Поле, "NAME", Неопределено);
		ПериодПриИзменении(ЭлемФормы[ИмяФильтра+"_Период"]);		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФильтр(Команда)
	ЭлемФормы = ПолучитьЭлементыФормы();
	Для Каждого ЭлемФильтр Из ДанныеФильтра.Значения Цикл
		Если ЭлемФильтр.Ключ = "ФильтрПериод" Тогда
			ДанныеФильтра.Значения.Вставить(ЭлемФильтр.Ключ,"За весь период");
		Иначе 
			Типы = Новый Массив;
			Типы.Добавить(ТипЗнч(ЭлемФильтр.Значение));
			ОписаниеТипа = Новый ОписаниеТипов(Типы);
			ДанныеФильтра.Значения[ЭлемФильтр.Ключ] = ОписаниеТипа.ПривестиЗначение(Неопределено);
		КонецЕсли; 
		Если ЭлемФормы.Найти(ЭлемФильтр.Ключ) <> Неопределено Тогда
			ЭтаФорма[ЭлемФильтр.Ключ] = ДанныеФильтра.Значения[ЭлемФильтр.Ключ];
		КонецЕсли;	
	КонецЦикла;
	ФильтрПериодПриИзменении(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСвязиНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Для Каждого ЭлементФильтра Из ДанныеФильтра.ПараметрыОтображения Цикл  
		
		ИмяФильтра = get_prop(ЭлементФильтра, "NAME", get_prop(ЭлементФильтра, "Name"));
		
		Если ИмяФильтра <> Элемент.Имя Тогда
			Продолжить;
		Конецесли;
		
		TEMPLATE = get_prop(ЭлементФильтра, "TEMPLATE", Неопределено);
		Если TEMPLATE <> Неопределено Тогда
			ПолеСвязиНачалоВыбораПоВидуФильтра(ЭлементФильтра);
			Возврат;
		КонецЕсли;	
		
		СвойстваЭлементаФильтра = ЭлементФильтра["Properties"];
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("FILTER_NAME", ИмяФильтра);
		ПараметрыФормы.Вставить("ВидДанных1С", "");
		ПараметрыФормы.Вставить("ТипДанных1С", ЭлементФильтра["ValueType"]);
		ЭлементыСтроки = СтрРазделить82(ЭлементФильтра["ValueType"], ".");
		Если ЭлементыСтроки.Количество() > 1 Тогда
			ПараметрыФормы.Вставить("ВидДанных1С", ЭлементыСтроки[0]);
			ПараметрыФормы.Вставить("ТипДанных1С", ЭлементыСтроки[1]);
		КонецЕсли;
		ПараметрыФормы.Вставить("INI", СвойстваЭлементаФильтра["INI"] + "_list");
		ПараметрыФормы.Вставить("ENDPOINT", СвойстваЭлементаФильтра["ENDPOINT"]);
		ПараметрыФормы.Вставить("CONST_FILTER", СвойстваЭлементаФильтра["CONST_FILTER"]);
		ПараметрыФормы.Вставить("FILTER", СвойстваЭлементаФильтра["FILTER"]);
		ПараметрыФормы.Вставить("MULTI", СвойстваЭлементаФильтра["MULTI"]);
		ПараметрыФормы.Вставить("ConnectionID", ConnectionID);
	
		Форма = ФормаОсновнойОбработки("ДиалогВыбораИзСписка", ПутьКФормамОбработки(), ПараметрыФормы, ЭтаФорма);
		Форма.Открыть();
	КонецЦикла;
КонецПроцедуры

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_ГлавноеОкно_Form_Фильтр_ОсобенностиПриложения
#КонецОбласти
