
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьЭлементыФормы();
	ФильтрУстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьНажатие(Элемент)
	ЗначенияФильтра = Новый Структура();
	Для Каждого Поле Из ДанныеФильтра.ПараметрыОтображения Цикл
		ЗначенияФильтра.Вставить(Поле["Name"], ПолучитьЗначениеЭлемента(Поле["Name"]));
	КонецЦикла;
	ЭтаФорма.ВладелецФормы.ДанныеФильтра.Значения = ЗначенияФильтра;
	ЭтаФорма.ВладелецФормы.ПрименитьФильтр();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПериодПриИзменении(Элемент)
	ФильтрУстановитьВидимость();
	Если(ФильтрПериод="За весь период") Тогда
		ФильтрДатаНач="";
		ФильтрДатаКнц="";
		Возврат;
	КонецЕсли;
	Если(ФильтрПериод="За сегодня") Тогда
		ФильтрДатаНач = ТекущаяДата();
		ФильтрДатаКнц = ТекущаяДата();
		Возврат;
	КонецЕсли;
	Если(ФильтрПериод = "За последний месяц") Тогда
		ФильтрДатаКнц = ТекущаяДата();
		ФильтрДатаНач = ДобавитьМесяц(ФильтрДатаКнц,-1);
		Возврат;
	КонецЕсли;
	Если(ФильтрПериод = "За последние полгода") Тогда
		ФильтрДатаКнц = ТекущаяДата();
		ФильтрДатаНач = ДобавитьМесяц(ФильтрДатаКнц,-6);
		Возврат;
	КонецЕсли;
	Если(ФильтрПериод = "За последний год") Тогда
		ФильтрДатаКнц = ТекущаяДата();
		ФильтрДатаНач = ДобавитьМесяц(ФильтрДатаКнц,-12);
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрУстановитьВидимость()
	ЭлемФормы = ПолучитьЭлементыФормы();
	Если(ФильтрПериод="За период") Тогда
		ЭлемФормы.ПанельСПо.Видимость = Истина;
	иначе
		ЭлемФормы.ПанельСПо.Видимость = Ложь;
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФильтр(Команда)
	ЭлемФормы = ПолучитьЭлементыФормы();
	Для Каждого ЭлемФильтр Из ДанныеФильтра.Значения Цикл
		Если ЭлемФильтр.Ключ = "ФильтрПериод" Тогда
			ДанныеФильтра.Значения.Вставить(ЭлемФильтр.Ключ,"За весь период");
		Иначе 
			Типы = Новый Массив;
			Типы.Добавить(ТипЗнч(ЭлемФильтр.Значение));
			ОписаниеТипа = Новый ОписаниеТипов(Типы);
			ДанныеФильтра.Значения[ЭлемФильтр.Ключ] = ОписаниеТипа.ПривестиЗначение(Неопределено);
		КонецЕсли; 
		Если ЭлемФормы.Найти(ЭлемФильтр.Ключ) <> Неопределено Тогда
			ЭтаФорма[ЭлемФильтр.Ключ] = ДанныеФильтра.Значения[ЭлемФильтр.Ключ];
		КонецЕсли;	
	КонецЦикла;
	ФильтрПериодПриИзменении(Ложь);	
КонецПроцедуры

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_ГлавноеОкно_Form_Фильтр_ОсобенностиПриложения
#КонецОбласти
