
#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти

Процедура ЗаполнитьЭлементыФормыПоВидуФильтра(Поле, ЭлемФормы, ОсновнаяПанель, Верх) 
	TEMPLATE = get_prop(Поле, "TEMPLATE", Неопределено);
	ИмяРеквизита = get_prop(Поле, "NAME", Неопределено); 
	Если TEMPLATE <> "filter_enumeration_with_date" И TEMPLATE <> "filter_chips" Тогда
		Элем = ЭлемФормы.Добавить(Тип("Надпись"), "Надпись" + ИмяРеквизита, Истина, ОсновнаяПанель);
		Элем.Верх = Верх;
		Элем.Лево = 10;
		Элем.Высота = 20;
		Элем.Ширина = 100;
		Элем.Заголовок = get_prop(Поле, "TITLE", "") + ":";
		Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
	КонецЕсли;
	
	Если TEMPLATE = "filter_number" Тогда   
		ТипПоля = Тип("ПолеВвода");
		Элем = ЭлемФормы.Добавить(ТипПоля, ИмяРеквизита, Истина, ОсновнаяПанель);
		Элем.ТипЗначения = Новый ОписаниеТипов("Число");
		Элем.Верх = Верх;
		Элем.Лево = 110;
		Элем.Высота = 20;
		Элем.Ширина = 295;
		Элем.КнопкаВыбора = Истина;	
		Элем.Значение = get_prop(ДанныеФильтра.Значения, ИмяРеквизита);
		Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
	ИначеЕсли TEMPLATE = "filter_string" Тогда 
		ТипПоля = Тип("ПолеВвода");
		Элем = ЭлемФормы.Добавить(ТипПоля, ИмяРеквизита, Истина, ОсновнаяПанель);
		Элем.ТипЗначения = Новый ОписаниеТипов("Строка");
		Элем.Верх = Верх;
		Элем.Лево = 110;
		Элем.Высота = 20;
		Элем.Ширина = 295;
		Элем.Значение = get_prop(ДанныеФильтра.Значения, ИмяРеквизита);	
		Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
	ИначеЕсли TEMPLATE = "filter_period" Тогда 
		ТипПоля = Тип("ПолеВвода");
		Элем = ЭлемФормы.Добавить(ТипПоля, ИмяРеквизита+"_Период", Истина, ОсновнаяПанель);
		Элем.ТипЗначения = Новый ОписаниеТипов("Строка");	
 		Элем.РедактированиеТекста = Ложь;
		Элем.РежимВыбораИзСписка = Истина;

		Элем.СписокВыбора.Добавить("За весь период", "За весь период");	
		Элем.СписокВыбора.Добавить("За последний год", "За последний год");	
		Элем.СписокВыбора.Добавить("За последние полгода", "За последние полгода");	
		Элем.СписокВыбора.Добавить("За последний месяц", "За последний месяц");	
		Элем.СписокВыбора.Добавить("За сегодня", "За сегодня");	
		Элем.СписокВыбора.Добавить("За период", "За период");	
		Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
		УстановитьДействиеНаЭлемент(Элем, "ПриИзменении", "ПериодПриИзменении");
		Элем.Значение = get_prop(ДанныеФильтра.Значения, ИмяРеквизита+"_Период");
		Элем.Верх = Верх;
		Элем.Лево = 110;
		Элем.Высота = 20;
		Элем.Ширина = 150;
		
		Элем = ЭлемФормы.Добавить(Тип("Надпись"), "Надпись" + ИмяРеквизита + "_From", Истина, ОсновнаяПанель);
		Элем.Верх = Верх;
		Элем.Лево = 270;
		Элем.Высота = 20;
		Элем.Ширина = 10;
		Элем.Заголовок = "с";
		Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
		
		ПараметрыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		Элем = ЭлемФормы.Добавить(ТипПоля, ИмяРеквизита+"_From", Истина, ОсновнаяПанель);;
		Элем.ТипЗначения = Новый ОписаниеТипов("Дата",,,,,ПараметрыДаты);	
		Элем.Верх = Верх;
		Элем.Лево = 290;
		Элем.Высота = 20;
		Элем.Ширина = 80;
    	Элем.Значение = get_prop(ДанныеФильтра.Значения, ИмяРеквизита+"_From");
		Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
		
		Элем = ЭлемФормы.Добавить(Тип("Надпись"), "Надпись" + ИмяРеквизита + "_To", Истина, ОсновнаяПанель);
		Элем.Верх = Верх;
		Элем.Лево = 380;
		Элем.Высота = 20;
		Элем.Ширина = 10;
		Элем.Заголовок = "по";
		Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);

		Элем = ЭлемФормы.Добавить(ТипПоля, ИмяРеквизита+"_To", Истина, ОсновнаяПанель);;
		Элем.ТипЗначения = Новый ОписаниеТипов("Дата",,,,,ПараметрыДаты);	
		Элем.Верх = Верх;
		Элем.Лево = 400;
		Элем.Высота = 20;
		Элем.Ширина = 80;
     	Элем.Значение = get_prop(ДанныеФильтра.Значения, ИмяРеквизита+"_To");
		Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
		
	ИначеЕсли TEMPLATE = "filter_enumeration" Тогда 
		ЗаполнитьЭлементФормыПеречисление(Поле, ЭлемФормы, ОсновнаяПанель, Верх, ИмяРеквизита);	
	ИначеЕсли TEMPLATE = "filter_enumeration_with_date" Тогда
	    ЗаполнитьЭлементФормыПеречислениеНаДату(Поле, ЭлемФормы, ОсновнаяПанель, Верх, ИмяРеквизита, ПараметрыДаты);
	ИначеЕсли TEMPLATE = "filter_link" Тогда
		ТипПоля = Тип("ПолеВвода");
		Элем = ЭлемФормы.Добавить(ТипПоля, ИмяРеквизита, Истина, ОсновнаяПанель);
		Элем.ТипЗначения = Новый ОписаниеТипов("Строка");
		Элем.Верх = Верх;
		Элем.Лево = 110;
		Элем.Высота = 20;
		Элем.Ширина = 295;
		Элем.КнопкаОчистки = Истина;
		Элем.КнопкаВыбора = Истина;
		Элем.КнопкаОткрытия = Истина;
		УстановитьДействиеНаЭлемент(Элем, "НачалоВыбора", "ПолеСвязиНачалоВыбора");
		Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
	Иначе  
		Возврат;
	КонецЕсли;
	Верх = Верх + 35;
КонецПроцедуры

Процедура ЗаполнитьЭлементФормыПеречисление(Поле, ЭлемФормы, ОсновнаяПанель, Верх, ИмяРеквизита)
	ТипПоля = Тип("ПолеВвода");
	Элем = ЭлемФормы.Добавить(ТипПоля, ИмяРеквизита, Истина, ОсновнаяПанель);
	Если get_prop(Поле, "MULTI_SELECT", Неопределено) = Истина Тогда
		Элем.ТипЗначения = Новый ОписаниеТипов("СписокЗначений");
	Иначе
		Элем.ТипЗначения = Новый ОписаниеТипов();
	КонецЕсли;
	Элем.Верх = Верх;
	Элем.Лево = 110;
	Элем.Высота = 20;
	Элем.Ширина = 295;
	Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
	Элем.РедактированиеТекста = Ложь;
	Элем.РежимВыбораИзСписка = Истина;
	СписокЗначенийПоля = get_prop(Поле, "ITEMS", Неопределено);
	Для Каждого ЗначениеПоля Из СписокЗначенийПоля Цикл  
		Значение = get_prop(ЗначениеПоля, "VALUE", Неопределено);
		Представление = get_prop(ЗначениеПоля, "TITLE", Неопределено);
		Элем.СписокВыбора.Добавить(Значение, Представление);	
	КонецЦикла;	
	Элем.Значение = get_prop(ДанныеФильтра.Значения, ИмяРеквизита);		
КонецПроцедуры

Процедура ЗаполнитьЭлементФормыПеречислениеНаДату(Поле, ЭлемФормы, ОсновнаяПанель, Верх, ИмяРеквизита, ПараметрыДаты)
	ТипПоля = Тип("ПолеВвода");
	Элем = ЭлемФормы.Добавить(ТипПоля, ИмяРеквизита, Истина, ОсновнаяПанель);
	Элем.ТипЗначения = Новый ОписаниеТипов();
	Элем.Верх = Верх;
	Элем.Лево = 10;
	Элем.Высота = 20;
	Элем.Ширина = 250;
	Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
	Элем.РедактированиеТекста = Ложь;
	Элем.РежимВыбораИзСписка = Истина;
	СписокЗначенийПоля = get_prop(Поле, "ITEMS", Неопределено);
	Для Каждого ЗначениеПоля Из СписокЗначенийПоля Цикл  
		Значение = get_prop(ЗначениеПоля, "VALUE", Неопределено);
		Представление = get_prop(ЗначениеПоля, "TITLE", Неопределено);
		Элем.СписокВыбора.Добавить(Значение, Представление);	
	КонецЦикла;	
	Элем.Значение = get_prop(ДанныеФильтра.Значения, ИмяРеквизита);
	
	Элем = ЭлемФормы.Добавить(ТипПоля, ИмяРеквизита + "_Date", Истина, ОсновнаяПанель);;
	Элем.ТипЗначения = Новый ОписаниеТипов("Дата",,,,,ПараметрыДаты);	
	Элем.Верх = Верх;
	Элем.Лево = 290;
	Элем.Высота = 20;
	Элем.Ширина = 80;
 	Элем.Значение = get_prop(ДанныеФильтра.Значения, ИмяРеквизита + "_Date");
	Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);		
КонецПроцедуры

Процедура ЗаполнитьСвойстваПолеВвода(Элем, Поле)  
	Для Каждого Свойство Из Поле["Properties"] Цикл
		Элем[Свойство.Ключ]	= Свойство.Значение;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьЭлементыФормы()
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемФормы.ПанельПериод.Видимость = Ложь;
	Верх = 5;
	ОсновнаяПанель = ЭлемФормы.ОсновнаяПанель;
	МассивФильтровПериода = Новый Массив;
	МассивФильтровПериода.Добавить("фильтрпериод");
	МассивФильтровПериода.Добавить("фильтрдатанач");
	МассивФильтровПериода.Добавить("фильтрдатакнц");
	Для Каждого Поле Из ДанныеФильтра.ПараметрыОтображения Цикл
	
		TEMPLATE = get_prop(Поле, "TEMPLATE", Неопределено);
		Если TEMPLATE <> Неопределено Тогда  
			ЗаполнитьЭлементыФормыПоВидуФильтра(Поле, ЭлемФормы, ОсновнаяПанель, Верх);
			Продолжить;
		КонецЕсли;
		
		Если МассивФильтровПериода.Найти(Нрег(Поле["Name"])) <> Неопределено Тогда
			Если ЭлемФормы.ПанельПериод.Видимость = Ложь Тогда
				ЭлемФормы.ПанельПериод.Видимость = Истина;
				Верх = Верх + 35;
			КонецЕсли;
			ЭлемФормы[Поле["Name"]].Значение = get_prop(ДанныеФильтра.Значения, Поле["Name"]);
			Продолжить;
		КонецЕсли;	
		Если ВРег(Поле["FieldType"]) = "ПОЛЕСВЯЗИ" Тогда
			ТипПоля = Тип("ПолеВвода");
			
			Элем = ЭлемФормы.Добавить(Тип("Надпись"), "Надпись" + Поле["Name"], Истина, ОсновнаяПанель);
			Элем.Верх = Верх;
			Элем.Лево = 10;
			Элем.Высота = 20;
			Элем.Ширина = 100;
			Элем.Заголовок = Поле["Title"] + ":";
			Элем = ЭлемФормы.Добавить(ТипПоля, Поле["Name"], Истина, ОсновнаяПанель);
			Если Поле["Properties"]["MULTI"] = Истина Тогда
				Элем.ТипЗначения = Новый ОписаниеТипов("СписокЗначений");
			Иначе
				Элем.ТипЗначения = Новый ОписаниеТипов(Поле["ValueType"]);
			КонецЕсли;
			Элем.Верх = Верх;
			Элем.Лево = 110;
			Элем.Высота = 20;
			Элем.Ширина = 395;
			
			Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
			Элем.УстановитьПривязку(ГраницаЭлементаУправления.Право,ОсновнаяПанель,ГраницаЭлементаУправления.Право);
			Верх = Верх + 35;
			
			Элем.КнопкаВыбора = Истина;
			Элем.КнопкаОчистки = Истина;
			УстановитьДействиеНаЭлемент(Элем, "НачалоВыбора", "ПолеСвязиНачалоВыбора");
			Продолжить;
		КонецЕсли;	
	
		ТипПоля = Тип(Поле["FieldType"]);
		Элем = ЭлемФормы.Добавить(Тип("Надпись"), "Надпись" + Поле["Name"], Истина, ОсновнаяПанель);
		Элем.Верх = Верх;
		Элем.Лево = 10;
		Элем.Высота = 20;
		Элем.Ширина = 100;
		Элем.Заголовок = Поле["Title"];
		Элем = ЭлемФормы.Добавить(ТипПоля, Поле["Name"], Истина, ОсновнаяПанель);
		Элем.ТипЗначения = Новый ОписаниеТипов(Поле["ValueType"]);
		Элем.Верх = Верх;
		Элем.Лево = 110;
		Элем.Высота = 20;
		Элем.Ширина = 395;
		ЗаполнитьСвойстваПолеВвода(Элем, Поле);
		Элем.Значение = get_prop(ДанныеФильтра.Значения, Поле["Name"]);
		Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
		Элем.УстановитьПривязку(ГраницаЭлементаУправления.Право,ОсновнаяПанель,ГраницаЭлементаУправления.Право);
		Верх = Верх + 35;
	КонецЦикла;
	
	Дельта = ЭтаФорма.Высота - ЭлемФормы.ОсновнаяПанель.Высота;
	НоваяВысота = Верх + ЭлемФормы.Отобрать.Высота;
	ЭтаФорма.Высота = Макс(94, НоваяВысота + Дельта);
	ЭлемФормы.ОсновнаяПанель.Высота = Макс(92, НоваяВысота);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСпискаЗначений(ВыбранноеЗначение, ИсточникВыбора) 
	ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение.Очистить();
	Для Каждого ЭлементМассива Из ДанныеФильтра.ПараметрыОтображения Цикл 
		ИмяФильтра = get_prop(ЭлементМассива, "Name", get_prop(ЭлементМассива, "NAME"));
		Если ИмяФильтра <> ИсточникВыбора.FILTER_NAME Тогда 
			Продолжить;
		КонецЕсли;			
		Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда 
			ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение.Добавить(ВыбранноеЗначение.Ссылка);
			Продолжить;
		КонецЕсли;	
		Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
			ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение.Добавить(ВыбранныйЭлемент.Ссылка);
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение) = Тип("СписокЗначений") Тогда
		ОбработкаВыбораСпискаЗначений(ВыбранноеЗначение, ИсточникВыбора);
		Возврат;
	КонецЕсли;
	ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение = Неопределено;
	Для Каждого ЭлементМассива Из ДанныеФильтра.ПараметрыОтображения Цикл
		Если ЭлементМассива["Name"] <> ИсточникВыбора.FILTER_NAME Тогда 
			Продолжить;
		КонецЕсли;	
		// Значение выбрано единичное, но если тип - список, то добавляем в него
		Если ЭлементМассива["ValueType"] = "СписокЗначений" Тогда
			ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение.Добавить(ВыбранноеЗначение.Ссылка);
		Иначе
			ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение = ВыбранноеЗначение.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПолеСвязиНачалоВыбораПоВидуФильтра(ЭлементФильтра) 
    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("FILTER_NAME", get_prop(ЭлементФильтра, "NAME"));
	//ПараметрыФормы.Вставить("ВидДанных1С", "");
	//ПараметрыФормы.Вставить("ТипДанных1С", ЭлементФильтра["ValueType"]);
	//ЭлементыСтроки = СтрРазделить82(ЭлементФильтра["ValueType"], ".");
	//Если ЭлементыСтроки.Количество() > 1 Тогда
	//	ПараметрыФормы.Вставить("ВидДанных1С", ЭлементыСтроки[0]);
	//	ПараметрыФормы.Вставить("ТипДанных1С", ЭлементыСтроки[1]);
	//КонецЕсли;
	ПараметрыФормы.Вставить("INI", get_prop(ЭлементФильтра, "ALGORITHM"));
	ПараметрыФормы.Вставить("MULTI", get_prop(ЭлементФильтра, "MULTI_SELECT"));

	Форма = ПолучитьФормуОбработки("ДиалогВыбораИзСписка", ПутьКФормамОбработки(), ПараметрыФормы, ЭтаФорма);
	Форма.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура ПолеСвязиНачалоВыбора(Элемент, СтандартнаяОбработка) Экспорт
	ПолеСвязиНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка);
КонецПроцедуры

