
#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти


Процедура ЗаполнитьЭлементыФормыПоВидуФильтра(Поле, ЭлемФормы, ОсновнаяПанель) 
	TEMPLATE = get_prop(Поле, "TEMPLATE", Неопределено);
	ИмяРеквизита = get_prop(Поле, "NAME", Неопределено);
	Если TEMPLATE = "filter_number" Тогда 
		ЭтаФорма[ИмяРеквизита] = get_prop(ДанныеФильтра.Значения, ИмяРеквизита);
		Элем = ДобавитьЭлементФормы(ИмяРеквизита, Тип("ПолеФормы"), ОсновнаяПанель);
		Элем.Вид = ВидПоляФормы["ПолеВвода"];
		Элем.ПутьКДанным = ИмяРеквизита;
		Элем.КнопкаВыбора = Истина;
		Элем.Заголовок = get_prop(Поле, "TITLE", "");	
	ИначеЕсли TEMPLATE = "filter_string" Тогда 
		ЭтаФорма[ИмяРеквизита] = get_prop(ДанныеФильтра.Значения, ИмяРеквизита);
		Элем = ДобавитьЭлементФормы(ИмяРеквизита, Тип("ПолеФормы"), ОсновнаяПанель);
		Элем.Вид = ВидПоляФормы["ПолеВвода"];
		Элем.ПутьКДанным = ИмяРеквизита;
		Элем.Заголовок = get_prop(Поле, "TITLE", "");	
	ИначеЕсли TEMPLATE = "filter_period" Тогда 
		ГруппаРеквизита = ДобавитьЭлементФормы("Группа"+ИмяРеквизита, Тип("ГруппаФормы"), ОсновнаяПанель);
		ГруппаРеквизита.Вид = ВидГруппыФормы["ОбычнаяГруппа"];
		ГруппаРеквизита.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаРеквизита.Объединенная = Истина; 
		ГруппаРеквизита.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаРеквизита.ОтображатьЗаголовок = Ложь;
		
		Элем = ДобавитьЭлементФормы(ИмяРеквизита+"_Период", Тип("ПолеФормы"), ГруппаРеквизита);
		Элем.Вид = ВидПоляФормы["ПолеВвода"];
		Элем.ПутьКДанным = ИмяРеквизита+"_Период";
		Элем.Заголовок = get_prop(Поле, "TITLE", "");	
        Элем.РедактированиеТекста = Ложь;
		Элем.РежимВыбораИзСписка = Истина;
		Элем.КнопкаВыпадающегоСписка = Истина;
		Элем.СписокВыбора.Добавить("За весь период", "За весь период");	
		Элем.СписокВыбора.Добавить("За последний год", "За последний год");	
		Элем.СписокВыбора.Добавить("За последние полгода", "За последние полгода");	
		Элем.СписокВыбора.Добавить("За последний месяц", "За последний месяц");	
		Элем.СписокВыбора.Добавить("За сегодня", "За сегодня");	
		Элем.СписокВыбора.Добавить("За период", "За период");	
		УстановитьДействиеНаЭлемент(Элем, "ПриИзменении", "ПериодПриИзменении");
		ЭтаФорма[ИмяРеквизита+"_Период"] = get_prop(ДанныеФильтра.Значения, ИмяРеквизита+"_Период");
		
		Элем = ДобавитьЭлементФормы(ИмяРеквизита+"_From", Тип("ПолеФормы"), ГруппаРеквизита);
		Элем.Вид = ВидПоляФормы["ПолеВвода"];
		Элем.ПутьКДанным = ИмяРеквизита+"_From";
		Элем.Заголовок = "с";
		ЭтаФорма[ИмяРеквизита+"_From"] = get_prop(ДанныеФильтра.Значения, ИмяРеквизита + "_From");
	
		Элем = ДобавитьЭлементФормы(ИмяРеквизита+"_To", Тип("ПолеФормы"), ГруппаРеквизита);
		Элем.Вид = ВидПоляФормы["ПолеВвода"];
		Элем.ПутьКДанным = ИмяРеквизита+"_To";
		Элем.Заголовок = "по";
		ЭтаФорма[ИмяРеквизита+"_To"] = get_prop(ДанныеФильтра.Значения, ИмяРеквизита + "_To");
		
	ИначеЕсли TEMPLATE = "filter_enumeration" Тогда
		ЭтаФорма[ИмяРеквизита] = get_prop(ДанныеФильтра.Значения, ИмяРеквизита);
		Элем = ДобавитьЭлементФормы(ИмяРеквизита, Тип("ПолеФормы"), ОсновнаяПанель);
		Элем.Вид = ВидПоляФормы["ПолеВвода"];
		Элем.ПутьКДанным = ИмяРеквизита;
		Элем.Заголовок = get_prop(Поле, "TITLE", "");	
        Элем.РедактированиеТекста = Ложь;
		Элем.РежимВыбораИзСписка = Истина;
		Элем.КнопкаВыпадающегоСписка = Истина;
		СписокЗначенийПоля = get_prop(Поле, "ITEMS", Неопределено);
		Для Каждого ЗначениеПоля Из СписокЗначенийПоля Цикл  
			Значение = get_prop(ЗначениеПоля, "VALUE", Неопределено);
			Представление = get_prop(ЗначениеПоля, "TITLE", Неопределено);
			Элем.СписокВыбора.Добавить(Значение, Представление);	
		КонецЦикла;
	ИначеЕсли TEMPLATE = "filter_enumeration_with_date" Тогда
		ГруппаРеквизита = ДобавитьЭлементФормы("Группа"+ИмяРеквизита, Тип("ГруппаФормы"), ОсновнаяПанель);
		ГруппаРеквизита.Вид = ВидГруппыФормы["ОбычнаяГруппа"];
		ГруппаРеквизита.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаРеквизита.Объединенная = Истина; 
		ГруппаРеквизита.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаРеквизита.ОтображатьЗаголовок = Ложь;
		
		ЭтаФорма[ИмяРеквизита] = get_prop(ДанныеФильтра.Значения, ИмяРеквизита);
		Элем = ДобавитьЭлементФормы(ИмяРеквизита, Тип("ПолеФормы"), ГруппаРеквизита);
		Элем.Вид = ВидПоляФормы["ПолеВвода"];
		Элем.ПутьКДанным = ИмяРеквизита;
		Элем.Заголовок = "";
		Элем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
        Элем.РедактированиеТекста = Ложь;
		Элем.РежимВыбораИзСписка = Истина;
		Элем.КнопкаВыпадающегоСписка = Истина;
		СписокЗначенийПоля = get_prop(Поле, "ITEMS", Неопределено);
		Для Каждого ЗначениеПоля Из СписокЗначенийПоля Цикл  
			Значение = get_prop(ЗначениеПоля, "VALUE", Неопределено);
			Представление = get_prop(ЗначениеПоля, "TITLE", Неопределено);
			Элем.СписокВыбора.Добавить(Значение, Представление);	
		КонецЦикла;
		
		Элем = ДобавитьЭлементФормы(ИмяРеквизита+"_Date", Тип("ПолеФормы"), ГруппаРеквизита);
		Элем.Вид = ВидПоляФормы["ПолеВвода"];
		Элем.ПутьКДанным = ИмяРеквизита+"_Date";
		Элем.Заголовок = "";
		Элем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭтаФорма[ИмяРеквизита+"_Date"] = get_prop(ДанныеФильтра.Значения, ИмяРеквизита + "_Date");
	ИначеЕсли TEMPLATE = "filter_link" Тогда
		ЭтаФорма[ИмяРеквизита] = get_prop(ДанныеФильтра.Значения, ИмяРеквизита);
		Элем = ДобавитьЭлементФормы(ИмяРеквизита, Тип("ПолеФормы"), ОсновнаяПанель);
		Элем.Вид = ВидПоляФормы["ПолеВвода"];
		Элем.ПутьКДанным = ИмяРеквизита;
		Элем.Заголовок = get_prop(Поле, "TITLE", "");
		Элем.КнопкаОчистки = Истина;
		Элем.КнопкаВыбора = Истина;
		Элем.КнопкаОткрытия = Истина;
		УстановитьДействиеНаЭлемент(Элем, "НачалоВыбора", "ПолеСвязиНачалоВыбора");	
	Иначе  
		Возврат;
	КонецЕсли; 			
КонецПроцедуры

Процедура ЗаполнитьЭлементыФормы()
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемФормы.ПанельПериод.Видимость = Ложь;
	ОсновнаяПанель = ЭлемФормы.ОсновнаяПанель;
	СоздатьРеквизитыФормы();
	Для Каждого Поле Из ДанныеФильтра.ПараметрыОтображения Цикл
	
		TEMPLATE = get_prop(Поле, "TEMPLATE", Неопределено);
		Если TEMPLATE <> Неопределено Тогда  
			ЗаполнитьЭлементыФормыПоВидуФильтра(Поле, ЭлемФормы, ОсновнаяПанель);
			Продолжить;
		КонецЕсли;	

		ЭтаФорма[Поле["Name"]] = get_prop(ДанныеФильтра.Значения, Поле["Name"]);
		Если Нрег(Поле["Name"]) = "фильтрпериод" Или Нрег(Поле["Name"]) = "фильтрдатанач" Или Нрег(Поле["Name"]) = "фильтрдатакнц" Тогда
			Если ЭлемФормы.ПанельПериод.Видимость = Ложь Тогда
				ЭлемФормы.ПанельПериод.Видимость = Истина;
			КонецЕсли;
		ИначеЕсли ВРег(Поле["FieldType"]) = "ПОЛЕСВЯЗИ" Тогда
			Элем = ДобавитьЭлементФормы(Поле["Name"], Тип("ПолеФормы"), ОсновнаяПанель);
			Элем.Вид = ВидПоляФормы["ПолеВвода"];
			Элем.ПутьКДанным = Поле["Name"];
			Элем.Заголовок = Поле["Title"];
			Элем.КнопкаОчистки = Истина;
			Элем.КнопкаВыбора = Истина;
			Элем.КнопкаОткрытия = Истина;
			УстановитьДействиеНаЭлемент(Элем, "НачалоВыбора", "ПолеСвязиНачалоВыбора");
		Иначе
			Элем = ЭлемФормы.Добавить(Поле["Name"], Тип("ПолеФормы"), ОсновнаяПанель);
			Элем.Вид = ВидПоляФормы[Поле["FieldType"]];
			Элем.ПутьКДанным = Поле["Name"];
			Элем.Заголовок = Поле["Title"];
			ЗаполнитьСвойстваЭлементаФормы(Элем, Поле["Properties"]);
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

Функция СформироватьИмяМетаданных(Тип, Имя)
	Если Тип = "Документы" Тогда 
		ТипМетаданных = "ДокументСсылка";
	ИначеЕсли Тип = "Справочники" Тогда
		ТипМетаданных = "СправочникСсылка";
	ИначеЕсли Тип = "Перечисления" Тогда
		ТипМетаданных = "ПеречислениеСсылка";
	Иначе
		ТипМетаданных = "";
	КонецЕсли;	
	ИмяТипа = ТипМетаданных + "." + Имя;
	Возврат ИмяТипа;	
КонецФункции

Процедура СоздатьРеквизитыПериода(Поле, Реквизиты)
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	ОписаниеТипаДата = Новый ОписаниеТипов("Дата",,,,, КвалификаторыДаты);	
	ИмяРеквизита = get_prop(Поле, "NAME", Неопределено);
	Если ИмяРеквизита = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ИмяРеквизитаПериод = ИмяРеквизита + "_Период";
	Рек = Новый РеквизитФормы(ИмяРеквизитаПериод, ОписаниеТипаСтрока);
	Реквизиты.Добавить(Рек);
	ИмяРеквизитаНачДата = ИмяРеквизита + "_From";
	Рек = Новый РеквизитФормы(ИмяРеквизитаНачДата, ОписаниеТипаДата);
	Реквизиты.Добавить(Рек);
	ИмяРеквизитаКонДата = ИмяРеквизита + "_To";
	Рек = Новый РеквизитФормы(ИмяРеквизитаКонДата, ОписаниеТипаДата);
	Реквизиты.Добавить(Рек);		
КонецПроцедуры

Процедура СоздатьРеквизитыСсылки(Поле, Реквизиты)
	ИмяРеквизита = get_prop(Поле, "NAME", Неопределено);
	Если ИмяРеквизита = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МножественныйВыбор = get_prop(Поле, "MULTI_SELECT", Неопределено);
	ОписаниеТипа = Новый ОписаниеТипов();
	Если МножественныйВыбор = Истина Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СписокЗначений");
	КонецЕсли;	
	Рек = Новый РеквизитФормы(ИмяРеквизита, ОписаниеТипа);
	Реквизиты.Добавить(Рек);
КонецПроцедуры

Процедура СоздатьРеквизитыПоВидуФильтра(Поле, Реквизиты)
 	КвалификаторыСтроки = Новый КвалификаторыСтроки();
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
	TEMPLATE = get_prop(Поле, "TEMPLATE", Неопределено);
	Если TEMPLATE = "filter_number" Тогда 
		ОписаниеТипа = Новый ОписаниеТипов("Число");
	ИначеЕсли TEMPLATE = "filter_string" Тогда 
		ОписаниеТипа = Новый ОписаниеТипов("Строка");
	ИначеЕсли TEMPLATE = "filter_period" Тогда
		СоздатьРеквизитыПериода(Поле, Реквизиты);
		Возврат;
	ИначеЕсли TEMPLATE = "filter_enumeration" Тогда
		ОписаниеТипа = Новый ОписаниеТипов("Строка");
	ИначеЕсли TEMPLATE = "filter_enumeration_with_date" Тогда
		КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		ОписаниеТипаДата = Новый ОписаниеТипов("Дата",,,,, КвалификаторыДаты);
		ИмяРеквизита = get_prop(Поле, "Name", get_prop(Поле, "NAME"));	
	    Рек = Новый РеквизитФормы(ИмяРеквизита + "_Date", ОписаниеТипаДата,,"");
		Реквизиты.Добавить(Рек);
		ОписаниеТипа = Новый ОписаниеТипов("Строка");
	ИначеЕсли TEMPLATE = "filter_link" Тогда
		СоздатьРеквизитыСсылки(Поле, Реквизиты);
		Возврат;
	ИначеЕсли TEMPLATE = "filter_chips" Тогда
		Возврат;
	Иначе 
		ОписаниеТипа = ОписаниеТипаСтрока;
	КонецЕсли; 
	ИмяРеквизита = get_prop(Поле, "Name", get_prop(Поле, "NAME"));	
    Рек = Новый РеквизитФормы(ИмяРеквизита, ОписаниеТипа);
	Реквизиты.Добавить(Рек);
КонецПроцедуры

Процедура СоздатьРеквизитыФормы()
	Реквизиты = Новый Массив();
	КвалификаторыСтроки = Новый КвалификаторыСтроки();
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
	МассивФильтровПериода = Новый Массив;
	МассивФильтровПериода.Добавить("фильтрпериод");
	МассивФильтровПериода.Добавить("фильтрдатанач");
	МассивФильтровПериода.Добавить("фильтрдатакнц");
	Для Каждого Поле Из ДанныеФильтра.ПараметрыОтображения Цикл
		Если МассивФильтровПериода.Найти(Нрег(Поле["Name"])) <> Неопределено Тогда
		    Продолжить;
		КонецЕсли;
		ОписаниеТипа = ОписаниеТипаСтрока;
		Тип = get_prop(Поле, "ValueType");
		Если Тип = Неопределено Тогда  
			СоздатьРеквизитыПоВидуФильтра(Поле, Реквизиты);
			Продолжить;
		КонецЕсли;	
		Если Тип = "Соответствие" Тогда
			ОписаниеТипа = Новый ОписаниеТипов();
		Иначе
			// Для множественного выбора, перопределяем тип реквизита на форме в список значений
			Если ВРег(Поле["FieldType"]) = "ПОЛЕСВЯЗИ" И Поле["Properties"]["MULTI"] = Истина Тогда
				ОписаниеТипа = Новый ОписаниеТипов("СписокЗначений");
			Иначе
				ОписаниеТипа = Новый ОписаниеТипов(Поле["ValueType"]);
			КонецЕсли;
		КонецЕсли;
		Рек = Новый РеквизитФормы(Поле["Name"], ОписаниеТипа);
		Реквизиты.Добавить(Рек);
	КонецЦикла;
	ИзменитьРеквизиты(Реквизиты);
КонецПроцедуры

Процедура ЗаполнитьСвойстваЭлементаФормы(ЭлементФормы, Свойства)
	
	Для Каждого Свойство Из Свойства Цикл
		Если Свойство.Ключ = "СписокВыбора" Тогда
			Для Каждого ЗначениеСписка Из Свойство.Значение Цикл
				ЭлементФормы[Свойство.Ключ].Добавить(ЗначениеСписка);
			КонецЦикла;
		Иначе
			ЭлементФормы[Свойство.Ключ]	 = Свойство.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ЭтаФорма[ИсточникВыбора.FILTER_NAME].Очистить();
		Для Каждого ЭлементМассива Из ДанныеФильтра.ПараметрыОтображения Цикл
			ИмяФильтра = get_prop(ЭлементМассива, "Name", get_prop(ЭлементМассива, "NAME"));
			Если ИмяФильтра <> ИсточникВыбора.FILTER_NAME Тогда 
				Продолжить;
			КонецЕсли;	
			Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
				ЭтаФорма[ИсточникВыбора.FILTER_NAME].Добавить(ВыбранныйЭлемент.Ссылка);
			КонецЦикла;	
		КонецЦикла;
		Возврат;
	КонецЕсли;
	ЭтаФорма[ИсточникВыбора.FILTER_NAME] = Неопределено;
	Для Каждого ЭлементМассива Из ДанныеФильтра.ПараметрыОтображения Цикл
		ИмяФильтра = get_prop(ЭлементМассива, "Name", get_prop(ЭлементМассива, "NAME"));
		Если ИмяФильтра <> ИсточникВыбора.FILTER_NAME Тогда 
			Продолжить;
		КонецЕсли;	
		// Значение выбрано единичное, но если тип - список, то добавляем в него
		Если ЭлементМассива["ValueType"] = "СписокЗначений" Тогда
			ЭтаФорма[ИсточникВыбора.FILTER_NAME].Добавить(ВыбранноеЗначение.Ссылка);
		Иначе
			ЭтаФорма[ИсточникВыбора.FILTER_NAME] = ВыбранноеЗначение.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолеСвязиНачалоВыбораПоВидуФильтра(ЭлементФильтра) 
    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("FILTER_NAME", get_prop(ЭлементФильтра, "NAME"));
	//ПараметрыФормы.Вставить("ВидДанных1С", "");
	//ПараметрыФормы.Вставить("ТипДанных1С", ЭлементФильтра["ValueType"]);
	//ЭлементыСтроки = СтрРазделить82(ЭлементФильтра["ValueType"], ".");
	//Если ЭлементыСтроки.Количество() > 1 Тогда
	//	ПараметрыФормы.Вставить("ВидДанных1С", ЭлементыСтроки[0]);
	//	ПараметрыФормы.Вставить("ТипДанных1С", ЭлементыСтроки[1]);
	//КонецЕсли;
	ПараметрыФормы.Вставить("INI", get_prop(ЭлементФильтра, "ALGORITHM"));
	ПараметрыФормы.Вставить("MULTI", get_prop(ЭлементФильтра, "MULTI_SELECT"));

	Форма = ПолучитьФормуОбработки("ДиалогВыбораИзСписка", ПутьКФормамОбработки(), ПараметрыФормы, ЭтаФорма);
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПолеСвязиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	ПолеСвязиНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка);
КонецПроцедуры


