
#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти

Процедура ЗаполнитьЭлементыФормы()
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемФормы.ПанельПериод.Видимость = Ложь;
	Верх = 5;
	ОсновнаяПанель = ЭлемФормы.ОсновнаяПанель; 
	Для Каждого Поле Из ДанныеФильтра.ПараметрыОтображения Цикл
		Если Нрег(Поле["Name"]) = "фильтрпериод" Или Нрег(Поле["Name"]) = "фильтрдатанач" Или Нрег(Поле["Name"]) = "фильтрдатакнц" Тогда
			Если ЭлемФормы.ПанельПериод.Видимость = Ложь Тогда
				ЭлемФормы.ПанельПериод.Видимость = Истина;
				Верх = Верх + 35;
			КонецЕсли;
			ЭлемФормы[Поле["Name"]].Значение = get_prop(ДанныеФильтра.Значения, Поле["Name"]);
		ИначеЕсли ВРег(Поле["FieldType"]) = "ПОЛЕСВЯЗИ" Тогда
			ТипПоля = Тип("ПолеВвода");
			
			Элем = ЭлемФормы.Добавить(Тип("Надпись"), "Надпись" + Поле["Name"], Истина, ОсновнаяПанель);
			Элем.Верх = Верх;
			Элем.Лево = 10;
			Элем.Высота = 20;
			Элем.Ширина = 100;
			Элем.Заголовок = Поле["Title"] + ":";
			Элем = ЭлемФормы.Добавить(ТипПоля, Поле["Name"], Истина, ОсновнаяПанель);
			Если Поле["Properties"]["MULTI"] = Истина Тогда
				Элем.ТипЗначения = Новый ОписаниеТипов("СписокЗначений");
			Иначе
				Элем.ТипЗначения = Новый ОписаниеТипов(Поле["ValueType"]);
			КонецЕсли;
			Элем.Верх = Верх;
			Элем.Лево = 110;
			Элем.Высота = 20;
			Элем.Ширина = 395;
			
			Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
			Элем.УстановитьПривязку(ГраницаЭлементаУправления.Право,ОсновнаяПанель,ГраницаЭлементаУправления.Право);
			Верх = Верх + 35;
			
			Элем.КнопкаВыбора = Истина;
			Элем.КнопкаОчистки = Истина;
			УстановитьДействиеНаЭлемент(Элем, "НачалоВыбора", "ПолеСвязиНачалоВыбора");
		Иначе
			ТипПоля = Тип(Поле["FieldType"]);
			Элем = ЭлемФормы.Добавить(Тип("Надпись"), "Надпись" + Поле["Name"], Истина, ОсновнаяПанель);
			Элем.Верх = Верх;
			Элем.Лево = 10;
			Элем.Высота = 20;
			Элем.Ширина = 100;
			Элем.Заголовок = Поле["Title"];
			Элем = ЭлемФормы.Добавить(ТипПоля, Поле["Name"], Истина, ОсновнаяПанель);
			Элем.ТипЗначения = Новый ОписаниеТипов(Поле["ValueType"]);
			Элем.Верх = Верх;
			Элем.Лево = 110;
			Элем.Высота = 20;
			Элем.Ширина = 395;
			Для Каждого Свойство Из Поле["Properties"] Цикл
				Элем[Свойство.Ключ]	= Свойство.Значение;
			КонецЦикла;
			Элем.Значение = get_prop(ДанныеФильтра.Значения, Поле["Name"]);
			Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель,ГраницаЭлементаУправления.Лево);
			Элем.УстановитьПривязку(ГраницаЭлементаУправления.Право,ОсновнаяПанель,ГраницаЭлементаУправления.Право);
			Верх = Верх + 35;
		КонецЕсли;
	КонецЦикла;
	
	Дельта = ЭтаФорма.Высота - ЭлемФормы.ОсновнаяПанель.Высота;
	НоваяВысота = Верх + ЭлемФормы.Отобрать.Высота;
	ЭтаФорма.Высота = Макс(94, НоваяВысота + Дельта);
	ЭлемФормы.ОсновнаяПанель.Высота = Макс(92, НоваяВысота);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение) = Тип("СписокЗначений") Тогда
		ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение.Очистить();
		Для Каждого ЭлементМассива Из ДанныеФильтра.ПараметрыОтображения Цикл
			Если ЭлементМассива["Name"] = ИсточникВыбора.FILTER_NAME Тогда
				Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
					Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
						ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение.Добавить(ВыбранныйЭлемент.Ссылка);
					КонецЦикла;
				Иначе
					ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение.Добавить(ВыбранноеЗначение.Ссылка);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение = Неопределено;
		Для Каждого ЭлементМассива Из ДанныеФильтра.ПараметрыОтображения Цикл
			Если ЭлементМассива["Name"] = ИсточникВыбора.FILTER_NAME Тогда
				// Значение выбрано единичное, но если тип - список, то добавляем в него
				Если ЭлементМассива["ValueType"] = "СписокЗначений" Тогда
					ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение.Добавить(ВыбранноеЗначение.Ссылка);
				Иначе
					ЭтаФорма.ЭлементыФормы[ИсточникВыбора.FILTER_NAME].Значение = ВыбранноеЗначение.Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеСвязиНачалоВыбора(Элемент, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	ИмяФильтра = Элемент.Имя;
	ИмяФильтра = СтрЗаменить(ИмяФильтра, "ЭлементФормы_", "");
	
	Для Каждого ЭлементФильтра Из ДанныеФильтра.ПараметрыОтображения Цикл
		Если ЭлементФильтра["Name"] <> ИмяФильтра Тогда
			Продолжить;
		Конецесли;
		
		СвойстваЭлементаФильтра = ЭлементФильтра["Properties"];
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("FILTER_NAME", ЭлементФильтра["Name"]);
		ПараметрыФормы.Вставить("ВидДанных1С", "");
		ПараметрыФормы.Вставить("ТипДанных1С", ЭлементФильтра["ValueType"]);
		ЭлементыСтроки = СтрРазделить82(ЭлементФильтра["ValueType"], ".");
		Если ЭлементыСтроки.Количество() > 1 Тогда
			ПараметрыФормы.Вставить("ВидДанных1С", ЭлементыСтроки[0]);
			ПараметрыФормы.Вставить("ТипДанных1С", ЭлементыСтроки[1]);
		КонецЕсли;
		ПараметрыФормы.Вставить("INI", СвойстваЭлементаФильтра["INI"] + "_list");
		ПараметрыФормы.Вставить("ENDPOINT", СвойстваЭлементаФильтра["ENDPOINT"]);
		ПараметрыФормы.Вставить("CONST_FILTER", СвойстваЭлементаФильтра["CONST_FILTER"]);
		ПараметрыФормы.Вставить("FILTER", СвойстваЭлементаФильтра["FILTER"]);
		ПараметрыФормы.Вставить("MULTI", СвойстваЭлементаФильтра["MULTI"]);
		
		Форма = ПолучитьФормуОбработки("ДиалогВыбораИзСписка", ПутьКФормамОбработки(), ПараметрыФормы, ЭтаФорма);
		Форма.Открыть();
	КонецЦикла;
КонецПроцедуры

