
&НаКлиенте
Процедура ВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ВложенияСкачать" Тогда
		#Если ВебКлиент Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ИмяФайла",     Элемент.ТекущиеДанные.ФайлИмя);
			ДопПараметры.Вставить("СсылкаНаФайл", Элемент.ТекущиеДанные.ФайлСсылка);
			РасширениеРаботыСФайламиПодключить(ДопПараметры);
		#Иначе
			СохранитьФайлВложения(Элемент.ТекущиеДанные.ФайлИмя, Элемент.ТекущиеДанные.ФайлСсылка);
		#КонецЕсли	
	КонецЕсли;
КонецПроцедуры

#Если ВебКлиент Тогда

&НаКлиенте 
Процедура РасширениеРаботыСФайламиПодключить(ДопПараметры) Экспорт
    НачатьПодключениеРасширенияРаботыСФайлами(
        Новый ОписаниеОповещения(
            "РасширениеРаботыСФайламиПослеПодключения",
            ЭтотОбъект,
            ДопПараметры));
КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСФайламиПослеПодключения(Подключено, ДопПараметры) Экспорт
	// Расширение работы с файлами подключено
	Если Подключено Тогда
		ОбработчикВыборФайлаВложения = SabyОписаниеОповещения("ОбработатьВыборФайлаВложения", ЭтаФорма, ДопПараметры);
		Диалог = ДиалогСохраненияФайла(ДопПараметры.ИмяФайла);
	    Диалог.Показать(ОбработчикВыборФайлаВложения);
		
	// Нужна установка расширения работы с файлами
	Иначе
		НачатьУстановкуРасширенияРаботыСФайлами(
			SabyОписаниеОповещения(
				"РасширениеРаботыСФайламиПодключить",
				ЭтотОбъект,
				ДопПараметры));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайлаВложения(ВыбранныеФайлы, ДопПараметры) Экспорт
    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;
	Для Каждого Файл Из ВыбранныеФайлы Цикл
		ФайлДД = ТранспортИнтеграции.local_helper_download_from_link(context_params, ДопПараметры.СсылкаНаФайл);
		АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ФайлДД, ЭтаФорма.УникальныйИдентификатор);
		ОписаниеПередаваемогоФайла = Новый ОписаниеПередаваемогоФайла(Файл, АдресФайлаВоВременномХранилище);
		
		ПолучаемыеФайлы = Новый Массив;	
		ПолучаемыеФайлы.Добавить(ОписаниеПередаваемогоФайла);
		
		ОповещениеОЗавершении = SabyОписаниеОповещения("ВыполнитьПослеПолученияФайла", ЭтотОбъект);
		НачатьПолучениеФайлов(ОповещениеОЗавершении, ПолучаемыеФайлы,, Ложь);
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПолученияФайла(ВыбранныеФайлы, ДопПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли

