
#Область include_core_base_ПросмотрДокумента_ПанельОперацийОФ
#КонецОбласти

&НаКлиенте
Процедура ОткрытьВSABYНажатие(Элемент)
	
	Если ДокументСБИС <> Неопределено Тогда
		АдресДокумента = ПолучитьПрямуюССылку(ДокументСБИС["СсылкаДляНашаОрганизация"]);
		#Если ТолстыйКлиентОбычноеПриложение Тогда 
// BSLLS:UsingSynchronousCalls-off
// Продолженное сонаром НачатьЗапускПриложения нам не подходит
 			ЗапуститьПриложение(АдресДокумента); 
// BSLLS:UsingSynchronousCalls-on
		#Иначе	
			ПерейтиПоНавигационнойСсылке(АдресДокумента);	
		#КонецЕсли		
	КонецЕсли
КонецПроцедуры

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщиеОФ
#КонецОбласти

Процедура ПоказатьМенюВыгрузитьВ1С(СписокЗначений)
	ЗначениеВыбора = ВыбратьИзМеню(СписокЗначений,КнопкаВыгрузитьВ1С());
	МенюВыгрузитьВ1СОбработкаОповещения(ЗначениеВыбора, Неопределено);
КонецПроцедуры

&НаКлиенте
Функция ТекущийДокументИС() 
	Возврат Документ1С;
КонецФункции

Процедура ПолучитьИмяФормы()
	ЭтаФорма.ИмяФормы = "ПросмотрДокумента";
КонецПроцедуры

