
#Область include_core_base_ПросмотрДокумента_ПанельОперацийОФ
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщиеОФ
#КонецОбласти

Процедура ПоказатьМенюВыгрузитьВ1С(СписокЗначений)
	ЗначениеВыбора = ВыбратьИзМеню(СписокЗначений,КнопкаВыгрузитьВ1С());
	МенюВыгрузитьВ1СОбработкаОповещения(ЗначениеВыбора, Неопределено);
КонецПроцедуры

&НаКлиенте
Функция ТекущийДокументИС() 
	Возврат Документ1С;
КонецФункции

Процедура ПолучитьИмяФормы()
	ЭтаФорма.ИмяФормы = "ПросмотрДокумента";
КонецПроцедуры

