
&НаКлиенте
Процедура ОткрытьПоказатьЗначение(Значение)
	// BSLLS:UsingSynchronousCalls-off
	ОткрытьЗначение(Значение);
	// BSLLS:UsingSynchronousCalls-on 
КонецПроцедуры

#Область include_core_base_ПросмотрДокумента_ПанельОперацийОФ
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщиеОФ
#КонецОбласти

Процедура ПоказатьМенюВыгрузитьВ1С(СписокЗначений)
	ЗначениеВыбора = ВыбратьИзМеню(СписокЗначений,КнопкаВыгрузитьВ1С());
	МенюВыгрузитьВ1СОбработкаОповещения(ЗначениеВыбора, Неопределено);
КонецПроцедуры

&НаКлиенте
Функция ТекущийДокументИС() 
	Возврат Документ1С;
КонецФункции

Процедура УстановитьРеквизитИмяФормы()
	ЭтаФорма.ИмяФормы = "ПросмотрДокумента";
КонецПроцедуры

