
#Область include_core_base_ПросмотрДокумента_ПанельОперацийОФ
#КонецОбласти

&НаКлиенте
Процедура ОткрытьВSABYНажатие(Элемент)
	Если ДокументСБИС <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Заголовок, АдресСтраницы",
			ДокументСБИС["Название"],
			ПолучитьПрямуюССылку(ДокументСБИС["СсылкаДляНашаОрганизация"]));
		Уникальность = Новый УникальныйИдентификатор(ДокументСБИС["Идентификатор"]);
		ОткрытьФормуОбработки("Browser", ПараметрыФормы, ЭтаФорма, Уникальность);	
	КонецЕсли
КонецПроцедуры

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщиеОФ
#КонецОбласти

Процедура ПоказатьМенюВыгрузитьВ1С(СписокЗначений)
	ЗначениеВыбора = ВыбратьИзМеню(СписокЗначений,КнопкаВыгрузитьВ1С());
	МенюВыгрузитьВ1СОбработкаОповещения(ЗначениеВыбора, Неопределено);
КонецПроцедуры

&НаКлиенте
Функция ТекущийДокументИС() 
	Возврат Документ1С;
КонецФункции

