
#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСерверСКлиента
#КонецОбласти

#Область include_core_base_ПросмотрДокумента_ПанельОперацийУФ
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСоСтроками
#КонецОбласти

&НаКлиенте
Процедура ОткрытьВSABYНажатие(Элемент)
	Если ДокументСБИС <> Неопределено Тогда
		АдресДокумента = ПолучитьПрямуюССылку(ДокументСБИС["СсылкаДляНашаОрганизация"]);
		#Если ТолстыйКлиентОбычноеПриложение Тогда 
		ЗапуститьПриложение(АдресДокумента); 
		#Иначе	
		ПерейтиПоНавигационнойСсылке(АдресДокумента);	
		#КонецЕсли
	КонецЕсли
КонецПроцедуры

#Область include_core_base_ExtException
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_ОберткаСерверныхКоманд
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОсобенностиПродукта
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщие
#КонецОбласти

&НаКлиенте
Процедура ПоказатьМенюВыгрузитьВ1С(СписокКнопок)
    ОписаниеОповещения = Новый ОписаниеОповещения("МенюВыгрузитьВ1СОбработкаОповещения", ЭтаФорма);
    ПоказатьВыборИзМеню(ОписаниеОповещения, СписокКнопок, КнопкаВыгрузитьВ1С());
КонецПроцедуры

&НаКлиенте
Функция ТекущийДокументИС()
	Возврат Документ1С;
КонецФункции

Процедура ПолучитьИмяФормы()
	// Заглушка
КонецПроцедуры

