
&НаКлиенте
Процедура ОткрытьПоказатьЗначение(Значение)
	// BSLLS:UsingSynchronousCalls-off
	ОткрытьЗначение(Значение);
	// BSLLS:UsingSynchronousCalls-on 
КонецПроцедуры

// TODO DEL 4200
#Область ГрадусникЗаглушкаОФ

Функция КомпонентГрадусник_Очистить(градусник)                                       
	// TODO Заглушка
	Возврат Неопределено;	
КонецФункции

Функция НовыйКомпонентГрадусник(ЦепочкаДокументов, ИмяНаФорме)
	// TODO Заглушка
	Возврат Неопределено; 
КонецФункции

Функция КомпонентГрадусник_СформироватьИнтерфейс(градусник, Форма, Родитель, ЭлементПеред)
	// TODO Заглушка
	Возврат Неопределено; 
КонецФункции

#КонецОбласти

#Область include_core_base_ПросмотрДокумента_ПанельОперацийОФ
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщиеОФ
#КонецОбласти

Процедура ПоказатьМенюВыгрузитьВ1С(СписокЗначений)
	ЗначениеВыбора = ВыбратьИзМеню(СписокЗначений,КнопкаВыгрузитьВ1С());
	МенюВыгрузитьВ1СОбработкаОповещения(ЗначениеВыбора, Неопределено);
КонецПроцедуры

&НаКлиенте
Функция ТекущийДокументИС() 
	Возврат Документ1С;
КонецФункции

Процедура УстановитьРеквизитИмяФормы()
	ЭтаФорма.ИмяФормы = "ПросмотрДокумента";
КонецПроцедуры

