Процедура ОбновитьПанельОпераций(ИмяПанели, КомандыПанели) Экспорт
    ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемПанельОпераций = ЭлемФормы[ИмяПанели];
	Лево = 1;
	
	ДобавитьКомандыНаПанельОпераций(ЭлемПанельОпераций, КомандыПанели, Лево);
	
	СтараяШирина = ЭлемПанельОпераций.Ширина;
	ЭлемПанельОпераций.Ширина = Лево;
	ЭлемПанельОпераций.Лево = ЭлемПанельОпераций.Лево + СтараяШирина - Лево;
КонецПроцедуры

#Область include_core_base_ГлавноеОкно_ДобавлениеКомандНаПанельОперацийОФ
#КонецОбласти

