
// BSLLS:FunctionOutParameter-off
// Нормальено поведение когда часть значений передается через параметры, так даже 1с делает
// BSLLS:CognitiveComplexity-off
// Нет необходимости разделять процедуру

&НаКлиенте
Функция ПредставлениеДополнительногоПоля(ДополнительноПоле, СчетЭлементов, КолвоЭлементовВСтроке)
	СимволовОтрезать = 2;
	ЗначениеПоля = "";
	ЗначениеПолей = "";
	
	Если ТипЗнч(ДополнительноПоле.Значение) = Тип("Массив") Тогда
		// Сейчас подразумевается, что в массиве может быть только элементы стправочника сотрудники
		ЗначениеПоля = СокрЛП(ДополнительноПоле.Ключ) + ": " + Символы.ВК;
		Для каждого ЭлементСправочника Из ДополнительноПоле.Значение Цикл
			СчетЭлементов = СчетЭлементов + 1;
			Если ТипЗнч(ЭлементСправочника) = Тип("Структура") Или ТипЗнч(ЭлементСправочника) = Тип("Соответствие") Тогда
				Если СчетЭлементов = КолвоЭлементовВСтроке Тогда
					ЗначениеПоля = 	ЗначениеПоля + Символы.ВК;
					СчетЭлементов = 0;
				КонецЕсли;
				ЗначениеПоля = ЗначениеПоля
				+ get_prop(ЭлементСправочника, "Фамилия", "") + " "
				+ get_prop(ЭлементСправочника, "Имя", "") + " "
				+ get_prop(ЭлементСправочника, "Отчество", "") + " "
				+ ";"  + Символы.ВК;
			Иначе
				ЗначениеПоля = ЗначениеПоля + ЭлементСправочника + ";"  + Символы.ВК;
			КонецЕсли;
		КонецЦикла;
		ЗначениеПоля = Лев(ЗначениеПоля, СтрДлина(ЗначениеПоля) - СимволовОтрезать);
	ИначеЕсли ТипЗнч(ДополнительноПоле.Значение) = Тип("Соответствие") Тогда
		Для Каждого ПолеЭлементМассиваВложенное Из ДополнительноПоле.Значение Цикл
			ЗначениеПоля =  ПредставлениеДополнительногоПоля(ПолеЭлементМассиваВложенное, СчетЭлементов, КолвоЭлементовВСтроке); 	
			ЗначениеПолей = ЗначениеПолей + ЗначениеПоля;
		КонецЦикла;
		Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
			ЗначениеПоля = СокрЛП(ДополнительноПоле.Ключ) + ": " + ЗначениеПоля;
		КонецЕсли;
	Иначе
		СчетЭлементов = СчетЭлементов + 1;
		Если СчетЭлементов = КолвоЭлементовВСтроке Тогда
			ЗначениеПоля = 	ЗначениеПоля + Символы.ВК;
			СчетЭлементов = 0;
		КонецЕсли;
		ЗначениеПоля = 	ЗначениеПоля + СокрЛП(ДополнительноПоле.Ключ) + ": " + СокрЛП(ДополнительноПоле.Значение) + ", ";
	КонецЕсли;
	
	Возврат ЗначениеПоля;
КонецФункции
// BSLLS:FunctionOutParameter-on
// BSLLS:CognitiveComplexity-on
