
&НаКлиенте
Функция ОтступПредставления( Знач Уровень = 0)
	ОтступСтрокой = "";
// BSLLS:UnusedLocalVariable-off
	Для СчетчикУровня = 0 По Уровень - 1 Цикл
		ОтступСтрокой = ОтступСтрокой + "  ";
	КонецЦикла;
// BSLLS:UnusedLocalVariable-on	
	Возврат ОтступСтрокой;
КонецФункции

// BSLLS:FunctionOutParameter-off
// Нормальено поведение когда часть значений передается через параметры, так даже 1с делает
// BSLLS:CognitiveComplexity-off
// Нет необходимости разделять процедуру

&НаКлиенте
Функция ПредставлениеДополнительногоПоля(ДополнительноеПоле,  Знач Уровень = 0)
	// BSLLS:Typo-off
	// Адекватное имя переменной
	КолвоЭлементовВСтроке = 4;
	// BSLLS:Typo-on 
	
	СимволовОтрезать = 2;
	ЗначениеПоля = "";
	ЗначениеПолей = "";
	
	ОтступГруппы = ОтступПредставления(Уровень - 1);
	ОтступПолей = ОтступПредставления(Уровень);
	Если ТипЗнч(ДополнительноеПоле.Значение) = Тип("Массив") Тогда
		// Сейчас подразумевается, что в массиве может быть только элементы стправочника сотрудники
		ЗначениеПоля = СокрЛП(ДополнительноеПоле.Ключ) + ": ";
		
		Для каждого ЭлементМассива Из ДополнительноеПоле.Значение Цикл
			Если ТипЗнч(ЭлементМассива) = Тип("Структура") Или ТипЗнч(ЭлементМассива) = Тип("Соответствие") Тогда
				Для каждого ЗначениеЭлементаСтруктуры Из ЭлементМассива Цикл
					ЗначениеПоля = ЗначениеПоля + ПредставлениеДополнительногоПоля(ЗначениеЭлементаСтруктуры,  Уровень);
				КонецЦикла;
			Иначе
				ЗначениеПоля = ЗначениеПоля + ЭлементМассива + ";";
			КонецЕсли;
		КонецЦикла;
		
		Возврат ЗначениеПоля;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительноеПоле.Значение) = Тип("Соответствие") Тогда
		Уровень = Уровень + 1;
		ДопПоляЗначения = ОбработатьМассивДопПолей(ДополнительноеПоле.Значение, ДопПоляЗначения, Уровень);
		ЗначениеПоля = ОтступГруппы + ДополнительноеПоле.Ключ + ":" + Символы.ВК;
		ЗначениеПоля = ЗначениеПоля 
			+ ОтступПолей + Saby_СтрСоединить82(ДопПоляЗначения, "; ");
		Уровень = Уровень - 1;
	Иначе
		ЗначениеПоля = 	СокрЛП(ДополнительноеПоле.Ключ) 
			+ ": "  + СокрЛП(ДополнительноеПоле.Значение) + ", ";
	КонецЕсли;
	
	Возврат ЗначениеПоля;
КонецФункции
// BSLLS:FunctionOutParameter-on
// BSLLS:CognitiveComplexity-on
