
&НаСервере
Процедура УстановитьЛокализацию()
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	
	ЭлементыФормочки.ДействиеВСБИС.Заголовок = "Выполнить в "+ЛокализацияНазваниеПродукта();
	ЭтаФорма.Команды.КомандаДействиеВСБИС.Подсказка = "Движение по регламенту в "+ЛокализацияНазваниеПродукта();
	
	ЭлементыФормочки.ОбновитьВСБИС.Заголовок = "Обновить в "+ЛокализацияНазваниеПродукта();
	ЭтаФорма.Команды.ЗагрузитьВложения.Подсказка = "Обновить реквизиты документа в "+ЛокализацияНазваниеПродукта();

	ЭлементыФормочки.ОткрытьВСБИС.Заголовок = "Открыть в "+ЛокализацияНазваниеПродукта();
	ЭтаФорма.Команды.ОткрытьВСБИС.Подсказка = "Открыть в "+ЛокализацияНазваниеПродукта();
КонецПроцедуры

