
&НаКлиенте
Процедура ДобавитьВложениеИзПрикреплёныхФайловВладельца(ВладелецФайла)
	
	ЕстьСотрудники = ЕстьМетаданные("Справочники", "Сотрудники");
	Если ЕстьСотрудники И ТипЗнч(ВладелецФайла) = Тип("СправочникСсылка.Сотрудники") Тогда
		ВладелецФайла = ФизЛицоСотрудника(ВладелецФайла);		
	КонецЕсли;
	Если ВладелецФайла = Неопределено Тогда
		Возврат;
	КонецЕСли;
	
	ИмяФормыВыбораФайла = ИмяФормыВыбораФайла(ВладелецФайла);
	Если НЕ ЗначениеЗаполнено(ИмяФормыВыбораФайла) Тогда
		Возврат;
	КонецЕсли;
			
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла",      ВладелецФайла);
	ПараметрыФормы.Вставить("ТолькоПросмотр",     Истина);
	ПараметрыФормы.Вставить("РежимВыбора",        Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);

	ОповещениеЗавершения =  SabyОписаниеОповещения("ОбработкаВыбораВложения", ЭтаФорма);
	ОткрытьФорму(ИмяФормыВыбораФайла,
         ПараметрыФормы,
         ЭтаФорма,
         Новый УникальныйИдентификатор,
		 ,
		 ,
		 ОповещениеЗавершения,
		 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ИмяФормыВыбораФайла(Знач ВладелецФайла)
	
	Попытка
		ПрефиксИмен = ПрефиксПродукта();
	Исключение
		ПрефиксИмен = "";
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ПрефиксИмен) Тогда
		Попытка
			ТипВладельца = ТипЗнч(ВладелецФайла);
			ИмяСправочника = Метаданные.НайтиПоТипу(ТипВладельца).Имя + "ПрисоединенныеФайлы";
			// Проверим все условия для своей обработки
			Если НЕ (
				  Найти(ИмяСправочника, ПрефиксИмен) = 1 // Префикс имен расширения в начале имени справочника
				И Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено // Есть такой справочник
				И Метаданные.Обработки.Найти(ПрефиксИмен + "РаботаСФайлами") <> Неопределено // Есть такая обработка
			) Тогда
				
				ПрефиксИмен = ""; // Сбросим префикс и будет стандартная обработка работы с файлами
			КонецЕсли;
		Исключение
			ПрефиксИмен = "";
		КонецПопытки;
	КонецЕсли;
	
	Если Метаданные.Обработки.Найти(ПрефиксИмен + "РаботаСФайлами") <> Неопределено Тогда // Есть такая обработка
		Возврат "Обработка." + ПрефиксИмен + "РаботаСФайлами.Форма.ПрисоединенныеФайлы";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

