
&НаСервере
Процедура УбратьДублиСотрудников()
	ВрТаблица = СписокИсполнителей.Выгрузить();
	ВрТаблица.Свернуть("Сотрудник, Роль, ТабельныйНомер, ЭлПочта, МобильныйТелефон");
	// Для Каждого Стр Из ВрТаблица Цикл
		// ПараметрыОтбора = Новый Структура();
		// ПараметрыОтбора.Вставить("Сотрудник", Стр.Сотрудник);
		// ПараметрыОтбора.Вставить("Роль", Стр.Роль);
		// ПараметрыОтбора.Вставить("ТабельныйНомер", Стр.ТабельныйНомер);
		// НашлиСтроки = СписокИсполнителей.НайтиСтроки(ПараметрыОтбора);
	// КонецЦикла;
	СписокИсполнителей.Загрузить(ВрТаблица);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораСотрудника(Значение, ДопПараметры) Экспорт
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Для Каждого НовыйСотрудник Из Значение Цикл
			НоваяСтрока = СписокИсполнителей.Добавить();
			НоваяСтрока.Сотрудник = get_prop(НовыйСотрудник, "Сотрудник", get_prop(НовыйСотрудник, "Наименование"));
			НоваяСтрока.Роль = "Сотрудник";
			НоваяСтрока.ТабельныйНомер = get_prop(НовыйСотрудник, "ТабельныйНомер");
			НоваяСтрока.ЭлПочта = get_prop(НовыйСотрудник, "ЭлПочта");
			НоваяСтрока.МобильныйТелефон = get_prop(НовыйСотрудник, "МобильныйТелефон");
		КонецЦикла;
	ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда
		НоваяСтрока = СписокИсполнителей.Добавить();
		НоваяСтрока.Сотрудник = get_prop(Значение, "Сотрудник", get_prop(Значение, "Наименование"));;
		НоваяСтрока.Роль = "Сотрудник"; 
		НоваяСтрока.ТабельныйНомер = get_prop(Значение, "ТабельныйНомер");
		НоваяСтрока.ЭлПочта = get_prop(Значение, "ЭлПочта");
		НоваяСтрока.МобильныйТелефон = get_prop(Значение, "МобильныйТелефон");
	Иначе
		Возврат;
    КонецЕсли;
    УбратьДублиСотрудников();
КонецПроцедуры

