
&НаСервере
Процедура УбратьДублиСотрудников()
	ВрТаблица = СписокИсполнителей.Выгрузить();
	ВрТаблица.Свернуть("Сотрудник, Роль, ТабельныйНомер, ЭлПочта, МобильныйТелефон");
	// Для Каждого Стр Из ВрТаблица Цикл
		// ПараметрыОтбора = Новый Структура();
		// ПараметрыОтбора.Вставить("Сотрудник", Стр.Сотрудник);
		// ПараметрыОтбора.Вставить("Роль", Стр.Роль);
		// ПараметрыОтбора.Вставить("ТабельныйНомер", Стр.ТабельныйНомер);
		// НашлиСтроки = СписокИсполнителей.НайтиСтроки(ПараметрыОтбора);
	// КонецЦикла;
	СписокИсполнителей.Загрузить(ВрТаблица);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораСотрудника(Значение, ДопПараметры) Экспорт
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Для Каждого НовыйСотрудник Из Значение Цикл
			НоваяСтрока = СписокИсполнителей.Добавить();
			НоваяСтрока.Сотрудник = НовыйСотрудник.Сотрудник;
			НоваяСтрока.Роль = "Сотрудник";
			НоваяСтрока.ТабельныйНомер = НовыйСотрудник.ТабельныйНомер;
			НоваяСтрока.ЭлПочта = НовыйСотрудник.ЭлПочта;
			НоваяСтрока.МобильныйТелефон = НовыйСотрудник.МобильныйТелефон;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда
		НоваяСтрока = СписокИсполнителей.Добавить();
		НоваяСтрока.Сотрудник = Значение.Сотрудник;
		НоваяСтрока.Роль = "Сотрудник"; 
		НоваяСтрока.ТабельныйНомер = Значение.ТабельныйНомер;
		НоваяСтрока.ЭлПочта = Значение.ЭлПочта;
		НоваяСтрока.МобильныйТелефон = Значение.МобильныйТелефон;
	Иначе
		Возврат;
    КонецЕсли;
    УбратьДублиСотрудников();
КонецПроцедуры

