
#Область include_core_base_ЭДО_РаботаСТаблицейИсполнителейОсобенностиПриложения
#КонецОбласти

&НаКлиенте
Процедура ДобавитьСотрудника(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораСотрудника", ЭтаФорма, "ПодборСотрудников");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ВидДанных1С", "Справочник");
	ПараметрыФормы.Вставить("ТипДанных1С", "Сотрудники");
	ПараметрыФормы.Вставить("INI", "Сотрудники" + "_list"); // INI (Строка) - имя списочной инишки
	ПараметрыФормы.Вставить("MULTI", Истина); // MULTI (Булево) - выбирать одну или несколько записей
	
	ОткрытьФормуОбработки("ДиалогВыбораИзСписка", ПараметрыФормы, ЭтаФорма,, ОбработкаВыбора);
КонецПроцедуры

&НаКлиенте
Процедура СписокИсполнителейСотрудникПриИзменении(Элемент)
	УбратьДублиСотрудников();
КонецПроцедуры

