
#Область include_core_base_ЭДО_РаботаСТаблицейИсполнителейОсобенностиПриложения
#КонецОбласти

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораСотрудника(Значение, ДопПараметры) Экспорт
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Для Каждого НовыйСотрудник Из Значение Цикл
			НоваяСтрока = СписокИсполнителей.Добавить();
			НоваяСтрока.Сотрудник = НовыйСотрудник.Сотрудник;
			НоваяСтрока.Роль = "Сотрудник";
		КонецЦикла;
	ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда
		НоваяСтрока = СписокИсполнителей.Добавить();
		НоваяСтрока.Сотрудник = Значение.Сотрудник;
		НоваяСтрока.Роль = "Сотрудник";
    КонецЕсли;
    УбратьДублиСотрудников();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСотрудника(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораСотрудника", ЭтаФорма, "ПодборСотрудников");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ВидДанных1С", "Справочник");
	ПараметрыФормы.Вставить("ТипДанных1С", "Сотрудники");
	ПараметрыФормы.Вставить("INI", "Сотрудники" + "_list"); // INI (Строка) - имя списочной инишки
	ПараметрыФормы.Вставить("MULTI", Истина); // MULTI (Булево) - выбирать одну или несколько записей
	
	ОткрытьФормуОбработки("ДиалогВыбораИзСписка", ПараметрыФормы, ЭтаФорма,, ОбработкаВыбора);
КонецПроцедуры

&НаКлиенте
Процедура СписокИсполнителейСотрудникПриИзменении(Элемент)
	УбратьДублиСотрудников();
КонецПроцедуры

