
&НаСервере
Процедура УбратьДублиСотрудников()
	ВрТаблица = СписокИсполнителей.Скопировать(, "Сотрудник, Роль, ТабельныйНомер");
	ВрТаблица.Свернуть("Сотрудник, Роль, ТабельныйНомер");
	СписокИсполнителей = ВрТаблица.Скопировать();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораСотрудника(Значение, ДопПараметры) Экспорт
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Для Каждого НовыйСотрудник Из Значение Цикл
			НоваяСтрока = СписокИсполнителей.Добавить();
			НоваяСтрока.Сотрудник = НовыйСотрудник.Сотрудник;
			НоваяСтрока.Роль = "Сотрудник";
			НоваяСтрока.ТабельныйНомер = НовыйСотрудник.ТабельныйНомер;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда
		НоваяСтрока = СписокИсполнителей.Добавить();
		НоваяСтрока.Сотрудник = Значение.Сотрудник;
		НоваяСтрока.Роль = "Сотрудник";
		НоваяСтрока.ТабельныйНомер = НовыйСотрудник.ТабельныйНомер;
    КонецЕсли;
    УбратьДублиСотрудников();
КонецПроцедуры

