
&НаКлиенте
Процедура ДобавитьВложениеСДиска(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = НСтр("ru=’Любой файл (*.*)|*.*'");
	Диалог.Заголовок = НСтр("ru=’Выберите файл'");
	Диалог.МножественныйВыбор = Истина;
	ОбработкаОкончанияЗагрузки = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма, Диалог);
	НачатьПомещениеФайлов(ОбработкаОкончанияЗагрузки,, Диалог, Истина);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВложениеИзТаблицы(ИмяТаблицы, ДанныеУдаления)
	ОтборСтрок = Новый Структура("ТипВложения, Представление, ПолноеИмяФайла",
		"ФайлСДиска",
		ДанныеУдаления.Представление,
		ДанныеУдаления.ПолноеИмяФайла);
	мСтрокКУдалению = ЭтаФорма[ИмяТаблицы].НайтиСтроки(ОтборСтрок);
	Если мСтрокКУдалению.Количество() > 0 Тогда
		//удаляем обратным перебором, т.к. индекс строк меняется
		ВсегоСтрок = мСтрокКУдалению.Количество() - 1;
		Для СчетСтрок = 0 По ВсегоСтрок Цикл
			СтрокаКУдалению = мСтрокКУдалению[ВсегоСтрок - СчетСтрок];
			ЭтаФорма[ИмяТаблицы].Удалить(СтрокаКУдалению);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	
