
&НаКлиенте
Процедура ЗагрузитьСопоставленияНажатие(Элемент)
	
	ИмяОбработки = ПутьОбработкиДляВыполненияФоновогоЗадания();
	ПараметрыДлительныеОперации = Новый Структура;
	Если ТипЗнч(ИмяОбработки) = Тип("Строка") Тогда
		ПараметрыДлительныеОперации.Вставить("ИмяОбработки",					ИмяОбработки); 
	Иначе     
		ПараметрыДлительныеОперации.Вставить("ДополнительнаяОбработкаСсылка",	ИмяОбработки); 	
	КонецЕсли;

	ПараметрыДлительныеОперации.Вставить("ИмяМетода",			"ЗагрузитьСопоставленияНаСервере");
	ПараметрыДлительныеОперации.Вставить("ПараметрыВыполнения",	Неопределено);
	ПараметрыДлительныеОперации.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка());

	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ПараметрыДлительныеОперации);   
	ПараметрыЗадания.Добавить("");   
	ЗаголовокФормы = "Загрузка сопоставлений";
	ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено;//Новый ОписаниеОповещения("ПослеВыполненияАлгоритма", ЭтотОбъект);
	
	МодульФоновогоЗаданияКлиент().ОткрытьФормуДлительнойОперации(ВыполняемыйМетод, ПараметрыЗадания, ЗаголовокФормы, Неопределено, ОповещениеОЗакрытииФормыФоновогоЗадания); 
КонецПроцедуры

