
&НаКлиенте
Процедура ЗапускФоновогоОбмена(ИмяМетода, ДополнительныеПараметры, ЗаголовокФормы, ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено)
	
	ИмяОбработки = ПутьОбработкиДляВыполненияФоновогоЗадания();
	ПараметрыДлительныеОперации = Новый Структура;
	Если ТипЗнч(ИмяОбработки) = Тип("Строка") Тогда
		ПараметрыДлительныеОперации.Вставить("ИмяОбработки",					ИмяОбработки); 
	Иначе     
		ПараметрыДлительныеОперации.Вставить("ДополнительнаяОбработкаСсылка",	ИмяОбработки); 	
	КонецЕсли;
	ПараметрыДлительныеОперации.Вставить("НазваниеОперации", ЗаголовокФормы);

	ПараметрыДлительныеОперации.Вставить("ИмяМетода",			ИмяМетода);
	ПараметрыДлительныеОперации.Вставить("ПараметрыВыполнения",	ДополнительныеПараметры);
	ПараметрыДлительныеОперации.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка());
	ИмяМодуляДлительныеОперации = ИмяМодуляДлительныеОперации();
	Если ИмяМодуляДлительныеОперации = Неопределено Тогда
		ВызватьИсключение "Отсутствует модуль для запуска длительной операции (Saby)";
	КонецЕсли;
	ВыполняемыйМетод = ИмяМодуляДлительныеОперации + ".ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ПараметрыДлительныеОперации);   
	ПараметрыЗадания.Добавить("");   
		
	МодульФоновогоЗаданияКлиент().ОткрытьФормуДлительнойОперации(ВыполняемыйМетод, ПараметрыЗадания, ЗаголовокФормы, Неопределено, ОповещениеОЗакрытииФормыФоновогоЗадания); 
КонецПроцедуры
