
&НаСервере
Функция ЗагрузитьСопоставленияНаСервере(Параметры, АдресРезультата = Неопределено) Экспорт
	//Дополнительная первоначальная ручная инициализация элементов справочника
	connection_info = Неопределено;
	//Дополнительная первоначальная ручная инициализация элементов справочника
	СообщитьПрогрессОперации(,"Инициализация подключения", Новый Структура("Прогресс", 0));
	context_param = НастройкиПодключенияПрочитать();

	Результат = Новый Структура();
	Результат.Вставить("Result", Новый Структура);
	Попытка
		system_info = API_ADDON_READSYSTEMINFO(Неопределено);
		system_info.Вставить("ConnectionStateEvents", Новый Массив);
		system_info["ConnectionStateEvents"].Добавить("NewSystem");
		connection_info = local_helper_init_connection(context_param, system_info);
		
		СообщитьПрогрессОперации(,"Синхронизация объектов", Новый Структура("Прогресс", 0));
		ЗагрузитьПредопределенныеОбъекты(connection_info);
		Результат.Вставить("Status", "complete");
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		Результат.Вставить("Status", "error");
		Результат.Result.Вставить("message", СтруктураОшибки.detail);
	КонецПопытки;
	Возврат Результат;
КонецФункции

