
&НаКлиенте
Процедура ЗагрузитьСопоставленияНажатие(Элемент)
	
	ЭтоВнешняяОбработка = ЭтоВнешняяОбработка();
	Если ЭтоВнешняяОбработка Тогда
		ИмяОбработки = ИмяФайлаОбработки();
	Иначе
		ИмяОбработки = ИмяОбработки();
	КонецЕсли;	
	
	ПараметрыДлительныеОперации = Новый Структура;
	ПараметрыДлительныеОперации.Вставить("ИмяОбработки",		ИмяОбработки);
	ПараметрыДлительныеОперации.Вставить("ИмяМетода",			"ЗагрузитьСопоставленияНаСервере");
	ПараметрыДлительныеОперации.Вставить("ПараметрыВыполнения",	Неопределено);
	ПараметрыДлительныеОперации.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка());

	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ПараметрыДлительныеОперации);   
	ПараметрыЗадания.Добавить("");   
	ЗаголовокФормы = "Загрузка сопоставлений";
	_МодульФоновогоЗадания = МодульФоновогоЗаданияКлиент();
	ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено;//Новый ОписаниеОповещения("ПослеВыполненияАлгоритма", ЭтотОбъект);
	
	МодульФоновогоЗаданияКлиент().ОткрытьФормуДлительнойОперации(ВыполняемыйМетод, ПараметрыЗадания, ЗаголовокФормы, _МодульФоновогоЗадания, ОповещениеОЗакрытииФормыФоновогоЗадания); 
КонецПроцедуры
	