
&НаКлиенте
Процедура ЗагрузитьСопоставленияНажатие(Элемент)
	
	connection_info = Неопределено;
	ЗаголовокДействие = "Загружены сопоставления по умолчанию.";
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("connection_info", connection_info);
	
	ПараметрыМетодаПИМ = Новый Структура();
	ПараметрыМетодаПИМ.Вставить("ИмяМетода", "ЗагрузитьСопоставленияНаСервере");
	ПараметрыМетодаПИМ.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ПараметрыМетодаПИМ.Вставить("Заголовок", ЗаголовокДействие);

	ЗапуститьОповещениеПриНаличииСессии("ПИМЗапуститьОбменСОблаком", ЭтаФорма, ПараметрыМетодаПИМ);
КонецПроцедуры

