
&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ЭтаФорма.context_params	= НастройкиПодключенияПрочитатьНаСервере();
	Если ЭтаФорма.context_params = Неопределено Тогда
		ЭтаФорма.context_params = Новый Структура();
	КонецЕсли;
	link			= api_url + "/!ping/";
	ЭтаФорма.context_params.Вставить("password",	password);
	ЭтаФорма.context_params.Вставить("login",	login);
	ЭтаФорма.context_params.Вставить("ApiUrl",	api_url);

	ЗаполнитьПараметрыПрокси();
	
	КартинкаУспешно = КартинкаУспешно();
	КартинкаОшибка = КартинкаОшибка();
	
	ОтветСервера = Неопределено;
	Попытка
		ОтветСервера = ТранспортИнтеграции.local_helper_exec_request("get", link, "text", Неопределено, ЭтаФорма.context_params);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
		ПоказатьВажноеОповещениеПользователя(
			"Ошибка", , СтруктураОшибки.message,
			КартинкаОшибка);
		Возврат;
	КонецПопытки;

	Если ОтветСервера <> Неопределено Тогда
		// Обработываетя корень домена, т.ч. ни каких ошибок быть не может
		// только 307, редирект на авторизацию
		Если ОтветСервера.code = 200 Тогда
			ПоказатьВажноеОповещениеПользователя(
				"Проверка сервисов", , "Проверка доступа к " + ЛокализацияНазваниеПродукта() + " прошла успешно.",
				КартинкаУспешно);
		Иначе
			ПоказатьВажноеОповещениеПользователя(
				"Проверка сервисов", , "Проверка доступа к " + ЛокализацияНазваниеПродукта() + " завершилась с ошибкой. Error code - "
				+ Формат(ОтветСервера.code),
				КартинкаОшибка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыПрокси()
	ЭтаФорма.context_params.Удалить("Proxy");
	ЭтаФорма.context_params.Вставить("ProxyType", ProxyType);
	Если ProxyType = "OtherSettings" Тогда
		Proxy = Новый Структура;
		Proxy.Вставить("Protocol", ProxyProtocol);
		Proxy.Вставить("Server", ProxyServer);
		Proxy.Вставить("Port", ProxyPort);
		Proxy.Вставить("User", ProxyLogin);
		Proxy.Вставить("Password", ProxyPassword);
		Если ProxyUseOSAuthentication = "Базовая аутентификация" Тогда
			Proxy.Вставить("ProxyUseOSAuthentication", Ложь);
		Иначе
			Proxy.Вставить("ProxyUseOSAuthentication", Истина);
		КонецЕсли;
		ЭтаФорма.context_params.Вставить("Proxy", Proxy);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция НастройкиПодключенияПрочитатьНаСервере()
	Модуль = МодульОбъекта();
	НастройкиПодключения = Модуль.НастройкиПодключенияПрочитать();
	Возврат НастройкиПодключения;
КонецФункции

&НаСервере
Процедура ВзятьНастройкиПроксиИз1СНаСервере()
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	НастройкаПроксиСервера = Константы.НастройкаПроксиСервера.Получить().Получить();
	НастройкаПроксиСервера = ?(ТипЗнч(НастройкаПроксиСервера) = Тип("Соответствие"),
		НастройкаПроксиСервера,
		Неопределено);
	Если 	НастройкаПроксиСервера = Неопределено Тогда
		МодульОбъекта = МодульОбъекта();	
		ОбщийМодульОбщегоНазначения = МодульОбъекта.ОбщийМодульЗначение("ОбщегоНазначения");
		Если ОбщийМодульОбщегоНазначения <> Неопределено Тогда
			НастройкаПроксиСервера = ОбщийМодульОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкаПроксиСервера", "");
		КонецЕсли;	
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	// BSLLS:SetPrivilegedMode-on
	
	ЭтаФорма.ProxyPort		= get_prop(НастройкаПроксиСервера, "Порт", 0);
	ProxyServer		= get_prop(НастройкаПроксиСервера, "Сервер", "");
	ProxyServer		= Нрег(ProxyServer);
	ЭтаФорма.ProxyPassword	= get_prop(НастройкаПроксиСервера, "Пароль", "");
	ЭтаФорма.ProxyLogin		= get_prop(НастройкаПроксиСервера, "Пользователь", "");
	
	ЭтаФорма.ProxyProtocol = "";
	Если Найти(ProxyServer, "https") Тогда
		ЭтаФорма.ProxyProtocol = "https";
		ЭтаФорма.ProxyServer = СтрЗаменить(ProxyServer, "https://", "");
	ИначеЕсли Найти(ProxyServer, "http") Тогда
		ЭтаФорма.ProxyProtocol = "http";
		ЭтаФорма.ProxyServer = СтрЗаменить(ProxyServer, "http://", "");
	Иначе
		Если СтрДлина(ProxyServer) Тогда
			ЭтаФорма.ProxyProtocol = "https";
		КонецЕсли;
	КонецЕсли;
	
	ИспользоватьАутентификациюОС = get_prop(НастройкаПроксиСервера, "ИспользоватьАутентификациюОС", Ложь);
	ЭтаФорма.ProxyUseOSAuthentication = ?(ИспользоватьАутентификациюОС, "Аутентификация через операционную систему", "Базовая аутентификация");
КонецПроцедуры

&НаКлиенте
Процедура ВзятьНастройкиПроксиИз1С(Команда)
	ВзятьНастройкиПроксиИз1СНаСервере();
КонецПроцедуры

