
&НаСервере
Процедура ОбновитьОбщиеНастройки(СтруктураПараметров)
	Если Не ЗначениеЗаполнено(СтруктураПараметров) Тогда
		Возврат;
	КонецЕсли;
	МодульОбъекта = МодульОбъекта();
	ОбщиеНастройки	= МодульОбъекта.ОбщиеНастройкиПрочитать();
	ПубличныеОбщиеНастройки	= ?(ОбщиеНастройки.Свойство("public"), ОбщиеНастройки.public, Новый Структура);
	Для Каждого ЭлемСтруктуры Из СтруктураПараметров Цикл
		ПубличныеОбщиеНастройки.Вставить(ЭлемСтруктуры.Ключ, ЭлемСтруктуры.Значение);
	КонецЦикла;
	ОбщиеНастройки.Вставить("public", ПубличныеОбщиеНастройки);
	МодульОбъекта.ОбщиеНастройкиЗаписать(ОбщиеНастройки);
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиПодключения(СтруктураПараметров)
	Если Не ЗначениеЗаполнено(СтруктураПараметров) Тогда
		Возврат;
	КонецЕсли;
	МодульОбъекта = МодульОбъекта();
	context_param = МодульОбъекта.НастройкиПодключенияПрочитать();
	Если context_param <> Неопределено Тогда 
		Для Каждого ЭлемСтруктуры Из СтруктураПараметров Цикл
			context_param.Вставить(ЭлемСтруктуры.Ключ, ЭлемСтруктуры.Значение);
		КонецЦикла;
	КонецЕСли;
	МодульОбъекта.НастройкиПодключенияЗаписать(context_param);
КонецПроцедуры

