
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("БезПараметра", Неопределено);
	ОткрытьФорму("Обработка." + ПрефиксПродукта() + "SABY.Форма.Настройки", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти
