// BSLLS:ExportVariables-off Необходимо для считывания из формы потомка
&НаКлиенте
Перем ТранспортИнтеграции Экспорт; 

&НаКлиенте
Перем BlocklyExecutor Экспорт;
// BSLLS:ExportVariables-on 

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МодульОбъекта = МодульОбъекта(); 
    ЗаполнитьПараметрыОкнаПоУмолчанию();
	Если Параметры <> Неопределено Тогда 
		ЭтаФорма.Сервис = get_prop(Параметры, "Сервис", "Dom1C");	
		ЭтаФорма.Версия = get_prop(Параметры, "Версия", ВерсияМетаданных());	
		ЭтаФорма.Подсистема = get_prop(Параметры, "Подсистема", ""); 	
		ЭтаФорма.context_params = get_prop(Параметры, "context_param", Неопределено); 	
		ЭтаФорма.Идентификатор = get_prop(Параметры, "Идентификатор", ""); 	
		ЭтаФорма.ИдентификаторНовый = get_prop(Параметры, "Идентификатор", "");
		Если Не ЗначениеЗаполнено(Идентификатор) Тогда
			ЭтаФорма.ИдентификаторНовый = get_prop(Параметры, "Ключ", Строка(Новый УникальныйИдентификатор));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly(ЭтаФорма);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		ЗаполнитьРеквизитыПоОперации();
	Иначе  
		ЭтаФорма.Идентификатор = get_prop(context_params, "ConnectionId", Неопределено);
		ЗаполнитьРеквизитыПоОперации();
		ЗаполнитьПараметрыОкнаПоУмолчанию();
	КонецЕсли; 
	ОбновитьАвтозапуск(); 
	ЗаполнитьИсториюОбмена();
	ЭтаФорма.ШрифтНеактивногоЭлемента = WebЦвета.Черный;
	ЭтаФорма.ШрифтАктивногоЭлемента = WebЦвета.Зеленый;
	ЭтоВнешняяОбработка = ЭтоВнешняяОбработка();
	Если ЭтоВнешняяОбработка Тогда
		ЭтаФорма.ИмяОбработки = ИмяФайлаОбработки();
	Иначе
		ЭтаФорма.ИмяОбработки = ИмяОбработки();
	КонецЕсли;
	Если ЭтаФорма.Алгоритм <> "<выберите алгоритм>" Тогда 
		ЗаполнитьФормуПоПараметрамАлгоритма();           
	КонецЕсли;
	ЗаполнитьАвтоматическийЗапуск();  
	ОбновитьОтображениеОграничениеВремени();
	ЭтаФорма.Заголовок = ИмяФормы();
	ПодсказкаКопировать();
	ДанныеФильтра = Новый Структура("ПараметрыОтображения, Значения");
	ЗаполнитьФильтрыПодключения(); 
	ДанныеФильтра.Вставить("Значения", ЗначенияФильтровПодключения());
	ОбновитьПанельФильтра();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФильтрыПодключения() 
	ПараметрыОтображения = get_prop(ДанныеФильтра, "ПараметрыОтображения");
	Если ПараметрыОтображения = Неопределено Тогда
		Результат = ТранспортИнтеграции.local_helper_api3_calc_objects_filter(context_params, Идентификатор, "Blockly");
		ПараметрыОтображения = Новый Массив;	
		Если ТипЗнч(Результат) = Тип("Соответствие") Тогда
			Для Каждого Запись Из Результат Цикл
				ПараметрыОтображения.Добавить(Запись.Значение);
			КонецЦикла;	
		КонецЕсли;  
		ДанныеФильтра.Вставить("ПараметрыОтображения", ПараметрыОтображения);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СписокЗначенийФильтраИзМассива(МассивЗначенийФильтра)
	МодульОбъекта = МодульОбъекта(); 
	СписокЗначений = Новый СписокЗначений;
	Для Каждого Запись Из МассивЗначенийФильтра Цикл
		ЗначениеСписка = Запись;
		Если ТипЗнч(ЗначениеСписка) = Тип("Соответствие") Тогда 
			ИмяИС = get_prop(ЗначениеСписка, "ИмяИС"); 
			ИдИС = get_prop(ЗначениеСписка, "ИдИС"); 
			ЗначениеСписка = МодульОбъекта.ПолучитьСсылкуПоИдИС(ИмяИС, ИдИС);
		КонецЕсли;
		СписокЗначений.Добавить(ЗначениеСписка, Строка(ЗначениеСписка));
	КонецЦикла;
	Возврат СписокЗначений;
КонецФункции

&НаСервере
Функция ФильтрУжеЕсть(ФильтрЗначения, ИмяФильтра)
	Для Каждого КлючЗначение Из ФильтрЗначения Цикл
		Если КлючЗначение["Ключ"] = ИмяФильтра Тогда 
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ПереложитьФильтрыToFrom(ФильтрЗначения)
	Отступ3 = 3;
	Отступ5 = 5;
	МассивКлючейToFrom = Новый Массив;
	Для Каждого ЗаписьФильтр Из ФильтрЗначения Цикл
		Если Прав(ЗаписьФильтр.Ключ, Отступ3) = "_To" Или Прав(ЗаписьФильтр.Ключ, Отступ5) = "_From" Тогда  
			МассивКлючейToFrom.Добавить(ЗаписьФильтр.Ключ);	
		КонецЕсли;
	КонецЦикла;	
	Для Каждого КлючToFrom Из МассивКлючейToFrom Цикл
		ИмяФильтра = "";
		ЗначениеФильтра = Неопределено;
		Если Прав(КлючToFrom, Отступ3) = "_To" Тогда 
			ИмяФильтра = Лев(КлючToFrom, СтрДлина(КлючToFrom) - Отступ3) + "Кнц";
			ЗначениеФильтра = get_prop(ФильтрЗначения, КлючToFrom);
		КонецЕсли;
		Если Прав(КлючToFrom, Отступ5) = "_From" Тогда
			ИмяФильтра = Лев(КлючToFrom, СтрДлина(КлючToFrom) - Отступ5) + "Нач";
			ЗначениеФильтра = get_prop(ФильтрЗначения, КлючToFrom);
		КонецЕсли;
		Если ЗначениеЗаполнено(ИмяФильтра) И ФильтрУжеЕсть(ФильтрЗначения, ИмяФильтра) = Ложь Тогда
			ФильтрЗначения.Вставить(ИмяФильтра, ЗначениеФильтра);	
		КонецЕсли;
		ФильтрЗначения.Вставить(КлючToFrom, Неопределено);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДополнитьФильтрамиПоУмолчанию(ФильтрЗначения) 
	Для Каждого Поле Из ДанныеФильтра.ПараметрыОтображения Цикл
    	Name = get_prop(Поле, "NAME", get_prop(Поле, "Name"));
		Если get_prop(ФильтрЗначения, Name) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	   
		TEMPLATE = get_prop(Поле, "TEMPLATE", Неопределено);
		Если TEMPLATE <> "filter_period" Тогда  
			ФильтрЗначения.Вставить(Name, Неопределено);	
		    Продолжить;
		КонецЕсли;
		Если get_prop(ФильтрЗначения, Name+"Нач",Неопределено) = Неопределено Тогда
			ФильтрЗначения.Вставить(Name+"Нач", Неопределено);
		КонецЕсли;
		Если get_prop(ФильтрЗначения, Name+"Кнц",Неопределено) = Неопределено  Тогда
			ФильтрЗначения.Вставить(Name+"Кнц", Неопределено);
		КонецЕсли;
		Если get_prop(ФильтрЗначения, Name+"Период",Неопределено) = Неопределено  Тогда
			ФильтрЗначения.Вставить(Name+"Период", Неопределено);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФильтрЗначения(ФильтрЗначения)
	МодульОбъекта = МодульОбъекта(); 
	ЭтоНовоеПодключение = (ИдентификаторНовый <> Идентификатор);
	Если Не ЭтоНовоеПодключение Тогда 
		Data = МодульОбъекта.local_helper_json_decode(dataСтрокой);  
		ФильтрЗначения = Data.Получить("Filter"); 
		Если ФильтрЗначения = Неопределено Тогда 
			public_params =  get_prop(Data, "public_params", Неопределено);
			ФильтрЗначения = get_prop(public_params, "Filter", Неопределено);	
		КонецЕсли;
	КонецЕсли;	
	Если ФильтрЗначения = Неопределено Тогда
		ФильтрЗначения = Новый Структура;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗначенияФильтровПодключения()
	МодульОбъекта = МодульОбъекта(); 
	ФильтрЗначения = Новый Структура;
	ЗаполнитьФильтрЗначения(ФильтрЗначения);
	
	// Убрать после 26.1100
	ПереложитьФильтрыToFrom(ФильтрЗначения);

	Для Каждого ЗаписьФильтр Из ФильтрЗначения Цикл
		Отступ3 = 3;
		Отступ5 = 5;
		
		Если Прав(ЗаписьФильтр.Ключ, Отступ3) = "Нач" Или Прав(ЗаписьФильтр.Ключ, Отступ3) = "Кнц" Тогда  
			ФильтрЗначения[ЗаписьФильтр.Ключ] = МодульОбъекта.ПреобразоватьСтрокуВДату("yyyy-MM-dd", ЗаписьФильтр.Значение);
		ИначеЕсли get_prop(ЗаписьФильтр.Значение, "Api3Link") <> Неопределено Тогда 
			Api3Link = get_prop(ЗаписьФильтр.Значение, "Api3Link");
			ИмяИС = get_prop(Api3Link, "ИмяИС"); 
			ТипИС = get_prop(Api3Link, "ТипИС");   
			Если  ЗначениеЗаполнено(ТипИС) Тогда
				ИмяИС = ТипИС + "." + ИмяИС;
			КонецЕсли;
			ИдИС = get_prop(Api3Link, "ИдИС"); 
			ФильтрЗначения[ЗаписьФильтр.Ключ] = МодульОбъекта.ПолучитьСсылкуПоИдИС(ИмяИС, ИдИС);
		ИначеЕсли ТипЗнч(ЗаписьФильтр.Значение) = Тип("Соответствие") Тогда
			ИмяИС = get_prop(ЗаписьФильтр.Значение, "ИмяИС"); 
			ИдИС = get_prop(ЗаписьФильтр.Значение, "ИдИС");
			Попытка
				ФильтрЗначения[ЗаписьФильтр.Ключ] = МодульОбъекта.ПолучитьСсылкуПоИдИС(ИмяИС, ИдИС);
			Исключение
				Продолжить;
			КонецПопытки;	
		ИначеЕсли ТипЗнч(ЗаписьФильтр.Значение) = Тип("Массив") Тогда 	
			ФильтрЗначения[ЗаписьФильтр.Ключ] = СписокЗначенийФильтраИзМассива(ЗаписьФильтр.Значение);
		Иначе
			Продолжить;
		КонецЕсли;	
	КонецЦикла;	
	ДополнитьФильтрамиПоУмолчанию(ФильтрЗначения);
	Возврат ФильтрЗначения;
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗавершениеРаботы И Модифицированность = Истина Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		ОповещениеПослеВыбораОтветаПередЗакрытием = Новый ОписаниеОповещения("ПослеВыбораОтветаПередЗакрытием",ЭтаФорма);
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");	
		ПоказатьВопрос(ОповещениеПослеВыбораОтветаПередЗакрытием, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "SabySignOut" Тогда
		Закрыть();	
	ИначеЕсли ИмяСобытия = "ПослеВыполненияАлгоритма" Тогда
		ПослеВыполненияАлгоритма(Неопределено,Неопределено);
	Иначе
		Возврат;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	ЗаполнитьАвтоматическийЗапуск();
	ПересчитатьДатуСледующегоЗапуска();
	ИзменитьМодифицированность(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьДняПриИзменении(Элемент)
	ОбновитьОтображениеОграничениеВремени();
	ПересчитатьДатуСледующегоЗапуска();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияУбратьОграничениеВремениНажатие(Элемент)
	ЭтаФорма.БезОграниченийВремени = Истина;
	ОбновитьОтображениеОграничениеВремени();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПодключенияПриИзменении(Элемент)
	ЭтаФорма.Заголовок = ИмяФормы();
	ИзменитьМодифицированность(Истина);
КонецПроцедуры  

&НаКлиенте
Процедура ИзменитьМодифицированность(Значение = Истина)
	ЭтаФорма.Модифицированность = Значение;	
КонецПроцедуры

&НаКлиенте
Процедура Пн(Команда)
	ЭтаФорма[Команда.Имя] = НЕ ЭтаФорма[Команда.Имя];  
	ОтобразитьЦветКнопкиДняНедели(Команда.Имя, ЭтаФорма[Команда.Имя]);
	ПересчитатьДатуСледующегоЗапуска();
	ИзменитьМодифицированность(Истина);
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;   
	ПараметрыПередачи = Новый Структура("Идентификатор,Версия,context_param",Идентификатор,Версия,context_params);
	ОписаниеЗакрытиеОкна = Новый ОписаниеОповещения("ПослеВыбораАлгоритма",ЭтаФорма);
	Попытка   
		ОткрытьФормуОбработки("РоботВыборАлгоритма",ПараметрыПередачи, ЭтаФорма,,ОписаниеЗакрытиеОкна);
	Исключение  
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		Если ОшибкаСтруктура <> Неопределено Тогда
			ТекстОшибки = ExtExceptionToMessage(ОшибкаСтруктура); 
			ПоказатьСкрытьОшибкуПолученияДанных(ИСТИНА, ТекстОшибки);
		КонецЕсли;	
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеРобота(ПараметрыВызова, РезультатВыполнения) 
    ПересчитатьДатуСледующегоЗапуска();
    
    СтатусОбмена = 100;    
    
    Если РезультатВыполнения.Status = "error" Тогда
        СтатусОбмена = 101;
    ИначеЕсли РезультатВыполнения.Свойство("data") Тогда 
        data = РезультатВыполнения.data;  
        CountError = data.Получить(CountError);
        Если CountError<> Неопределено 
            И CountError <> 0 Тогда
            СтатусОбмена = 101;    
        КонецЕсли;
    Иначе
        СтатусОбмена = 100;        
    КонецЕсли;
        
    props = Новый Структура;
    props.Вставить("id",        ПараметрыВызова.Получить("ConnectionId"));
    props.Вставить("NextRun",    УниверсальноеВремяСтрокой(ДатаВремяСледующегоЗапуска));
    // BSLLS:DeprecatedCurrentDate-off ВызовНаКлиенте
    props.Вставить("LastRun",    УниверсальноеВремяСтрокой(ТекущаяДата()));
    // BSLLS:DeprecatedCurrentDate-on
    props.Вставить("StatusID",    СтатусОбмена);
    МассивINI = Новый Массив;
    params = Новый Структура("props,ini", Props, МассивINI);
    
    ТранспортИнтеграции.local_helper_integration_api(context_params, "IntegrationConnection.WriteConnection", params, "int-settings");
КонецПроцедуры

&НаКлиенте
Процедура ЗапускНаКлиенте()
	Data = local_helper_json_decode(dataСтрокой);
	СтруктураСоединения = Новый Структура;
	СтруктураСоединения.Вставить("connection_uuid", Идентификатор);
	СтруктураСоединения.Вставить("operation_uuid",  Неопределено);
	СтруктураСоединения.Вставить("isRobot", 		Истина);
	context_params.Вставить("operation", СтруктураСоединения);
	
	ПараметрыВызова	= Новый Соответствие(); 
	ПараметрыВызова.Вставить("ContextId", 	Неопределено);
	ПараметрыВызова.Вставить("ConnectionId", Идентификатор);
	ПараметрыВызова.Вставить("params", 	context_params );
	ПараметрыВызова.Вставить("CommandsResult",	Новый Массив);
	ПараметрыВызова.Вставить("Endpoint",		get_prop(Data, "Endpoint",""));
	ПараметрыВызова.Вставить("Algorithm",		get_prop(Data, "OperationId"));
	ПараметрыВызова.Вставить("object",			Новый Структура());
	ПараметрыВызова.Вставить("isRobot", 		ИСТИНА);
	ПараметрыВызова.Вставить("Data", 			Data);
    РезультатВыполнения = BlocklyExecutor.API_BLOCKLY_RUN(ПараметрыВызова);
    ОбновитьСостояниеРобота(ПараметрыВызова, РезультатВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура ФиксацияНачалаОбмена()
    ПараметрыВызова = Новый Структура("Direction", 1);
    Попытка
		param = Новый Структура("ConnectionId, ExtSyncDoc, ExtSyncObj", ИдентификаторНовый, ПараметрыВызова, Неопределено);
		params = Новый Структура("param", param);
		ТранспортИнтеграции.local_helper_integration_api(context_params, "ExtSyncDoc.Write", params, "integration-sync");
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке));		
	КонецПопытки;        
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)  
	Если НаименованиеПодключения = "" Тогда 
		СтрокаСообщения = НСтр("ru = 'Необходимо заполнить наименование подключения';");		
		СоощениеПользователю = Новый СообщениеПользователю;
		СоощениеПользователю.ПутьКДанным = "НаименованиеПодключения";
		СоощениеПользователю.Текст = СтрокаСообщения;
		СоощениеПользователю.Сообщить();
	КонецЕсли; 
	
	Если Алгоритм = "<выберите алгоритм>" Тогда 
		СтрокаСообщения = НСтр("ru = 'Необходимо заполнить алгоритм';");		
		СоощениеПользователю = Новый СообщениеПользователю;
		СоощениеПользователю.ПутьКДанным = "Алгоритм";
		СоощениеПользователю.Текст = СтрокаСообщения;
		СоощениеПользователю.Сообщить();
	КонецЕсли;

	Попытка
		СохранитьПодключение();
		ИзменитьМодифицированность(Ложь); 
		ПоказатьСкрытьОшибкуПолученияДанных(Ложь, ""); 
		
		СтрокаСообщения = НСтр("ru = 'Автоматическая операция успешно сохранена';");		
		СоощениеПользователю = Новый СообщениеПользователю;
		СоощениеПользователю.Текст = СтрокаСообщения;
		СоощениеПользователю.Сообщить();
	Исключение  
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		Если ОшибкаСтруктура <> Неопределено Тогда
			ТекстОшибки = ExtExceptionToMessage(ОшибкаСтруктура); 
			ПоказатьСкрытьОшибкуПолученияДанных(Истина, ТекстОшибки);
		КонецЕсли;	
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПодключенияПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ЭлемФормы = ПолучитьЭлементыФормы();
	Если ТекущиеДанные <> Неопределено Тогда
		ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.СписокВыбора.Очистить();
		Если ТекущиеДанные.НаправленияВозможные = 0 Тогда
			ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.ТолькоПросмотр = Истина;
		Иначе
			ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.ТолькоПросмотр = Ложь;
			Если ТекущиеДанные.НаправленияВозможные = 2 Тогда   
				СтрокаСостояния = "⇄  Синхронизировать в обе стороны";
				ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.СписокВыбора.Добавить(2,СтрокаСостояния);	
			КонецЕсли;
			
			Если ТекущиеДанные.НаправленияВозможные = 3
				ИЛИ ТекущиеДанные.НаправленияВозможные = 2 Тогда
				СтрокаСостояния = "→ В Saby";
				ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.СписокВыбора.Добавить(3,СтрокаСостояния);	
			КонецЕсли;
			
			Если ТекущиеДанные.НаправленияВозможные = 4 
				ИЛИ ТекущиеДанные.НаправленияВозможные = 2 Тогда
				СтрокаСостояния = "← В ИС";
				ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.СписокВыбора.Добавить(4,СтрокаСостояния);	
			КонецЕсли;	
			СтрокаСостояния = "x  Отключено";
			ЭлемФормы.ДеревоНастроекПодключения.ПодчиненныеЭлементы.ДеревоНастроекПодключенияНаправление.СписокВыбора.Добавить(1,СтрокаСостояния);
		
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	Если Алгоритм <> "<выберите алгоритм>" Тогда   
		НазваниеАлгоритма = КодироватьСтрокуНаСервере(Алгоритм);
		ПараметрыФормы = Новый Структура;
		АдресСтраницы = context_params.api_url;
		connector = КоннекторLPP(context_params);
		АдресСтраницы = АдресСтраницы + "/blockly_editor_1c2/page/?connection_id=";
		АдресСтраницы = АдресСтраницы + Идентификатор;
		АдресСтраницы = АдресСтраницы + "&connector=" + connector + "&command=" + connector + "&algorithm=";
		АдресСтраницы = АдресСтраницы + НазваниеАлгоритма;
		ПараметрыФормы.Вставить("Заголовок", "Редактор файлов настроек");
		ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
        ОткрытьФормуОбработки("Browser", ПараметрыФормы, Этаформа.ВладелецФормы);
	Иначе
		СтрокаСообщения = НСтр("ru = 'Не указан алгоритм';");		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрокаСообщения;
		Сообщение.Поле = "Алгоритм";
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Запуск(Команда)
	Если ИдетПроцессВыполнения = ИСТИНА Тогда
		Возврат;
	КонецЕсли;	
	
	Если Модифицированность = Истина Тогда  
		ПослеВыбораСохраненияАлгоритма = Новый ОписаниеОповещения("ПослеВыбораСохраненияАлгоритма", ЭтаФорма);
		ТекстВопроса = НСтр("ru = 'Перед выполнением алгоритма необходимо сохранить настройки';");
		ПоказатьВопрос(ПослеВыбораСохраненияАлгоритма, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Да);
	Иначе
		ЗапускАлгоритма();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Копировать(Команда)    
	#Если НЕ ВебКлиент Тогда
		СистемнаяИнформация = Новый СистемнаяИнформация;
		Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Или ТипПлатформы.Linux_x86_64 Тогда
			ОбъектКопирования = Новый COMОбъект("htmlfile"); 
			ОбъектКопирования.ParentWindow.ClipboardData.SetData("Text", ИдентификаторНовый);
			ПоказатьОповещениеПользователя(,,"Идентификатор операции помещен в буфер обмена",,СтатусОповещенияПользователя.Информация);
		КонецЕсли;
	#Иначе  
		ОписаниеПослеОтображенияID = Новый ОписаниеОповещения("ПослеВводаСтрокиБуфераОбмена",ЭтаФорма);
		ПоказатьВводСтроки(ОписаниеПослеОтображенияID, ИдентификаторНовый, "Идентификатор операции"); 
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаБезОграниченийВремениНажатие(Элемент)
	ЭтаФорма.БезОграниченийВремени = Ложь;
	ОбновитьОтображениеОграничениеВремени();
	ПересчитатьДатуСледующегоЗапуска();
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеФильтровНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	
	Форма = ФормаОсновнойОбработки("Фильтр", ПутьКФормамОбработки(), , ЭтаФорма);
	Форма.ДанныеФильтра = ДанныеФильтра;
	Форма.ConnectionID = Идентификатор;
	Если НЕ Форма.Открыта() Тогда
		Форма.Открыть();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПротоколОбменаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	Попытка 
		parentNode = ДанныеСобытия.Element.parentNode;
		Пока parentNode.localName <> "tr" Цикл
			parentNode = parentNode.parentNode;
		КонецЦикла;	
		АдресСсылки = parentNode.attributes["0"].textContent;
		Если ЗначениеЗаполнено(АдресСсылки) Тогда
			ПараметрыОткрытияОкнаБраузера = Новый Структура;
			ПараметрыОткрытияОкнаБраузера.Вставить("АдресСтраницы", АдресСсылки);
			ПараметрыОткрытияОкнаБраузера.Вставить("Заголовок", "Страница синхронизации"); 
			ОткрытьФормуОбработки("Browser",ПараметрыОткрытияОкнаБраузера);
		КонецЕсли;	
	Исключение
		Возврат;
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)
	ПересчитатьДатуСледующегоЗапуска();
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияПриИзменении(Элемент)
	ПересчитатьДатуСледующегоЗапуска();
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачала1ПриИзменении(Элемент)
	ПересчитатьДатуСледующегоЗапуска();
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОбменаТабличныйДокументПриАктивизации(Элемент)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ТекВерх = ЭлемФормы.ИсторияОбменаТабличныйДокумент.ТекущаяОбласть.Верх;
	ИсторияОбменаТабличныйДокумент = РеквизитИсторияОбмена();
	МассивОбластей = Новый Массив();
	Если ТекВерх = 1 Тогда 
		ЯчейкаСтрока =ИсторияОбменаТабличныйДокумент.Область(ТекВерх,1,ТекВерх,16);
	Иначе
		ПоправкаРасположенияНачалоОбласти = ТекВерх % 3;
		Если ПоправкаРасположенияНачалоОбласти = 2 Тогда
			НачалоОбласти = ТекВерх;
		ИначеЕсли ПоправкаРасположенияНачалоОбласти = 1 Тогда
			НачалоОбласти = ТекВерх-2;
		Иначе 
			НачалоОбласти = ТекВерх-1;
		КонецЕсли;
	    ЯчейкаСтрока =ИсторияОбменаТабличныйДокумент.Область(НачалоОбласти,1,НачалоОбласти+2,16);
	КонецЕсли; 
    МассивОбластей.Добавить(ЯчейкаСтрока);
  	ЭлемФормы.ИсторияОбменаТабличныйДокумент.УстановитьВыделенныеОбласти(МассивОбластей);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОбменаТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	АдресСсылки = Область.Расшифровка;
	Если ЗначениеЗаполнено(Область.Расшифровка) Тогда
		ПараметрыОткрытияОкнаБраузера = Новый Структура;
		ПараметрыОткрытияОкнаБраузера.Вставить("АдресСтраницы", АдресСсылки);
		ПараметрыОткрытияОкнаБраузера.Вставить("Заголовок", "Страница синхронизации"); 
		ОткрытьФормуОбработки("Browser",ПараметрыОткрытияОкнаБраузера,,ИСТИНА);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоНастроекПодключения

&НаКлиенте
Процедура ДеревоНастроекПодключенияНаправлениеПриИзменении(Элемент)
	ИзменитьМодифицированность(Истина);	
КонецПроцедуры



&НаКлиенте
Процедура Отметить(Команда) 
	УстановитьСнятьФлажки = НЕ УстановитьСнятьФлажки;
	УстановитьСнятьФлажки();
	
	//ПослеВыбораВариантаОтметки = Новый ОписаниеОповещения("ПослеВыбораВариантаОтметки", ЭтотОбъект);
	//СписокВыбора = Новый СписокЗначений;
	//СписокВыбора.Добавить("Все","Все");
	//СписокВыбора.Добавить("Снять","Снять");
	//СписокВыбора.Добавить("Инвертировать","Инвертировать");	
	//ЭлементУстановитьСнятьФлажки = Элементы.ДеревоНастроекПодключенияУстановитьСнятьФлажки;
	//ПоказатьВыборИзСписка(ПослеВыбораВариантаОтметки, СписокВыбора, ЭлементУстановитьСнятьФлажки);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ИмяФормы()
	Возврат "Автоматическая операция: "+НаименованиеПодключения;
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыОкнаПоУмолчанию()
	ЭтаФорма.Алгоритм = "<выберите алгоритм>"; 
	ЭтаФорма.Периодичность = 1; 
	ЭтаФорма.Автозапуск = Ложь;
	ЭтаФорма.ПериодичностьДня = "02:00";
	ЭтаФорма.ВремяНачала = Дата(2023,01,01,09,00,00);
	ЭтаФорма.ВремяОкончания = Дата(2023,01,01,18,00,00);
	ВидимостьГруппаРезультат(Истина);
	ЭтаФорма.ПредставлениеФильтров = "Все объекты";	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ЭтоБазоваяКонфигурация()
	Если Найти(ВРег(Метаданные.Имя), "БАЗОВАЯ") > 0 Тогда
   		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура СоздатьУзелПланаОбмена()
	УзелПланаОбмена = ПланыОбмена[НазваниеПланаОбмена].ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторНовый));
	Если ЗначениеЗаполнено(УзелПланаОбмена.Код) Тогда 
		Возврат;
	КонецЕсли;	
	Если Метаданные.Константы.Найти("ИспользоватьСинхронизациюДанных") <> Неопределено Тогда
		Константы["ИспользоватьСинхронизациюДанных"].Установить(Истина);
	КонецЕсли;	
	УзелСоздан = Ложь;
	Для Сч = 0 По 100 Цикл	
		Попытка 
			КодУзла = "S"+Сч; 
			НовыйУзел = ПланыОбмена[НазваниеПланаОбмена].СоздатьУзел(); 
			НовыйУзел.УстановитьСсылкуНового(УзелПланаОбмена);	
			НовыйУзел.Код = КодУзла;
			НовыйУзел.Наименование = ЛокализацияНазваниеПродукта() + " " + НаименованиеПодключения;
			МетаданныеПланаОбмена = Метаданные.ПланыОбмена.Найти(НазваниеПланаОбмена);
			Если МетаданныеПланаОбмена.Реквизиты.Найти("СинхронизироватьДанныеПоОрганизациям") <> Неопределено Тогда
				НовыйУзел.СинхронизироватьДанныеПоОрганизациям = Истина;
			КонецЕсли;	
			Если МетаданныеПланаОбмена.Реквизиты.Найти("РегистрироватьИзменения") <> Неопределено Тогда
				НовыйУзел.РегистрироватьИзменения = Истина;
			КонецЕсли;
			Если МетаданныеПланаОбмена.ТабличныеЧасти.Найти("РазделыДанных") <> Неопределено Тогда
				НовыйРаздел = НовыйУзел.РазделыДанных.Добавить();
				НовыйРаздел.Идентификатор = "ОбщиеДанные";
				НовыйРаздел = НовыйУзел.РазделыДанных.Добавить();
				НовыйРаздел.Идентификатор = "РегламентированныеДанные";
			КонецЕсли; 
			НовыйУзел.Записать();
			УзелСоздан = Истина;
			Прервать;
		Исключение
			Продолжить;
		КонецПопытки;			
	КонецЦикла;	
	УзелПланаОбмена = ПланыОбмена[НазваниеПланаОбмена].ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторНовый));
	Если УзелСоздан = Истина Тогда
		Сообщить("Для настройки обмена создан узел " + УзелПланаОбмена.Наименование);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораАлгоритма(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат <> Неопределено И ТипЗнч(Результат) = Тип("Строка") Тогда
		Этаформа.Алгоритм = Результат; 
		ЗаполнитьФормуПоПараметрамАлгоритма(); 
		ИзменитьМодифицированность(Истина);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФормуПоПараметрамАлгоритма()
	ПараметрыВызова	= Новый Соответствие();  
	ПараметрыВызова.Вставить("params", context_params );
	ПараметрыВызова.Вставить("ConnectionId", Идентификатор );
	ПараметрыВызова.Вставить("CommandsResult",Новый Массив);
	ПараметрыВызова.Вставить("Endpoint", "info");
	ПараметрыВызова.Вставить("Algorithm", Алгоритм);
	ПараметрыВызова.Вставить("object",Новый Структура());
	ПараметрыАлгоритма = BlocklyExecutor.API_BLOCKLY_RUN(ПараметрыВызова);
	ПараметрыАлгоритма = ПолучитьПараметрыАлгоритма(ПараметрыАлгоритма);
	Если ТипЗнч(ПараметрыАлгоритма) = Тип("Соответствие") Тогда
		ЭлемФормы = ПолучитьЭлементыФормы();
		Если ПараметрыАлгоритма.Получить("ЭтоСинхронизация") = Истина Тогда
			ВидимостьГруппаОбъектыОбмена(Истина);
			Этаформа.ЭтоСинхронизация = Истина;
			ЭлемФормы.ГруппаПараметрыФильтры.Видимость = Истина;
			ВидимостьГруппаИсторияОбмена(Истина);
			Этаформа.НазваниеПланаОбмена = ПараметрыАлгоритма.Получить("ПланОбмена");
			ЗаполнитьДеревоНастроек();
		Иначе
			ВидимостьГруппаОбъектыОбмена(Ложь);
			Этаформа.ЭтоСинхронизация = Ложь;
			ЭлемФормы.ГруппаПараметрыФильтры.Видимость = Ложь; 	
			ВидимостьГруппаИсторияОбмена(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыАлгоритма(Знач ПараметрыАлгоритма)
	МодульОбъекта = МодульОбъекта();
	ИнтерфейсныеПараметры = Новый Соответствие;
	Записьsyncobj = МодульОбъекта.BlocklyGetInfoParams(ПараметрыАлгоритма.Result, "type", "syncobj");
	ЗаписьПланОбмена = МодульОбъекта.BlocklyGetInfoParams(ПараметрыАлгоритма.Result, "name", "ПланОбмена");
	Если Записьsyncobj <> Неопределено Тогда
		ИнтерфейсныеПараметры.Вставить("ЭтоСинхронизация", Истина);
		Если ЗаписьПланОбмена <> Неопределено Тогда 
			ИнтерфейсныеПараметры.Вставить("ПланОбмена", ЗаписьПланОбмена.Получить("default"));
		КонецЕсли;	
	Иначе
		ИнтерфейсныеПараметры.Вставить("ЭтоСинхронизация", Ложь);
	КонецЕсли;	
		
	Возврат ИнтерфейсныеПараметры;
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеОграничениеВремени() 
	ВидимостьГруппаВремяЗапуска(ЛОЖЬ);	
	ВидимостьГруппаБезОграничений(ЛОЖЬ);
	ВидимостьГруппаРазВДень(ЛОЖЬ);
	Если ПериодичностьДня = "24:00" Тогда
		ВидимостьГруппаРазВДень(ИСТИНА);
	Иначе	
		ВидимостьГруппаВремяЗапуска(НЕ БезОграниченийВремени);	
		ВидимостьГруппаБезОграничений(БезОграниченийВремени);
	КонецЕсли;		
КонецПроцедуры
	

&НаКлиенте
Процедура ЗаполнитьАвтоматическийЗапуск() 
	Если Периодичность = 1 Тогда
		ВидимостьГруппаАвтоЗапускаДниНедели(Ложь);
	Иначе
		ВидимостьГруппаАвтоЗапускаДниНедели(Истина)
	КонецЕсли;	
	ОтобразитьЦветКнопкиДняНедели("Пн", ЭтаФорма["Пн"]);
	ОтобразитьЦветКнопкиДняНедели("Вт", ЭтаФорма["Вт"]);
	ОтобразитьЦветКнопкиДняНедели("Ср", ЭтаФорма["Ср"]);
	ОтобразитьЦветКнопкиДняНедели("Чт", ЭтаФорма["Чт"]);
	ОтобразитьЦветКнопкиДняНедели("Пт", ЭтаФорма["Пт"]);
	ОтобразитьЦветКнопкиДняНедели("Сб", ЭтаФорма["Сб"]);
	ОтобразитьЦветКнопкиДняНедели("Вс", ЭтаФорма["Вс"]);
	ОбновитьАвтозапуск();	
КонецПроцедуры

&НаСервере
Функция МассивПоДнямНедели(ВсеДни = ЛОЖЬ) 
	Массив = Новый Массив(); 
	Если Пн ИЛИ ВсеДни Тогда Массив.Добавить("1"); КонецЕсли; 
	Если Вт ИЛИ ВсеДни Тогда Массив.Добавить("2"); КонецЕсли; 
	Если Ср ИЛИ ВсеДни Тогда Массив.Добавить("3"); КонецЕсли; 
	Если Чт ИЛИ ВсеДни Тогда Массив.Добавить("4"); КонецЕсли; 
	Если Пт ИЛИ ВсеДни Тогда Массив.Добавить("5"); КонецЕсли; 
	Если Сб ИЛИ ВсеДни Тогда Массив.Добавить("6"); КонецЕсли; 
	Если Вс ИЛИ ВсеДни Тогда Массив.Добавить("7"); КонецЕсли; 
	Возврат Массив;
КонецФункции	

&НаКлиенте
Функция СоответствиеData() 
	НачальнаяДатаВремя = Дата(1, 1, 1, 0, 0, 0);
	connectionParam = Новый Соответствие;
	Если ЭтаФорма.БезОграниченийВремени Тогда 
		ВремяНачала = НачальнаяДатаВремя;	
		ВремяОкончания = КонецДня(НачальнаяДатаВремя);	
	КонецЕсли;	
	connectionParam.Вставить("PeriodicityType", Периодичность);
	connectionParam.Вставить("RepeatTime", 		ПериодичностьДня);
	connectionParam.Вставить("DaysSelect", 		МассивПоДнямНедели(Периодичность = 1));
	connectionParam.Вставить("StartTime", 		Формат(ВремяНачала,"ДФ=ЧЧ:мм")); 
	Если ВремяНачала = НачальнаяДатаВремя Тогда 
		connectionParam.Вставить("StartTime", 		"00:00");
	КонецЕсли;	
	Если ПериодичностьДня = "24:00" Тогда 
		connectionParam.Вставить("EndTime", 	"");
	Иначе
		connectionParam.Вставить("EndTime", 	Формат(ВремяОкончания,"ДФ=ЧЧ:мм"));
	КонецЕсли;
	Data = ТранспортИнтеграции.local_helper_json_decode(dataСтрокой);
	Data.Вставить("connectionParam",	connectionParam);
	Data.Вставить("isRobot",	Истина);
	Если Алгоритм <> "<выберите алгоритм>" Тогда
		Data.Вставить("OperationType",	"Blockly");
		Data.Вставить("OperationId",	Алгоритм);
	Иначе 
		Data.Удалить("OperationId");
	КонецЕсли;               
	Data.Вставить("Endpoint",	endpoint);
	NDate = "";
	Если Автозапуск = Истина Тогда 
		NDate = ПересчитатьДатуСледующегоЗапуска();	
	КонецЕсли;	
	Data.Вставить("NDate",	NDate);
	Filter = ПодготовитьФильтр();
	public_params = get_prop(Data, "public_params", Новый Структура);
	public_params.Вставить("Filter", Filter);
	Data.Вставить("public_params", public_params);
	Data.Вставить("Filter", Неопределено);
	dataСтрокой = ТранспортИнтеграции.local_helper_json_encode(Data);	
	Возврат Data;
КонецФункции

&НаСервере
Процедура ЗаписатьСвойствоParentНаСервере(Знач parent)
	МодульОбъекта = МодульОбъекта(); 	
	МодульОбъекта.ЗаписатьСвойствоParent(,, parent);	
КонецПроцедуры

&НаСервере
Функция ВерсияМетаданных() 
	МодульОбъекта = МодульОбъекта(); 
 	Возврат МодульОбъекта.ПреобразоватьВерсию(Метаданные.Версия);
КонецФункции

&НаКлиенте
Функция ЗаписатьПодключение() 
	
	МассивINI = Новый Массив;
	props = Новый Структура;
	props.Вставить("id"					,ИдентификаторНовый);
	props.Вставить("service"           	,"Dom1C");
	props.Вставить("subsystem"			,Подсистема);
	props.Вставить("version"			,ВерсияМетаданных());
	props.Вставить("name_connection"	,НаименованиеПодключения);
	props.Вставить("for_all"			,Ложь);			
	props.Вставить("auto_update"		,Ложь);
	// BSLLS:DeprecatedCurrentDate-off Для использования на клиенте
	props.Вставить("update_date"		,УниверсальноеВремяСтрокой(ТекущаяДата()));
	// BSLLS:DeprecatedCurrentDate-on
	props.Вставить("Data"				,СоответствиеData());
	props.Вставить("sync"				,Автозапуск);
	props.Вставить("parent"				,parent);
	props.Вставить("SystemId"			,"");
	props.Вставить("Connector"			,"Robot1C");
	props.Вставить("ProductId"			,"robot_blockly_1c");
	NextRun = ПересчитатьДатуСледующегоЗапуска();
	NextRun = УниверсальноеВремяСтрокой(NextRun);
	Если Автозапуск = Истина Тогда
		props.Вставить("NextRun"			,NextRun);
	Иначе
		props.Вставить("NextRun"			,Неопределено);
	КонецЕсли;
	props.Вставить("StatusID"			,100);
	ЗаписатьСвойствоParentНаСервере(parent);
	params = Новый Структура("props,ini", Props, МассивINI); 
	res = ТранспортИнтеграции.local_helper_write_connection(context_params, params);
   	Этаформа.Идентификатор = ИдентификаторНовый;
	Возврат res;
КонецФункции

&НаСервере
Функция МассивИзмененныхНаправленийСинхронизации()
	МодульОбъекта = МодульОбъекта();
	
	ТаблицаОбъектовНаправлений = Новый ТаблицаЗначений;
	ТаблицаОбъектовНаправлений.Колонки.Добавить("ИмяОбъекта");
	ТаблицаОбъектовНаправлений.Колонки.Добавить("Направление");
	ДеревоЗначений = ПолучитьДеревоНастроекПодключения();
	Для Каждого Ветка ИЗ ДеревоЗначений.Строки Цикл
		Для Каждого СтрокаВетки ИЗ Ветка.Строки Цикл
			НоваяСтрока = ТаблицаОбъектовНаправлений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаВетки);
		КонецЦикла;	
	КонецЦикла;
	
	ТаблицаНаправлений = ТаблицаОбъектовНаправлений.Скопировать();
	ТаблицаНаправлений.Свернуть("Направление");
	МассивРезультат = Новый Массив;
	Для Каждого ЗаписьНаправление ИЗ ТаблицаНаправлений Цикл	
		Если ЗаписьНаправление.Направление = 0 Тогда
			Продолжить;
		КонецЕсли;	
		ОтборТаблицы = Новый Структура("Направление", ЗаписьНаправление.Направление);
		ОтборПоНаправлениям = ТаблицаОбъектовНаправлений.НайтиСтроки(ОтборТаблицы);
		МассивДляЗаписи = Новый Массив;
		Для Каждого ЗаписьОтбора ИЗ ОтборПоНаправлениям Цикл
			МассивДляЗаписи.Добавить(ЗаписьОтбора.ИмяОбъекта);
		КонецЦикла;			                                  
		Если МассивДляЗаписи.Количество() > 0 Тогда  	
			params = Новый Структура;
			params.Вставить("ConnectionId", 	ИдентификаторНовый);
			params.Вставить("ListTypeObject", 	МассивДляЗаписи);
			params.Вставить("Direction", 		ЗаписьНаправление.Направление); 
			МассивРезультат.Добавить(params);
		КонецЕсли;	
	КонецЦикла;
	Возврат МассивРезультат;	
КонецФункции	

&НаКлиенте
Процедура ИзменитьНаправленияСинхронизации()
	Если ЭтоСинхронизация = Ложь Тогда 
		Возврат;
	КонецЕсли;
	МассивНаправленийСинхронизации = МассивИзмененныхНаправленийСинхронизации();
	Для Каждого params Из МассивНаправленийСинхронизации Цикл 
		ТранспортИнтеграции.local_helper_api3_typesyncobjectmasssetdirection(context_params, params);
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДеревоНастроекНаСервере(Знач ТаблицаНастроек)
	МодульОбъекта = МодульОбъекта();
		
	ДеревоЗначений = ПолучитьДеревоНастроекПодключения();
	ДеревоЗначений.Строки.Очистить();
    Если ТаблицаНастроек.Количество() > 0 Тогда
		Для Каждого Запись ИЗ ТаблицаНастроек Цикл
			Если get_prop(Запись, "Parent@", Неопределено) = Истина Тогда
				НоваяВетка = ДеревоЗначений.Строки.Добавить();
				НоваяВетка.Объект = get_prop(Запись,"ObjectName","");
			Иначе	
			    НоваяСтрокаВетки = НоваяВетка.Строки.Добавить();
				НоваяСтрокаВетки.Объект 				= get_prop(Запись,"ObjectName","");
				НоваяСтрокаВетки.Направление 			= get_prop(Запись,"SyncStatus","");
				НоваяСтрокаВетки.НаправленияВозможные 	= РазобратьНаправлениеПоУмолчанию(get_prop(Запись,"PossibleStatus",""));
				НоваяСтрокаВетки.ИмяОбъекта 			= get_prop(Запись,"ObjId","");
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
	ОтобразитьДеревоНастроекПодключения(ДеревоЗначений);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеревоНастроек()	
	ТаблицаНастроек = BlocklyExecutor.НаправленияСинхронизации(context_params, Идентификатор);
	ЗаполнитьДеревоНастроекНаСервере(ТаблицаНастроек);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодДействия(connectionParam)
	Если connectionParam.Получить("StartTime") <> Неопределено Тогда
		ЭтаФорма.ВремяНачала = "01.01.01 " + connectionParam["StartTime"] + ":00";
	КонецЕсли;
	Если connectionParam.Получить("EndTime") <> Неопределено Тогда
		ЭтаФорма.ВремяОкончания = "01.01.01 " + connectionParam["EndTime"] + ":00";
	КонецЕсли;
	НачальнаяДатаВремя = Дата(1, 1, 1, 0, 0, 0);	
	Секунды59 = 59;
	Если ЭтаФорма.ВремяНачала = НачальнаяДатаВремя 
		И ЭтаФорма.ВремяОкончания = КонецДня(НачальнаяДатаВремя) - Секунды59 Тогда  
		ЭтаФорма.БезОграниченийВремени = Истина;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьconnectionParam(Data)
	connectionParam = get_prop(Data, "connectionParam", Неопределено); 
	Если ТипЗнч(connectionParam) <> Тип("Соответствие") Тогда 
		Возврат;
	КонецЕсли;	
	Периодичность = get_prop(connectionParam, "PeriodicityType", Периодичность);
	ПериодичностьДня = get_prop(connectionParam, "RepeatTime", ПериодичностьДня);
	ЗаполнитьПериодДействия(connectionParam);
	ВидимостьГруппаАвтоЗапускаДниНедели(Периодичность = 1);
	МассивПоДнямНедели = connectionParam.Получить("DaysSelect");	
	Если ТипЗНч(МассивПоДнямНедели) <> Тип("Массив") Тогда 
		Возврат;
	КонецЕсли;	
	Этаформа.Пн = Ложь; Этаформа.Вт = Ложь; Этаформа.Ср = Ложь; 
	Этаформа.Чт = Ложь; Этаформа.Пт = Ложь; Этаформа.Сб = Ложь; Этаформа.Вс = Ложь;
	Для Каждого Запись ИЗ МассивПоДнямНедели Цикл 
		Если Запись = "1" Тогда Этаформа.Пн = Истина 
		ИначеЕсли Запись = "2" Тогда Этаформа.Вт = Истина	
		ИначеЕсли Запись = "3" Тогда Этаформа.Ср = Истина	
		ИначеЕсли Запись = "4" Тогда Этаформа.Чт = Истина	
		ИначеЕсли Запись = "5" Тогда Этаформа.Пт = Истина	
		ИначеЕсли Запись = "6" Тогда Этаформа.Сб = Истина	
		Иначе Этаформа.Вс = Истина
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиData(Data)  
	ЗаполнитьconnectionParam(Data);	
	Если Data.Получить("OperationId") <> Неопределено Тогда
		Этаформа.Алгоритм = Data["OperationId"];
	КонецЕсли;	
	Этаформа.endpoint = get_prop(Data, "Endpoint", "");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоОперации()
	МассивИНИ = Неопределено;
	ПараметрыОперации = Новый Структура("id,Версия,INI",Идентификатор,Версия,МассивИНИ); 
    АвтоматическаяОперация = ТранспортИнтеграции.local_helper_read_connection(context_params, ПараметрыОперации);
 	ЭтаФорма.parent = АвтоматическаяОперация.Получить("parent");
	ЭтаФорма.Автозапуск = АвтоматическаяОперация.Получить("sync");
	LastRun = АвтоматическаяОперация.Получить("LastRun"); 
	Этаформа.Подсистема = АвтоматическаяОперация.Получить("subsystem");
	Если ЗначениеЗаполнено(LastRun) Тогда
		Этаформа.ДатаВремяПоследнегоЗапуска = ПреобразоватьСтрокуВДатуСЧасовымПоясом(LastRun);
	КонецЕсли;
	NextRun = АвтоматическаяОперация.Получить("NextRun"); 
	Если ЗначениеЗаполнено(NextRun) Тогда
		Этаформа.ДатаВремяСледующегоЗапуска = ПреобразоватьСтрокуВДатуСЧасовымПоясом(NextRun);
	КонецЕсли;
	Статус = get_prop(АвтоматическаяОперация, "StatusID", Неопределено);
	ЭлемФормы = ПолучитьЭлементыФормы();
	Если ЗначениеЗаполнено(Статус) И Статус > 0 И Статус <> 100 Тогда  
		ЭлемФормы.ДекорацияСтатусОшибка.Видимость = Истина;
		ЭлемФормы.ДекорацияСтатусВыполнено.Видимость = ЛОЖЬ;
	Иначе
		ЭлемФормы.ДекорацияСтатусВыполнено.Видимость = Истина;
		ЭлемФормы.ДекорацияСтатусОшибка.Видимость = ЛОЖЬ;
	КонецЕсли;
	Data = АвтоматическаяОперация["Data"]; 
	ЭтаФорма.dataСтрокой = local_helper_json_encode(Data);
	ЗаполнитьНастройкиData(Data);
	ЭтаФорма.НаименованиеПодключения = АвтоматическаяОперация.Получить("name_connection");                                         
	ЗаполнитьДеревоНастроек();

	//ExtSysUid = АвтоматическаяОперация.Получить("SystemId");
КонецПроцедуры

&НаСервере
Процедура АктивироватьРегламентноеЗаданиеАвтоматическихОперацийНаСервере()
	МодульОбъекта = МодульОбъекта();
	МодульОбъекта.АктивироватьРегламентноеЗаданиеАвтоматическихОпераций();	
КонецПроцедуры

&НаСервере
Функция SystemInfoRobot()
	МодульОбъекта = МодульОбъекта();
	Возврат	МодульОбъекта.local_helper_system_info(Истина);
КонецФункции

&НаКлиенте
Процедура ЗаписатьСтатистику(ЭтоНовоеПодключение)
	SystemInfoRobot = SystemInfoRobot();
	ActionContext = ?(ЭтоНовоеПодключение, "Создание интеграции", "Изменение интеграции");
	Action = ТранспортИнтеграции.local_helper_element_action("Other", ActionContext, Новый Структура, 1);
	Actions = Новый Массив;
	Actions.Добавить(Action);
	ТранспортИнтеграции.local_helper_register_actions(context_params, Actions, SystemInfoRobot);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПодключение() 
	ЭтоНовоеПодключение = (ИдентификаторНовый <> Идентификатор);
	Если ЭтоСинхронизация И ЗначениеЗаполнено(НазваниеПланаОбмена) Тогда   
		БазоваяКонфигурация = ЭтоБазоваяКонфигурация();
		Если БазоваяКонфигурация Тогда  
			ТекстСообщения = "Для базовой конфигурации выбранный алгоритм невозможно выполнить: 
							 |отсутствует возможность работы с планами обмена";
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		СоздатьУзелПланаОбмена();
	КонецЕсли;
	ЗаписатьПодключение();
	ЗаписатьСтатистику(ЭтоНовоеПодключение);
	Если ЭтоСинхронизация Тогда
		ИзменитьНаправленияСинхронизации();	
		Если ЭтоНовоеПодключение Тогда 
			ФиксацияНачалаОбмена();
		КонецЕсли;
	КонецЕсли;
	Если Автозапуск Тогда
		АктивироватьРегламентноеЗаданиеАвтоматическихОперацийНаСервере();	
	КонецЕсли;
	Оповестить("ОбновитьАвтоматическиеОперации");
КонецПроцедуры

&НаСервереБезКонтекста
Функция КодироватьСтрокуНаСервере(Знач НазваниеАлгоритма) 
	Возврат КодироватьСтроку(НазваниеАлгоритма,СпособКодированияСтроки.КодировкаURL); 
КонецФункции

&НаКлиенте
Процедура АвтозапускПриИзменении(Элемент)
	ОбновитьАвтозапуск();
	ИзменитьМодифицированность(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПослеНастройкиФильтров(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Этаформа.dataСтрокой = Результат;
		Этаформа.ПредставлениеФильтров = ПолучитьПредставлениеФильтра();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАвтозапуск()
	Если Автозапуск = Истина Тогда
		ВидимостьГруппаАвтоЗапускаВложенная(Истина);
		ВидимостьГруппаДатаВремяСледующегоЗапуска(Истина);
	Иначе
		ВидимостьГруппаАвтоЗапускаВложенная(Ложь);
		ВидимостьГруппаДатаВремяСледующегоЗапуска(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияАлгоритма(Результат, ДополнительныеПараметры) Экспорт
	ЭлемФормы = ПолучитьЭлементыФормы();
	Этаформа.ИдетПроцессВыполнения = Ложь;
	ЭлемФормы.Запуск.Видимость = Истина;
	ЭлемФормы.ВПроцессе.Видимость = Ложь;
	ЗаполнитьРеквизитыПоОперации();	
	Если ЭтоСинхронизация Тогда 
		ЗаполнитьИсториюОбмена(); 
	КонецЕсли;
	Оповестить("ОбновитьАвтоматическиеОперации");
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораОтветаПередЗакрытием(Результат, ДополнительныеПараметры) Экспорт  
	Если Результат = КодВозвратаДиалога.Нет Тогда
        ИзменитьМодифицированность(Ложь);
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		Сохранить(ИСТИНА);
	Иначе
		Возврат;
    КонецЕсли;		
КонецПроцедуры	

&НаСервере
Функция СтрокаСостоянияИсторииСинхронизации(СтрокаРаспределения, Цвет)
	ИтоговаяСтрока = "";
	Если СтрокаРаспределения <> Неопределено И СтрокаРаспределения.КоличествоКубов > 0 Тогда
		КоличествоБлоков = СтрокаРаспределения.КоличествоКубов;	
		Сч = 1;
		Пока Сч <= КоличествоБлоков Цикл 
		//	ИтоговаяСтрока = ИтоговаяСтрока + "<div class = ""block "+Цвет+"block"">1</div>";
			ИтоговаяСтрока = Новый ФорматированнаяСтрока(ИтоговаяСтрока, Новый ФорматированнаяСтрока(Символ(9632),,Цвет));
			Сч = Сч + 1;
		КонецЦикла;
	КонецЕсли;
	Возврат ИтоговаяСтрока;
КонецФункции

&НаСервере
Процедура ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, НазваниеЭтапа)
	НоваяСтрока = ТаблицаРаспределения.Добавить(); 
	НоваяСтрока.НазваниеЭтапа = НазваниеЭтапа;
	Попытка 
		НоваяСтрока.ПроцентыЭтапа = ЗаписьИсторииОбмена[НазваниеЭтапа];
	Исключение 
		НоваяСтрока.ПроцентыЭтапа = 0;
	КонецПопытки;
	НоваяСтрока.КоличествоКубов = 0;	
КонецПроцедуры	

&НаСервере
Функция РаспределениеКубовИсторииОбмена(ЗаписьИсторииОбмена, ВсегоКубов)
	ТаблицаРаспределения = Новый ТаблицаЗначений;
	ТаблицаРаспределения.Колонки.Добавить("НазваниеЭтапа");
	ТаблицаРаспределения.Колонки.Добавить("ПроцентыЭтапа");
	ТаблицаРаспределения.Колонки.Добавить("КоличествоКубов");
	
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "DonePercent");
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "WarningPercent");
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "WritePercent");
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "PreparePercent");
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "ErrorPercent");
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "IgnorePercent");
	ДобавитьСтрокуТаблицыРаспределения(ТаблицаРаспределения, ЗаписьИсторииОбмена, "WorkPercent");
	
	ТаблицаРаспределения.Сортировать("ПроцентыЭтапа");
	
	Для СчТаблицы = 0 По ТаблицаРаспределения.Количество()-1 Цикл  
		СтрокаТаблицы = ТаблицаРаспределения.Получить(СчТаблицы);
		Если СчТаблицы = ТаблицаРаспределения.Количество() - 1 Тогда
			СтрокаТаблицы.КоличествоКубов = ВсегоКубов - ТаблицаРаспределения.Итог("КоличествоКубов");
		ИначеЕсли СтрокаТаблицы.ПроцентыЭтапа > 0 Тогда
			СтрокаТаблицы.КоличествоКубов = Окр(СтрокаТаблицы.ПроцентыЭтапа/100 * ВсегоКубов, 0, РежимОкругления.Окр15как20);	
			Если СтрокаТаблицы.КоличествоКубов = 0 Тогда
				СтрокаТаблицы.КоличествоКубов = 1; 
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;	
	КонецЦикла;	
	Возврат ТаблицаРаспределения;
КонецФункции	

&НаСервере
Процедура ВывестиБлокиВТабличныйДокумент(НазваниеБлока, ТаблицаБлоков, ТабличныйДокумент, ОбластьБлока) 
	СтрокаБлока = ТаблицаБлоков.Найти(НазваниеБлока);
	Если СтрокаБлока <> Неопределено Тогда
		КоличествоКубов = СтрокаБлока.КоличествоКубов;
		Сч = 1;
		Пока Сч <= КоличествоКубов Цикл
			ТабличныйДокумент.Присоединить(ОбластьБлока);
			Сч = Сч + 1;
		КонецЦикла;	
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ПостроитьОтчетИсторияОбмена(Знач МассивИсторииОбмена)
	МодульОбъекта = МодульОбъекта();
	ИсторияОбменаТабличныйДокумент = РеквизитИсторияОбмена();  
	ИсторияОбменаТабличныйДокумент.Очистить();
	ТаблицаИсторииОбмена = МодульОбъекта.МассивВТаблицуЗначений(МассивИсторииОбмена);	
	ВсегоБлоков = 10;	
	ДатаПредыдущейЗаписи = Дата(1,1,1); 
	ТабличныйДокумент = Новый ТабличныйДокумент;
	МакетИсторияОбмена = ПолучитьМакетНаСервере("ИсторияОбмена");
	ОбластьШапка = МакетИсторияОбмена.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	СтрокаТаблицыПерваяОсновная = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Основная");
	СтрокаТаблицыВтораяОсновная = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыВторая|Основная");
	КолонкаКрасный = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Красный");
	КолонкаОранжевый = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Оранжевый");
	КолонкаСиний = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Синий");
	КолонкаЗеленый = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Зеленый");
	КолонкаФиолетовый = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Фиолетовый");
	КолонкаСерый = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Серый");
	КолонкаГолубой = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыПервая|Голубой");
	ВремяПроцессаОбласть = МакетИсторияОбмена.ПолучитьОбласть("СтрокаТаблицыВторая|ВремяПроцессаВертикальное");
	Для Каждого Запись Из ТаблицаИсторииОбмена Цикл  
		ТаблицаРаспределенияКубов = РаспределениеКубовИсторииОбмена(Запись, ВсегоБлоков);  
		СтрокаСинхронизации 	= context_params.api_url+"/ext-sync-doc/page?extSyncDocId="+Запись.ExtSyncDocID;//+"&selectedTab=objects";
		ДатаЗаписи = Запись.Date;
		Если ТипЗнч(ДатаЗаписи) = Тип("Строка") Тогда 
			ДатаЗаписи 				= Дата(ПРАВ(Запись.Date,4),СРЕД(Запись.Date,4,2),ЛЕВ(Запись.Date,2));
		КонецЕсли;	
		ВремяЗаписи 			= ЛЕВ(Запись.Time,5);
		
		Если ДатаПредыдущейЗаписи <> ДатаЗаписи Тогда
			СтрокаТаблицыПерваяОсновная.ТекущаяОбласть.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
			СтрокаТаблицыПерваяОсновная.Параметры.ДатаЗаписи = Формат(ДатаЗаписи,"ДФ=dd.MM.yy")+"  ";
			СтрокаТаблицыВтораяОсновная.Параметры.ВремяЗаписи = ВремяЗаписи+"  ";
		Иначе  
			СтрокаТаблицыПерваяОсновная.ТекущаяОбласть.ЦветТекста = WebЦвета.ТусклоСерый;
			СтрокаТаблицыПерваяОсновная.Параметры.ДатаЗаписи = ВремяЗаписи+"  ";
			СтрокаТаблицыВтораяОсновная.Параметры.ВремяЗаписи = "";
		КонецЕсли;
		СтрокаТаблицыПерваяОсновная.Параметры.СтрокаСинхронизации = СтрокаСинхронизации;
		СтрокаТаблицыПерваяОсновная.Параметры.Название = Запись.Title;	
		СтрокаТаблицыПерваяОсновная.Параметры.КоличествоОбъектов = Запись.CountObjects;	
		СтрокаТаблицыПерваяОсновная.Параметры.Проценты = Строка(Запись.TotalPercent) + "%";
		ТабличныйДокумент.Вывести(СтрокаТаблицыПерваяОсновная);
		
		ВывестиБлокиВТабличныйДокумент("DonePercent", 	ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаЗеленый); 	
		ВывестиБлокиВТабличныйДокумент("WarningPercent", ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаОранжевый); 	
		ВывестиБлокиВТабличныйДокумент("WritePercent", 	ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаГолубой); 	
		ВывестиБлокиВТабличныйДокумент("PreparePercent", ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаСиний); 	
		ВывестиБлокиВТабличныйДокумент("ErrorPercent", ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаКрасный); 	
		ВывестиБлокиВТабличныйДокумент("IgnorePercent", ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаФиолетовый); 	
		ВывестиБлокиВТабличныйДокумент("WorkPercent", ТаблицаРаспределенияКубов, ТабличныйДокумент, КолонкаСерый); 	
		
		ТабличныйДокумент.Вывести(СтрокаТаблицыВтораяОсновная);
		ВремяПроцессаОбласть.Параметры.ВремяПроцесса = СРЕД(Запись.ElapsedTime,12,8);
		ТабличныйДокумент.Присоединить(ВремяПроцессаОбласть);
		
		ДатаПредыдущейЗаписи 	= ДатаЗаписи;  															
	КонецЦикла;
	ТабличныйДокумент.ФиксацияСверху = 1;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ИсторияОбменаТабличныйДокумент.Вывести(ТабличныйДокумент);
	ИсторияОбменаТабличныйДокумент.ФиксацияСверху = 1;
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьИсториюОбмена() 
	Фильтр = Новый Структура("ConnectionId", ИдентификаторНовый);
	СчетчикСтраниц = 0;
	МассивИсторииОбмена = Новый Массив;
	Пока Истина Цикл
		res = ТранспортИнтеграции.local_helper_api3_extsyncdoc_list(context_params, Фильтр, Неопределено, Неопределено, СчетчикСтраниц);
		Result = res.Получить("Result");
		Если ТипЗнч(Result) = Тип("Массив") Тогда
			Для Каждого Запись Из Result Цикл   
				МассивИсторииОбмена.Добавить(Запись);
			КонецЦикла;	
		КонецЕсли;
		Если res.Получить("Navigation") <> Неопределено
			И res["Navigation"].Получить("HasMore") = Истина Тогда
			СчетчикСтраниц = СчетчикСтраниц + 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	ПостроитьОтчетИсторияОбмена(МассивИсторииОбмена);
КонецПроцедуры

&НаСервере
Функция РазобратьНаправлениеПоУмолчанию(ВозможныеНаправления)
	Если ТипЗнч(ВозможныеНаправления) <> Тип("Массив") Тогда
		Возврат 0;
	КонецЕсли;
	ТекущееЗначение = 0;
	ОписаниеТипа = Новый ОписаниеТипов("Число");
	Для Каждого ЗначениеМассива Из ВозможныеНаправления Цикл
		Если ТипЗнч(ЗначениеМассива) <> Тип("Соответствие") Тогда 
			Продолжить;
		КонецЕсли;	
		Попытка 
			ЗначениеЧислом = ЗначениеМассива.Получить("key");
		Исключение  
			Продолжить;
		КонецПопытки;
		ЗначениеЧислом = ОписаниеТипа.ПривестиЗначение(ЗначениеЧислом);
		Если ЗначениеЧислом = 2 Тогда
			Возврат ЗначениеЧислом;
		КонецЕсли;	
		Если ЗначениеЧислом > ТекущееЗначение Тогда
			ТекущееЗначение = ЗначениеЧислом;	
		КонецЕсли;	
	КонецЦикла;	
	Возврат ТекущееЗначение
КонецФункции	

&НаСервере
Функция ПересчитатьДатуСледующегоЗапуска()
	МодульОбъекта = МодульОбъекта();
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Периодичность", Периодичность);
	ПараметрыВыполнения.Вставить("ПериодичностьДня", ПериодичностьДня);	
	ПараметрыВыполнения.Вставить("ВремяНачала", Формат(ВремяНачала,"ДФ=ЧЧ:мм"));	
	ПараметрыВыполнения.Вставить("ВремяОкончания", Формат(ВремяОкончания,"ДФ=ЧЧ:мм"));	
	ПараметрыВыполнения.Вставить("МассивПоДнямНедели", МассивПоДнямНедели(Ложь));
	ДатаВремяЗапуска = МодульОбъекта.ДатаСледующегоЗапускаАлгоритмаПоПараметрам(ПараметрыВыполнения);
	ЭтаФорма.ДатаВремяСледующегоЗапуска = ДатаВремяЗапуска;
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	Если ДатаВремяЗапуска = "" Тогда 
		ЭлемФормы.ДатаВремяСледующегоЗапуска.Видимость = Ложь; 
	Иначе
		ЭлемФормы.ДатаВремяСледующегоЗапуска.Видимость = Истина; 	
	КонецЕсли;	
	Возврат ДатаВремяЗапуска; 
КонецФункции	

&НаКлиенте
Процедура ПослеВыбораСохраненияАлгоритма(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьПодключение();
		ИзменитьМодифицированность(Ложь);
		ЗапускАлгоритма();
	КонецЕсли;	
КонецПроцедуры	
	

&НаСервере
Функция ПараметрыЗапускаАлгоритма()
	СтруктураСоединения = Новый Структура;
	СтруктураСоединения.Вставить("connection_uuid", Идентификатор);
 	СтруктураСоединения.Вставить("operation_uuid",  Неопределено);
    context_params.Вставить("operation", СтруктураСоединения);

	ПараметрыОперации = Новый Соответствие();
	ПараметрыОперации.Вставить("Uuid", 					Идентификатор);
	ПараметрыОперации.Вставить("dataСтрокой",			dataСтрокой);
	ПараметрыОперации.Вставить("ИмяОбработки", 			ИмяОбработки);
	ПараметрыОперации.Вставить("ЭтоВнешняяОбработка", 	ЭтоВнешняяОбработка);
	ПараметрыОперации.Вставить("Title", 				НаименованиеПодключения);
	
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(ПараметрыОперации);
	ПараметрыВызова.Добавить(context_params);
	Возврат ПараметрыВызова;
КонецФункции



&НаКлиенте
Процедура ПослеВыбораЗначения(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений")  Тогда
		ЭлемФормы = ПолучитьЭлементыФормы();
		ЭлемФормы.ДеревоНастроекПодключения.ТекущиеДанные.Направление = Результат.Значение;	
		ИзменитьМодифицированность(Истина);
 	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРодителя(Родитель)
	Если Родитель <> Неопределено Тогда
		СтрокиРодителя = ПолучитьСтроки(Родитель);  
		Родитель.Отметка = ИСТИНА;
		Для Каждого СтрокаРодителя ИЗ СтрокиРодителя Цикл
			Если СтрокаРодителя.Отметка = ЛОЖЬ Тогда
				Родитель.Отметка = ЛОЖЬ;   
				Прервать;
			КонецЕсли;	
		КонецЦикла;		
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
Процедура ДеревоНастроекПодключенияОтметкаПриИзменении(Элемент)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ТекущиеДанные = ЭлемФормы.ДеревоНастроекПодключения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		СтрокиДерева = ПолучитьСтроки(ТекущиеДанные);;
		Для Каждого СтрокаДерева ИЗ СтрокиДерева Цикл
			СтрокаДерева.Отметка = ТекущиеДанные.Отметка;	
		КонецЦикла; 
		Родитель = ПолучитьРодителя(ТекущиеДанные);
		ИзменитьМодифицированность(Истина);
 		ПроверитьРодителя(Родитель);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаправление(Команда)
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("2","⇄  В обе стороны");
	СписокВыбора.Добавить("3","→ В Saby");
	СписокВыбора.Добавить("4","← В ИС");
	СписокВыбора.Добавить("1","x  Отключить");
	ВыборИзСписка(СписокВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВложенныеНаправления(ОбъектОбмена, ПереданноеЗначение)	
	ОбъектОбмена.Направление = ПереданноеЗначение;  
	ИзменитьМодифицированность(Истина);
	Если ОбъектОбмена.НаправленияВозможные = 2 Тогда
		Возврат;
	КонецЕсли;	
	Если ОбъектОбмена.НаправленияВозможные = 1 Тогда
		ОбъектОбмена.Направление = 1;
	КонецЕсли;	
	Если ОбъектОбмена.НаправленияВозможные <> ОбъектОбмена.Направление Тогда
		Если ОбъектОбмена.Направление = 2 Тогда
			ОбъектОбмена.Направление = ОбъектОбмена.НаправленияВозможные;
		Иначе
			ОбъектОбмена.Направление = 1;
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораВариантаУстановкиНаправления(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	ЭлементыДерева = ДеревоНастроекПодключения.ПолучитьЭлементы();  
	Для Каждого ВеткаДерева ИЗ ЭлементыДерева Цикл   
		СтрокиДерева = ВеткаДерева.ПолучитьЭлементы();
		Для Каждого СтрокаДерева ИЗ СтрокиДерева Цикл  
			Если СтрокаДерева.Отметка = Ложь Тогда 
				Продолжить;
			КонецЕсли;
			ИзменитьВложенныеНаправления(СтрокаДерева, Результат.Значение);		
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВариантаОтметки(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда 
		Возврат
	КонецЕсли;	
	ЭлементыДерева = ДеревоНастроекПодключения.ПолучитьЭлементы();
	Для Каждого ВеткаДерева ИЗ ЭлементыДерева Цикл   
		СтрокиДерева = ВеткаДерева.ПолучитьЭлементы();
		Для Каждого СтрокаДерева ИЗ СтрокиДерева Цикл 
			Если Результат.Значение = "Все" Тогда
				СтрокаДерева.Отметка = Истина;
			ИначеЕсли Результат.Значение = "Снять" Тогда
				СтрокаДерева.Отметка = Ложь;
			Иначе
				СтрокаДерева.Отметка = НЕ СтрокаДерева.Отметка;
			КонецЕсли;	
		КонецЦикла;
		Если Результат.Значение = "Все" Тогда
			ВеткаДерева.Отметка = Истина;
		ИначеЕсли Результат.Значение = "Снять" Тогда
			ВеткаДерева.Отметка = Ложь;
		Иначе
			ВеткаДерева.Отметка = Не ВеткаДерева.Отметка; 	
		КонецЕсли;
		ПроверитьРодителя(ВеткаДерева);
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьСнятьФлажки()  
	ЭлементыДерева = ПолучитьСтроки(ДеревоНастроекПодключения);
	Для Каждого ВеткаДерева ИЗ ЭлементыДерева Цикл   
		СтрокиДерева = ПолучитьСтроки(ВеткаДерева);
		Для Каждого СтрокаДерева ИЗ СтрокиДерева Цикл 
			СтрокаДерева.Отметка = УстановитьСнятьФлажки;
		КонецЦикла;
		ВеткаДерева.Отметка = УстановитьСнятьФлажки;
		ПроверитьРодителя(ВеткаДерева);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьОшибкуПолученияДанных(Показать, ТекстОшибки) 
	Если Показать Тогда
		Сообщить(ТекстОшибки, СтатусСообщения.Внимание);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтрокиБуфераОбмена(Результат, ДополнительныеПараметры) Экспорт 
	Возврат;
КонецПроцедуры	

&НаСервере
Функция ПолучитьПредставлениеФильтра()
	ПредставлениеФильтра = "Все объекты";
	
	МодульОбъекта = МодульОбъекта();
	Data = МодульОбъекта.local_helper_json_decode(dataСтрокой);
	Фильтры = Data.Получить("Filter"); 
	Если Фильтры <> Неопределено Тогда
		ЗначениеПредставлениеФильтра = Фильтры.Получить("description");
		Если ЗначениеЗаполнено(ЗначениеПредставлениеФильтра) Тогда  
			ПредставлениеФильтра = ЗначениеПредставлениеФильтра;	
		КонецЕсли;	
	КонецЕсли;	
		
	Возврат ПредставлениеФильтра;	
КонецФункции

&НаКлиенте
Процедура ДеревоНастроекПодключенияПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ДанныеСтроки.Направление = 1 Тогда
		ОформлениеСтроки.Ячейки.НаправлениеОтображение.Значение = "x";
	ИначеЕсли ДанныеСтроки.Направление = 2 Тогда
		ОформлениеСтроки.Ячейки.НаправлениеОтображение.Значение = "⇄"; 
	ИначеЕсли ДанныеСтроки.Направление = 3 Тогда
		ОформлениеСтроки.Ячейки.НаправлениеОтображение.Значение = "→"; 
	ИначеЕсли ДанныеСтроки.Направление = 4 Тогда	
		ОформлениеСтроки.Ячейки.НаправлениеОтображение.Значение = "←";
	Иначе
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПодключенияПриИзмененииФлажка(Элемент, Колонка)
	Если Колонка.Имя = "Отметка" Тогда  
		ДеревоНастроекПодключенияОтметкаПриИзменении(Неопределено);
	КонецЕсли;	
КонецПроцедуры

Функция ЭтотОбъектНаСервере()
	Возврат ЭтаФорма;
КонецФункции

&НаКлиенте
Функция ПериодПрописью(ДатНач, ДатКнц)
	СтрокаПериода = Неопределено;
	Если Год(ДатНач) <> Год(ДатКнц) Тогда
		СтрокаПериода = Формат(ДатНач, "ДФ=""д ММММ гггг""") + " - " + Формат(ДатКнц, "ДФ=""д ММММ гггг""");
	ИначеЕсли Месяц(ДатНач) <> Месяц(ДатКнц) Тогда
		СтрокаПериода = Формат(ДатНач, "ДФ=""д ММММ""") + " - " + Формат(ДатКнц, "ДФ=""д ММММ""") + " " + Формат(Год(ДатКнц), "ЧГ=0");	
	ИначеЕсли ДатНач = ДатКнц Тогда
		СтрокаПериода = Формат(ДатКнц, "ДФ=""д ММММ гггг""")
	Иначе
		СтрокаПериода = Строка(День(ДатНач)) + " - " + Формат(ДатКнц, "ДФ=""д ММММ""") + " "+ Формат(Год(ДатКнц), "ЧГ=0");	
	КонецЕсли;
	Возврат СтрокаПериода;
КонецФункции

&НаКлиенте
Процедура ОбновитьПанельФильтра() Экспорт
	// Формирует строковое представление по всем установленным параметрам фильтра	
	ТекущееЗначениеФильтра = "";
	ФильтрПериода = get_prop(ДанныеФильтра.Значения, "ФильтрПериод", "");
	Если ФильтрПериода = "За период" Тогда
		ТекущееЗначениеФильтра = ПериодПрописью(ДанныеФильтра.Значения.ФильтрДатаНач, ДанныеФильтра.Значения.ФильтрДатаКнц);
	КонецЕсли;	
	Если ФильтрПериода <> "За весь период" И ФильтрПериода <> "" Тогда
		ТекущееЗначениеФильтра = ФильтрПериода;
	КонецЕсли;
	ФильтрыПериода = Новый Массив;
	ФильтрыПериода.Добавить("ФильтрПериод");
	ФильтрыПериода.Добавить("ФильтрДатаНач");
	ФильтрыПериода.Добавить("ФильтрДатаКнц");
	Для Каждого ЭлемФильтр Из ДанныеФильтра.Значения Цикл
		Если ФильтрыПериода.Найти(ЭлемФильтр.Ключ) <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЭлемФильтр.Значение) Тогда
			Продолжить;
		КонецЕсли;	
		Для Каждого ПараметрОтображения Из ДанныеФильтра.ПараметрыОтображения Цикл
			Если get_prop(ПараметрОтображения,"Name", get_prop(ПараметрОтображения, "NAME", "")) = ЭлемФильтр.Ключ Тогда
				FilterTitle = get_prop(ПараметрОтображения, "Title", get_prop(ПараметрОтображения, "TITLE", "")); 
				ТекущееЗначениеФильтра = ТекущееЗначениеФильтра + ", " + FilterTitle + ": " + Строка(ЭлемФильтр.Значение);
				Прервать;
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
	
	Если Лев(ТекущееЗначениеФильтра, 2) = ", " Тогда
		ТекущееЗначениеФильтра = Сред(ТекущееЗначениеФильтра, 3);
	КонецЕсли;
	
	Если ТекущееЗначениеФильтра = "" Тогда
		ТекущееЗначениеФильтра = "Все объекты";
    КонецЕсли;
	
	ЭтаФорма.ПредставлениеФильтров = ТекущееЗначениеФильтра;
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьФильтр() Экспорт
	ОбновитьПанельФильтра();
	ИзменитьМодифицированность(Истина);
КонецПроцедуры

&НаСервере
Функция Api3ObjectНаСервере(Знач СсылкаНаОбъект)
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.Api3Object(СсылкаНаОбъект, "",,, Истина);	
КонецФункции

&НаКлиенте
Функция ПодготовитьApi3Object(СсылкаНаОбъект) 
	Api3Object = Api3ObjectНаСервере(СсылкаНаОбъект);
	Api3Object.Вставить("Название", get_prop(Api3Object, "Title"));  
	Integration = get_prop(context_params, "Integration");
	ClientType = get_prop(Api3Object, "ИмяИС");
	ClientId = Новый Массив;
	ClientId.Добавить(get_prop(Api3Object, "ИдИС"));
	МассивОбъектовМаппинга = ТранспортИнтеграции.local_helper_mapping_obj_findbyclientid(context_params, Integration, ClientType, ClientId);
	Если МассивОбъектовМаппинга.Количество() = 0 Тогда
		Возврат Api3Object;		
	КонецЕсли;
	Для Каждого Запись Из МассивОбъектовМаппинга Цикл 
		Статус = get_prop(Запись, "Status");
		Если Статус = 1 Тогда 
			Api3Object.Вставить("ИдСБИС", get_prop(Запись, "SbisId"));	
			Api3Object.Вставить("ИмяСБИС", get_prop(Запись, "SbisType"));
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Возврат Api3Object;		
КонецФункции

&НаКлиенте
Функция ПодготовитьФильтр()
	ТипыСтрокаЧислоБулево = Новый Массив;
	ТипыСтрокаЧислоБулево.Добавить(Тип("Строка"));
	ТипыСтрокаЧислоБулево.Добавить(Тип("Число"));
	ТипыСтрокаЧислоБулево.Добавить(Тип("Булево"));
	ФильтрПодключения = Новый Соответствие;
	Для Каждого Запись Из ДанныеФильтра.Значения Цикл
		Если НЕ ЗначениеЗаполнено(Запись.Значение) Тогда  
			Значение = Неопределено;
		ИначеЕсли ТипЗнч(Запись.Значение) = Тип("Дата") Тогда
			Значение = Формат(Запись.Значение, "ДФ=гггг-ММ-дд");
		ИначеЕсли ТипЗнч(Запись.Значение) = Тип("СписокЗначений") Тогда
			Значение = Новый Массив;
			Для Каждого ЗаписьМассива Из Запись.Значение Цикл 
				ЗначениеМассива = ЗаписьМассива.Значение;
				Если ТипЗнч(ЗаписьМассива) <> Тип("Строка") Тогда 
					ЗначениеМассива = ПодготовитьApi3Object(ЗаписьМассива.Значение);
				КонецЕсли;
				Значение.Добавить(ЗначениеМассива);
			КонецЦикла;
		ИначеЕсли ТипыСтрокаЧислоБулево.Найти(ТипЗнч(Запись.Значение)) = Неопределено Тогда
			Значение = ПодготовитьApi3Object(Запись.Значение);
		Иначе	
			Значение = Запись.Значение;
		КонецЕсли;
		ФильтрПодключения.Вставить(Запись.Ключ, Значение);
	КонецЦикла;
	Возврат ФильтрПодключения;
КонецФункции


#Область include_core_base_АвтоматическиеОперации_Form_РоботОперация_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ВызовФорм
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключенияНаСервере
#КонецОбласти

#Область include_core_base_Helpers_ConnectorLPP
#КонецОбласти

#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСерверСКлиента
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти
