
Процедура ПодсказкаКопировать()
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ИдентификаторПодключения.Подсказка = "Копировать в буфер обмена: " + РеквизитИдентификаторПодключения();
КонецПроцедуры

Процедура ВидимостьГруппаВремяЗапуска(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаПериодичностьДня.Страницы.ГруппаВремяЗапуска.Видимость = Видимость;
	Если Видимость = Истина Тогда
		ЭлемФормы.ГруппаПериодичностьДня.ТекущаяСтраница = ЭлемФормы.ГруппаПериодичностьДня.Страницы.ГруппаВремяЗапуска;
	КонецЕсли;	
КонецПроцедуры

Процедура ВидимостьГруппаБезОграничений(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаПериодичностьДня.Страницы.ГруппаБезОграничений.Видимость = Видимость;
	Если Видимость = Истина Тогда
		ЭлемФормы.ГруппаПериодичностьДня.ТекущаяСтраница = ЭлемФормы.ГруппаПериодичностьДня.Страницы.ГруппаБезОграничений;
	КонецЕсли;	
КонецПроцедуры

Процедура ВидимостьГруппаРазВДень(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаПериодичностьДня.Страницы.ГруппаРазВДень.Видимость = Видимость;
	Если Видимость = Истина Тогда
		ЭлемФормы.ГруппаПериодичностьДня.ТекущаяСтраница = ЭлемФормы.ГруппаПериодичностьДня.Страницы.ГруппаРазВДень;
	КонецЕсли;	
КонецПроцедуры

Процедура ВидимостьГруппаРезультат(Видимость)	
КонецПроцедуры

Процедура ВидимостьГруппаАвтоЗапускаВложенная(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы(); 
	ЭлемФормы.Периодичность.Доступность 			= Видимость;
	ЭлемФормы.Еженедельно.Доступность 				= Видимость;
	ЭлемФормы.ПериодичностьДня.Доступность 			= Видимость;
	ЭлемФормы.ГруппаПериодичностьДня.Доступность 	= Видимость;	
КонецПроцедуры

Процедура ВидимостьГруппаАвтоЗапускаДниНедели(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.Пн.Доступность = Видимость;
	ЭлемФормы.Вт.Доступность = Видимость;
	ЭлемФормы.Ср.Доступность = Видимость;
	ЭлемФормы.Чт.Доступность = Видимость;
	ЭлемФормы.Пт.Доступность = Видимость;
	ЭлемФормы.Сб.Доступность = Видимость;
	ЭлемФормы.Вс.Доступность = Видимость;	
КонецПроцедуры

Процедура ВидимостьГруппаДатаВремяСледующегоЗапуска(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ДатаВремяСледующегоЗапуска.Видимость = Видимость;	
КонецПроцедуры

Процедура ВидимостьГруппаОбъектыОбмена(Видимость)
	ЭтаФорма.Панель.Страницы.ГруппаОбъектыОбмена.Видимость = Видимость;			
КонецПроцедуры

Процедура ВидимостьГруппаИсторияОбмена(Видимость)
	ЭтаФорма.Панель.Страницы.ГруппаИсторияОбмена.Видимость = Видимость;		
КонецПроцедуры

Процедура ОтобразитьЦветКнопкиДняНедели(ИмяКоманды, ЗначениеПараметра) 
	ЭлемФормы = ПолучитьЭлементыФормы();
	Если ЗначениеПараметра = Ложь Тогда  
		ЭлемФормы[ИмяКоманды].ЦветТекстаКнопки = ШрифтНеактивногоЭлемента;
		ЭлемФормы[ИмяКоманды].ЦветФонаКнопки = ЦветаСтиля.ЦветФонаКнопки;
	Иначе
		ЭлемФормы[ИмяКоманды].ЦветТекстаКнопки = ШрифтАктивногоЭлемента;
		ЭлемФормы[ИмяКоманды].ЦветФонаКнопки = ЦветаСтиля.ЦветФонаПоля;
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьДеревоНастроекПодключения() 
	Возврат ДеревоНастроекПодключения;	
КонецФункции
	
Процедура ЗапускАлгоритма() 
	ПараметрыВызова = ПараметрыЗапускаАлгоритма();
	ЗапуститьАвтоматическуюОперацию(ПараметрыВызова, Неопределено);
КонецПроцедуры

Процедура СоздатьЭлементыПараметровАлгоритма(ПараметрыАлгоритма) 
    ТипыРеквизитов = Новый Соответствие;
    ТипыРеквизитов.Вставить("Строка", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки()));
    ТипыРеквизитов.Вставить("Число", Новый ОписаниеТипов("Число"));
    ТипыРеквизитов.Вставить("Булево", Новый ОписаниеТипов("Булево"));
    ТипыРеквизитов.Вставить("Дата", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
    ТипыРеквизитов.Вставить("ДатаВремя", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));

    ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
    ГруппаПараметрыАлгоритма = ЭлемФормы.Найти("ГруппаПараметрыАлгоритма"); 
    ГруппаПараметрыФильтра = ЭлемФормы.Найти("ГруппаПараметрыФильтры"); 
    Для Каждого ЭлементПараметр Из ГруппаПараметрыАлгоритма Цикл 
        Если Лев(ЭлементПараметр.Имя, 6) <> "Param_" Тогда 
            Продолжить;
        КонецЕсли;
        ЭлемФормы.Удалить(ЭлементПараметр);
    КонецЦикла;    
    Верх = 18;
    ШагРеквизита = 35;
    Если ГруппаПараметрыФильтра <> Неопределено И ГруппаПараметрыФильтра.Видимость = Истина Тогда 
        Верх = Верх + ШагРеквизита;    
    КонецЕсли;
    ЛевоНадпись = 6; 
    ВысотаЭлемент = 20;
    ШиринаНадпись = 100;
    ЛевоРеквизит = 110; 
    ШиринаРеквизит = 295;
    
    Для Каждого ПараметрАлгоритма Из ПараметрыАлгоритма Цикл
        ИмяПараметра = get_prop(ПараметрАлгоритма, "name");
        Если ИмяПараметра = "extsys_objects" Тогда
            Продолжить;
        КонецЕсли;
        Элем = ЭлемФормы.Добавить(Тип("Надпись"), "Param_Надпись" + ИмяПараметра, Истина, ГруппаПараметрыАлгоритма);
        Элем.Верх = Верх;
        Элем.Лево = ЛевоНадпись;
        Элем.Высота = ВысотаЭлемент;
        Элем.Ширина = ШиринаНадпись;
        Элем.Заголовок = get_prop(ПараметрАлгоритма, "title", "") + ":";
        
        ТипПоля = Тип("ПолеВвода");
        Элем = ЭлемФормы.Добавить(ТипПоля, "Param_" + ИмяПараметра, Истина, ГруппаПараметрыАлгоритма);
        Элем.ТипЗначения = get_prop(ТипыРеквизитов, get_prop(ПараметрАлгоритма, "type"));
        Элем.Верх = Верх;
        Элем.Лево = ЛевоРеквизит;
        Элем.Высота = ВысотаЭлемент;
        Элем.Ширина = ШиринаРеквизит;
        Элем.Значение = get_prop(ПараметрАлгоритма, "default");
        Элем.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ГруппаПараметрыАлгоритма,ГраницаЭлементаУправления.Лево);
           Верх = Верх + ШагРеквизита;    
    
    КонецЦикла;
КонецПроцедуры
