
Процедура ПодсказкаКопировать()
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.Копировать.Подсказка = "Копировать в буфер обмена: "+ИдентификаторНовый;
КонецПроцедуры

Процедура ВидимостьГруппаВремяЗапуска(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаПериодичностьДня.Страницы.ГруппаВремяЗапуска.Видимость = Видимость;
	Если Видимость = Истина Тогда
		ЭлемФормы.ГруппаПериодичностьДня.ТекущаяСтраница = ЭлемФормы.ГруппаПериодичностьДня.Страницы.ГруппаВремяЗапуска;
	КонецЕсли;	
КонецПроцедуры

Процедура ВидимостьГруппаБезОграничений(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаПериодичностьДня.Страницы.ГруппаБезОграничений.Видимость = Видимость;
	Если Видимость = Истина Тогда
		ЭлемФормы.ГруппаПериодичностьДня.ТекущаяСтраница = ЭлемФормы.ГруппаПериодичностьДня.Страницы.ГруппаБезОграничений;
	КонецЕсли;	
КонецПроцедуры

Процедура ВидимостьГруппаРазВДень(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаПериодичностьДня.Страницы.ГруппаРазВДень.Видимость = Видимость;
	Если Видимость = Истина Тогда
		ЭлемФормы.ГруппаПериодичностьДня.ТекущаяСтраница = ЭлемФормы.ГруппаПериодичностьДня.Страницы.ГруппаРазВДень;
	КонецЕсли;	
КонецПроцедуры

Процедура ВидимостьГруппаРезультат(Видимость)	
КонецПроцедуры

Процедура ВидимостьГруппаАвтоЗапускаВложенная(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы(); 
	ЭлемФормы.Периодичность.Доступность 			= Видимость;
	ЭлемФормы.Еженедельно.Доступность 				= Видимость;
	ЭлемФормы.ПериодичностьДня.Доступность 			= Видимость;
	ЭлемФормы.ГруппаПериодичностьДня.Доступность 	= Видимость;	
КонецПроцедуры

Процедура ВидимостьГруппаАвтоЗапускаДниНедели(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.Пн.Доступность = Видимость;
	ЭлемФормы.Вт.Доступность = Видимость;
	ЭлемФормы.Ср.Доступность = Видимость;
	ЭлемФормы.Чт.Доступность = Видимость;
	ЭлемФормы.Пт.Доступность = Видимость;
	ЭлемФормы.Сб.Доступность = Видимость;
	ЭлемФормы.Вс.Доступность = Видимость;	
КонецПроцедуры

Процедура ВидимостьГруппаДатаВремяСледующегоЗапуска(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ДатаВремяСледующегоЗапуска.Видимость = Видимость;	
КонецПроцедуры

Процедура ВидимостьГруппаОбъектыОбмена(Видимость)
	ЭтаФорма.Панель.Страницы.ГруппаОбъектыОбмена.Видимость = Видимость;			
КонецПроцедуры

Процедура ВидимостьГруппаИсторияОбмена(Видимость)
	ЭтаФорма.Панель.Страницы.ГруппаИсторияОбмена.Видимость = Видимость;		
КонецПроцедуры

Процедура ОтобразитьЦветКнопкиДняНедели(ИмяКоманды, ЗначениеПараметра) 
	ЭлемФормы = ПолучитьЭлементыФормы();
	Если ЗначениеПараметра = Ложь Тогда  
		ЭлемФормы[ИмяКоманды].ЦветТекстаКнопки = ШрифтНеактивногоЭлемента;
		ЭлемФормы[ИмяКоманды].ЦветФонаКнопки = ЦветаСтиля.ЦветФонаКнопки;
	Иначе
		ЭлемФормы[ИмяКоманды].ЦветТекстаКнопки = ШрифтАктивногоЭлемента;
		ЭлемФормы[ИмяКоманды].ЦветФонаКнопки = ЦветаСтиля.ЦветФонаПоля;
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьДеревоНастроекПодключения() 
	Возврат ДеревоНастроекПодключения;	
КонецФункции
	
Процедура ОтобразитьДеревоНастроекПодключения(ДеревоЗначений) 
	ДеревоНастроекПодключения = ДеревоЗначений;
КонецПроцедуры

Процедура ДеревоНастроекПодключенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя <> "НаправлениеОтображение" Тогда 
		Возврат;
	КонецЕсли;	
	СтандартнаяОбработка = ЛОЖЬ;
	ЭлемФормы = ПолучитьЭлементыФормы();
	СписокВыбора = Новый СписокЗначений;
	Если ВыбраннаяСтрока.НаправленияВозможные = 0 Тогда
	Иначе
		Если ВыбраннаяСтрока.НаправленияВозможные = 2 Тогда   
			СтрокаСостояния = "⇄  Синхронизировать в обе стороны";
			СписокВыбора.Добавить(2,СтрокаСостояния);	
		КонецЕсли;
		
		Если ВыбраннаяСтрока.НаправленияВозможные = 3
			ИЛИ ВыбраннаяСтрока.НаправленияВозможные = 2 Тогда
			СтрокаСостояния = "→ В СБИС";
			СписокВыбора.Добавить(3,СтрокаСостояния);	
		КонецЕсли;
		
		Если ВыбраннаяСтрока.НаправленияВозможные = 4 
			ИЛИ ВыбраннаяСтрока.НаправленияВозможные = 2 Тогда
			СтрокаСостояния = "← в ИС";
			СписокВыбора.Добавить(4,СтрокаСостояния);	
		КонецЕсли;	
		СтрокаСостояния = "x  Отключено";
		СписокВыбора.Добавить(1,СтрокаСостояния);
		
	КонецЕсли;	
	ВидОбмена = ВыбратьИзМеню(СписокВыбора,Элемент);  
	Если ВидОбмена <> Неопределено Тогда
		ВыбраннаяСтрока.Направление = ВидОбмена.Значение;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСтроки(Элемент)
	Возврат Элемент.Строки;
КонецФункции

Функция ПолучитьРодителя(Элемент)
	Возврат Элемент.Родитель;
КонецФункции

Функция ПолучитьМакетНаСервере(ИмяМакета)  
	Макет = ЭтотОбъект.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
КонецФункции

Процедура ЗапускАлгоритма() 
	ПараметрыВызова = ПараметрыЗапускаАлгоритма();
	ЗапуститьАвтоматическуюОперацию(ПараметрыВызова, Неопределено);
КонецПроцедуры

Процедура ВыборИзСписка(СписокВыбора)
	Результат = ВыбратьИзМеню(СписокВыбора,ЭлементыФормы.ДеревоНастроекПодключенияУстановитьНаправление);	
    ПослеВыбораВариантаУстановкиНаправления(Результат, Неопределено);
КонецПроцедуры

Функция РеквизитИсторияОбмена()
	ЭлемФормы = ПолучитьЭлементыФормы();
	Возврат ЭлемФормы.ИсторияОбменаТабличныйДокумент;
КонецФункции
