
&НаКлиенте
Процедура ПодсказкаКопировать()
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.КопироватьРасширеннаяПодсказка.Заголовок = "Копировать в буфер обмена: " + РеквизитИдентификаторПодключения();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьГруппаВремяЗапуска(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаВремяЗапуска.Видимость = Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьГруппаБезОграничений(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаБезОграничений.Видимость = Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьГруппаРазВДень(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаРазВДень.Видимость = Видимость;
КонецПроцедуры

Процедура ВидимостьГруппаРезультат(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемФормы.ГруппаРезультат.Видимость = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьГруппаАвтоЗапускаВложенная(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаАвтоЗапускаВложенная.Видимость = Видимость;	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьГруппаДатаВремяСледующегоЗапуска(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаДатаВремяСледующегоЗапуска.Видимость = Видимость;;	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьГруппаОбъектыОбмена(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.СтраницаОбъектыСинхронизации.Видимость = Видимость;	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьГруппаИсторияОбмена(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.ГруппаИсторияОбмена.Видимость = Видимость;;	
КонецПроцедуры

&НаСервере
Процедура ВидимостьГруппаАвтоЗапускаДниНедели(Видимость)
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемФормы.ГруппаАвтоЗапускаДниНедели.Видимость = Видимость;;	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЦветКнопкиДняНедели(ИмяКоманды, ЗначениеПараметра) 
	ЭлемФормы = ПолучитьЭлементыФормы();
	Если ЗначениеПараметра = Ложь Тогда
		ЭлемФормы[ИмяКоманды].ЦветТекста = ШрифтНеактивногоЭлемента;
		ЭлемФормы[ИмяКоманды].Пометка = ЛОЖЬ;
	Иначе
		ЭлемФормы[ИмяКоманды].Пометка = ИСТИНА;
		ЭлемФормы[ИмяКоманды].ЦветТекста = ШрифтАктивногоЭлемента; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРодителя(Элемент)
	Возврат Элемент.ПолучитьРодителя();
КонецФункции

&НаКлиенте
Процедура ЗапускАлгоритма() 
	context_params = ПроверитьНаличиеПараметровПодключенияНаСервере();
	ПараметрыВызова = ПараметрыЗапускаАлгоритма();
	ВидТранспорта = ТранспортИнтеграции.ВидТранспорта(context_params);
	ЭлемФормы = ПолучитьЭлементыФормы();
	ЭлемФормы.Запуск.Видимость = Ложь;
	ЭлемФормы.ВПроцессе.Видимость = Истина;	
	Если ВидТранспорта = "ExtSdk" Или ВидТранспорта = "ExtSdkCrypto" Или ВидТранспорта = "SabyPluginConnector"  Тогда
        ЗапускНаКлиенте();
		ПослеВыполненияАлгоритма(Неопределено, Неопределено);
		Возврат;
	КонецЕсли;	
	ПутьОбработкиДляВыполненияФоновогоЗадания();
	ПараметрыДлительныеОперации = Новый Структура;
	ПараметрыДлительныеОперации.Вставить("ДополнительнаяОбработкаСсылка",	Неопределено);
	Если ТипЗнч(ИмяОбработки) = Тип("Строка") Тогда
		ПараметрыДлительныеОперации.Вставить("ИмяОбработки",					ИмяОбработки); 
	Иначе     
		ПараметрыДлительныеОперации.Вставить("ДополнительнаяОбработкаСсылка",	ИмяОбработки); 	
	КонецЕсли;
	ПараметрыДлительныеОперации.Вставить("ИмяМетода",				"ЗапуститьАвтоматическуюОперацию");
	ПараметрыДлительныеОперации.Вставить("ПараметрыВыполнения",	ПараметрыВызова);
	ПараметрыДлительныеОперации.Вставить("ЭтоВнешняяОбработка",	ЭтоВнешняяОбработка);
	ИмяМодуляДлительныеОперации = ИмяМодуляДлительныеОперации();
	Если ИмяМодуляДлительныеОперации = Неопределено Тогда
		ВызватьИсключение "Отсутствует модуль для запуска длительной операции (Saby)";
	КонецЕсли;
	ВыполняемыйМетод = ИмяМодуляДлительныеОперации + ".ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ПараметрыДлительныеОперации);   
	ПараметрыЗадания.Добавить("");   
	ЗаголовокФормы = "Выполнение " + ЛокализацияНазваниеПродукта() + " " + НаименованиеПодключения;
	ФормаВладелец = ЭтаФорма;
	//ОповещениеОЗакрытииФормыФоновогоЗадания = Новый ОписаниеОповещения("ПослеВыполненияАлгоритма", ЭтаФорма);
	ОповещениеОЗакрытииФормыФоновогоЗадания = "ПослеВыполненияАлгоритма";	
		
	ОткрытьФормуДлительнойОперации(
		ВыполняемыйМетод,
		ПараметрыЗадания,
		ЗаголовокФормы,
		ФормаВладелец,
		ОповещениеОЗакрытииФормыФоновогоЗадания); 
	Этаформа.ИдетПроцессВыполнения = Истина;	
КонецПроцедуры

&НаКлиенте
Функция ПреобразоватьСтрокуВДатуСЧасовымПоясом(знач Строка) Экспорт    
	Строка = СокрЛП(Строка);
	Если Прав(Строка,3) <> ":00" Тогда
		Строка = Строка + ":00";
	КонецЕсли;
	ДатаСтрокойВФорматеJSON = СтрЗаменить(Строка," ","T"); 
	Попытка 
		#Если ВебКлиент Тогда
			Дата = ПреобразоватьСтрокуВДату("yyyy-MM-dd HH:mm:ss",Строка);
		#Иначе	
			Дата = XMLЗначение(Тип("Дата"), ДатаСтрокойВФорматеJSON);
		#КонецЕсли	
	Исключение
		Дата = ПреобразоватьСтрокуВДату("yyyy-MM-dd HH:mm:ss",Строка);
	КонецПопытки;	
	Возврат Дата; 
КонецФункции

&НаКлиенте
Функция УниверсальноеВремяСтрокой(ДатаВремя)
	ВремяУниверсальное = УниверсальноеВремя(ДатаВремя); 
	ВремяУниверсальноеСтрокой = Формат(ВремяУниверсальное,"ДФ=гггг-ММ-ддTЧЧ:мм:сс");
	ВремяУниверсальноеСтрокой = ВремяУниверсальноеСтрокой + "+0";
	Возврат ВремяУниверсальноеСтрокой;
КонецФункции

Процедура СоздатьРеквизитыПараметровАлгоритма(ПараметрыАлгоритма) 
    ТипыРеквизитов = Новый Соответствие;
    ТипыРеквизитов.Вставить("Строка", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки()));
    ТипыРеквизитов.Вставить("Число", Новый ОписаниеТипов("Число"));
    ТипыРеквизитов.Вставить("Булево", Новый ОписаниеТипов("Булево"));
    ТипыРеквизитов.Вставить("Дата", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
    ТипыРеквизитов.Вставить("ДатаВремя", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
    
    ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
    РеквизитыУдалить = Новый Массив();
    Реквизиты = Новый Массив();
    ТекущиеРеквизиты = ПолучитьРеквизиты();
    Для Каждого Рек Из ТекущиеРеквизиты Цикл 
        Если Лев(Рек.Имя, 6) <> "Param_" Тогда 
            Продолжить;
        КонецЕсли;
        НайденныйЭлементФормы = ЭлемФормы.Найти(Рек.Имя);
        Если НайденныйЭлементФормы <> Неопределено Тогда
            ЭлемФормы.Удалить(НайденныйЭлементФормы);    
        КонецЕсли;    
        РеквизитыУдалить.Добавить(Рек.Имя);        
    КонецЦикла;
    
    Для Каждого ПараметрАлгоритма Из ПараметрыАлгоритма Цикл 
        ИмяПараметра = get_prop(ПараметрАлгоритма, "name");
        Если ИмяПараметра = "extsys_objects" Тогда
            Продолжить;
        КонецЕсли; 
        ОписаниеТипов = get_prop(ТипыРеквизитов, get_prop(ПараметрАлгоритма, "type"));
        РеквизитЗаголовок = get_prop(ПараметрАлгоритма, "title", "");
        Рек = Новый РеквизитФормы("Param_" + ИмяПараметра, ОписаниеТипов, , РеквизитЗаголовок);
        Реквизиты.Добавить(Рек);
    КонецЦикла;
    ИзменитьРеквизиты(Реквизиты, РеквизитыУдалить);
КонецПроцедуры  

Процедура СоздатьЭлементыПараметровАлгоритма(ПараметрыАлгоритма) 
    СоздатьРеквизитыПараметровАлгоритма(ПараметрыАлгоритма);
    ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
    ГруппаПараметрыАлгоритма = ЭлемФормы.Найти("ГруппаПараметрыАлгоритма");
    Для Каждого ПараметрАлгоритма Из ПараметрыАлгоритма Цикл
        ИмяПараметра = get_prop(ПараметрАлгоритма, "name");
        Если ИмяПараметра = "extsys_objects" Тогда
            Продолжить;
        КонецЕсли;
        Элем = ДобавитьЭлементФормы("Param_" + ИмяПараметра, Тип("ПолеФормы"), ГруппаПараметрыАлгоритма);
        Элем.Вид = ВидПоляФормы["ПолеВвода"];
        Элем.ПутьКДанным = "Param_" + ИмяПараметра;
        ЭтаФорма["Param_" + ИмяПараметра] = get_prop(ПараметрАлгоритма, "default");
    КонецЦикла;
КонецПроцедуры

#Область include_core_base_ExtException
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_Form_РоботОперация_ОсобенностиПродукта
#КонецОбласти

#Область includr_core_base_Helpers_JSON 
#КонецОбласти

#Область includr_core_base_Helpers_ПреобразованиеТипов 
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСоСтроками 
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти
