
// BSLLS:MissingParameterDescription-off
// Сонар не видит описания

// Описание типа элемента параметра
//
// Параметры:
//  ТипПараметра - Тип блока - строка.
//
// Возвращаемое значение:
//  ОписаниеТипов - Описание типа реквитита
//
Функция ОписаниеТипаЭлементаПараметра(ТипПараметра)
	СтрокаДата = "Дата";
	СтрокаДатаВремя = "datetime";
	ТипыРеквизитов = Новый Соответствие;
	ТипыРеквизитов.Вставить("Строка", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки()));
	ТипыРеквизитов.Вставить("Число", Новый ОписаниеТипов("Число"));
	ТипыРеквизитов.Вставить("Булево", Новый ОписаниеТипов("Булево"));
	ТипыРеквизитов.Вставить(СтрокаДата, Новый ОписаниеТипов(СтрокаДата, , , , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТипыРеквизитов.Вставить(СтрокаДатаВремя, Новый ОписаниеТипов(СтрокаДата, , , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	ОписаниеТипов = get_prop(ТипыРеквизитов, ТипПараметра);
	// Блок для типа - даты ++
	// Для реквизита с типом даты может быть указана строка - "Обмен раньше не выполнялся"
	Если	ТипПараметра = СтрокаДата 
			Или ТипПараметра = СтрокаДатаВремя Тогда
		МассивОписанийТипов = Новый Массив;
		МассивОписанийТипов.Добавить(Тип("Строка"));
		МассивОписанийТипов.Добавить(Тип("Дата"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивОписанийТипов);
	КонецЕсли;
	// Блок для типа - даты --
	Возврат ОписаниеТипов;
КонецФункции
// BSLLS:MissingParameterDescription-on
