
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура(); 
	
	ОткрытьФорму("Обработка." + ПрефиксПродукта() + "SABY.Форма.ДокументыКЭДО", 
		ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка, , 
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти
