
#Область includr_core_base_ВстраиваниеВФормы_ГлавнаяСтраница1С_ОбработкаОбщейКомандыОткрытиеФормыБраузера
#КонецОбласти

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	context_params = МодульCoreКлиент().ПроверитьНаличиеПараметровПодключения();
	АдресСтраницы = "/connection-card/page?connectionId=" + МодульCoreКлиент().get_prop(context_params, "ConnectionUuid", "");
	ОткрытьАдресВФормеБраузера(АдресСтраницы, "Настройки");
КонецПроцедуры

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область includr_core_base_БазовыеКомпоненты_Модули_МодульCoreКлиент
#КонецОбласти
