
&НаКлиенте
Процедура Применить(Команда)
	ЭтаФорма.Закрыть(password);
КонецПроцедуры

&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент) //Из-за ошибки платформы на старых формах пришлось добавить переключение видимости элементов формы, и тогда форма обновляется, иначе пароль не отображается при нажатии
	ЭлемФормы = ПолучитьЭлементыФормы();
	Попытка
		ЭтаФорма.Password = ЭлемФормы.Пароль.ТекстРедактирования;
	Исключение
		ЭтаФорма.Password = ЭлемФормы.Пароль.Значение; //если ОФ, то ТекстРедактирования отсутствует, есть Значение
	КонецПопытки;
	ЭлемФормы.Пароль.Видимость = Ложь;
	Если ЭлемФормы.Пароль.РежимПароля Тогда 	
		ЭлемФормы.Пароль.РежимПароля = Ложь;
		Попытка
			ЭлемФормы.Пароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.СкрытьПароль;
		Исключение                  
			ЭлемФормы.Пароль.КнопкаВыбора = Ложь;	
		КонецПопытки;
   	Иначе
		ЭлемФормы.Пароль.РежимПароля = Истина;
		Попытка
			ЭлемФормы.Пароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.ПоказатьПароль;
		Исключение                  
			ЭлемФормы.Пароль.КнопкаВыбора = Ложь;	
		КонецПопытки;
	КонецЕсли; 
	ЭлемФормы.Пароль.Видимость = Истина;
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере(); 
	ЭтаФорма.Заголовок = get_prop(Параметры, "Заголовок", "Введите пароль");
	РасшифровкаВводаПароля = get_prop(Параметры, "РасшифровкаВводаПароля");  
	Если ЗначениеЗаполнено(РасшифровкаВводаПароля) Тогда 
		ЭлементыФормочки.РасшифровкаВводаПароля.Заголовок = РасшифровкаВводаПароля;
		ЭлементыФормочки.РасшифровкаВводаПароля.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры

#Область include_core_base_БазовыеКомпоненты_Form_ВводПароля_ОсобенностиПлатформы
#КонецОбласти


#Область include_core_base_Helpers_FormGetters
#КонецОбласти
