
#Область include_core_base_Helpers_ModuleGetters802
#КонецОбласти

// BSLLS:FunctionNameStartsWithGet-off

&НаКлиенте
Функция ПолучитьФормуТранспорта(context_param, ПараметрФормаВладелец = Неопределено)
	Возврат ЭтотОбъект;
КонецФункции
// BSLLS:FunctionNameStartsWithGet-on

// BSLLS:FunctionNameStartsWithGet-off

&НаКлиенте
Функция ПолучитьФормуBlockly(ПараметрФормаВладелец = Неопределено)
	Возврат ЭтотОбъект;
КонецФункции

// BSLLS:FunctionNameStartsWithGet-on

&НаКлиенте
Функция ПутьКФормамОбработки()
	Возврат "";
КонецФункции

Функция ФормаОсновнойОбработки(ИмяФормы, ПутьКФормам, ПарамФормы = Неопределено, ВладелецФормы = Неопределено)
	Фрм = ЭтотОбъект.ПолучитьФорму(ИмяФормы, ВладелецФормы);
	Если ЗначениеЗаполнено(ПарамФормы) Тогда
		Фрм.Параметры = ПарамФормы;
	КонецЕсли;
	Возврат Фрм;
КонецФункции

Функция ПолучитьСтраницуНаКлиенте(Элемент, ИмяСтраницы)
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции

Функция ПолучитьСтраницу(Элемент, ИмяСтраницы)
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции

// BSLLS:NumberOfOptionalParams-off

Процедура ОткрытьФормуОбработки(ИмяФормы, ПарамФормы = Неопределено, ВладелецФормы = Неопределено, Уникальность = Неопределено, 
								ОписаниеОповещения = Неопределено, РежимОткрытияОкна = Неопределено)
	Попытка
		ОткрываемаяФорма = ФормаОсновнойОбработки(ИмяФормы, "", ПарамФормы, ВладелецФормы);
	Исключение
		Попытка
			Картинка = БиблиотекаКартинок["Saby_Ошибка32"];
		Исключение
			Картинка = Неопределено;
		КонецПопытки;
		Если Картинка = Неопределено Тогда
			Попытка
				Картинка = БиблиотекаКартинок.Ошибка32;
			Исключение
				Картинка = Новый Картинка; // Если нет нужных картинок, то пустая
			КонецПопытки;
		КонецЕсли;
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			"Не смогли открыть форму """ + ИмяФормы + """!",
			Картинка);
		Возврат;
	КонецПопытки;
	РезультатИзФормы = ОткрываемаяФорма.ОткрытьМодально();
	ВыполнитьSabyОписаниеОповещения(ОписаниеОповещения, РезультатИзФормы);
КонецПроцедуры

// BSLLS:NumberOfOptionalParams-on

Функция ЭтотМодуль()
	Возврат ЭтаФорма;
КонецФункции

#Область include_core_base_Helpers_FormElements802
#КонецОбласти

