
#Область include_core_base_Helpers_ModuleGetters802
#КонецОбласти

&НаКлиенте
Функция ПолучитьФормуТранспорта(context_param)
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция ПолучитьФормуBlockly()
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция ПутьКФормамОбработки()
	Возврат "";
КонецФункции

// BSLLS-off
Функция ПолучитьФормуОбработки(ИмяФормы, ПутьКФормам, ПараметрыФормы = Неопределено, ВладелецФормы = Неопределено)
	Фрм = ЭтотОбъект.ПолучитьФорму(ИмяФормы, ВладелецФормы);
	Если ЗначениеЗаполнено(ПараметрыФормы) Тогда
		Фрм.Параметры = ПараметрыФормы;
	КонецЕсли;
	Возврат Фрм;
КонецФункции
// BSLLS-on

Функция ПолучитьСтраницуНаКлиенте(Элемент, ИмяСтраницы)
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции

Функция ПолучитьСтраницу(Элемент, ИмяСтраницы)
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции

Процедура ОткрытьФормуОбработки(ИмяФормы, ПараметрыФормы = Неопределено, ВладелецФормы = Неопределено, Уникальность=Неопределено, ОписаниеОповещения = Неопределено, РежимОткрытияОкна= Неопределено)
	Попытка
		ОткрываемаяФорма = ПолучитьФормуОбработки(ИмяФормы, "", ПараметрыФормы, ВладелецФормы);
	Исключение
		Попытка
			Картинка = БиблиотекаКартинок["Saby_Ошибка32"];
		Исключение
			Картинка = Неопределено;
		КонецПопытки;
		Если Картинка = Неопределено Тогда
			Попытка
				Картинка = БиблиотекаКартинок.Ошибка32;
			Исключение
				Картинка = Новый Картинка; // Если нет нужных картинок, то пустая
			КонецПопытки;
		КонецЕсли;
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			"Не смогли открыть форму """ + ИмяФормы + """!",
			Картинка,
			СтатусОповещенияПользователя.Важное);
		Возврат;
	КонецПопытки;
	РезультатИзФормы = ОткрываемаяФорма.ОткрытьМодально();
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, РезультатИзФормы);
КонецПроцедуры

Функция ЭтотМодуль()
	Возврат ЭтаФорма;
КонецФункции

#Область include_core_base_Helpers_FormElements802
#КонецОбласти


