
#Область include_core_base_Helpers_ModuleGetters
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьРеквизитГлавнойФормыМодульФормы
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьФункциональныеФормы
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьФормуОбработки
#КонецОбласти

&НаКлиенте
Функция ПутьКФормамОбработки()
	ИмяФормыПС = СтрЗаменить(ЭтаФорма.ИмяФормы, ".", Символы.ПС);
	ПутьКФормам = "";
	Для Счетчик = 1 По СтрЧислоСтрок(ИмяФормыПС)-1 Цикл
	    ПутьКФормам = ПутьКФормам + СтрПолучитьСтроку(ИмяФормыПС, Счетчик) + ".";
	КонецЦикла;
	Возврат ПутьКФормам;
КонецФункции

Функция ПолучитьСтраницу(Элемент, ИмяСтраницы)
	Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
КонецФункции

&НаКлиенте
Функция ПолучитьСтраницуНаКлиенте(Элемент, ИмяСтраницы)
	Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
КонецФункции

// BSLLS:NumberOfOptionalParams-off

&НаКлиенте
Процедура ОткрытьФормуОбработки(ИмяФормы, ПарамФормы = Неопределено, ВладелецФормы = Неопределено, Уникальность = Неопределено, 
								ОписаниеОповещения = Неопределено, РежимОткрытияОкна = Неопределено)
	ОткрытьФорму(ПутьКФормамОбработки() + ИмяФормы, ПарамФормы, ВладелецФормы,Уникальность, , , ОписаниеОповещения, РежимОткрытияОкна);
КонецПроцедуры

// BSLLS:NumberOfOptionalParams-on

&НаКлиенте
Функция ЭтотМодуль()
	Возврат ЭтаФорма;
КонецФункции

#Область include_core_base_Helpers_FormElements
#КонецОбласти

