
&НаКлиенте
Функция ПолучитьЭлементыФормы()
	Возврат Элементы;
КонецФункции

Функция ПолучитьЭлементыФормыНаСервере()
	Возврат Элементы;
КонецФункции

Функция ПолучитьЗначениеЭлемента(ИмяЭлемента)
	Возврат ЭтаФорма[ИмяЭлемента];
КонецФункции

&НаКлиенте
Функция СтрокаТаблицыФормы(Таблица, ИндексСтроки)
	Возврат Таблица.Получить(ИндексСтроки).ПолучитьИдентификатор();	
КонецФункции

Функция КопияТаблицыФормы(Таблица)
	Возврат Таблица.Выгрузить();	
КонецФункции

Процедура УстановитьЗначениеЭлемента(ИмяЭлемента, ЗначениеЭлемента)
	ЭтаФорма[ИмяЭлемента] = ЗначениеЭлемента;
КонецПроцедуры

&НаКлиенте
Функция СтрокиТаблицы(Элемент)
    Возврат Элемент.ПолучитьЭлементы();
КонецФункции
