
#Область include_core_base_Helpers_ModuleGetters
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьРеквизитГлавнойФормыМодульФормы
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьФункциональныеФормы
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьФормуОбработки
#КонецОбласти

Функция ПолучитьСтраницу(Элемент, ИмяСтраницы)
	Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
КонецФункции

&НаКлиенте
Функция ПолучитьСтраницуНаКлиенте(Элемент, ИмяСтраницы)
	Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
КонецФункции

#Область include_core_base_Helpers_ОткрытьФормуОбработки
#КонецОбласти

&НаКлиенте
Функция ЭтотМодуль()
	Возврат ЭтаФорма;
КонецФункции

#Область include_core_base_Helpers_FormElements
#КонецОбласти

#Область include_core_base_Helpers_ОписаниеОповещения
#КонецОбласти
