
#Область include_core_base_Helpers_ModuleGetters802
#КонецОбласти

// BSLLS:FunctionNameStartsWithGet-off

&НаКлиенте
Функция ПолучитьФормуТранспорта(context_param, ПараметрФормаВладелец = Неопределено)
	Возврат ЭтотОбъект;
КонецФункции
// BSLLS:FunctionNameStartsWithGet-on

// BSLLS:FunctionNameStartsWithGet-off

&НаКлиенте
Функция ПолучитьФормуBlockly(ПараметрФормаВладелец = Неопределено)
	Возврат ЭтотОбъект;
КонецФункции

// BSLLS:FunctionNameStartsWithGet-on

#Область include_core_base_Helpers_ПолучитьФормуОбработки802
#КонецОбласти

Функция ПолучитьСтраницуНаКлиенте(Элемент, ИмяСтраницы)
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции

Функция ПолучитьСтраницу(Элемент, ИмяСтраницы)
	Возврат Элемент.Страницы[ИмяСтраницы];
КонецФункции

#Область include_core_base_Helpers_ОткрытьФормуОбработки802
#КонецОбласти

Функция ЭтотМодуль()
	Возврат ЭтаФорма;
КонецФункции

#Область include_core_base_Helpers_FormElements802
#КонецОбласти

