
#Область include_core_base_Helpers_ModuleGetters
#КонецОбласти

&НаКлиенте
Функция ПутьКФормамОбработки()
	ИмяФормыПС = СтрЗаменить(ЭтаФорма.ИмяФормы, ".", Символы.ПС);
	ПутьКФормам = "";
	Для Счетчик = 1 По СтрЧислоСтрок(ИмяФормыПС)-1 Цикл
	    ПутьКФормам = ПутьКФормам + СтрПолучитьСтроку(ИмяФормыПС, Счетчик) + ".";
	КонецЦикла;
	Возврат ПутьКФормам;
КонецФункции

// BSLLS-off
&НаКлиенте
Функция ПолучитьФормуОбработки(ИмяФормыОбработки, ПутьКФормам, ПараметрыФормы = Неопределено, ВладелецФормы = Неопределено)
	Возврат ПолучитьФорму(ПутьКФормам + ИмяФормыОбработки, ПараметрыФормы, ВладелецФормы);
КонецФункции
// BSLLS-on

Функция ПолучитьСтраницу(Элемент, ИмяСтраницы)
	Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
КонецФункции

&НаКлиенте
Функция ПолучитьСтраницуНаКлиенте(Элемент, ИмяСтраницы)
	Возврат Элемент.ПодчиненныеЭлементы[ИмяСтраницы];
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуОбработки(ИмяФормы, ПараметрыФормы = Неопределено, ВладелецФормы = Неопределено, Уникальность=Неопределено, ОписаниеОповещения = Неопределено, РежимОткрытияОкна= Неопределено)
	ОткрытьФорму(ПутьКФормамОбработки() + ИмяФормы, ПараметрыФормы, ВладелецФормы,Уникальность,,,ОписаниеОповещения,РежимОткрытияОкна);
КонецПроцедуры

&НаКлиенте
Функция ЭтотМодуль()
	Возврат ЭтотОбъект;
КонецФункции

#Область include_core_base_Helpers_FormElements
#КонецОбласти

