
Функция ПолучитьЭлементыФормы()
	Возврат ЭлементыФормы;
КонецФункции

Функция ПолучитьЭлементыФормыНаСервере()
	Возврат ЭлементыФормы;
КонецФункции

Функция ПолучитьЗначениеЭлемента(ИмяЭлемента)
	Возврат ЭлементыФормы[ИмяЭлемента].Значение;
КонецФункции

Функция СтрокаТаблицыФормы(Таблица, ИндексСтроки)
	Возврат Таблица.Получить(ИндексСтроки);	
КонецФункции

Функция КопияТаблицыФормы(Таблица)
	Возврат Таблица.Скопировать();	
КонецФункции

Процедура УстановитьЗначениеЭлемента(ИмяЭлемента, ЗначениеЭлемента)
	ЭлементыФормы[ИмяЭлемента].Значение = ЗначениеЭлемента;
КонецПроцедуры
