// Читает строку JSON и преобразует в соответствие
//
// Параметры:
//  json - строка - исходная json-строка.
//  ВСоответствие - булево - если Истина, чтение JSON будет выполнено в Соответствие, если Ложь - в Структуру.
//
// Возвращаемое значение:
//  Соответствие - результат преобразования json-строки в соответствие
//
//DynamicDirective
Функция local_helper_json_decode(json, ВСоответствие = Истина) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(json);
	Попытка
		#Если ВебКлиент Тогда
			СтрокаВСоответсвие = ПрочитатьJSONНаСервере(ЧтениеJSON, ВСоответствие);
		#Иначе	
			СтрокаВСоответсвие = ПрочитатьJSON(ЧтениеJSON, ВСоответствие);
		#КонецЕсли
		//Для просмотра в отладке
		Возврат СтрокаВСоответсвие;
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение NewExtExceptionСтрока(ИнфоОбОшибке, "Ошибка чтения JSON");
	КонецПопытки;
КонецФункции

Функция	ПрочитатьJSONНаСервере(ЧтениеJSON,ВСоответствие)
	Возврат ПрочитатьJSON(ЧтениеJSON, ВСоответствие);
КонецФункции

// Преобразует соответствие в JSON
//
// Параметры:
//  ОбъектДляСериализации - соответствие - объект, который необходимо преобразовать в json.
//
// Возвращаемое значение:
//  Строка - результат преобразования соответствия в json
//
Функция local_helper_json_encode(ОбъектДляСериализации) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	//ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,ОбъектДляСериализации,,"ПоискОшибокСериализации", ЭтотОбъектНаСервере());
	Возврат ЗаписьJSON.Закрыть();	
КонецФункции

