
// Читает строку JSON и преобразует в соответствие
//
// Параметры:
//  json - строка - исходная json-строка.
//  ВСоответствие - булево - если Истина, чтение JSON будет выполнено в Соответствие, если Ложь - в Структуру.
//
// Возвращаемое значение:
//  Соответствие - результат преобразования json-строки в соответствие
//
//DynamicDirective
Функция local_helper_json_decode(json, ВСоответствие = Истина) Экспорт
	Возврат сбисПрочитатьJSON(json, , , Ложь, Не ВСоответствие);
КонецФункции

// Преобразует соответствие в JSON
//
// Параметры:
//  ОбъектДляСериализации - соответствие - объект, который необходимо преобразовать в json.
//
// Возвращаемое значение:
//  Строка - результат преобразования соответствия в json
//
//DynamicDirective
Функция local_helper_json_encode(ОбъектДляСериализации) Экспорт
	Возврат ПреобразоватьЗначениеВJSON(ОбъектДляСериализации);	
КонецФункции

// Старое АПИ для парсера

//DynamicDirective

// JSON парсер.
//
// Параметры:
//	Значение - Строка. Строка данных в формате JSON для парсинга;
//
//  Стандарт - Неопределено, Булево. Режим работы:
//		- Истина - стандартный режим (значение по умолчанию);
//		- Ложь - альтернативный режим;
//		- Неопределено - автоопределение режима;
//
//  ПредставленияСсылок - Неопределено, Булево. Режим передачи ссылочных типов, с их представлением или без:
//		- Истина - ссылки передаются вместе со своим представлением, как объекты с двумя свойствами содержащими саму ссылку и ее представление;
//		- Ложь - ссылки передаются без представления (значение по умолчанию).
//		- Неопределено - автоопределение режима.
// 
// Возвращаемое значение:
//  Набор данных согласно содержимому входящих данных. 
//
Функция сбисПрочитатьJSON(Значение, Стандарт = Истина, ПредставленияСсылок = Ложь, ПреобразовыватьДаты = Истина, ПриводитьКСтруктуре = Истина) Экспорт
	
	Возврат ПрочитатьJSONСтрокуВОбъект(Значение, Стандарт, ПредставленияСсылок, ПреобразовыватьДаты, ПриводитьКСтруктуре);
	
КонецФункции

//DynamicDirective

// Функция - вызвать значения В JSON
//
// Параметры:
//  ЗначениеПреобразовать	 - Произвольный				 - сериализуемый обътек
//  ПараметрыКонвертации	 - Неопределено, Структура	 - расширение
// 
// Возвращаемое значение:
//  Строка - Сериализованный в JSON объект
//
Функция ПреобразоватьЗначениеВJSON(ЗначениеПреобразовать, ПараметрыКонвертации=Неопределено) Экспорт
	
	Возврат СериализоватьПроизвольноеЗначениеВJSONСтроку(ЗначениеПреобразовать, ПараметрыКонвертации);
	
КонецФункции

