
&НаКлиенте
Функция ТикетДемоПользователя()
	Тикет = "";
	Если Найти(АдресСтраницы, ".sabyd.") > 0 Тогда
		Тикет = ТранспортИнтеграции.ТикетТекущейСессии(ЭтаФорма.context_params);
		Тикет = "&ticket=" + Тикет;
	КонецЕсли;		
	Возврат Тикет;
КонецФункции

&НаКлиенте
Функция API_ADDON_OPENURL(ПараметрыВызова)
	Тикет = ТикетДемоПользователя();
	Ссылка = get_prop(ПараметрыВызова, "Link") + Тикет;
	// BSLLS:UsingSynchronousCalls-off
	#Если ВебКлиент Тогда
		// Значит мы в расширении и значит подсисисема БСП присутсвует
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Ссылка);
	#Иначе	
		ЗапуститьПриложение(Ссылка);
	#КонецЕсли
	// BSLLS:UsingSynchronousCalls-on
	Возврат Неопределено;
КонецФункции

