
Процедура ГлобальныйКэшПрочитать() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	НазваниеПродукта = НазваниеПродукта();
	// BSLLS:UnusedLocalVariable-off
	ГлобальныйКэш = ХранилищеОбщихНастроек.Загрузить(НазваниеПродукта, "ГлобальныйКэш");
	// BSLLS:UnusedLocalVariable-on
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ГлобальныйКэшЗаписать(ГлобальныйКэш) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	НазваниеПродукта = НазваниеПродукта();	
	ХранилищеОбщихНастроек.Сохранить(НазваниеПродукта, "ГлобальныйКэш", ГлобальныйКэш);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

