
// Функция - Возвращает дату в миллисекундах
//
// Параметры:
//  ДатаЗначение - Дата	 - Дата, которую надо получить в миллисекундах. Если не указано, то текущая.
// 
// Возвращаемое значение:
//  Число - миллисекунды
//
//DynamicDirective
Функция ДатаВМиллисекундах(ДатаЗначение = Неопределено) Экспорт 
	ПереданнаяДата = ДатаЗначение;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Если ПереданнаяДата = Неопределено Тогда
			// BSLLS:DeprecatedCurrentDate-off Для совместимости с 8.2
			ПереданнаяДата = ТекущаяДата();
			// BSLLS:DeprecatedCurrentDate-on			
		КонецЕсли;
		
	#Иначе
	
		Если ПереданнаяДата = Неопределено Тогда	
			Возврат ТекущаяУниверсальнаяДатаВМиллисекундах();
		КонецЕсли;
		
	#КонецЕсли
	КоличествоМиллисекундВСекунде = 1000;
	КоличествоМиллисекундВ3Часах = 10800000;
	
	Возврат (ПереданнаяДата - '0001.01.01') * КоличествоМиллисекундВСекунде - КоличествоМиллисекундВ3Часах;
КонецФункции
