
#Область include_core_base_Helpers_СоздатьДополнительноеСвойствоКЭДО
#КонецОбласти

Функция НайтиСвойствоПоИмени( ИмяСвойства ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НайденноеСВо = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту( "Имя", ИмяСвойства );
	Возврат НайденноеСВо;
	
КонецФункции

Функция ПолучитьЗначениеСвойства( ОбъектСсылка, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено ) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос			= Новый Запрос;
	Запрос.Текст	= 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДС.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДС
		|ГДЕ
		|	ДС.Свойство.Имя = &ИмяСвойства
		|	И ДС.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", ОбъектСсылка);
	Запрос.УстановитьПараметр("ИмяСвойства", ИмяСвойства );
	ВДЗ = Запрос.Выполнить().Выбрать();
	ЗначениеСВа	= ЗначениеПоУмолчанию;
	Пока ВДЗ.Следующий() Цикл
		ЗначениеСВа	= ВДЗ.Значение;
		Прервать;
	КонецЦикла;
	
	Возврат ЗначениеСВа;
			
КонецФункции

Функция УстановитьЗначениеСвойства( ОбъектСсылка, ИмяСвойства, Значение ) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	НовМЗ			= РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	НовМЗ.Объект	= ОбъектСсылка;
	НовМЗ.Свойство	= НайтиСвойствоПоИмени( ИмяСвойства );
	НовМЗ.Значение	= Значение;
	
	СтатусОперации = Ложь;
	Попытка
		НовМЗ.Записать(Истина);
		СтатусОперации = Истина;
	Исключение
		СтатусОперации = Ложь;
	КонецПопытки;
	
	Возврат СтатусОперации;
	
КонецФункции

