
&НаКлиенте
Процедура ИмяИзСБИСвАПИ3(ИмяСБИС, ПримечаниеСБИС, ИдентификаторДокумента) 
	
	Если ИмяСБИС = "Allowance" Тогда
		Если Найти(ПримечаниеСБИС, "уход") > 0 Тогда
			context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
			ДокументСБИС = ТранспортИнтеграции.local_helper_read_document(context_params, Новый Структура("Идентификатор", ИдентификаторДокумента));
			Если Найти(ДокументСБИС["Регламент"]["Название"], "уход") > 0 И Найти(ДокументСБИС["Регламент"]["Название"], "Больничный") = 0 Тогда 
				ИмяСБИС = "ОтпускПоУходу";
			Иначе
				ИмяСБИС = "Больничный";        
			КонецЕсли;
		Иначе
			ИмяСБИС = "Больничный";   
		КонецЕсли;
    Иначе
		СловарьСБИСвАПИ3 = Новый Соответствие;
		СловарьСБИСвАПИ3.Вставить("СлужЗап","Задача");
		СловарьСБИСвАПИ3.Вставить("АвансОтчёт","АвансовыйОтчёт");
		СловарьСБИСвАПИ3.Вставить("АвансОтчет","АвансовыйОтчет");
		СловарьСБИСвАПИ3.Вставить("ВнутрПрм","ВнутреннееПеремещение");
		СловарьСБИСвАПИ3.Вставить("ВыдачаЗарплаты","ДоговорДок");
		СловарьСБИСвАПИ3.Вставить("Договор","PriceChange");
		СловарьСБИСвАПИ3.Вставить("PriceChange","ИзменениеЦен");
		СловарьСБИСвАПИ3.Вставить("Номенклатура","ПоказательОстатокНаСкладе");
		СловарьСБИСвАПИ3.Вставить("ДокОтгрВх","Поступление");
		СловарьСБИСвАПИ3.Вставить("Прайсы","Прайс");
		СловарьСБИСвАПИ3.Вставить("ДокОтгрИсх","Реализация");
		СловарьСБИСвАПИ3.Вставить("СчетИсх","СчетНаОплату");
		СловарьСБИСвАПИ3.Вставить("УдержанияПоЗарплате","УдержаниеПоЗарплате");
		СловарьСБИСвАПИ3.Вставить("ШтатнаяДолжность","ШтатноеРасписание");
		СловарьСБИСвАПИ3.Вставить("Согласование","ГрафикОтпусков");
		СловарьСБИСвАПИ3.Вставить("CadresOther","ПрочийКадровыйДокумент");
		СловарьСБИСвАПИ3.Вставить("НачисленияПоЗарплате","НачислениеПоЗарплате");
		СловарьСБИСвАПИ3.Вставить("PlanVacationScheduleChange","ПереносОтпусков");
		СловарьСБИСвАПИ3.Вставить("ТабельДокумент","Табель");
		СловарьСБИСвАПИ3.Вставить("ИзмененияОклада","ИзменениеУсловийОплаты");
		СловарьСБИСвАПИ3.Вставить("Indexation","ИндексацияЗаработка");
		СловарьСБИСвАПИ3.Вставить("GphAct","АктПриемки");
		СловарьСБИСвАПИ3.Вставить("CombinationPositions","СовмещениеДолжностей");
		СловарьСБИСвАПИ3.Вставить("BusinessTrip","СписочнаяКомандировка");
		СловарьСБИСвАПИ3.Вставить("GphContract","ПриемНаРаботуГПХ");
		СловарьСБИСвАПИ3.Вставить("CombinationCancel","ОтменаСовмещенияДолжностей");
		СловарьСБИСвАПИ3.Вставить("BTCorrection","КорректировкаСписочнойКомандировки");
		СловарьСБИСвАПИ3.Вставить("TimesheetCorrection","КорректировкаТабеля");
		СловарьСБИСвАПИ3.Вставить("РеалВх","Поступление");
		СловарьСБИСвАПИ3.Вставить("StaffStatements","Заявление");
		
		НайденныйАПИ3 = СловарьСБИСвАПИ3[ИмяСБИС];
		Если НайденныйАПИ3 <> Неопределено Тогда 
			ИмяСБИС = НайденныйАПИ3;	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
