
&НаКлиенте
Функция КартинкаУспешно()
	Попытка
		Картинка = БиблиотекаКартинок[ЛокализацияНазваниеПродукта()+"_Успешно32"];
	Исключение
		Картинка = Неопределено;
	КонецПопытки;
	Если Картинка = Неопределено Тогда
		Попытка
			Картинка = БиблиотекаКартинок.Успешно32;
		Исключение
			Картинка = Неопределено; // Если нет нужных картинок, то пустая
		КонецПопытки;
	КонецЕсли;
	Если Картинка = Неопределено Тогда
		Попытка
			Картинка = БиблиотекаКартинок.ЗеленаяГалка;
		Исключение
			Картинка = Новый Картинка; // Если нет нужных картинок, то пустая
		КонецПопытки;
	КонецЕсли;
	Возврат Картинка;
КонецФункции

&НаКлиенте
Функция КартинкаОшибка()
	Попытка
		Картинка = БиблиотекаКартинок[ЛокализацияНазваниеПродукта()+"_Ошибка32"];
	Исключение
		Картинка = Неопределено;
	КонецПопытки;
	Если Картинка = Неопределено Тогда
		Попытка
			Картинка = БиблиотекаКартинок.Ошибка32;
		Исключение
			Картинка = Неопределено; // Если нет нужных картинок, то пустая
		КонецПопытки;
	КонецЕсли;
	Если Картинка = Неопределено Тогда
		Попытка
			Картинка = БиблиотекаКартинок.КрасныйКрест;
		Исключение
			Картинка = Новый Картинка; // Если нет нужных картинок, то пустая
		КонецПопытки;
	КонецЕсли;
	Возврат Картинка;
КонецФункции



