
#Область include_core_base_Helpers_КартинкиУспешноОшибка
#КонецОбласти

Процедура УстановитьКартинку(Элем, КартинкаПуть)
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	Попытка
		Если Лев(КартинкаПуть, 19) = "БиблиотекаКартинок." Тогда
			Элем.Картинка = БиблиотекаКартинок[Сред(КартинкаПуть, 20)];	
		Иначе
			Если ЭлемФормы.Найти(КартинкаПуть) <> Неопределено Тогда
				Элем.Картинка = ЭлемФормы[КартинкаПуть].Картинка;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Возврат;
	КонецПопытки;	
КонецПроцедуры

