
&НаКлиенте
Функция КартинкаПоПриоритету(МассивИменКартинок)
	Если ТипЗнч(МассивИменКартинок) <> Тип("Массив") Тогда
		Возврат Новый Картинка;
	КонецЕсли;	
	Для Каждого Запись Из МассивИменКартинок Цикл 
		Попытка
			Картинка = БиблиотекаКартинок[Запись];
		Исключение
			Продолжить; // Если нет нужных картинок, то пустая
		КонецПопытки;
		Возврат Картинка;
	КонецЦикла;	
	Возврат Новый Картинка;
КонецФункции

&НаКлиенте
Функция КартинкаУспешно()
	МассивКартинокУспешно = Новый Массив;
	МассивКартинокУспешно.Добавить(ПрефиксПродукта() + "Успешно32");
	МассивКартинокУспешно.Добавить("Успешно32");
	МассивКартинокУспешно.Добавить("ЗеленаяГалка");
	Возврат КартинкаПоПриоритету(МассивКартинокУспешно);
КонецФункции

&НаКлиенте
Функция КартинкаОшибка()
	МассивКартинокОшибка = Новый Массив;
	МассивКартинокОшибка.Добавить(ПрефиксПродукта() + "Ошибка32");
	МассивКартинокОшибка.Добавить("Ошибка32");
	МассивКартинокОшибка.Добавить("КрасныйКрест");
	Возврат КартинкаПоПриоритету(МассивКартинокОшибка);
КонецФункции

&НаКлиенте
Функция КартинкаИнформация()
	МассивКартинокИнформация = Новый Массив;
	МассивКартинокИнформация.Добавить(ПрефиксПродукта() + "Информация32");
	МассивКартинокИнформация.Добавить("Информация32");
	МассивКартинокИнформация.Добавить("ИнформацияПоДлительнойОтправке");
	Возврат КартинкаПоПриоритету(МассивКартинокИнформация);	
КонецФункции
