
// Функция - копирует объект
//
// Параметры:
//  ОбъектСкопироватьВходящий	 - Произвольный	 - что скорпировать
//  ДопПараметры				 - Булево, Структура	 - Параметры копирования
//		ГлубокаяКопия			 - скопировать основной объект на всех уровнях. Если ДопПараметры задан булевом, то устанавливается напрямую
//		ЕслиТипНеизвестен		 - обработка неизвестных типов: "Ошибка" - вызвать исключение, пропустить - все остальные
// 
// Возвращаемое значение:
//  Произвольный - копия объекта. Если тип неизвестен, копирование не производится
//
//DynamicDirective
Функция НовыйКопияОбъекта(ОбъектСкопироватьВходящий, ДопПараметры = Неопределено)

	ГлубокаяКопия		= Ложь;
	ЕслиТипНеизвестен	= "какесть"; // пропустить
	
	Если Не ДопПараметры = Неопределено Тогда
		
		Если ТипЗнч(ДопПараметры) = Тип("Булево") Тогда
			
			ГлубокаяКопия = ДопПараметры;
			
		Иначе
			
			ГлубокаяКопия = ДопПараметры.Свойство("ГлубокаяКопия")
						И	ДопПараметры.ГлубокаяКопия;
			Если ДопПараметры.Свойство("ЕслиТипНеизвестен") Тогда
				
				ЕслиТипНеизвестен	= НРег(ДопПараметры.ЕслиТипНеизвестен);
				
			КонецЕсли;
			
		КонецЕсли;
					
	КонецЕсли;
				
	КонтекстКопирования = Новый Структура("Уровень, ГлубокаяКопия, ЕслиТипНеизвестен, Путь", 0, ГлубокаяКопия, ЕслиТипНеизвестен);
	КонтекстКопирования.Путь = "ОбъектСкопироватьВходящий";
	
	Возврат яСоздатьКопиюОбъекта_Объект(ОбъектСкопироватьВходящий, КонтекстКопирования);
	
КонецФункции

// Функция - обработка на проверку типа
//
// Параметры:
//  ОбъектСкопироватьВходящий	 - Произвольный - что копируем
//  КонтекстКопирования	  - Структура	 								 - контекст дозаполнения: 
//		Уровень			- текущий уровень вложенности
//		ГлубокаяКопия	- скопировать основной объект на всех уровнях
// 
// Возвращаемое значение:
// Произвольный - копия ОбъектСкопироватьВходящий
//
//DynamicDirective
Функция яСоздатьКопиюОбъекта_Объект(ОбъектСкопироватьВходящий, КонтекстКопирования)

	ТипПроверка = ТипЗнч(ОбъектСкопироватьВходящий);
	КонтекстКопирования.Уровень = КонтекстКопирования.Уровень + 1;
	
	Если	Не	КонтекстКопирования.ГлубокаяКопия
		И		КонтекстКопирования.Уровень > 1 Тогда
		
		// Верхний уровень уже скопирован
		Результат = ОбъектСкопироватьВходящий;
		
	ИначеЕсли	ТипПроверка = Тип("Структура") 
			Или	ТипПроверка = Тип("Соответствие")	Тогда
			
		Результат = яСоздатьКопиюОбъекта_КлючЗначение(ОбъектСкопироватьВходящий, КонтекстКопирования);	
		
	ИначеЕсли	ТипПроверка = Тип("Массив")			Тогда 
		
		Результат = яСоздатьКопиюОбъекта_Массив(ОбъектСкопироватьВходящий, КонтекстКопирования);
		
	ИначеЕсли 	ТипПроверка = Тип("СписокЗначений") Тогда	
		
		Результат = яСоздатьКопиюОбъекта_Список(ОбъектСкопироватьВходящий, КонтекстКопирования);
		
	ИначеЕсли	ТипПроверка = Тип("Строка")
		Или		ТипПроверка = Тип("Булево")
		Или		ТипПроверка = Тип("Число")
		Или		ТипПроверка = Тип("Дата") Тогда
		
		// Простой тип объекта. Берётся как есть
		Результат = ОбъектСкопироватьВходящий;
		
	Иначе 
		
		Если		КонтекстКопирования.ЕслиТипНеизвестен = "ошибка" Тогда
			
			ОшибкаКопирования = NewExtException(, "МодульОбъекта.яСоздатьКопиюОбъекта_Объект",767,,КонтекстКопирования.Путь);
			ВызватьИсключение ExtException_Dump(ОшибкаКопирования);
			
		ИначеЕсли	КонтекстКопирования.ЕслиТипНеизвестен = "пропустить" Тогда	
			
			Результат = NULL;
			
		Иначе
			
			Результат = ОбъектСкопироватьВходящий;
			
		КонецЕсли;
		
	КонецЕсли;
		
	КонтекстКопирования.Уровень = КонтекстКопирования.Уровень - 1;
	
	Возврат Результат;

КонецФункции

//DynamicDirective

Функция яСоздатьКопиюОбъекта_КлючЗначение(ОбъектСкопироватьВходящий, КонтекстКопирования)
	
	ТипСоздать	= Новый ОписаниеТипов(Строка(ТипЗнч(ОбъектСкопироватьВходящий)));
	Результат	= ТипСоздать.ПривестиЗначение();
	ПутьТекущий	= КонтекстКопирования.Путь;
	
	Для Каждого КлючИЗначение Из ОбъектСкопироватьВходящий Цикл 
		
		КонтекстКопирования.Путь = ПутьТекущий + "." + Строка(КлючИЗначение.Ключ);
		ЗначениеВставить = яСоздатьКопиюОбъекта_Объект(КлючИЗначение.Значение, КонтекстКопирования);
		Если ЗначениеВставить = NULL Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(КлючИЗначение.Ключ,  ЗначениеВставить);
		
	КонецЦикла;
	
	КонтекстКопирования.Путь = ПутьТекущий;
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

Функция яСоздатьКопиюОбъекта_Список(ОбъектСкопироватьВходящий, КонтекстКопирования)
	
	Результат	= Новый СписокЗначений;
	ПутьТекущий	= КонтекстКопирования.Путь;
	
	Для ИндексКоллекции = 0 По ОбъектСкопироватьВходящий.Количество() - 1 Цикл 
		
		КонтекстКопирования.Путь = ПутьТекущий + "[" + ИндексКоллекции + "]";
		СтрокаКопировать = ОбъектСкопироватьВходящий[ИндексКоллекции];
		ЗначениеВставить = яСоздатьКопиюОбъекта_Объект(СтрокаКопировать.Значение, КонтекстКопирования);
		Если ЗначениеВставить = NULL Тогда
			Продолжить;
		КонецЕсли;
		Результат.Добавить(ЗначениеВставить, СтрокаКопировать.Представление, СтрокаКопировать.Пометка, СтрокаКопировать.Картинка);
		
	КонецЦикла;
	
	КонтекстКопирования.Путь = ПутьТекущий;
	
	Возврат Результат;
	
КонецФункции

//DynamicDirective

Функция яСоздатьКопиюОбъекта_Массив(ОбъектСкопироватьВходящий, КонтекстКопирования)
	
	Результат	= Новый Массив;
	ПутьТекущий	= КонтекстКопирования.Путь;
	
	Для ИндексКоллекции = 0 По ОбъектСкопироватьВходящий.Количество() - 1 Цикл 
		
		КонтекстКопирования.Путь = ПутьТекущий + "[" + ИндексКоллекции + "]";
		ЗначениеВставить = яСоздатьКопиюОбъекта_Объект(ОбъектСкопироватьВходящий[ИндексКоллекции], КонтекстКопирования);
		Если ЗначениеВставить = NULL Тогда
			Продолжить;
		КонецЕсли;
		Результат.Добавить(ЗначениеВставить);
		
	КонецЦикла;
	
	КонтекстКопирования.Путь = ПутьТекущий;

	Возврат Результат;
	
КонецФункции

