
Функция СписокСерверовSaby(ОтображатьГОСТСервера = Ложь) Экспорт
	СписокСрв = Новый Массив();
	ДобавитьСервер(СписокСрв, "online.saby.ru", 			"online.saby.ru");
	ДобавитьСервер(СписокСрв, "sabyd.ru",				"sabyd.ru");
	ДобавитьСервер(СписокСрв, "fix-online.saby.ru", 		"fix-online.saby.ru");
	ДобавитьСервер(СписокСрв, "fix-online.sabyd.ru",	"fix-online.sabyd.ru");
	ДобавитьСервер(СписокСрв, "test-online.saby.ru", 		"test-online.saby.ru");
	ДобавитьСервер(СписокСрв, "test-online.sabyd.ru",	"test-online.sabyd.ru");
	ДобавитьСервер(СписокСрв, "pre-test-online.saby.ru", 	"pre-test-online.saby.ru");
	Возврат СписокСрв;
КонецФункции

Процедура ДобавитьСервер(СписокСерверов, Адрес, Представление, Индекс = Неопределено)
	Сервер = Новый Структура;
	Сервер.Вставить("Значение", Адрес);
	Сервер.Вставить("Представление", Представление);
	Если Индекс <> Неопределено Тогда
		СписокСерверов.Вставить(Индекс, Сервер);
	Иначе	
		СписокСерверов.Добавить(Сервер);
	КонецЕсли;		
КонецПроцедуры
