
Функция СписокСерверовSaby(ОтображатьГОСТСервера = Истина) Экспорт
	СписокСрв = Новый Массив();
	СписокСрв.Добавить(Новый Структура("Значение,Представление", "ie-1c.saby.ru", "online.saby.ru") );
	СписокСрв.Добавить(Новый Структура("Значение,Представление", "fix-ie-1c.saby.ru", "fix-online.saby.ru") );
	СписокСрв.Добавить(Новый Структура("Значение,Представление", "test-ie-1c.saby.ru", "test-online.saby.ru") );
	Если ОтображатьГОСТСервера Тогда
		СписокСрв.Вставить(1,Новый Структура("Значение,Представление", "ieg-1c.sbis.ru", "g.sbis.ru") );
		СписокСрв.Вставить(3,Новый Структура("Значение,Представление", "fix-ieg-1c.sbis.ru", "fix-g.sbis.ru") );
		СписокСрв.Добавить(Новый Структура("Значение,Представление", "test-ieg-1c.sbis.ru", "test-g.sbis.ru") );
	КонецЕсли;
	СписокСрв.Добавить(Новый Структура("Значение,Представление", "pre-test-ie-1c.saby.ru", "pre-test-online.saby.ru") );
	СписокСрв.Добавить(Новый Структура("Значение,Представление", "ie-1c.sabytest.ru", "online.sabytest.ru") );
	Возврат СписокСрв;
КонецФункции
