
Функция СписокСерверовSaby(ОтображатьГОСТСервера = Истина) Экспорт
	СписокСрв = Новый Массив();
	ДобавитьСервер(СписокСрв, "online.saby.ru", 			"online.saby.ru");
	ДобавитьСервер(СписокСрв, "fix-online.saby.ru", 		"fix-online.saby.ru");
	ДобавитьСервер(СписокСрв, "test-online.saby.ru", 		"test-online.saby.ru");
	ДобавитьСервер(СписокСрв, "pre-test-online.saby.ru", 	"pre-test-online.saby.ru");
    Если ОтображатьГОСТСервера Тогда
		ДобавитьСервер(СписокСрв, "g.saby.ru", 		"g.saby.ru");
		ДобавитьСервер(СписокСрв, "fix-g.saby.ru",	"fix-g.saby.ru");
		ДобавитьСервер(СписокСрв, "test-g.saby.ru",	"test-g.saby.ru");
	КонецЕсли;
	ДобавитьСервер(СписокСрв, "online.sabytest.ru",         "online.sabytest.ru");
	ДобавитьСервер(СписокСрв, "online.setty.kz", 		"online.setty.kz");
	ДобавитьСервер(СписокСрв, "fix-online.setty.kz", 	"fix-online.setty.kz");
	Возврат СписокСрв;
КонецФункции

Процедура ДобавитьСервер(СписокСерверов, Адрес, Представление, Индекс = Неопределено)
	АдресСервера = Новый Структура;
	АдресСервера.Вставить("Значение", Адрес);
	АдресСервера.Вставить("Представление", Представление);
	Если Индекс <> Неопределено Тогда
		СписокСерверов.Вставить(Индекс, АдресСервера);
	Иначе	
		СписокСерверов.Добавить(АдресСервера);
	КонецЕсли;		
КонецПроцедуры 

