
#Область include_core_base_Helpers_НастройкиПодключенияСписокДоменов
#КонецОбласти

Функция НастройкиПодключенияПрочитать() Экспорт
	ОбщиеНастройки	= ОбщиеНастройкиПрочитать();
	ОбщиеПараметры	= get_prop(ОбщиеНастройки, "public", Новый Структура);
	ИмяПродукта = ИмяПродукта();	
	НастройкиПользователя = ХранилищеОбщихНастроек.Загрузить(ИмяПродукта, "params");
	Если ТипЗнч(НастройкиПользователя) = Тип("Структура") ТОгда
		
		Если get_prop(НастройкиПользователя, ИмяСвойстваТранспорта(), Неопределено) = Неопределено Тогда
			НастройкиПользователя.Вставить(ИмяСвойстваТранспорта(),get_prop(ОбщиеНастройки, ИмяСвойстваТранспорта(), "API"));	
		КонецЕсли;
		НастройкиПользователя.Вставить("ExtSysSettingsId", get_prop(ОбщиеНастройки, "ExtSysSettingsId", ""));
		НастройкиПользователя.Вставить("public", ОбщиеПараметры);
	КонецЕсли;
	Возврат НастройкиПользователя;
КонецФункции

Процедура НастройкиПодключенияЗаписать(НастройкиПодключения ) Экспорт
	ИмяПродукта = ИмяПродукта();	
	Если ТипЗнч(НастройкиПодключения) = Тип("Структура") ТОгда
		НастройкиПодключения.Удалить("public");
	КонецЕсли;
	ХранилищеОбщихНастроек.Сохранить(ИмяПродукта, "params", НастройкиПодключения);
КонецПроцедуры

//DynamicDirective

Функция ПроверитьНаличиеПараметровПодключения() Экспорт
	param = НастройкиПодключенияПрочитать();
	Если param = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	Если УИДСессии(param) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат param;
КонецФункции


