
#Область include_core_base_Helpers_НастройкиПодключенияСписокДоменов
#КонецОбласти

#Область include_core_base_Helpers_РаботаСХранилищемЗначения
#КонецОбласти

Функция НастройкиПодключенияПрочитать() Экспорт
	ОбщиеНастройки	= ОбщиеНастройкиПрочитать(Ложь);
	ОбщиеПараметры	= get_prop(ОбщиеНастройки, "public", Новый Структура);
	НазваниеПродукта = НазваниеПродукта();
	НастройкиПользователя = ПрочитатьИзХранилища(НазваниеПродукта, "params");
#Область include_core_base_Helpers_НастройкиПодключенияСЭДО
#КонецОбласти
	Если ТипЗнч(НастройкиПользователя) = Тип("Структура") Тогда
		Если get_prop(НастройкиПользователя, ИмяСвойстваТранспорта(), Неопределено) = Неопределено Тогда
			НастройкиПользователя.Вставить(ИмяСвойстваТранспорта(),get_prop(ОбщиеНастройки, ИмяСвойстваТранспорта(), "API"));
		КонецЕсли;
		НастройкиПользователя.Вставить("ExtSysSettingsId", get_prop(ОбщиеНастройки, "ExtSysSettingsId", ""));
		НастройкиПользователя.Вставить("IntegrationUuid", get_prop(ОбщиеНастройки, "parent", ""));
		НастройкиПользователя.Вставить("public", ОбщиеПараметры);
	КонецЕсли;
	Возврат НастройкиПользователя;
КонецФункции

Процедура НастройкиПодключенияЗаписать(Знач НастройкиПодключения ) Экспорт
	НазваниеПродукта = НазваниеПродукта(); 
	public_param = get_prop(НастройкиПодключения, "public"); // Сохраним значение "public"
	Если ТипЗнч(НастройкиПодключения) = Тип("Структура") ТОгда
		НастройкиПодключения.Удалить("public");
	КонецЕсли;
	ЗаписатьВХранилище(НазваниеПродукта, "params", НастройкиПодключения);
	Если public_param <> Неопределено Тогда  // Восстановим значение "public"
		НастройкиПодключения.Вставить("public", public_param);	
    КонецЕсли;
КонецПроцедуры

//DynamicDirective

Функция ПроверитьНаличиеПараметровПодключения() Экспорт
	param = НастройкиПодключенияПрочитать();
	Если param = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	Если УИДСессии(param) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат param;
КонецФункции

Процедура ОбновитьНастройкиПодключенияПриНачалеРаботы() Экспорт
	context_param = НастройкиПодключенияПрочитать(); 
	ConnectionUuid = get_prop(context_param, "ConnectionUuid");
	ConnectionId = get_prop(context_param, "ConnectionId");
	Если ConnectionUuid <> Неопределено Тогда
		Если ConnectionId <> Неопределено Тогда
			УдалитьУстаревшиеНастройкиПодключения(context_param);
			НастройкиПодключенияЗаписать(context_param);
		КонецЕсли;
		Возврат;
	КонецЕсли; 
	ConnectionId = get_prop(context_param, "ConnectionId");
	Если ConnectionId <> Неопределено Тогда
		context_param.Вставить("ConnectionUuid", context_param["ConnectionId"]);
	КонецЕсли;     
	api_url = get_prop(context_param, "api_url");
	Если api_url <> Неопределено Тогда
		context_param.Вставить("ApiUrl", get_prop(context_param, "api_url", ""));
	КонецЕсли;
	Session = get_prop(context_param, "session"); 
	Если ЗначениеЗаполнено(Session) И ЗначениеЗаполнено(get_prop(Session, "user_fio")) Тогда
		Session.Вставить("AccountId", get_prop(Session, "account", ""));
		Session.Вставить("UserFio", get_prop(Session, "user_fio", ""));
		context_param.Вставить("Session", Session);
	КонецЕсли;
	SessionExtSdk = get_prop(context_param, "sessionExtSdk2");
	Если ЗначениеЗаполнено(SessionExtSdk) И ЗначениеЗаполнено(get_prop(SessionExtSdk, "user_fio")) Тогда
		SessionExtSdk.Вставить("AccountId", get_prop(SessionExtSdk, "account", ""));
		SessionExtSdk.Вставить("UserFio", get_prop(SessionExtSdk, "user_fio", ""));
		context_param.Вставить("SessionExtSdk", SessionExtSdk);
	КонецЕсли; 
	exchange_method = get_prop(context_param, "exchange_method");
	Если ЗначениеЗаполнено(exchange_method) Тогда
		context_param.Вставить("ExchangeMethod", get_prop(context_param, "exchange_method", ""));
		Если context_param.ExchangeMethod = "ExtSdk2" Тогда
			context_param.ExchangeMethod = "ExtSdk"	
		Конецесли;
	КонецЕсли;
	НастройкиПодключенияЗаписать(context_param);
КонецПроцедуры

Процедура УдалитьУстаревшиеНастройкиПодключения(НастройкиПодключения)
	НастройкиПодключения.Удалить("session_begin");
	НастройкиПодключения.Удалить("account");
	НастройкиПодключения.Удалить("user_fio");
	НастройкиПодключения.Удалить("last_token_time");
	НастройкиПодключения.Удалить("ВидАвторизации");
	НастройкиПодключения.Удалить("Сертификат");
	НастройкиПодключения.Удалить("ЗапомнитьПароль");
	НастройкиПодключения.Удалить("ЗапомнитьСертификат");
	НастройкиПодключения.Удалить("ConnectionId");
	НастройкиПодключения.Удалить("api_url");
	НастройкиПодключения.Удалить("ТипПрокси");
	Saby_Прокси = get_prop(НастройкиПодключения, "Proxy", Новый Структура);
	Saby_Прокси.Удалить("ИспользоватьАутентификациюОС");
	НастройкиПодключения.Удалить("exchange_method");
	НастройкиПодключения.Удалить("ВремяОжиданияОтвета");
	НастройкиПодключения.Удалить("ШифроватьВыборочно");
	НастройкиПодключения.Удалить("КаталогОбмена");
	НастройкиПодключения.Удалить("advanced_log");
	НастройкиПодключения.Удалить("КаталогОтладки");
КонецПроцедуры
