
Функция ОбщиеНастройкиИзНастроекПодключения()
	ПользовательскиеНастройки = НастройкиПодключенияПрочитать();
	ExtSysUid =  get_prop(ПользовательскиеНастройки, "ExtSysUid", Неопределено);
	ОбщиеНастройки = Новый Структура;
	ОбщиеНастройки.Вставить("ExtSysUid", ExtSysUid);
	Возврат ОбщиеНастройки;
КонецФункции

Функция ОбщиеНастройкиПрочитать(Знач ИзНастроекПодключения = Истина) Экспорт
	ОбщиеНастройки = Неопределено;
	Попытка  
		МодульОбъекта = МодульОбъекта();
		ИмяПродукта = ИмяПродукта();	
		ОбщиеНастройки = ПрочитатьИзХранилища(ИмяПродукта, "params", , ИмяПродукта);
		//Проблема перехода между названием продуктов в верхнем регистре и CamelCase
		Если ТипЗнч(ОбщиеНастройки) <> Тип("Структура") Тогда
			ОбщиеНастройки = ПрочитатьИзХранилища(ИмяПродукта, "params", , ВРЕГ(ИмяПродукта));
		КонецЕсли;
		Если ТипЗнч(ОбщиеНастройки) <> Тип("Структура") Тогда
			ОбщиеНастройки = МодульОбъекта.ПриПервомЗапуске();
		КонецЕсли;
	Исключение
		Если ИзНастроекПодключения Тогда
			ОбщиеНастройки = ОбщиеНастройкиИзНастроекПодключения();	
		КонецЕсли;
	КонецПопытки;	
	Возврат ОбщиеНастройки;
КонецФункции

Процедура ОбщиеНастройкиЗаписать(ОбщиеНастройки) Экспорт
	Попытка
		ИмяПродукта = ИмяПродукта();	
		ЗаписатьВХранилище(ИмяПродукта, "params", ОбщиеНастройки, , ИмяПродукта);
	Исключение   
		Возврат;
	КонецПопытки;
КонецПроцедуры

