
Функция ОбщиеНастройкиПрочитать() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	МодульОбъекта = ПолучитьМодульОбъекта();
	ИмяПродукта = ПолучитьИмяПродукта();	
	ОбщиеНастройки = ХранилищеОбщихНастроек.Загрузить(ИмяПродукта, "params",,ИмяПродукта);
	//Проблема перехода между названием продуктов в верхнем регистре и CamelCase
	Если ТипЗнч(ОбщиеНастройки) <> Тип("Структура") Тогда
		ОбщиеНастройки = ХранилищеОбщихНастроек.Загрузить(ИмяПродукта, "params",,ВРЕГ(ИмяПродукта));
	КонецЕсли;
	Если ТипЗнч(ОбщиеНастройки) <> Тип("Структура") Тогда
		ОбщиеНастройки = МодульОбъекта.ПриПервомЗапуске();
	КонецЕсли;
	Возврат ОбщиеНастройки;
КонецФункции

Функция ОбщиеНастройкиЗаписать(ОбщиеНастройки) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ИмяПродукта = ПолучитьИмяПродукта();	
	ХранилищеОбщихНастроек.Сохранить(ИмяПродукта, "params", ОбщиеНастройки,,ИмяПродукта);
КонецФункции

