
Функция ОбщиеНастройкиИзНастроекПодключения()
	ПользовательскиеНастройки = НастройкиПодключенияПрочитать();
	ExtSysUid =  get_prop(ПользовательскиеНастройки, "ExtSysUid", Неопределено);
	ОбщиеНастройки = Новый Структура;
	ОбщиеНастройки.Вставить("ExtSysUid", ExtSysUid);
	Возврат ОбщиеНастройки;
КонецФункции

Функция ОбщиеНастройкиПрочитать(Знач ИзНастроекПодключения = Истина) Экспорт
	ОбщиеНастройки = Неопределено;
	Попытка  
		УстановитьПривилегированныйРежим(Истина);
		МодульОбъекта = МодульОбъекта();
		ИмяПродукта = ИмяПродукта();	
		ОбщиеНастройки = ХранилищеОбщихНастроек.Загрузить(ИмяПродукта, "params",,ИмяПродукта);
		//Проблема перехода между названием продуктов в верхнем регистре и CamelCase
		Если ТипЗнч(ОбщиеНастройки) <> Тип("Структура") Тогда
			ОбщиеНастройки = ХранилищеОбщихНастроек.Загрузить(ИмяПродукта, "params",,ВРЕГ(ИмяПродукта));
		КонецЕсли;
		Если ТипЗнч(ОбщиеНастройки) <> Тип("Структура") Тогда
			ОбщиеНастройки = МодульОбъекта.ПриПервомЗапуске();
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь); 
	Исключение
		Если ИзНастроекПодключения Тогда
			ОбщиеНастройки = ОбщиеНастройкиИзНастроекПодключения();	
		КонецЕсли;
	КонецПопытки;	
	Возврат ОбщиеНастройки;
КонецФункции

Процедура ОбщиеНастройкиЗаписать(ОбщиеНастройки) Экспорт
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		ИмяПродукта = ИмяПродукта();	
		ХранилищеОбщихНастроек.Сохранить(ИмяПродукта, "params", ОбщиеНастройки,,ИмяПродукта);
		УстановитьПривилегированныйРежим(Ложь); 
	Исключение   
		Возврат;
	КонецПопытки;
КонецПроцедуры

