
&НаКлиенте
Функция SabyОписаниеОповещения(SabyПроцедура, SabyМодуль, SabyДопПараметры = Неопределено, SabyПроцедураИсключения = Неопределено, SabyМодульИсключения = Неопределено) Экспорт
	Если SabyПроцедураИсключения = Неопределено Тогда
		ОписаниеОповещенияРезультат = Новый ОписаниеОповещения(SabyПроцедура, SabyМодуль, SabyДопПараметры);		
	Иначе
		SabyМодульИсключенияУстановить = SabyМодульИсключения;
		Если SabyМодульИсключенияУстановить = Неопределено Тогда 
			SabyМодульИсключенияУстановить = SabyМодуль;
		КонецЕсли;	
		ОписаниеОповещенияРезультат = Новый ОписаниеОповещения(SabyПроцедура, SabyМодуль, SabyДопПараметры, SabyПроцедураИсключения, SabyМодульИсключенияУстановить);		
	КонецЕсли;		
	Возврат ОписаниеОповещенияРезультат;	
КонецФункции

&НаКлиенте
Процедура ВыполнитьSabyОписаниеОповещения(SabyОписаниеОповещения, РезультатВызова) Экспорт
	ВыполнитьОбработкуОповещения(SabyОписаниеОповещения, РезультатВызова);
КонецПроцедуры

&НаКлиенте
Процедура SabyПоказатьВопрос(ДействиеВопроса, ТекстВопроса, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, КнопкаТаймаута = Неопределено) 
	ПоказатьВопрос(ДействиеВопроса,
			ТекстВопроса,
			Кнопки,
			Таймаут,
			КнопкаПоУмолчанию,
			Заголовок);		
КонецПроцедуры
