
Функция SabyОписаниеОповещения(SabyПроцедура, SabyМодуль, SabyДопПараметры = Неопределено, SabyПроцедураИсключения = Неопределено, SabyМодульИсключения = Неопределено) Экспорт
	Попытка 
		СтрокаВычислить = "Новый ОписаниеОповещения(SabyПроцедура, SabyМодуль, SabyДопПараметры)";
		Если Не SabyПроцедураИсключения = Неопределено Тогда
			SabyМодульИсключенияУстановить = SabyМодульИсключения;
			Если SabyМодульИсключенияУстановить = Неопределено Тогда 
				SabyМодульИсключенияУстановить = SabyМодуль;
				СтрокаВычислить = СтрЗаменить(СтрокаВычислить, ")", ", SabyПроцедураИсключения, SabyМодульИсключенияУстановить)");
			КонецЕсли;	
		КонецЕсли;
		//Вычислить для маскировки от синтаксиса
		ОписаниеОповещенияРезультат = Вычислить(СтрокаВычислить);
	Исключение
		ОписаниеОповещенияРезультат = Новый Структура(
			"_класс,					ИмяПроцедуры,	Модуль,		ДополнительныеПараметры,	ИмяПроцедурыОбработкиОшибки,	МодульОбработкиОшибки",
			"СбисОписаниеОповещения",	SabyПроцедура,	SabyМодуль,	SabyДопПараметры,			SabyПроцедураИсключения,		SabyМодульИсключения);
	КонецПопытки;
	Возврат ОписаниеОповещенияРезультат;
КонецФункции

Процедура ВыполнитьSabyОписаниеОповещения(SabyОписаниеОповещения, РезультатВызова) Экспорт
	Если SabyОписаниеОповещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		//Через Выполнить для старых платформ. Маскировка от синтаксиса.
		Выполнить("ВыполнитьОбработкуОповещения(SabyОписаниеОповещения, РезультатВызова)");  
	Исключение
		Попытка
			Выполнить("SabyОписаниеОповещения.Модуль." + SabyОписаниеОповещения.ИмяПроцедуры + "(РезультатВызова, SabyОписаниеОповещения.ДополнительныеПараметры)");
		Исключение
			СтандартнаяОбработка = Истина;
			Если ЗначениеЗаполнено(SabyОписаниеОповещения.ИмяПроцедурыОбработкиОшибки) Тогда
				// BSLLS:UnusedLocalVariable-off Используется в функции Выполнить
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				// BSLLS:UnusedLocalVariable-on
				Выполнить("SabyОписаниеОповещения.МодульОбработкиОшибки." + SabyОписаниеОповещения.ИмяПроцедурыОбработкиОшибки + "(ИнформацияОбОшибке, СтандартнаяОбработка, SabyОписаниеОповещения.ДополнительныеПараметры)");
			КонецЕсли;
			Если СтандартнаяОбработка Тогда
				ВызватьИсключение;
			КонецЕсли;
		КонецПопытки;
	КонецПопытки;
КонецПроцедуры

Процедура SabyПоказатьВопрос(ДействиеВопроса, ТекстВопроса, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, КнопкаТаймаута = Неопределено) Экспорт
	#Если Клиент Тогда
	// BSLLS:UsingSynchronousCalls-off для совместимости с 8.2
	Ответ = Вопрос(ТекстВопроса, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, КнопкаТаймаута);
	// BSLLS:UsingSynchronousCalls-on
	ВыполнитьSabyОписаниеОповещения(ДействиеВопроса, Ответ);
	#КонецЕсли	
КонецПроцедуры
