
&НаКлиенте
Функция ПутьКФормамОбработки()
	ИмяФормыПС = СтрЗаменить(ЭтаФорма.ИмяФормы, ".", Символы.ПС);
	ПутьКФормам = "";
	Для Счетчик = 1 По СтрЧислоСтрок(ИмяФормыПС)-1 Цикл
	    ПутьКФормам = ПутьКФормам + СтрПолучитьСтроку(ИмяФормыПС, Счетчик) + ".";
	КонецЦикла;
	Возврат ПутьКФормам;
КонецФункции

// BSLLS:NumberOfOptionalParams-off

&НаКлиенте
Процедура ОткрытьФормуОбработки(ИмяФормы, ПарамФормы = Неопределено, ВладелецФормы = Неопределено, Уникальность = Неопределено, 
								ОписаниеОповещения = Неопределено, РежимОткрытияОкна = Неопределено) Экспорт
	ОткрытьФорму(ПутьКФормамОбработки() + ИмяФормы, ПарамФормы, ВладелецФормы, Уникальность, , , ОписаниеОповещения, РежимОткрытияОкна);
КонецПроцедуры

// BSLLS:NumberOfOptionalParams-on
