
&НаКлиенте
Функция ПутьКФормамОбработки()
	Возврат "";
КонецФункции

// BSLLS:NumberOfOptionalParams-off

Процедура ОткрытьФормуОбработки(ИмяФормы, ПарамФормы = Неопределено, ВладелецФормы = Неопределено, Уникальность = Неопределено, 
								ОписаниеОповещения = Неопределено, РежимОткрытияОкна = Неопределено)
	Попытка
		ОткрываемаяФорма = ФормаОсновнойОбработки(ИмяФормы, "", ПарамФормы, ВладелецФормы);
	Исключение
		Попытка
			Картинка = БиблиотекаКартинок["Saby_Ошибка32"];
		Исключение
			Картинка = Неопределено;
		КонецПопытки;
		Если Картинка = Неопределено Тогда
			Попытка
				Картинка = БиблиотекаКартинок.Ошибка32;
			Исключение
				Картинка = Новый Картинка; // Если нет нужных картинок, то пустая
			КонецПопытки;
		КонецЕсли;
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			"Не смогли открыть форму """ + ИмяФормы + """!",
			Картинка);
		Возврат;
	КонецПопытки;
	РезультатИзФормы = ОткрываемаяФорма.ОткрытьМодально();
	ВыполнитьSabyОписаниеОповещения(ОписаниеОповещения, РезультатИзФормы);
КонецПроцедуры

// BSLLS:NumberOfOptionalParams-on
