
&НаКлиенте
Функция ПолучитьСписокРегламентов(ВидОбъекта) Экспорт 
	ТипыДокументов = Новый Массив;
	Для каждого ТипаОбъекта Из ТипыВыгружаемыхОбъектов Цикл
		ТипыДокументов.Добавить(ТипаОбъекта.ТипыОбъекта);	
	КонецЦикла;	

	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	Возврат ТранспортИнтеграции.local_helper_regl_get_by_types(context_params, ТипыДокументов);
КонецФункции

&НаКлиенте
Функция ПолучитьИзОбъекта1СОбъектСБИС(ИмяОбъектаИС)
	ПараметрыВызова = Новый Структура;
	
	
	СписокИнишек = СписокДоступныхИнишек(ИмяОбъектаИС);
	МассивПараметровОбъектов = Новый Массив;
		
	Для каждого ФайлНастроек из СписокИнишек Цикл
		ПараметрыВызова.Вставить("algorithm", ФайлНастроек);
		ПараметрыВызова.Вставить("endpoint", "info");	
		ПараметрыВызова.Вставить("params",	Неопределено);
		BlocklyExecutor = ПолучитьФормуBlockly();
		Результат = BlocklyExecutor.API_BLOCKLY_RUN(ПараметрыВызова);
		
		Если get_prop(Результат,"status") <> "complete" Тогда 
			ВызватьИсключение ( NewExtExceptionСтрока(,,"Не удалось получить регламенты по объекту "+ ИмяОбъектаИС+": "+ExtExceptionToMessage(get_prop(Результат,"data"))));
		КонецЕсли;
		data = get_prop(Результат,"data","");
		Если Не get_prop(data,"type","") = "read" Тогда
			Продолжить;
		КонецЕсли;	
		obj_type = get_prop(data,"obj_type","");
		ext_sys_obj_title = get_prop(data,"ext_sys_obj_title",""); 
		Если obj_type = Неопределено Тогда  
			Возврат Новый Массив();
		КонецЕсли;
		МассивТиповОбъектовАПИ = СтрРазделить82(obj_type,",");
		Если МассивТиповОбъектовАПИ.Количество() > 0 Тогда			
			ПараметрыОбъекта = Новый Структура("SbisType, Api3Type, Title, Ini",
				ТипСБИСПоТипуОбъектаАПИ(МассивТиповОбъектовАПИ[0]), МассивТиповОбъектовАПИ[0], ext_sys_obj_title, ФайлНастроек);
			МассивПараметровОбъектов.Добавить(ПараметрыОбъекта);
		КонецЕсли;	
	КонецЦикла;	
	Возврат МассивПараметровОбъектов;
КонецФункции

&НаКлиенте
Функция СписокДоступныхИнишек(ИмяОбъектаИС)
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	мИниФайлов	= Новый Массив();
	мИниФайлов.Добавить(Новый Структура("type, name", "Система", "ОбъектыСинхBlockly"));
	params	= Новый Структура(
			"props, ini",
			Новый Структура("id, type_data, requested_ini_format", context_params.ConnectionId, 1, "Dom1C"), мИниФайлов);
	res = ТранспортИнтеграции.local_helper_integration_api(context_params, "IntegrationConnection.ReadConnection", params, "int-settings");
	ОбъектыИСОбъектыСБИС = get_prop(get_prop(get_prop(res, "data"), "ОбъектыСинхBlockly"), "data");
	ОбъектыИС = get_prop(ОбъектыИСОбъектыСБИС, "ОбъектыИС");
	// ОбъектыСБИС = get_prop(ОбъектыИСОбъектыСБИС, "Объекты");
	Если ОбъектыИС[ИмяОбъектаИС] = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;	
	Возврат ОбъектыИС[ИмяОбъектаИС];
КонецФункции	

&НаКлиенте
Функция ТипСБИСПоТипуОбъектаАПИ(Знач ТипОбъектаАПИ)
	Результат = ТипОбъектаАПИ;	
	Если Результат = "Больничный" Тогда
		Результат = "Allowance";
	ИначеЕсли Результат = "ГрафикОтпусков" Тогда
		Результат = "Согласование"; 	
	ИначеЕсли Результат = "Договор" Тогда
		Результат = "GphContract";
	ИначеЕсли Результат = "ИзменениеУсловийОплаты" Тогда
		Результат = "ИзмененияОклада";
	ИначеЕсли Результат = "ИндексацияЗаработка" Тогда
		Результат = "Indexation";
	ИначеЕсли Результат = "Командировка" Тогда
		Результат = "BusinessTrip";
	ИначеЕсли Результат = "ОтпускПоУходу" Тогда
		Результат = "Allowance";
	ИначеЕсли Результат = "ПереносОтпусков" Тогда
		Результат = "PlanVacationScheduleChange";
	ИначеЕсли Результат = "Табель" Тогда
		Результат = "ТабельДокумент";
	ИначеЕсли Результат = "СовмещениеДолжностей" Тогда
		Результат = "CombinationPositions";
	ИначеЕсли Результат = "АктПриемки" Тогда
		Результат = "GphAct";
	ИначеЕсли Результат = "ОтменаСовмещенияДолжностей" Тогда
		Результат = "CombinationCancel";
	ИначеЕсли Результат = "АвансовыйОтчет" Тогда
		Результат = "АвансОтчет";
	ИначеЕсли Результат = "ПрочийКадровыйДокумент" Тогда
		Результат = "CadresOther";
	Иначе
		Результат = ТипОбъектаАПИ;	
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ТипОбъектаАПИПоТипуСБИС(Знач ТипСБИС)
	Результат = ТипСБИС;	
// BSLLS:IfElseDuplicatedCondition-off
	Если Результат = "Allowance" Тогда
		Результат = "Больничный";
	ИначеЕсли Результат = "Согласование" Тогда
		Результат = "ГрафикОтпусков"; 	
	ИначеЕсли Результат = "GphContract" Тогда
		Результат = "Договор";
	ИначеЕсли Результат = "ИзмененияОклада" Тогда
		Результат = "ИзменениеУсловийОплаты";
	ИначеЕсли Результат = "Indexation" Тогда
		Результат = "ИндексацияЗаработка";
	ИначеЕсли Результат = "BusinessTrip" Тогда
		Результат = "Командировка";
	ИначеЕсли Результат = "Allowance" Тогда
		Результат = "ОтпускПоУходу";
	ИначеЕсли Результат = "PlanVacationScheduleChange" Тогда
		Результат = "ПереносОтпусков";
	ИначеЕсли Результат = "ТабельДокумент" Тогда
		Результат = "Табель";
	ИначеЕсли Результат = "CombinationPositions" Тогда
		Результат = "СовмещениеДолжностей";
	ИначеЕсли Результат = "GphAct" Тогда
		Результат = "АктПриемки";
	ИначеЕсли Результат = "CombinationCancel" Тогда
		Результат = "ОтменаСовмещенияДолжностей";
	ИначеЕсли Результат = "АвансОтчет" Тогда
		Результат = "АвансовыйОтчет";
	ИначеЕсли Результат = "CadresOther" Тогда
		Результат = "ПрочийКадровыйДокумент";
	Иначе
		Результат = ТипСБИС;	
	КонецЕсли;
// BSLLS:IfElseDuplicatedCondition-on
	Возврат Результат;
КонецФункции 

