
// Выполнение обязательных действий после аутентификации
//
// Параметры:
//  context_params - Структура - Контекст.
//
// Возвращаемое значение:
//  Структура - Информация о подключении.
//
//DynamicDirective
Функция ПослеАутентификации(context_params) Экспорт
	Попытка
		connection_info = ПолучитьПодключение(context_params);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		НастройкиПодключенияЗаписать(context_params);
		ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке));
	КонецПопытки;
	ЗаполнитьИнформациюОПользователе(context_params);
    ПослеПолученияПодключения(context_params, connection_info);
	Возврат connection_info;
КонецФункции

// Заполнение информации о текущем пользователе
//
// Параметры:
//  context_params - Структура - Контекст.
//DynamicDirective
Процедура ЗаполнитьИнформациюОПользователе(context_params) Экспорт
	Попытка
		user_info = ТранспортИнтеграции.local_helper_get_user_info(context_params);
		fio = user_info["Фамилия"] + " " + user_info["Имя"] + " " + user_info["Отчество"];  
		СтруктураАккаунтФИО = Новый Структура;
		СтруктураАккаунтФИО.Вставить("account", user_info["Аккаунт"]["Номер"]);
		СтруктураАккаунтФИО.Вставить("user_fio", СокрЛП(fio));
		ТранспортИнтеграции.ЗаписатьСессию(context_params, СтруктураАккаунтФИО);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке));
	КонецПопытки;
КонецПроцедуры

// Выполнение обязательных действий после получения подключения
//
// Параметры:
//  context_params - Структура - Контекст.
//  connection_info - Структура - информация о подключении.
//DynamicDirective
Процедура ПослеПолученияПодключения(context_params, connection_info) Экспорт
	
	ОбщиеНастройки = ОбщиеНастройкиПрочитать();
	ОбщиеНастройки.Вставить("ExtSysSettingsId", get_prop(connection_info, "ExtSysSettingsId", ""));
	ОбщиеНастройкиЗаписать(ОбщиеНастройки);
	
	//Установим признак необходимости получения токена
	context_params.Вставить("last_token_time", Неопределено);
	context_params.Вставить("service", СтатусыДокументовСервис(context_params));
	СтатусыДокументовИнициализация(context_params);
		
	НастройкиПодключенияЗаписать(context_params); 
	ЗаписатьСвойствоParent(context_params, connection_info);
КонецПроцедуры

// Записывает свойство Родитель
//
// Параметры:
//  context_param - Структура - Контекст.
//  connection_info - Структура - Информация о подключении.
//  parent - Произвольный - Родитель.
//
//DynamicDirective
Процедура ЗаписатьСвойствоParent(context_param = Неопределено, connection_info = Неопределено, parent = Неопределено) Экспорт
	ОбщиеНастройки = ОбщиеНастройкиПрочитать();
	Если parent = Неопределено Тогда
		Если ОбщиеНастройки.Свойство("parent") 
			И ЗначениеЗаполнено(ОбщиеНастройки.parent) Тогда
			Возврат;
		КонецЕсли;  
		Версия = ПреобразоватьВерсию(ВерсияМетаданных());
		id = connection_info.Получить("ConnectionId");
		params = Новый Структура("id,Версия",id,Версия);
		Результат = ТранспортИнтеграции.local_helper_read_connection(context_param, params);
		ОбщиеНастройки.Вставить("parent", Результат.Получить("parent")); 
	Иначе  
		ОбщиеНастройки.Вставить("parent", parent); 	
	КонецЕсли;
	ОбщиеНастройкиЗаписать(ОбщиеНастройки);	
КонецПроцедуры

