
&НаКлиенте
Функция ПолучитьРеквизитВладельцаФорм(Реквизит)
	ТекущийВладелец = ЭтаФорма;
	Пока ПолучитьСвойствоОбъектаНаКлиенте(ТекущийВладелец,"ВладелецФормы") <> Неопределено Цикл  
		ТекущийВладелец =  ТекущийВладелец.ВладелецФормы;
	КонецЦикла;
	РеквизитФормы = ПолучитьСвойствоОбъектаНаКлиенте(ТекущийВладелец,Реквизит); 	
	Возврат РеквизитФормы;
КонецФункции

&НаКлиенте
Функция ПолучитьСвойствоОбъектаНаКлиенте(ОбъектНаКлиенте, СвойствоОбъекта)
	Попытка 
		ЗначениеСвойстваОбъекта = ОбъектНаКлиенте[СвойствоОбъекта];
	Исключение   
		ЗначениеСвойстваОбъекта = Неопределено;	
	КонецПопытки;
	Возврат ЗначениеСвойстваОбъекта;
КонецФункции
