
&НаКлиенте
Функция ПолучитьСписокРегламентов(ВидОбъекта) Экспорт 
	ТипыДокументов	= ПолучитьИзОбъекта1СОбъектСБИС(ВидОбъекта);

	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	Возврат ТранспортИнтеграции.local_helper_regl_get_by_types(context_params, ТипыДокументов);
КонецФункции

&НаКлиенте
Функция ПолучитьИзОбъекта1СОбъектСБИС(ВидОбъекта)
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("algorithm",ВидОбъекта+"_read");
	ПараметрыВызова.Вставить("endpoint","info");	
	ПараметрыВызова.Вставить("params",	Неопределено);
	BlocklyExecutor = ПолучитьФормуBlockly();
	Результат = BlocklyExecutor.API_BLOCKLY_RUN(ПараметрыВызова);
	
	Если get_prop(Результат,"status") <> "complete" Тогда 
		ВызватьИсключение ( NewExtExceptionСтрока(,,"Не удалось получить регламенты по объекту "+ ВидОбъекта+": "+ExtExceptionToMessage(get_prop(Результат,"data"))));
	КонецЕсли;
	data = get_prop(Результат,"data","");
	obj_type = get_prop(data,"obj_type","");
	Если obj_type = Неопределено Тогда  
		Возврат Новый Массив();
	КонецЕсли;
	МассивТиповОбъектовАПИ = СтрРазделить82(obj_type,","); 
	Результат = Новый Массив;
	Для Каждого ТипОбъектаАПИ Из МассивТиповОбъектовАПИ Цикл
		Результат.Добавить(ТипСБИСПоТипуОбъектаАПИ(ТипОбъектаАПИ));
	КонецЦикла;		
	Возврат Результат;
КонецФункции	

&НаКлиенте
Функция ТипСБИСПоТипуОбъектаАПИ(Знач ТипОбъектаАПИ)
	Результат = ТипОбъектаАПИ;	
	Если Результат = "Больничный" Тогда
		Результат = "Allowance";
	ИначеЕсли Результат = "ГрафикОтпусков" Тогда
		Результат = "Согласование"; 	
	ИначеЕсли Результат = "Договор" Тогда
		Результат = "GphContract";
	ИначеЕсли Результат = "ИзменениеУсловийОплаты" Тогда
		Результат = "ИзмененияОклада";
	ИначеЕсли Результат = "ИндексацияЗаработка" Тогда
		Результат = "Indexation";
	ИначеЕсли Результат = "Командировка" Тогда
		Результат = "BusinessTrip";
	ИначеЕсли Результат = "ОтпускПоУходу" Тогда
		Результат = "Allowance";
	ИначеЕсли Результат = "ПереносОтпусков" Тогда
		Результат = "PlanVacationScheduleChange";
	ИначеЕсли Результат = "Табель" Тогда
		Результат = "ТабельДокумент";
	ИначеЕсли Результат = "СовмещениеДолжностей" Тогда
		Результат = "CombinationPositions";
	ИначеЕсли Результат = "АктПриемки" Тогда
		Результат = "GphAct";
	ИначеЕсли Результат = "ОтменаСовмещенияДолжностей" Тогда
		Результат = "CombinationCancel";
	ИначеЕсли Результат = "АвансовыйОтчет" Тогда
		Результат = "АвансОтчет";
	ИначеЕсли Результат = "ПрочийКадровыйДокумент" Тогда
		Результат = "CadresOther";
	Иначе
		Результат = ТипОбъектаАПИ;	
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ТипОбъектаАПИПоТипуСБИС(Знач ТипСБИС)
	Результат = ТипСБИС;	
// BSLLS:IfElseDuplicatedCondition-off
	Если Результат = "Allowance" Тогда
		Результат = "Больничный";
	ИначеЕсли Результат = "Согласование" Тогда
		Результат = "ГрафикОтпусков"; 	
	ИначеЕсли Результат = "GphContract" Тогда
		Результат = "Договор";
	ИначеЕсли Результат = "ИзмененияОклада" Тогда
		Результат = "ИзменениеУсловийОплаты";
	ИначеЕсли Результат = "Indexation" Тогда
		Результат = "ИндексацияЗаработка";
	ИначеЕсли Результат = "BusinessTrip" Тогда
		Результат = "Командировка";
	ИначеЕсли Результат = "Allowance" Тогда
		Результат = "ОтпускПоУходу";
	ИначеЕсли Результат = "PlanVacationScheduleChange" Тогда
		Результат = "ПереносОтпусков";
	ИначеЕсли Результат = "ТабельДокумент" Тогда
		Результат = "Табель";
	ИначеЕсли Результат = "CombinationPositions" Тогда
		Результат = "СовмещениеДолжностей";
	ИначеЕсли Результат = "GphAct" Тогда
		Результат = "АктПриемки";
	ИначеЕсли Результат = "CombinationCancel" Тогда
		Результат = "ОтменаСовмещенияДолжностей";
	ИначеЕсли Результат = "АвансОтчет" Тогда
		Результат = "АвансовыйОтчет";
	ИначеЕсли Результат = "CadresOther" Тогда
		Результат = "ПрочийКадровыйДокумент";
	Иначе
		Результат = ТипСБИС;	
	КонецЕсли;
// BSLLS:IfElseDuplicatedCondition-on
	Возврат Результат;
КонецФункции 

Функция КрасивоеПредставлениеПоТипуСБИС(Знач ТипСБИС, Знач Вид1С = Неопределено)
	СоответствиеТипов = Новый Соответствие;
	Результат = "";
	СоответствиеТипов.Вставить("Allowance", "Больничный");
	СоответствиеТипов.Вставить("Согласование", "График отпусков");
	СоответствиеТипов.Вставить("GphContract", "Договор");
	СоответствиеТипов.Вставить("ИзмененияОклада", "Изменение условий оплаты");
	СоответствиеТипов.Вставить("Indexation", "Индексация заработка");
	СоответствиеТипов.Вставить("BusinessTrip", "Командировка");
	СоответствиеТипов.Вставить("PlanVacationScheduleChange", "Перенос отпусков");
	СоответствиеТипов.Вставить("ТабельДокумент", "Табель");
	СоответствиеТипов.Вставить("CombinationPositions", "Совмещение должностей");
	СоответствиеТипов.Вставить("GphAct", "Акт приемки");
	СоответствиеТипов.Вставить("CombinationCancel", "Отмена совмещения должностей");
	СоответствиеТипов.Вставить("АвансОтчет", "Авансовый отчет");
	СоответствиеТипов.Вставить("CadresOther", "Прочий кадровый документ");
	СоответствиеТипов.Вставить("СлужЗап", "Задача");
	СоответствиеТипов.Вставить("СписочнаяКомандировка", "Списочная командировка");
	
	// Отпуск по уходу это фактически тот же больничный, 
	// Но БЛ не признает его отдельным документом, поэтому так
	Если ТипСБИС = "Allowance" И Вид1С = "ОтпускПоУходуЗаРебенком" Тогда
		Результат = "Отпуск по уходу за ребенком";  
	Иначе
		Результат = СоответствиеТипов[ТипСБИС];
	КонецЕсли;	
	Возврат Результат;
КонецФункции

