
Процедура ПослеОбновления(ПараметрыИнициализации)
	//Заполним справочник состояний объектов
	Справочники.Saby_СостоянияОбъектов.НачальнаяИнициализация();
	//Создадим ДопСведение - "КЭДО"
	СоздатьДополнительноеСвойствоКЭДО();
	ПараметрыИнициализации.ОбщиеНастройки.Вставить("ВерсияРасширения", ПараметрыИнициализации.НомерТекущейВерсии);
	ОбщиеНастройкиЗаписать(ПараметрыИнициализации.ОбщиеНастройки);
	СброситьКэшНаСервере();
КонецПроцедуры

Процедура ВключениеФункциональныхОпций()
	УстановитьПривилегированныйРежим(Истина);
	МетаданныеРасширения = ПолучитьМетаданныеРасширения();
	Если МетаданныеРасширения <> Неопределено Тогда
		Для каждого ФО Из МетаданныеРасширения.ФункциональныеОпции Цикл
			Константы[ФО.Имя].Установить(Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_Helpers_МодульСбросКеша
#КонецОбласти

