
&НаКлиенте
Функция ПолучитьФормуТранспорта(context_param, ФормаВладелец = Неопределено)
	ФормаТранспорта = ПолучитьРеквизитВладельцаФорм("ТранспортИнтеграции"); 
	Если ФормаТранспорта <> Неопределено Тогда
		Возврат ФормаТранспорта;
	КонецЕсли;	
	ФормаТранспорт = ПолучитьФормуОбработки("Transport", ПутьКФормамОбработки(), Неопределено, ФормаВладелец);
	Если ФормаТранспорт <> Неопределено Тогда 
		ФормаТранспорт.ИнициироватьТранспорт();	
	КонецЕсли;
	Возврат ФормаТранспорт; 	
КонецФункции

&НаКлиенте
Функция ПолучитьФормуBlockly(ФормаВладелец = Неопределено)
	ФормаBlocklyExecutor = ПолучитьРеквизитВладельцаФорм("BlocklyExecutor"); 
	Если ФормаBlocklyExecutor <> Неопределено Тогда
		Возврат ФормаBlocklyExecutor;
	КонецЕсли;
	ФормаBlocklyExecutor = ПолучитьФормуОбработки("BlocklyExecutor", ПутьКФормамОбработки(), Неопределено, ФормаВладелец);
	Если ФормаBlocklyExecutor <> Неопределено Тогда 
		ФормаBlocklyExecutor.ИнициироватьТранспорт();	
	КонецЕсли;
	Возврат ФормаBlocklyExecutor;	
КонецФункции
