
&НаКлиенте
Функция ПолучитьСписокРегламентов(ВидОбъекта) Экспорт 
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	
	ТипыДокументов	= ПолучитьИзОбъекта1СОбъектСБИС(ВидОбъекта);
	
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	
	Возврат ТранспортИнтеграции.local_helper_regl_get_by_types(context_params, ТипыДокументов);
КонецФункции

&НаКлиенте
Функция ПолучитьИзОбъекта1СОбъектСБИС(ВидОбъекта)
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("algorithm",ВидОбъекта+"_read");
	ПараметрыВызова.Вставить("endpoint","info");	
	ПараметрыВызова.Вставить("params",	Неопределено);
	BlocklyExecutor = ПолучитьФормуBlockly();
	Результат = BlocklyExecutor.API_BLOCKLY_RUN(ПараметрыВызова);
	
	Если get_prop(Результат,"status") <> "complete" Тогда 
		ВызватьИсключение ( NewExtExceptionСтрока(,,"Не удалось получить регламенты по объекту "+ ВидОбъекта+": "+ExtExceptionToMessage(get_prop(Результат,"data"))));
	КонецЕсли;
	data = get_prop(Результат,"data","");
	obj_type = get_prop(data,"obj_type","");
	Если obj_type = Неопределено Тогда  
		Возврат Новый Массив();
	КонецЕсли;
	МассивТиповОбъектовАПИ = СтрРазделить82(obj_type,","); 
	Результат = Новый Массив;
	Для Каждого ТипОбъектаАПИ Из МассивТиповОбъектовАПИ Цикл
		Результат.Добавить(ТипСБИСПоТипуОбъектаАПИ(ТипОбъектаАПИ));
	КонецЦикла;		
	Возврат Результат;
КонецФункции	

&НаКлиенте
Функция ТипСБИСПоТипуОбъектаАПИ(Знач ТипОбъектаАПИ)
	Результат = ТипОбъектаАПИ;	
	Если Результат = "Больничный" Тогда
		Результат = "Allowance";
	ИначеЕсли Результат = "ГрафикОтпусков" Тогда
		Результат = "Согласование"; 	
	ИначеЕсли Результат = "Договор" Тогда
		Результат = "GphContract";
	ИначеЕсли Результат = "ИзменениеУсловийОплаты" Тогда
		Результат = "ИзмененияОклада";
	ИначеЕсли Результат = "ИндексацияЗаработка" Тогда
		Результат = "Indexation";
	ИначеЕсли Результат = "Командировка" Тогда
		Результат = "BusinessTrip";
	ИначеЕсли Результат = "ОтпускПоУходу" Тогда
		Результат = "Allowance";
	ИначеЕсли Результат = "ПереносОтпусков" Тогда
		Результат = "PlanVacationScheduleChange";
	ИначеЕсли Результат = "Табель" Тогда
		Результат = "ТабельДокумент";
	ИначеЕсли Результат = "СовмещениеДолжностей" Тогда
		Результат = "CombinationPositions";
	ИначеЕсли Результат = "АктПриемки" Тогда
		Результат = "GphAct";
	ИначеЕсли Результат = "ОтменаСовмещенияДолжностей" Тогда
		Результат = "CombinationCancel";
	ИначеЕсли Результат = "АвансовыйОтчет" Тогда
		Результат = "АвансОтчет";
	ИначеЕсли Результат = "ПрочийКадровыйДокумент" Тогда
		Результат = "CadresOther";
	Иначе
		Результат = ТипОбъектаАПИ;	
	КонецЕсли;
	Возврат Результат;
КонецФункции
