
&НаКлиенте
Функция ПолучитьПрямуюССылку(СсылкаIE)
	ПреобразованнаяСсылкаIE = СтрЗаменить(СсылкаIE, "://ie-1c.", "://online.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://fix-ie-1c.", "://fix-online.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://test-ie-1c.", "://test-online.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://pre-test-ie-1c.", "://pre-test-online.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://ieg-1c.", "://online.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://fix-ieg-1c.", "://fix-online.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://test-ieg-1c.", "://test-online.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://pre-test-ieg-1c.", "://pre-test-online.");
	Возврат ПреобразованнаяСсылкаIE;
КонецФункции
