
&НаКлиенте
Функция ПолучитьФормуТранспорта(context_param) 
	ФормаТранспорт = ПолучитьФормуОбработки("Transport", ПутьКФормамОбработки(), Неопределено, );
	Возврат ФормаТранспорт; 	
КонецФункции

&НаКлиенте
Функция ПолучитьФормуBlockly()
	ФормаBlocklyExecutor = ПолучитьФормуОбработки("BlocklyExecutor", ПутьКФормамОбработки(), Неопределено, );
	Если ФормаBlocklyExecutor <> Неопределено Тогда 
		ФормаBlocklyExecutor.ИнициироватьТранспорт();	
	КонецЕсли;
	Возврат ФормаBlocklyExecutor;	
КонецФункции
