
&НаКлиенте
Функция ПолучитьСписокРегламентов(ВидОбъекта) Экспорт 
	ТипыДокументов = Новый Массив;
	Для каждого ТипаОбъекта Из ТипыВыгружаемыхОбъектов Цикл
		ТипыДокументов.Добавить(ТипаОбъекта.ТипыОбъекта);	
	КонецЦикла;	

	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	Возврат ТранспортИнтеграции.local_helper_regl_get_by_types(context_params, ТипыДокументов);
КонецФункции

&НаКлиенте
Функция ПолучитьИзОбъекта1СОбъектСБИС(ИмяОбъектаИС)
	ПараметрыВызова = Новый Структура;
	
	
	СписокИнишек = СписокДоступныхИнишек(ИмяОбъектаИС);
	МассивПараметровОбъектов = Новый Массив;
		
	Для каждого ФайлНастроек из СписокИнишек Цикл
		ПараметрыВызова.Вставить("Algorithm", ФайлНастроек);
		ПараметрыВызова.Вставить("Endpoint", "info");	
		BlocklyExecutor = ПолучитьФормуBlockly();
		Результат = BlocklyExecutor.API_BLOCKLY_RUN(ПараметрыВызова);
		
		Если get_prop(Результат,"Status") <> "complete" Тогда 
			ВызватьИсключение ( NewExtExceptionСтрока(,,"Не удалось получить регламенты по объекту "+ ИмяОбъектаИС+": "+ExtExceptionToMessage(get_prop(Результат,"Result"))));
		КонецЕсли;
		data = get_prop(Результат,"Result","");
		Если Не get_prop(data,"type","") = "read" Тогда
			Продолжить;
		КонецЕсли;	
		obj_type = get_prop(data,"obj_type","");
		ext_sys_obj_title = get_prop(data,"ext_sys_obj_title",""); 
		Если obj_type = Неопределено Тогда  
			Возврат Новый Массив();
		КонецЕсли;
		МассивТиповОбъектовАПИ = СтрРазделить82(obj_type,",");
		Если МассивТиповОбъектовАПИ.Количество() > 0 Тогда			
			ПараметрыОбъекта = Новый Структура("SbisType, Api3Type, Title, Ini",
				ТипСБИСПоТипуОбъектаАПИ(МассивТиповОбъектовАПИ[0]), МассивТиповОбъектовАПИ[0], ext_sys_obj_title, ФайлНастроек);
			МассивПараметровОбъектов.Добавить(ПараметрыОбъекта);
		КонецЕсли;	
	КонецЦикла;	
	Возврат МассивПараметровОбъектов;
КонецФункции

&НаКлиенте
Функция СписокДоступныхИнишек(ИмяОбъектаИС)
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	мИниФайлов	= Новый Массив();
	мИниФайлов.Добавить(Новый Структура("type, name", "Система", "ОбъектыСинхBlockly"));
	params	= Новый Структура(
			"props, ini",
			Новый Структура("id, type_data, requested_ini_format", context_params.ConnectionId, 1, "Dom1C"), мИниФайлов);
	res = ТранспортИнтеграции.local_helper_integration_api(context_params, "IntegrationConnection.ReadConnection", params, "int-settings");
	ОбъектыИСОбъектыСБИС = get_prop(get_prop(get_prop(res, "data"), "ОбъектыСинхBlockly"), "data");
	ОбъектыИС = get_prop(ОбъектыИСОбъектыСБИС, "ОбъектыИС");
	// ОбъектыСБИС = get_prop(ОбъектыИСОбъектыСБИС, "Объекты");
	Если ОбъектыИС[ИмяОбъектаИС] = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;	
	Возврат ОбъектыИС[ИмяОбъектаИС];
КонецФункции	

