
//DynamicDirective

Функция ТипСБИСПоТипуОбъектаАПИ(Знач ТипОбъектаАПИ)
    СловарьСБИСвАПИ3 = Новый Соответствие;
    СловарьСБИСвАПИ3.Вставить("Больничный", "Allowance");
    СловарьСБИСвАПИ3.Вставить("ГрафикОтпусков", "Согласование");
    СловарьСБИСвАПИ3.Вставить("ПриемНаРаботуГПХ", "GphContract");
    СловарьСБИСвАПИ3.Вставить("ИзменениеУсловийОплаты", "ИзмененияОклада");
    СловарьСБИСвАПИ3.Вставить("ИндексацияЗаработка", "Indexation");
    СловарьСБИСвАПИ3.Вставить("Командировка", "BusinessTrip");
    СловарьСБИСвАПИ3.Вставить("СписочнаяКомандировка", "BusinessTrip");
    СловарьСБИСвАПИ3.Вставить("ОтпускПоУходу", "Allowance");
    СловарьСБИСвАПИ3.Вставить("ПереносОтпусков", "PlanVacationScheduleChange");
    СловарьСБИСвАПИ3.Вставить("Табель", "ТабельДокумент");
    СловарьСБИСвАПИ3.Вставить("СовмещениеДолжностей", "CombinationPositions");
    СловарьСБИСвАПИ3.Вставить("АктПриемки", "GphAct");
    СловарьСБИСвАПИ3.Вставить("ОтменаСовмещенияДолжностей", "CombinationCancel");
    СловарьСБИСвАПИ3.Вставить("АвансовыйОтчет", "АвансОтчет");
    СловарьСБИСвАПИ3.Вставить("ПрочийКадровыйДокумент", "CadresOther");
    СловарьСБИСвАПИ3.Вставить("ВыдачаЗарплаты", "PayoutDoc");
    СловарьСБИСвАПИ3.Вставить("НачислениеПоЗарплате", "НачисленияПоЗарплате");
    СловарьСБИСвАПИ3.Вставить("УдержаниеПоЗарплате", "НачисленияПоЗарплате");
	СловарьСБИСвАПИ3.Вставить("Реализация", "ДокОтгрИсх");
	СловарьСБИСвАПИ3.Вставить("ЗаказПокупателя", "ЗаказВх");
	СловарьСБИСвАПИ3.Вставить("ЗаказПоставщику", "ЗаказИсх");
	СловарьСБИСвАПИ3.Вставить("КорректировкаРеализации", "CorrOut");
	СловарьСБИСвАПИ3.Вставить("ВозвратПоставщику", "ReturnOut");
    СловарьСБИСвАПИ3.Вставить("ВозвратОтПокупателя", "ReturnIn");
    СловарьСБИСвАПИ3.Вставить("СчетФактураВыданный", "ФактураИсх");
    СловарьСБИСвАПИ3.Вставить("СчетФактураПолученный", "ФактураВх");
	СловарьСБИСвАПИ3.Вставить("КорректировкаПоступления", "CorrIn");
	СловарьСБИСвАПИ3.Вставить("СчетНаОплату", "СчетИсх");
    
    Результат = СловарьСБИСвАПИ3[ТипОбъектаАПИ];
    Если Результат = Неопределено Тогда 
        Результат = ТипОбъектаАПИ;
    КонецЕсли;
    Возврат Результат;
КонецФункции

//DynamicDirective

Функция ТипОбъектаАПИПоТипуСБИС(Знач ТипСБИС, Знач ПримечаниеСБИС, Знач ИдентификаторДокумента, context_params)
	СловарьСБИСвАПИ3 = Новый Соответствие;
	Если ТипСБИС = "Allowance" Тогда
		Если Найти(ПримечаниеСБИС, "уход") > 0 Тогда
			ДокументСБИС = ТранспортИнтеграции.local_helper_read_document(context_params, Новый Структура("Идентификатор", ИдентификаторДокумента));
			Если Найти(ДокументСБИС["Регламент"]["Название"], "уход") > 0 И Найти(ДокументСБИС["Регламент"]["Название"], "Больничный") = 0 Тогда 
				ТипСБИС = "ОтпускПоУходу";
			Иначе
				ТипСБИС = "Больничный";        
			КонецЕсли;
		Иначе
			ТипСБИС = "Больничный";   
		КонецЕсли;
		Возврат ТипСБИС;
    Иначе
		СловарьСБИСвАПИ3.Вставить("СлужЗап", "Задача");
		СловарьСБИСвАПИ3.Вставить("АвансОтчёт", "АвансовыйОтчёт");
		СловарьСБИСвАПИ3.Вставить("АвансОтчет", "АвансовыйОтчет");
		СловарьСБИСвАПИ3.Вставить("ВнутрПрм", "ВнутреннееПеремещение");
		СловарьСБИСвАПИ3.Вставить("PayoutDoc", "ВыдачаЗарплаты");
		СловарьСБИСвАПИ3.Вставить("ДоговорДок", "Договор");
		СловарьСБИСвАПИ3.Вставить("PriceChange", "ИзменениеЦен");
		СловарьСБИСвАПИ3.Вставить("Номенклатура", "ПоказательОстатокНаСкладе");
		СловарьСБИСвАПИ3.Вставить("ДокОтгрВх", "Поступление");
		СловарьСБИСвАПИ3.Вставить("Прайсы", "Прайс");
		СловарьСБИСвАПИ3.Вставить("ДокОтгрИсх", "Реализация");
		СловарьСБИСвАПИ3.Вставить("СчетИсх", "СчетНаОплату");
		СловарьСБИСвАПИ3.Вставить("УдержанияПоЗарплате", "УдержаниеПоЗарплате");
		СловарьСБИСвАПИ3.Вставить("ШтатнаяДолжность", "ШтатноеРасписание");
		СловарьСБИСвАПИ3.Вставить("Согласование", "ГрафикОтпусков");
		СловарьСБИСвАПИ3.Вставить("CadresOther", "ПрочийКадровыйДокумент");
		СловарьСБИСвАПИ3.Вставить("НачисленияПоЗарплате", "НачислениеПоЗарплате");
		СловарьСБИСвАПИ3.Вставить("PlanVacationScheduleChange", "ПереносОтпусков");
		СловарьСБИСвАПИ3.Вставить("ТабельДокумент", "Табель");
		СловарьСБИСвАПИ3.Вставить("ИзмененияОклада", "ИзменениеУсловийОплаты");
		СловарьСБИСвАПИ3.Вставить("Indexation", "ИндексацияЗаработка");
		СловарьСБИСвАПИ3.Вставить("GphAct", "АктПриемки");
		СловарьСБИСвАПИ3.Вставить("CombinationPositions", "СовмещениеДолжностей");
		СловарьСБИСвАПИ3.Вставить("BusinessTrip", "СписочнаяКомандировка");
		СловарьСБИСвАПИ3.Вставить("GphContract", "ПриемНаРаботуГПХ");
		СловарьСБИСвАПИ3.Вставить("CombinationCancel", "ОтменаСовмещенияДолжностей");
		СловарьСБИСвАПИ3.Вставить("BTCorrection", "КорректировкаСписочнойКомандировки");
		СловарьСБИСвАПИ3.Вставить("TimesheetCorrection", "КорректировкаТабеля");
		СловарьСБИСвАПИ3.Вставить("РеалВх", "Поступление");
		СловарьСБИСвАПИ3.Вставить("StaffStatements", "КадровоеЗаявление");
		СловарьСБИСвАПИ3.Вставить("ФактураСкВх", "СчетФактураПолученный"); 
		СловарьСБИСвАПИ3.Вставить("ЗаказВх", "ЗаказПокупателя");
		СловарьСБИСвАПИ3.Вставить("ЗаказСкВх", "ЗаказПокупателя");
		СловарьСБИСвАПИ3.Вставить("ЗаказИсх", "ЗаказПоставщику");
		СловарьСБИСвАПИ3.Вставить("CorrOut", "КорректировкаРеализации");
		СловарьСБИСвАПИ3.Вставить("ReturnOut", "ВозвратПоставщику");
		СловарьСБИСвАПИ3.Вставить("ReturnIn", "ВозвратОтПокупателя");
		СловарьСБИСвАПИ3.Вставить("ФактураИсх", "СчетФактураВыданный");
		СловарьСБИСвАПИ3.Вставить("ФактураВх", "СчетФактураПолученный");
		СловарьСБИСвАПИ3.Вставить("CorrWhOut", "КорректировкаРеализации");
		СловарьСБИСвАПИ3.Вставить("CorrWhIn", "КорректировкаПоступления");
		СловарьСБИСвАПИ3.Вставить("CorrIn", "КорректировкаПоступления");
		СловарьСБИСвАПИ3.Вставить("СчетСкИсх", "СчетНаОплату");
		СловарьСБИСвАПИ3.Вставить("РеалИсх", "Реализация");
		СловарьСБИСвАПИ3.Вставить("ReturnWhIn", "ВозвратОтПокупателя");
		СловарьСБИСвАПИ3.Вставить("ReturnWhOut", "ВозвратПоставщику");
        СловарьСБИСвАПИ3.Вставить("ФактураСкИсх", "СчетФактураВыданный");
	КонецЕсли;	
   
    Результат = СловарьСБИСвАПИ3[ТипСБИС];
    Если Результат = Неопределено Тогда 
        Результат = ТипСБИС;
    КонецЕсли;
    Возврат Результат;
КонецФункции 
