
// Функция ПрочитатьИзХранилища
//
// Параметры:
// 	КлючОбъекта - Произвольный - Ключ объекта настройки.
// 	КлючНастройки - Строка - Ключ загружаемых настроек.
// 	ОписаниеНастройки - ОписаниеНастроек - Описание настроек.
// 	ПользовательНастройки -  Строка - Имя пользователя,
//
// Возвращаемое значение:
//  - Неопределено, Произвольный - Результат работы метода
//
// TODO Depricated 
&НаСервере
Функция ПрочитатьИзХранилища(КлючОбъекта, КлючНастройки = "", ОписаниеНастройки = Неопределено, 
	ПользовательНастройки = Неопределено) Экспорт
// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
// BSLLS:SetPrivilegedMode-on
	Возврат ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастройки, ОписаниеНастройки, ПользовательНастройки);
КонецФункции

// Функция ЗаписатьВХранилище
//
// Параметры:
// 	КлючОбъекта - Произвольный - Ключ объекта настройки.
// 	КлючНастройки - Строка - Ключ загружаемых настроек.
// 	Настройки - Произвольный - Настройки пользователя.
// 	ОписаниеНастройки - ОписаниеНастроек - Описание настроек.
// 	ПользовательНастройки -  Строка - Имя пользователя,
//
// Возвращаемое значение:
//  - Булево - Результат работы метода
//
// Все параметры нужны
// BSLLS:NumberOfOptionalParams-off
&НаСервере
Функция ЗаписатьВХранилище(КлючОбъекта, КлючНастройки = "", Настройки = Неопределено, ОписаниеНастройки = Неопределено,
 ПользовательНастройки = Неопределено) Экспорт
// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
// BSLLS:SetPrivilegedMode-on
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастройки, Настройки, ОписаниеНастройки, ПользовательНастройки);
	Возврат Истина;
КонецФункции
// BSLLS:NumberOfOptionalParams-on
