
// Возвращает Признак сузествования метаданных.
//
// Параметры:
//  Тип                    - Строкаи - Имя типа метаданных
//  Имя                  - Строкаи - Имя объекта метаданных
//
// Возвращаемое значение:
//  Будево                       - Признак сузествования метаданных
//
//DynamicDirective
Функция ЕстьМетаданные(Знач Тип, Знач Имя)
	Возврат Метаданные[Тип].Найти(Имя) <> Неопределено;
КонецФункции

// Возвращает по возможности ФизЛоцоо сотрудника или тот же объект.
//
// Параметры:
//  Сотрудник                	   - Ссылка - ссылка на объект
//  ЗнчПоУмолчанию         		 - Ссылка - Возвращаемое знч по умолчанию когда нет физ лица
//
// Возвращаемое значение:
//  Ссылка                       - Ссылка, Неопределено - 
//
//DynamicDirective
Функция ФизЛицоСотрудника(Знач Сотрудник, ЗнчПоУмолчанию = Неопределено)
	ЕстьСотрудники = Метаданные["Справочники"].Найти("Сотрудники") <> Неопределено;
	Если ЕстьСотрудники И ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Сотрудники") Тогда
		Возврат	get_prop(Сотрудник, "ФизическоеЛицо", ЗнчПоУмолчанию);
	КонецЕсли;
	Возврат	Сотрудник;
КонецФункции
