
// Функция ПрочитатьИзХранилищаСистемныхНастроек
//
// Параметры:
// 	КлючОбъекта - Произвольный - Ключ объекта настройки.
// 	КлючНастройки - Строка - Ключ загружаемых настроек.
// 	ОписаниеНастройки - ОписаниеНастроек - Описание настроек.
// 	ПользовательНастройки -  Строка - Имя пользователя,
//
// Возвращаемое значение:
//  - Неопределено, Произвольный - Результат работы метода
//
// TODO Depricated 
&НаСервере
Функция ПрочитатьИзХранилищаСистемныхНастроек(КлючОбъекта, КлючНастройки = "", ОписаниеНастройки = Неопределено, 
	ПользовательНастройки = Неопределено) Экспорт
// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
// BSLLS:SetPrivilegedMode-on
	Возврат ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючНастройки,
													ОписаниеНастройки, ПользовательНастройки);
КонецФункции

// Функция ЗаписатьВХранилищеСистемныхНастроек
//
// Параметры:
// 	КлючОбъекта - Произвольный - Ключ объекта настройки.
// 	КлючНастройки - Строка - Ключ загружаемых настроек.
// 	Настройки - Произвольный - Настройки пользователя.
// 	ОписаниеНастройки - ОписаниеНастроек - Описание настроек.
// 	ПользовательНастройки -  Строка - Имя пользователя,
//
// Возвращаемое значение:
//  - Булево - Результат работы метода
//
// Все параметры нужны
// BSLLS:NumberOfOptionalParams-off
&НаСервере
Функция ЗаписатьВХранилищеСистемныхНастроек(КлючОбъекта, КлючНастройки = "", Настройки = Неопределено,
 			ОписаниеНастройки = Неопределено, ПользовательНастройки = Неопределено) Экспорт
// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
// BSLLS:SetPrivilegedMode-on
	ХранилищеСистемныхНастроек.Сохранить(КлючОбъекта, КлючНастройки, Настройки,
											ОписаниеНастройки, ПользовательНастройки);
	Возврат Истина;
КонецФункции
// BSLLS:NumberOfOptionalParams-on

