
//DynamicDirective
Функция has_prop(СтруктураИсточник, ИмяСвойства, ЗначениеПоУмолчанию=Неопределено) Экспорт
	Возврат ЗначениеЗаполнено(get_prop(СтруктураИсточник, ИмяСвойства, ЗначениеПоУмолчанию));
КонецФункции

//DynamicDirective
Функция get_prop(СтруктураИсточник, ИмяСвойства, ЗначениеПоУмолчанию=Неопределено) Экспорт
	Если СтруктураИсточник = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Значение = Неопределено;
	Если ТипЗнч(СтруктураИсточник) = Тип("Структура") И (НЕ СтруктураИсточник.Свойство(ИмяСвойства, Значение)) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Попытка
		Значение = СтруктураИсточник[ИмяСвойства];
	Исключение
		Возврат ЗначениеПоУмолчанию;
	КонецПопытки;
	Если Значение = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Возврат Значение;
КонецФункции

//DynamicDirective
Функция set_prop(СтруктураИсточник, СтруктураНазначения, ИмяСвойстваИсточник, ИмяСвойстваПриемник,ЗначениеПоУмолчанию = Неопределено) Экспорт
	ЗначениеИсточник = Get_Prop(СтруктураИсточник, ИмяСвойстваИсточник, ЗначениеПоУмолчанию);
	Если ЗначениеИсточник <> Неопределено Тогда
		СтруктураНазначения.Вставить(ИмяСвойстваПриемник, ЗначениеИсточник);
	КонецЕсли;
КонецФункции

