
Функция СформироватьУРЛСТикетом(Знач УрлРесурса, Тикет)
	
	ПосОРГ3 = Найти(УрлРесурса, "&org=3");
	Если ПосОРГ3 > 0 Тогда
		УрлРесурса	= Сред(УрлРесурса, 1, ПосОРГ3 - 1);
	КонецЕсли;				
	
	УрлРесурса = УрлРесурса + ?(ЗначениеЗаполнено(Тикет), "&ticket=" + Тикет, "");
	
	Возврат УрлРесурса;
	
КонецФункции

// Возвращает префикс названия записи в плане видов характеристик, где хранятся названия дополнительных свойств
//
// Параметры:
//  context_params - Структура - Контекст.
//
// Возвращаемое значение:
//  Строка - префикс = имя сервиса
//
Функция СтатусыДокументовСервис(context_params)
	// значения из СписокСерверовSaby()
	ИмяСервераСтр = get_prop(context_params, "api_url", "");
	Если Найти(ИмяСервераСтр, "pre-test-") > 0 Тогда
		Возврат "pre-test";
	ИначеЕсли Найти(ИмяСервераСтр, "stest-") > 0 Или Найти(ИмяСервераСтр, ".sabytest.") > 0 Тогда
		Возврат "stest";
	ИначеЕсли Найти(ИмяСервераСтр, "test-") > 0 Тогда
		Возврат "test";
	ИначеЕсли Найти(ИмяСервераСтр, "fix-") > 0 Тогда
		Возврат "fix";
	//ИначеЕсли Найти(ИмяСервераСтр, "ie-1c.saby.ru") > 0 Тогда
	//	Возврат ""; // онлайн
	//ИначеЕсли Найти(ИмяСервераСтр, "ieg-1c.sbis.ru") > 0 Тогда
	//	Возврат ""; // онлайн
	//Иначе
	//	Возврат "undefine";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

