
Функция СформироватьУРЛСТикетом(Знач УрлРесурса, Тикет)
	
	ПосОРГ3 = Найти(УрлРесурса, "&org=3");
	Если ПосОРГ3 > 0 Тогда
		УрлРесурса	= Сред(УрлРесурса, 1, ПосОРГ3 - 1);
	КонецЕсли;				
	
	УрлРесурса = УрлРесурса + ?(ЗначениеЗаполнено(Тикет), "&ticket=" + Тикет, "");
	
	Возврат УрлРесурса;
	
КонецФункции

// Возвращает префикс названия записи в плане видов характеристик, где хранятся названия дополнительных свойств
//
// Параметры:
//  context_params - Структура - Контекст.
//
// Возвращаемое значение:
//  Строка - префикс = имя сервиса
//
Функция СтатусыДокументовСервис(context_params)
	Contour = get_prop(context_params, "Contour");
	Если Contour = Неопределено Тогда
		ЗаполнитьПараметрыПодключенияПоУРЛ(context_params);
		Contour = get_prop(context_params, "Contour", "");
	КонецЕсли;
	Domain = get_prop(context_params, "Domain", "");
	
	Префикс = Contour;
	
	Если Domain = "sabytest" Тогда
		Префикс = Префикс + "-stest";
	КонецЕсли;
	
	Возврат Префикс;
КонецФункции

Процедура ЗаполнитьПараметрыПодключенияПоУРЛ(context_params)
	ИмяСервераСтр = get_prop(context_params, "api_url", "");
	Если Найти(ИмяСервераСтр, "pre-test-") > 0 Тогда
		Contour = "pre-test";
	ИначеЕсли Найти(ИмяСервераСтр, "test-") > 0 Тогда
		Contour = "test";
	ИначеЕсли Найти(ИмяСервераСтр, "fix-") > 0 Тогда
		Contour = "fix";
	Иначе
		Contour = "";
	КонецЕсли;
	Если Найти(ИмяСервераСтр, ".ru") > 0 Тогда
		Country = "RU";
	Иначе
		Country = "KZ";
	КонецЕсли;
	Если Найти(ИмяСервераСтр, ".setty") > 0 Тогда
		Domain = "Setty";
	Иначе
		Domain = "Saby";
	КонецЕсли;
	context_params.Вставить("Country", Country);
	context_params.Вставить("Domain", Domain);
	context_params.Вставить("Contour", Contour);
КонецПроцедуры

