				
Функция ВложениеФайлСДиска(ПечатнаяФормаДокумента)
	context_params	= ПроверитьНаличиеПараметровПодключения();
	
	ИмяФайла	= ПечатнаяФормаДокумента.Команда.ИмяФайла;
	ТипКонтента	= ПолучитьКонтентТипВложения(ИмяФайла);
	АдресВХранилище = get_prop(ПечатнаяФормаДокумента.Команда, "АдресВХранилище");
	ФайлBase64	= ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	СуффиксФайла = Saby_СтрРазделить82(ИмяФайла, ".");
	СуффиксФайла = СуффиксФайла[СуффиксФайла.Количество() - 1];
	Файл = Новый Структура("Имя", ИмяФайла);
	
	Попытка
		СсылкаНаPDF = local_helper_convert_to_pdfa_to_disk_x(context_params, ФайлBase64, ИмяФайла); 	
		
		Если get_prop(СсылкаНАPDF, "Convert", Ложь) И НРег(СуффиксФайла) <> "pdf" Тогда
			СсылкаНаСБИСДиск = get_prop(СсылкаНаPDF, "FileId");
			ИмяФайла = get_prop(СсылкаНаPDF, "FileName");
			ТипКонтента = "application/pdf";
		КонецЕсли;
		СсылкаНаСБИСДиск = get_prop(СсылкаНаPDF, "FileId");
		Файл.Вставить("Ссылка", СсылкаНаСБИСДиск); 
		Файл.Вставить("ContentType", ТипКонтента); 
	Исключение  
		Файл.Вставить("ДвоичныеДанные", ФайлBase64); 	
	КонецПопытки;
	УдалитьИзВременногоХранилища(АдресВХранилище);	
	Вложение = Новый Структура("Название, Файл", ПечатнаяФормаДокумента.Представление, Файл);
	Возврат Вложение;
КонецФункции

&НаСервере
Функция ЗаполнитьСтруктуруПечатныхФормДляПередачи(ВложенияПоТипамДокументов) Экспорт 
	НазваниеСтр	= "Название";
	ФайлСтр		= "Файл";
	ИмяСтр		= "Имя";
	ContentTypeStr	= "ContentType";
	ПрисоединенныйФайлСтр = "ПрисоединенныйФайл";

	ВыбранныеПечатныеФормы = Новый Структура();
	Для Каждого ПечатнаяФормаДокумента Из ВложенияПоТипамДокументов Цикл 
	
		ВидОбъекта = ПечатнаяФормаДокумента.ВидОбъекта;
		Если ПустаяСтрока(ВидОбъекта) Тогда
			ВидОбъекта = "БезОбъекта";
		КонецЕсли;
		Если НЕ ВыбранныеПечатныеФормы.Свойство(ВидОбъекта) Тогда
			ВыбранныеПечатныеФормы.Вставить(ВидОбъекта, Новый Массив());
		КонецЕсли;
		Если ПечатнаяФормаДокумента.ОтметкаВыбора = Ложь Тогда
			Продолжить;
        ИначеЕсли ПечатнаяФормаДокумента.ТипВложения = "ПечатнаяФорма" Тогда
			// Печатная форма
			ФайлПФ = Новый Структура();
			ФайлПФ.Вставить("ПечатнаяФормаДокумента", ПечатнаяФормаДокумента.Представление);
			Вложение = Новый Структура();
			Вложение.Вставить(НазваниеСтр, ПечатнаяФормаДокумента.Представление);
			Вложение.Вставить(ФайлСтр, ФайлПФ);
			
			ВыбранныеПечатныеФормы[ВидОбъекта].Добавить(Вложение);
		ИначеЕсли ПечатнаяФормаДокумента.ТипВложения = "ФайлСДиска" Тогда
			// Прикреплённый файл с компьютера
			Вложение =  ВложениеФайлСДиска(ПечатнаяФормаДокумента);
			ВыбранныеПечатныеФормы[ВидОбъекта].Добавить(Вложение);
		ИначеЕсли ПечатнаяФормаДокумента.ТипВложения = "ПрисоединенныйФайл" Тогда
			// Прикреплённый файл от объекта
			ФайлСсылка = ПечатнаяФормаДокумента.Команда.Ссылка;
			ДанныеФайла	= ПолучитьДанныеПрисоединенногоФайла(ФайлСсылка);
			ИмяФайла	= ДанныеФайла.ИмяФайла;
			ТипКонтента	= ПолучитьКонтентТипВложения(ИмяФайла);
			
			ФайлПФ = Новый Структура();
			ФайлПФ.Вставить(ИмяСтр, ИмяФайла);
			ФайлПФ.Вставить(ПрисоединенныйФайлСтр, Истина);
			ФайлПФ.Вставить(ContentTypeStr, ТипКонтента);
			Вложение = Новый Структура();
			Вложение.Вставить(НазваниеСтр, ПечатнаяФормаДокумента.Представление);
			Вложение.Вставить(ФайлСтр, ФайлПФ);

			ВложениеСертификаты = ПодписиВложения(ФайлСсылка);
			Если ВложениеСертификаты.Количество() Тогда
				Вложение.Вставить("Подпись", ВложениеСертификаты);
			КонецЕсли;			
			ВыбранныеПечатныеФормы[ВидОбъекта].Добавить(Вложение);
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыбранныеПечатныеФормы;
КонецФункции

