
// Получить Структуру Из Соответствия
//
// Параметры:
//  ЗначВход  - Структура, Соответствие - произвольная структура
//
// Возвращаемое значение:
//   Структура.
//
//DynamicDirective
Функция ПолучитьСтруктуруИзСоответствия(ЗначВход)
	Если ТипЗнч(ЗначВход)=Тип("Соответствие") Тогда
		Возврат ТипЗначенияСоответствие(ЗначВход);
	Иначе
		Если ТипЗнч(ЗначВход)=Тип("Массив") Тогда
			Возврат ТипЗначенияМассив(ЗначВход);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначВход; 
КонецФункции

// Преобразуем входящее значение в структуру
//
// Параметры:
//  ЗначВход  - Структура, Соответствие - произвольная структура
//
// Возвращаемое значение:
//   Структура.
//
//DynamicDirective
Функция ТипЗначенияСоответствие(ЗначВход)
	СтруктураВозврат=Новый Структура;
	ФлагОшибка=Ложь;
	
	Для Каждого р Из ЗначВход Цикл
		Попытка
			СтруктураВозврат.Вставить(р.Ключ,ПолучитьСтруктуруИзСоответствия(р.Значение));
		Исключение
			ФлагОшибка=Истина;
			Прервать;
		КонецПопытки;
	КонецЦикла;
	
	Если ФлагОшибка Тогда // пришел ключ, который не возможно поместить в структуру
		СтруктураВозврат = Новый Массив;
		Для Каждого р Из ЗначВход Цикл
			ДопСтруктура=Новый Структура;
			ДопСтруктура.Вставить("Ключ",р.Ключ);
			ДопСтруктура.Вставить("Значение",ПолучитьСтруктуруИзСоответствия(р.Значение));
			СтруктураВозврат.Добавить(ДопСтруктура);
		КонецЦикла;
	КонецЕсли;
	Возврат СтруктураВозврат;
КонецФункции

// Преобразуем входящее значение в массив
//
// Параметры:
//  ЗначВход  - Структура, Соответствие - произвольная структура
//
// Возвращаемое значение:
//   Массив.
//
//DynamicDirective
Функция ТипЗначенияМассив(ЗначВход)
	НовыйМассив=Новый Массив;
	Для Каждого ЭлМ Из ЗначВход Цикл
		НовыйМассив.Добавить(ПолучитьСтруктуруИзСоответствия(ЭлМ));
	КонецЦикла;
	Возврат НовыйМассив;	
КонецФункции
