				
Функция ЗаполнитьСтруктуруПечатныхФормДляПередачи(ВложенияПоТипамДокументов) Экспорт 
	ВыбранныеПечатныеФормы = Новый Структура();
	Для каждого ПечатнаяФормаДокумента Из ВложенияПоТипамДокументов Цикл
        ВидОбъекта = ПечатнаяФормаДокумента.ВидОбъекта;
		Если ПустаяСтрока(ВидОбъекта) Тогда
			ВидОбъекта = "БезОбъекта";
		КонецЕсли;
		Если НЕ ВыбранныеПечатныеФормы.Свойство(ВидОбъекта) Тогда
			ВыбранныеПечатныеФормы.Вставить(ВидОбъекта, Новый Массив());
		КонецЕсли;
		Если ПечатнаяФормаДокумента.ТипВложения = "ПечатнаяФорма" И ПечатнаяФормаДокумента.ОтметкаВыбора Тогда
			//Печатная форма
			Вложение = Новый Структура("Название, Файл", ПечатнаяФормаДокумента.Представление, Новый Структура("ПечатнаяФормаДокумента", ПечатнаяФормаДокумента.Представление));
			ВыбранныеПечатныеФормы[ВидОбъекта].Добавить(Вложение);
		ИначеЕсли ПечатнаяФормаДокумента.ТипВложения = "ФайлСДиска" И ПечатнаяФормаДокумента.ОтметкаВыбора Тогда
			//Прикреплённый файл
			context_params	= ПроверитьНаличиеПараметровПодключения();
			
			ИмяФайла	= ПечатнаяФормаДокумента.Команда.ИмяФайла;
			ТипКонтента	= ПолучитьКонтентТипВложения(ИмяФайла);
			АдресВХранилище = get_prop(ПечатнаяФормаДокумента.Команда, "АдресВХранилище");
			ФайлBase64	= ПолучитьИзВременногоХранилища(АдресВХранилище);
			
			СуффиксФайла = СтрРазделить82(ИмяФайла,".");
			СуффиксФайла = СуффиксФайла[СуффиксФайла.Количество() - 1]; 
			СсылкаНаPDF = local_helper_convert_to_pdfa_to_disk_x(context_params, ФайлBase64, ИмяФайла); 	
			
			Если get_prop(СсылкаНАPDF, "Convert", Ложь) и НРег(СуффиксФайла) <> "pdf" Тогда
				СсылкаНаСБИСДиск = get_prop(СсылкаНаPDF, "FileId");
				ИмяФайла = get_prop(СсылкаНаPDF, "FileName");
				ТипКонтента = "application/pdf";
			КонецЕсли;
			СсылкаНаСБИСДиск = get_prop(СсылкаНаPDF, "FileId");
			
			Вложение = Новый Структура("Название, Файл", ПечатнаяФормаДокумента.Представление, Новый Структура("Имя, Ссылка, ContentType", ИмяФайла, СсылкаНаСБИСДиск, ТипКонтента) );
			ВыбранныеПечатныеФормы[ВидОбъекта].Добавить(Вложение);
		ИначеЕсли ПечатнаяФормаДокумента.ТипВложения = "ПрисоединенныйФайл" И ПечатнаяФормаДокумента.ОтметкаВыбора Тогда
			ДанныеФайла	= ПолучитьДанныеПрисоединенногоФайла(ПечатнаяФормаДокумента.Команда.Ссылка);
			ИмяФайла	= ДанныеФайла.ИмяФайла;
			ТипКонтента	= ПолучитьКонтентТипВложения(ИмяФайла);
			Вложение = Новый Структура("Название, Файл", ПечатнаяФормаДокумента.Представление, Новый Структура("Имя, ПрисоединенныйФайл, ContentType",ИмяФайла, Истина, ТипКонтента) );
			ВыбранныеПечатныеФормы[ВидОбъекта].Добавить(Вложение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыбранныеПечатныеФормы;
КонецФункции

