
&НаСервере
Функция ТемаПриложения() Экспорт
	Попытка
		Тема = "Светлая"; // Изначальная тема
		// Тема в настройках клиентского приложения
		КлючНастройкиКлиентскогоПриложения = "Общее/НастройкиКлиентскогоПриложения";
		Настройка = ПрочитатьИзХранилищаСистемныхНастроек(КлючНастройкиКлиентскогоПриложения);
		ЗначенияИзНастроекИзвлечь = Новый Структура("ТемаКлиентскогоПриложения, ВариантИнтерфейсаКлиентскогоПриложения");
		ЗаполнитьЗначенияСвойств(ЗначенияИзНастроекИзвлечь, Настройка);
		
		СтрНастройкиТема = СокрЛП(ЗначенияИзНастроекИзвлечь.ТемаКлиентскогоПриложения);
		Если	СокрЛП(ЗначенияИзНастроекИзвлечь.ВариантИнтерфейсаКлиентскогоПриложения) = "Версия 8.5"
			ИЛИ СокрЛП(Метаданные.РежимСовместимостиИнтерфейса) = "Версия8_5" Тогда
			
			Если СтрНастройкиТема = "Темная" Тогда
				Тема = "Темная";
			ИначеЕсли СтрНастройкиТема = "Светлая" Тогда
				Тема = "Светлая";
				// Тема в настройках = Авто -> берём из конфигурации
			Иначе
				
				ЗаполнитьЗначенияСвойств(ЗначенияИзНастроекИзвлечь, Метаданные);
				// Тема в свойствах конфигурации
				ТемаКП = СокрЛП(ЗначенияИзНастроекИзвлечь.ТемаКлиентскогоПриложения);
				Если Не ТемаКП = "" Тогда
					
					Тема = ТемаКП;
					
				КонецЕсли;
				//Если	ТемаКП = "Авто" Тогда
				//		ТемаКП = "Светлая";
				//	// На самом деле, тут тему надо определять в системе, можно посмотреть ссылки отсюда
				//	// https://forum.mista.ru/topic/900869?ysclid=mmyyusmvie522010219#13
				//КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Тема = "Светлая";
	КонецПопытки;
	Возврат Тема;
КонецФункции

