
&НаСервере
Функция ТемаПриложения() Экспорт
	Попытка
		Тема = "Светлая"; // Изначальная тема
		// Тема в настройках клиентского приложения
		КлючНастройкиКлиентскогоПриложения = "Общее/НастройкиКлиентскогоПриложения";
		Настройка = ПрочитатьИзХранилищаСистемныхНастроек(КлючНастройкиКлиентскогоПриложения);
		СтрНастройкиТема = СокрЛП(Настройка.ТемаКлиентскогоПриложения);
		Если СокрЛП(Настройка.ВариантИнтерфейсаКлиентскогоПриложения) = "Версия 8.5"
				ИЛИ СокрЛП(Метаданные.РежимСовместимостиИнтерфейса) = "Версия8_5" Тогда
			Если СтрНастройкиТема = "Темная" Тогда
				Тема = "Темная";
			ИначеЕсли СтрНастройкиТема = "Светлая" Тогда
				Тема = "Светлая";
			// Тема в настройках = Авто -> берём из конфигурации
			Иначе
				// Тема в свойствах конфигурации
				Тема = СокрЛП(Метаданные.ТемаКлиентскогоПриложения);
				Если Тема = "Авто" Тогда
					Тема = "Светлая";
					// На самом деле, тут тему надо определять в системе, можно посмотреть ссылки отсюда
					// https://forum.mista.ru/topic/900869?ysclid=mmyyusmvie522010219#13
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Тема = "Светлая";
	КонецПопытки;
	Возврат Тема;
КонецФункции

