Функция КлючШифрованияXOR()
	Возврат "wLZhP7CibDtFKTi9bLHkcQSLzYRGVlmW";
КонецФункции	

&НаСервере
Функция ШифроватьXOR(Текст) Экспорт
	Если Лев(Текст, 5) = "#ЁЪ#0" Тогда
		Возврат Текст; 
	КонецЕсли;
	Ключ = "wLZhP7CibDtFKTi9bLHkcQSLzYRGVlmW";
	Результат = "";
	ДлинаТекста = СтрДлина(Текст);
	ДлинаКлюча = СтрДлина(Ключ);
	
	Для i = 1 По ДлинаТекста Цикл
		ПозицияКлюча = (i - 1) % ДлинаКлюча + 1;
		СимволТекста = Сред(Текст, i, 1);
		СимволКлюча = Сред(Ключ, ПозицияКлюча, 1);
		
		КодСимволаТекста = КодСимвола(СимволТекста);
		КодСимволаКлюча = КодСимвола(СимволКлюча);
		
		ЗашифрованныйКод = КодСимволаТекста + КодСимволаКлюча;
		ЗашифрованныйСимвол = Символ(ЗашифрованныйКод);
		
		Результат = Результат + ЗашифрованныйСимвол;
		
	КонецЦикла;
	
	Возврат "#ЁЪ#0" + Результат;

КонецФункции

&НаСервере
Функция РасшифроватьXOR(Знач Текст, context_params = Неопределено) Экспорт
	// BSLLS:MagicNumber-off
	Если НЕ Лев(Текст, 5) = "#ЁЪ#0" Тогда
		ЗашифрованныйТекст = ШифроватьXOR(Текст);
		context_params.password = ЗашифрованныйТекст;
		Возврат Текст; 
	КонецЕсли;
	
	ЗашифрованныйТекст = Сред(Текст, 6);
	// BSLLS:MagicNumber-on
	
	Ключ = КлючШифрованияXOR();
	Результат = "";
	ДлинаТекста = СтрДлина(ЗашифрованныйТекст);
	ДлинаКлюча = СтрДлина(Ключ);
	
	Для i = 1 По ДлинаТекста Цикл
		ПозицияКлюча = (i - 1) % ДлинаКлюча + 1;
		СимволТекста = Сред(ЗашифрованныйТекст, i, 1);
		СимволКлюча = Сред(Ключ, ПозицияКлюча, 1);
		
		КодСимволаТекста = КодСимвола(СимволТекста);
		КодСимволаКлюча = КодСимвола(СимволКлюча);
		
		Если КодСимволаТекста >= КодСимволаКлюча Тогда
			РасшифрованныйКод = КодСимволаТекста - КодСимволаКлюча;
		Иначе
			РасшифрованныйКод = 0; // Обработка случая, когда КодСимволаТекста < КодСимволаКлюча
		КонецЕсли;
		
		РасшифрованныйСимвол = Символ(РасшифрованныйКод);
		Результат = Результат + РасшифрованныйСимвол;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции 

