
//DynamicDirective

Функция ОбновитьПИМ(ИдентификаторПодключения, Алгоритмы, ДополнительныеПараметры = Неопределено) Экспорт
	context_params = get_prop(ДополнительныеПараметры, "context_params");
	Если context_params = Неопределено Тогда 
		context_params = НастройкиПодключенияПрочитать();	
	КонецЕсли;
	props = Новый Структура;
	props.Вставить("id", ИдентификаторПодключения);
	ini_list = Новый Массив;
	Для Каждого Запись Из Алгоритмы Цикл 
		ini_obj = Новый Структура;
		ini_obj.Вставить("type", Запись.Тип);
		ini_obj.Вставить("name", Запись.ИмяФайла);
		ini_obj.Вставить("data", Запись.Содержимое);
		ini_obj.Вставить("active", Истина);
		ini_list.Добавить(ini_obj);
	КонецЦикла;
	connection_info = Новый Структура;
	connection_info.Вставить("props", props);	
	connection_info.Вставить("ini", ini_list);	
	Возврат ТранспортИнтеграции.local_helper_write_connection(context_params, connection_info); 	
КонецФункции

//DynamicDirective

Функция ПрочитатьПИМИзSaby(ИдентификаторПодключения, Алгоритмы, context_params, requested_ini_format = Неопределено) Экспорт
	мИниФайлов	= Новый Массив;  
	Для Каждого Запись Из Алгоритмы Цикл 
		СтруктураIni = Новый Структура("type, name", Запись.Тип, Запись.ИмяФайла);
		мИниФайлов.Добавить(СтруктураIni);
	КонецЦикла;	
	props = Новый Структура;
	props.Вставить("id", ИдентификаторПодключения);
	props.Вставить("type_data", 1);
	Если requested_ini_format <> Неопределено Тогда
		props.Вставить("requested_ini_format", requested_ini_format);
	КонецЕсли;
	params	= Новый Структура;
	params.Вставить("props", props);
	params.Вставить("ini", мИниФайлов);
	МетодAPI = "IntegrationConnection.ReadConnection";
	res = ТранспортИнтеграции.local_helper_integration_api(context_params, МетодAPI, params, "int-settings");  
	data = get_prop(res, "data", Новый Соответствие);
	Результат = Новый Соответствие;
	Для Каждого Запись Из data Цикл 
		Содержимое = get_prop(Запись.Значение, "data");
		Результат.Вставить(Запись.Ключ, Содержимое);	
	КонецЦикла;	
	Возврат Результат;
КонецФункции	

Функция ПрочитатьПИМИзКаталога(Алгоритмы, Репозиторий) Экспорт
	Результат = Новый Соответствие;
	Для Каждого Запись Из Алгоритмы Цикл
		ИмяФайла = Запись.ИмяФайла;
		// BSLLS:UsingSynchronousCalls-off Для совместимости с 8.2
		МассивНайденныхФайлов = НайтиФайлы(Репозиторий, ИмяФайла + ".*", Ложь);
		// BSLLS:UsingSynchronousCalls-on
		Если МассивНайденныхФайлов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ПутьКФайлу = МассивНайденныхФайлов.Получить(0).ПолноеИмя;
		ТекстовыйФайл = Новый ТекстовыйДокумент;
		ТекстовыйФайл.Прочитать(ПутьКФайлу, КодировкаТекста.UTF8);
		Результат.Вставить(ИмяФайла, ТекстовыйФайл.ПолучитьТекст());
	КонецЦикла;
	Возврат Результат;
КонецФункции

//DynamicDirective   

Процедура ПрочитатьИзКэш(Алгоритмы, Результат, КэшИни, НеобработанныеАлгоритмы)  
	НеобработанныеАлгоритмы = Новый Массив;
	Для Каждого Запись Из Алгоритмы Цикл
		ИмяИни = get_prop(Запись, "ИмяФайла"); 
		ЗначениеIni = get_prop(КэшИни, ИмяИни);
		Если ЗначениеIni <> Неопределено Тогда 
			Результат.Вставить(ИмяИни, ЗначениеIni);
		Иначе
			НеобработанныеАлгоритмы.Добавить(Запись);	
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

//DynamicDirective

Функция ПрочитатьПИМ(ИдентификаторПодключения, Знач Алгоритмы, ДополнительныеПараметры = Неопределено) Экспорт 
	Результат = Новый Соответствие;
	ИспользоватьКэш = get_prop(ДополнительныеПараметры, "ИспользоватьКэш", Ложь);
	Если ИспользоватьКэш Тогда   
		ОтсутствующиеВКэш = Новый Массив;
		КэшИни = get_prop(ДополнительныеПараметры, "КэшИни");
		ПрочитатьИзКэш(Алгоритмы, Результат, КэшИни, ОтсутствующиеВКэш);
		Алгоритмы = ОтсутствующиеВКэш;
	КонецЕсли;                         
	Если Алгоритмы.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;	
	context_params = get_prop(ДополнительныеПараметры, "context_params");
	Если context_params = Неопределено Тогда 
		context_params = НастройкиПодключенияПрочитать();	
	КонецЕсли;   
	requested_ini_format = get_prop(ДополнительныеПараметры, "requested_ini_format");
	ЧитатьСПодключения = get_prop(ДополнительныеПараметры, "ЧитатьСПодключения", Ложь);
	ХранилищеАлгоритмов = get_prop(context_params.public, "AlgorithmsStorage", Неопределено);
	Если ЧитатьСПодключения Или ХранилищеАлгоритмов = Неопределено Тогда 
		РезультатIni = ПрочитатьПИМИзSaby(ИдентификаторПодключения, Алгоритмы, context_params, requested_ini_format);	
	Иначе
		Репозиторий = get_prop(ХранилищеАлгоритмов, "Repository");
		РезультатIni = ПрочитатьПИМИзКаталога(Алгоритмы, Репозиторий);		
	КонецЕсли;	
	Для Каждого Запись Из РезультатIni Цикл 
		Результат.Вставить(Запись.Ключ, Запись.Значение);	
	КонецЦикла;	
	Возврат Результат;
КонецФункции

//DynamicDirective

Функция СписокПИМ(КодПодключения, НеобходимоСодержимое = Ложь, ДополнительныеПараметры = Неопределено) Экспорт 
	context_params = get_prop(ДополнительныеПараметры, "context_params");
	Если context_params = Неопределено Тогда 
		context_params = НастройкиПодключенияПрочитать();	
	КонецЕсли;   
	params	= Новый Структура;
	params.Вставить("Filter", Новый Структура("Id", КодПодключения));
	ExtraFields = Новый Массив;
	ExtraFields.Добавить("Scope");
	params.Вставить("ExtraFields", ExtraFields);
	МетодAPI = "IntegrationConnection.AlgorithmList";
	res = ТранспортИнтеграции.local_helper_integration_api(context_params, МетодAPI, params, "int-settings");
	Возврат res;		
КонецФункции 

//DynamicDirective

Функция УдалитьПИМ(ИдентификаторПодключения, Знач Алгоритмы, ДополнительныеПараметры = Неопределено) Экспорт
	context_params = get_prop(ДополнительныеПараметры, "context_params");
	Если context_params = Неопределено Тогда 
		context_params = НастройкиПодключенияПрочитать();	
	КонецЕсли;
	props = Новый Структура;
	props.Вставить("id", ИдентификаторПодключения);
	ini_list = Новый Массив;
	Для Каждого Запись Из Алгоритмы Цикл  
		ini_obj = Новый Структура;
		ini_obj.Вставить("type", Запись.Тип);
		ini_obj.Вставить("name", Запись.ИмяФайла);
		ini_obj.Вставить("data", Неопределено);
		ini_list.Добавить(ini_obj);
	КонецЦикла;
	connection_info = Новый Структура;
	connection_info.Вставить("props", props);	
	connection_info.Вставить("ini", ini_list);	
	Возврат ТранспортИнтеграции.local_helper_write_connection(context_params, connection_info); 		
КонецФункции
