

Процедура ЗаписатьПИМыВКаталог(СоответствиеПИМ, context_params)
	ХранилищеАлгоритмов = get_prop(context_params.public, "AlgorithmsStorage", Неопределено);
	Если ХранилищеАлгоритмов = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Для Каждого ПИМ Из СоответствиеПИМ Цикл  
		ИмяФайла = ХранилищеАлгоритмов + ПИМ.Ключ + ".xml";
		Файл = Новый ТекстовыйДокумент;
		Файл.УстановитьТекст(ПИМ.Значение);
		Файл.Записать(ИмяФайла, КодировкаТекста.UTF8);
	КонецЦикла;	
КонецПроцедуры

//DynamicDirective

Процедура ВыгрузитьПИМыИзОблака(ДополнительныеПараметры)   
	context_params = get_prop(ДополнительныеПараметры, "context_params");
	Если context_params = Неопределено Тогда 
		context_params = НастройкиПодключенияПрочитать();	
	КонецЕсли; 
	КодПодключения = get_prop(context_params, "ConnectionUuid");
	ИдентификаторПодключения = get_prop(context_params, "ConnectionId");
	ПИМы = ТранспортИнтеграции.СписокПИМ(КодПодключения,, ДополнительныеПараметры); 
	МассивПИМ = Новый Массив;
	СчетчикПИМ = 0; 
	КоличествоПИМ = ПИМы.Количество();
	Для Каждого ПИМ Из ПИМы Цикл  
		СчетчикПИМ = СчетчикПИМ + 1;
		ИмяПИМ = get_prop(ПИМ, "DataName");
		ТипПИМ = get_prop(ПИМ, "DataType");
		МассивПИМ.Добавить(Новый Структура("Тип, ИмяФайла", ТипПИМ, ИмяПИМ));  
		Если МассивПИМ.Количество() >= 10 Или СчетчикПИМ >= КоличествоПИМ Тогда 
			ПИМыССодержимым = ТранспортИнтеграции.ПрочитатьПИМИзSaby(ИдентификаторПодключения, МассивПИМ, context_params); 
			ЗаписатьПИМыВКаталог(ПИМыССодержимым, context_params);
			МассивПИМ.Очистить();
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

//DynamicDirective

Процедура ОбогатитьМассивПИМСодержимым(МассивПИМ, ПИМыССодержимым) 
	Для Каждого Запись Из МассивПИМ Цикл 
		Запись.Вставить("Содержимое", get_prop(ПИМыССодержимым, Запись.ИмяФайла, ""));
	КонецЦикла;	
КонецПроцедуры	
			
//DynamicDirective

Процедура ЗагрузитьПИМыВОблако(ДополнительныеПараметры)
	context_params = get_prop(ДополнительныеПараметры, "context_params");
	Если context_params = Неопределено Тогда 
		context_params = НастройкиПодключенияПрочитать();	
	КонецЕсли; 
	КодПодключения = get_prop(context_params, "ConnectionUuid");
	ИдентификаторПодключения = get_prop(context_params, "ConnectionId");
	ПИМы = ТранспортИнтеграции.СписокПИМ(КодПодключения,, ДополнительныеПараметры); 
	МассивПИМ = Новый Массив;
	СчетчикПИМ = 0; 
	КоличествоПИМ = ПИМы.Количество();
	ХранилищеАлгоритмов = get_prop(context_params.public, "AlgorithmsStorage", Неопределено);
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("context_params", context_params);
	Для Каждого ПИМ Из ПИМы Цикл  
		СчетчикПИМ = СчетчикПИМ + 1;
		ИмяПИМ = get_prop(ПИМ, "DataName");
		ТипПИМ = get_prop(ПИМ, "DataType");
		МассивПИМ.Добавить(Новый Структура("Тип, ИмяФайла", ТипПИМ, ИмяПИМ));  
		Если МассивПИМ.Количество() >= 10 Или СчетчикПИМ >= КоличествоПИМ Тогда  
			ПИМыССодержимым = ТранспортИнтеграции.ПрочитатьПИМИзКаталога(МассивПИМ, ХранилищеАлгоритмов);
			ОбогатитьМассивПИМСодержимым(МассивПИМ, ПИМыССодержимым);
			ТранспортИнтеграции.ОбновитьПИМ(ИдентификаторПодключения, МассивПИМ, ДопПараметры);
			МассивПИМ.Очистить();
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры
