 
Процедура ЗаписатьПИМыВКаталог(СоответствиеПИМ, context_params, ХранилищеАлгоритмов)
	Если ХранилищеАлгоритмов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодульОбъекта = МодульОбъекта();
	Для Каждого ПИМ Из СоответствиеПИМ Цикл 
		Содержимое = ПИМ.Значение;
		Если ТипЗнч(Содержимое) = Тип("Строка") Тогда
			Расширение = "xml";
		Иначе
			Расширение = "json"; 
			Содержимое = МодульОбъекта.local_helper_json_encode(Содержимое);
		КонецЕсли;	
		ИмяФайла = ХранилищеАлгоритмов + "\" + ПИМ.Ключ + "." + Расширение;
		Файл = Новый ТекстовыйДокумент; 
		Файл.УстановитьТекст(Содержимое);
		Файл.Записать(ИмяФайла, КодировкаТекста.UTF8);
	КонецЦикла;	
КонецПроцедуры

//DynamicDirective

Процедура ВыгрузитьПИМыИзОблака(ДополнительныеПараметры)   
	context_params = get_prop(ДополнительныеПараметры, "context_params");
	Если context_params = Неопределено Тогда 
		context_params = ПроверитьНаличиеПараметровПодключенияНаСервере();	
	КонецЕсли;     
	ХранилищеАлгоритмов = get_prop(ДополнительныеПараметры, "ХранилищеАлгоритмов");  
	Если ХранилищеАлгоритмов = Неопределено Тогда
		ХранилищеАлгоритмов = get_prop(context_params.public, "AlgorithmsStorage"); 	
	КонецЕсли;	
	КодПодключения = get_prop(context_params, "Connection");
	ИдПодключения = get_prop(context_params, "ConnectionUuid");
	ПИМы = ТранспортИнтеграции.СписокПИМ(КодПодключения,, ДополнительныеПараметры); 
	МассивПИМ = Новый Массив;
	СчетчикПИМ = 0; 
	КоличествоПИМ = ПИМы.Количество();
	ActionStat = ТранспортИнтеграции.local_helper_element_action("Settings", "Выгрузка копии ПИМ-файлов в каталог", Новый Структура(), 1);
	ActionStats = Новый Массив;
	ActionStats.Добавить(ActionStat);
	ТранспортИнтеграции.local_helper_register_actions(context_params, ActionStats);
	Для Каждого ПИМ Из ПИМы Цикл  
		СчетчикПИМ = СчетчикПИМ + 1;
		ИмяПИМ = get_prop(ПИМ, "FileName");
		ТипПИМ = get_prop(ПИМ, "DataType");
		МассивПИМ.Добавить(Новый Структура("Тип, ИмяФайла", ТипПИМ, ИмяПИМ));  
		Если МассивПИМ.Количество() >= 10 Или СчетчикПИМ >= КоличествоПИМ Тогда 
			ПИМыССодержимым = ТранспортИнтеграции.ПрочитатьПИМИзSaby(ИдПодключения, МассивПИМ, context_params); 
			ЗаписатьПИМыВКаталог(ПИМыССодержимым, context_params, ХранилищеАлгоритмов);
			МассивПИМ.Очистить();
			Прогресс = СчетчикПИМ/КоличествоПИМ * 100;
			СообщитьПрогрессОперации(Прогресс, "Выгружено ПИМ из облака " + СчетчикПИМ + " из " + КоличествоПИМ); 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//DynamicDirective

Процедура ОбогатитьМассивПИМСодержимым(МассивПИМ, ПИМыССодержимым) 
	Для Каждого Запись Из МассивПИМ Цикл 
		Содержимое = get_prop(ПИМыССодержимым, Запись.ИмяФайла);
		Запись.Вставить("Содержимое", Содержимое);
	КонецЦикла;	
КонецПроцедуры	
			
//DynamicDirective

Процедура ЗагрузитьПИМыВОблако(ДополнительныеПараметры)
	context_params = get_prop(ДополнительныеПараметры, "context_params");
	Если context_params = Неопределено Тогда 
		context_params = ПроверитьНаличиеПараметровПодключенияНаСервере();	
	КонецЕсли; 
	ХранилищеАлгоритмов = get_prop(ДополнительныеПараметры, "ХранилищеАлгоритмов");  
	Если ХранилищеАлгоритмов = Неопределено Тогда
		ХранилищеАлгоритмов = get_prop(context_params.public, "AlgorithmsStorage"); 	
	КонецЕсли;
	ИдПодключения = get_prop(ДополнительныеПараметры, "ИдентификаторПодключения"); 
	Если ИдПодключения = Неопределено Тогда 
		ИдПодключения = get_prop(context_params, "ConnectionUuid");	
	КонецЕсли;	
	КодПодключения = get_prop(context_params, "Connection");
	ПИМы = ТранспортИнтеграции.СписокПИМ(КодПодключения,, ДополнительныеПараметры); 
	МассивПИМ = Новый Массив;
	СчетчикПИМ = 0; 
	КоличествоПИМ = ПИМы.Количество();
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("context_params", context_params); 
	НазваниеДействия = get_prop(ДополнительныеПараметры, "ДействиеСПИМФайлами", "Загрузка ПИМ-файлов в облако");
	ActionStat = ТранспортИнтеграции.local_helper_element_action("Settings", НазваниеДействия, Новый Структура(), 1);
	ActionStats = Новый Массив;
	ActionStats.Добавить(ActionStat);
	ТранспортИнтеграции.local_helper_register_actions(context_params, ActionStats);
	Для Каждого ПИМ Из ПИМы Цикл  
		СчетчикПИМ = СчетчикПИМ + 1;
		ИмяПИМ = get_prop(ПИМ, "FileName");
		ТипПИМ = get_prop(ПИМ, "DataType");
		МассивПИМ.Добавить(Новый Структура("Тип, ИмяФайла", ТипПИМ, ИмяПИМ));  
		Если МассивПИМ.Количество() >= 10 Или СчетчикПИМ >= КоличествоПИМ Тогда  
			ПИМыССодержимым = ТранспортИнтеграции.ПрочитатьПИМИзКаталога(МассивПИМ, ХранилищеАлгоритмов);
			ОбогатитьМассивПИМСодержимым(МассивПИМ, ПИМыССодержимым);
			ТранспортИнтеграции.ОбновитьПИМ(ИдПодключения, МассивПИМ, ДопПараметры);
			МассивПИМ.Очистить();
			Прогресс = СчетчикПИМ/КоличествоПИМ * 100;
			СообщитьПрогрессОперации(Прогресс, "Загружено ПИМ в облако " + СчетчикПИМ + " из " + КоличествоПИМ); 
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры
