 
Процедура ЗаписатьПИМыВКаталог(СоответствиеПИМ, context_params, ХранилищеАлгоритмов)
	Если ХранилищеАлгоритмов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодульОбъекта = МодульОбъекта();
	Для Каждого ПИМ Из СоответствиеПИМ Цикл 
		Содержимое = ПИМ.Значение;
		Если ТипЗнч(Содержимое) = Тип("Строка") Тогда
			Расширение = "xml";
		Иначе
			Расширение = "json"; 
			Содержимое = МодульОбъекта.local_helper_json_encode(Содержимое);
		КонецЕсли;	
		ИмяФайла = ХранилищеАлгоритмов + "\" + ПИМ.Ключ + "." + Расширение;
		Файл = Новый ТекстовыйДокумент; 
		Файл.УстановитьТекст(Содержимое);
		Файл.Записать(ИмяФайла, КодировкаТекста.UTF8);
	КонецЦикла;	
КонецПроцедуры

//DynamicDirective

Процедура ЗаписатьСтатистикуПИМФайлов(context_params, НазваниеДействия, Количество) Экспорт
	ActionStat = ТранспортИнтеграции.local_helper_element_action("Settings", НазваниеДействия, Новый Структура(), Количество);
	ActionStats = Новый Массив;
	ActionStats.Добавить(ActionStat);
	ТранспортИнтеграции.local_helper_register_actions(context_params, ActionStats);		
КонецПроцедуры

//DynamicDirective

Процедура УстановитьФормуДлительнойОперации(ДополнительныеПараметры)
	Saby_ДлительнаяОперация = get_prop(ДополнительныеПараметры, "ДлительнаяОперация", Неопределено);
	Если Saby_ДлительнаяОперация <> Неопределено Тогда
		ДлитОперации = Новый Соответствие();
		ДлитОперации.Вставить("ДлительнаяОперация", Saby_ДлительнаяОперация);
	КонецЕсли;	
КонецПроцедуры

//DynamicDirective

Функция ВыгрузитьПИМыИзОблака(ДополнительныеПараметры, АдресРезультата = Неопределено) Экспорт  
	context_params = get_prop(ДополнительныеПараметры, "context_params");
	ХранилищеАлгоритмов = get_prop(ДополнительныеПараметры, "ХранилищеАлгоритмов");  
	Если ХранилищеАлгоритмов = Неопределено Тогда
		ХранилищеАлгоритмов = get_prop(context_params.public, "UseLocalAlgorithmStorage"); 	
	КонецЕсли;	
	КодПодключения = get_prop(context_params, "Connection");
	ИдПодключения = get_prop(context_params, "ConnectionUuid");
	ПИМы = ТранспортИнтеграции.СписокПИМ(КодПодключения,, ДополнительныеПараметры); 
	МассивПИМ = Новый Массив;
	СчетчикПИМ = 0; 
	КоличествоПИМ = ПИМы.Количество();
	ЗаписатьСтатистикуПИМФайлов(context_params, "Выгрузка копии ПИМ-файлов в каталог", КоличествоПИМ);
	УстановитьФормуДлительнойОперации(ДополнительныеПараметры);
	
	ДанныеПрогресса = Новый Структура("Прогресс, status", 0, "run");
	Для Каждого ПИМ Из ПИМы Цикл  
		СчетчикПИМ = СчетчикПИМ + 1;
		ИмяПИМ = get_prop(ПИМ, "FileName");
		ТипПИМ = get_prop(ПИМ, "DataType");
		МассивПИМ.Добавить(Новый Структура("Тип, ИмяФайла", ТипПИМ, ИмяПИМ));  
		Если МассивПИМ.Количество() >= 10 Или СчетчикПИМ >= КоличествоПИМ Тогда 
			ПИМыССодержимым = ТранспортИнтеграции.ПрочитатьПИМИзSaby(ИдПодключения, МассивПИМ, context_params); 
			ЗаписатьПИМыВКаталог(ПИМыССодержимым, context_params, ХранилищеАлгоритмов);
			МассивПИМ.Очистить();
			Прогресс = Окр(СчетчикПИМ/КоличествоПИМ * 100);
			ДанныеПрогресса.Вставить("Прогресс", Прогресс);   
			СообщитьПрогрессОперации(
				Прогресс,
				"Выгружено ПИМ из облака " + СчетчикПИМ + " из " + КоличествоПИМ,
				ДанныеПрогресса); 
		КонецЕсли;
	КонецЦикла;
	Прогресс = 100;
	ДанныеПрогресса.Вставить("Прогресс", Прогресс);
	ДанныеПрогресса.Вставить("status", "complete");
	СообщитьПрогрессОперации(
		Прогресс,
		"Выгружено ПИМ из облака " + СчетчикПИМ + " из " + КоличествоПИМ,
		ДанныеПрогресса); 
		
	Результат = Новый Структура();
	Результат.Вставить("Status", "complete");
	Результат.Вставить("Result", Новый Структура);
	// BSLLS:UnusedLocalVariable-off Переменная модуля
	ДлитОперации = Неопределено;
	// BSLLS:UnusedLocalVariable-on
	Возврат Результат;
КонецФункции

//DynamicDirective

Процедура ОбогатитьМассивПИМСодержимым(МассивПИМ, ПИМыССодержимым, УдалятьБезСодержимого = Ложь) Экспорт  
	СчетчикЭлементов = МассивПИМ.Количество() - 1;
	Пока СчетчикЭлементов >= 0 Цикл 
		ЭлементМассива = МассивПИМ.Получить(СчетчикЭлементов);
		Содержимое = get_prop(ПИМыССодержимым, ЭлементМассива.ИмяФайла); 
		ЭлементМассива.Вставить("Содержимое", Содержимое);  
		Если Не ЗначениеЗаполнено(Содержимое) И УдалятьБезСодержимого Тогда 
			МассивПИМ.Удалить(СчетчикЭлементов);	
		КонецЕсли;	
		СчетчикЭлементов = СчетчикЭлементов - 1;
	КонецЦикла;	
КонецПроцедуры	
			
//DynamicDirective

Функция ЗагрузитьПИМыВОблако(ДополнительныеПараметры, АдресРезультата = Неопределено) Экспорт
	context_params = get_prop(ДополнительныеПараметры, "context_params");
	ХранилищеАлгоритмов = get_prop(ДополнительныеПараметры, "ХранилищеАлгоритмов");  
	Если ХранилищеАлгоритмов = Неопределено Тогда
		ХранилищеАлгоритмов = get_prop(context_params.public, "UseLocalAlgorithmStorage"); 	
	КонецЕсли;
	ИдПодключения = get_prop(ДополнительныеПараметры, "ИдентификаторПодключения"); 
	Если ИдПодключения = Неопределено Тогда 
		ИдПодключения = get_prop(context_params, "ConnectionUuid");	
	КонецЕсли;	
	КодПодключения = get_prop(context_params, "Connection");
	ПИМы = ТранспортИнтеграции.СписокПИМ(КодПодключения,, ДополнительныеПараметры); 
	МассивПИМ = Новый Массив;
	СчетчикПИМ = 0; 
	КоличествоПИМ = ПИМы.Количество();
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("context_params", context_params); 
	НазваниеДействия = get_prop(ДополнительныеПараметры, "ДействиеСПИМФайлами", "Загрузка ПИМ-файлов в облако");
	ЗаписатьСтатистикуПИМФайлов(context_params, НазваниеДействия, КоличествоПИМ);
	УстановитьФормуДлительнойОперации(ДополнительныеПараметры);
	ДанныеПрогресса = Новый Структура("Прогресс, status", 0, "run");
	Для Каждого ПИМ Из ПИМы Цикл  
		СчетчикПИМ = СчетчикПИМ + 1;
		ИмяПИМ = get_prop(ПИМ, "FileName");
		ТипПИМ = get_prop(ПИМ, "DataType");
		МассивПИМ.Добавить(Новый Структура("Тип, ИмяФайла", ТипПИМ, ИмяПИМ));  
		Если МассивПИМ.Количество() >= 10 Или СчетчикПИМ >= КоличествоПИМ Тогда  
			ПИМыССодержимым = ТранспортИнтеграции.ПрочитатьПИМИзКаталога(МассивПИМ, ХранилищеАлгоритмов);
			ОбогатитьМассивПИМСодержимым(МассивПИМ, ПИМыССодержимым, Истина);
			ТранспортИнтеграции.ОбновитьПИМ(ИдПодключения, МассивПИМ, ДопПараметры);
			МассивПИМ.Очистить();
			Прогресс = Окр(СчетчикПИМ/КоличествоПИМ * 100);
			ДанныеПрогресса.Вставить("Прогресс", Прогресс);
			СообщитьПрогрессОперации(
				Прогресс,
				"Загружено ПИМ в облако " + СчетчикПИМ + " из " + КоличествоПИМ,
				ДанныеПрогресса);
		КонецЕсли;	
	КонецЦикла;
	Прогресс = 100;
	ДанныеПрогресса.Вставить("Прогресс", Прогресс);
	ДанныеПрогресса.Вставить("status", "complete");
	СообщитьПрогрессОперации(
		Прогресс,
		"Загружено ПИМ в облако " + СчетчикПИМ + " из " + КоличествоПИМ,
		ДанныеПрогресса); 
		
	Результат = Новый Структура();
	Результат.Вставить("Status", "complete");
	Результат.Вставить("Result", Новый Структура);
	// BSLLS:UnusedLocalVariable-off Переменная модуля
	ДлитОперации = Неопределено;
	// BSLLS:UnusedLocalVariable-on
	Возврат Результат;

КонецФункции
