
&НаКлиенте
Процедура ПИМВыгрузитьКопиюИзОблакаНажатие(Элемент)
	ПИМВыгрузитьКопиюИзОблака("ПИМВыгрузитьКопиюИзОблака", ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПИМВыгрузитьКопиюИзОблака(Результат = Неопределено, ДопПараметры = Неопределено) Экспорт

	ТекстСообщения = "Выгружены копию из облака.";
	Картинка = КартинкаУспешно();
	Попытка
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("context_params", context_params);
		ДополнительныеПараметры.Вставить("ХранилищеАлгоритмов", ЭтаФорма.ПИМПутьККаталогу);
		ВыгрузитьПИМыИзОблака(ДополнительныеПараметры, Неопределено);
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		Картинка = КартинкаОшибка();
		ТекстСообщения = СтруктураОшибки.message;
	КонецПопытки;
	ПоказатьОповещениеПользователя("Сопоставление завершено", ,
		ТекстСообщения,
		Картинка,
		СтатусОповещенияПользователя.Важное,
		Новый УникальныйИдентификатор);
КонецПроцедуры

// BSLLS:UnusedLocalVariable-off

&НаКлиенте
Процедура ПИМВыгрузитьКопиюИзОблака(Команда)
	ЗаголовокДействие = "Загрузка копии ПИМ-файлов на подключение";
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("context_params", 			ЭтаФорма.context_params);
	ДополнительныеПараметры.Вставить("ХранилищеАлгоритмов", 	ЭтаФорма.ПИМПутьККаталогу);
	ДополнительныеПараметры.Вставить("ИдентификаторПодключения", ЭтаФорма.ИдентификаторПодключения);
	ДополнительныеПараметры.Вставить("ДействиеСПИМФайлами", 	ЗаголовокДействие);
	ПИМЗапускФоновогоОбмена(
		"ЗагрузитьПИМыВОблако",
		ДополнительныеПараметры,
		ЗаголовокДействие);
КонецПроцедуры

// BSLLS:UnusedLocalVariable-on

&НаКлиенте
Процедура ПИМВыгрузитьКопиюИзОблака(Команда)
    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("context_params", ЭтаФорма.context_params);
    ДополнительныеПараметры.Вставить("ХранилищеАлгоритмов", ЭтаФорма.ПИМПутьККаталогу);
    ВыгрузитьПИМыИзОблака(ДополнительныеПараметры);    
КонецПроцедуры

&НаКлиенте
Процедура ПИМЗагрузитьКопиюВОблакоНаПодключение(Команда)
	ЗаголовокДействие = "Загрузка копии ПИМ-файлов на подключение";
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("context_params", 			ЭтаФорма.context_params);
	ДополнительныеПараметры.Вставить("ХранилищеАлгоритмов", 	ЭтаФорма.ПИМПутьККаталогу);
	ДополнительныеПараметры.Вставить("ИдентификаторПодключения", ЭтаФорма.ИдентификаторПодключения);
	ДополнительныеПараметры.Вставить("ДействиеСПИМФайлами", 	ЗаголовокДействие);
	ПИМЗапускФоновогоОбмена(
		"ЗагрузитьПИМыВОблако",
		ДополнительныеПараметры,
		ЗаголовокДействие);
КонецПроцедуры

&НаКлиенте
Процедура ПИМЗагрузитьКопиюВОблакоНаИнтеграцию(Команда)
	ЗаголовокДействие = "Загрузка копии ПИМ-файлов на интеграцию";
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("context_params", 			ЭтаФорма.context_params);
	ДополнительныеПараметры.Вставить("ХранилищеАлгоритмов", 	ЭтаФорма.ПИМПутьККаталогу);
	ДополнительныеПараметры.Вставить("ИдентификаторПодключения", ЭтаФорма.context_params.IntegrationUuid);
	ДополнительныеПараметры.Вставить("ДействиеСПИМФайлами", 	ЗаголовокДействие);
	//ЗагрузитьПИМыВОблако(ДополнительныеПараметры);	
	ПИМЗапускФоновогоОбмена(
		"ЗагрузитьПИМыВОблако",
		ДополнительныеПараметры,
		ЗаголовокДействие);
КонецПроцедуры

