
&НаКлиенте
Процедура ЗаполнитьСтатусыПИМ(НоваяСтрока, Запись)
	ПИМСтатусПодключения = -1;
	ПИМСтатусИзменения = -1; 
	ScopeCustomStatus = get_prop(Запись, "ScopeCustomStatus", "");
	ScopePersonal = get_prop(Запись, "ScopePersonal", Ложь);
	Если ScopePersonal = Истина Тогда 
		ПИМСтатусПодключения = 0;	
	КонецЕсли;	
	Если ScopeCustomStatus = "Add" Тогда
		ПИМСтатусИзменения = 1;	
	КонецЕсли;
	Если ScopeCustomStatus = "Change" Тогда
		ПИМСтатусИзменения = 2;	
	КонецЕсли;
	НоваяСтрока.СтатусПодключения = ПИМСтатусПодключения; 
	НоваяСтрока.СтатусИзменения = ПИМСтатусИзменения;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПимФайлов() 
	АвторизацияВыполнена	= ТранспортИнтеграции.УИДСессии(ЭтаФорма.context_params) <> Неопределено;  
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФормСтраницаПИМ = ЭлФорм.Найти(ПИМИмяОбластиЭлементов());
	Если Не АвторизацияВыполнена Тогда 
		ЭлФормСтраницаПИМ.ТекущаяСтраница = 
			ПолучитьСтраницуНаКлиенте(ЭлФормСтраницаПИМ, "ПрограммыИнтеграционногоМодуляОграничения");
        Возврат;
	Иначе
		ЭлФормСтраницаПИМ.ТекущаяСтраница = 
			ПолучитьСтраницуНаКлиенте(ЭлФормСтраницаПИМ, "ПрограммыИнтеграционногоМодуляОсновная");	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РеквизитИдентификаторПодключения()) Тогда
		Возврат;
	КонецЕсли;
	КодПодключения = get_prop(ЭтаФорма.context_params, "Connection"); 
	ДопПараметры = Новый Структура("context_params", ЭтаФорма.context_params);
	Попытка // Убрать попытку после 26.3200
		СписокПИМ = ТранспортИнтеграции.СписокПИМ(КодПодключения, Ложь, ДопПараметры);
	Исключение
		СписокПИМ = Новый Массив;
	КонецПопытки;
	Для Каждого Запись Из СписокПИМ Цикл
		НоваяСтрока = ЭтаФорма.ПИМФайлы.Добавить();
		НоваяСтрока.Название = get_prop(Запись, "FileName");
		НоваяСтрока.Тип = get_prop(Запись, "Type");
		НоваяСтрока.Формат =  get_prop(Запись, "ApiType", "") + "/" + get_prop(Запись, "CustomisationType", ""); 
		НоваяСтрока.ИмяОбъектаИС =  get_prop(Запись, "ExtSysObjName");
		НоваяСтрока.ИмяОбъектаAPI3 = get_prop(Запись, "ObjName"); 
		НоваяСтрока.DataType = get_prop(Запись, "DataType"); 
		ЗаполнитьСтатусыПИМ(НоваяСтрока, Запись);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПимСнятьУстановитьОтметку(Команда)  
	ЭтаФорма.ПИМОтметка = Не ЭтаФорма.ПИМОтметка;
	Для Каждого Запись Из ЭтаФорма.ПИМФайлы Цикл  
		Запись.Отметка = ЭтаФорма.ПИМОтметка;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьОтобразитьГруппуКопиюИзКаталогаНастройки()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ГруппаКопияИзКаталогаНастройки.Видимость = ЭтаФорма.ПИМИспользоватьКопиюИзКаталога;
КонецПроцедуры

&НаКлиенте
Процедура ПИМИспользоватьКопиюИзКаталогаПриИзменении(Элемент)
	СкрытьОтобразитьГруппуКопиюИзКаталогаНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПИМВыгрузитьКопиюИзОблака(Команда)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("context_params", ЭтаФорма.context_params);
	ДополнительныеПараметры.Вставить("ХранилищеАлгоритмов", ЭтаФорма.ПИМПутьККаталогу);
	ВыгрузитьПИМыИзОблака(ДополнительныеПараметры);	
КонецПроцедуры

&НаКлиенте
Процедура ПИМОбновить(Команда)
	ЭтаФорма.ПИМФайлы.Очистить();
	ЗаполнитьСписокПимФайлов();	
КонецПроцедуры

&НаКлиенте
Процедура ПИМДобавить(Команда)
	ОткрытьРедакторФайловНастроекНажатие(Неопределено);
КонецПроцедуры

#Область include_core_base_ПИМ_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_ПИМ_ОсобенностиПродукта  
#КонецОбласти


&НаКлиенте
Функция ТипФайла(ИмяФайла) Экспорт
	ТипФайла = ИмяФайла;
	ЭлементыСтроки = СтрРазделить82(ИмяФайла, ".");
	Если ЭлементыСтроки.Количество() > 1 Тогда
		ТипФайла = ЭлементыСтроки[ЭлементыСтроки.Количество() - 1];
	КонецЕсли;
	Возврат ТипФайла;
КонецФункции

&НаКлиенте
Процедура ПИМСохранитьНаПодключении(ИдПодключения,МассивПИМ, Количество = 1)
	Если МассивПИМ.Количество() < Количество Тогда
		Возврат;
	КонецЕсли;
	ДопПараметры = Новый Структура("context_params", ЭтаФорма.context_params);
	ТранспортИнтеграции.ОбновитьПИМ(ИдПодключения, МассивПИМ, ДопПараметры); 
КонецПроцедуры

&НаКлиенте
Процедура ПИМВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда   
		Возврат;
	КонецЕсли;
	МассивВыбранныхФайлов = Новый Массив;
	Каталог = get_prop(ДополнительныеПараметры, "Каталог", "");
	Для Каждого ВыбранныйФайл Из ВыбранныеФайлы Цикл
		Если ТипЗнч(ВыбранныйФайл) = Тип("Строка") Тогда 
			ИмяФайла = СтрЗаменить(ВыбранныйФайл, Каталог, "");
			ПолноеИмяФайла = ВыбранныйФайл;
		Иначе	
			ИмяФайла = ВыбранныйФайл.Имя; 
			ПолноеИмяФайла = ВыбранныйФайл.ПолноеИмя;
		КонецЕсли;	
		ТипФайла				= ТипФайла(ИмяФайла);
		ИмяФайлаБезРаширения	= СтрЗаменить(ИмяФайла, "." + ТипФайла, "");
		#Если ВебКлиент Тогда
			ФайлПИМ				= ПолучитьИзВременногоХранилища(ВыбранныйФайл.Хранение);
			УдалитьИзВременногоХранилища(ВыбранныйФайл.Хранение);
			ТекстПИМ			= ПолучитьСтрокуИзДвоичныхДанных(ФайлПИМ);
		#Иначе     
			ФайлПИМ = Новый ТекстовыйДокумент;
			ФайлПИМ.Прочитать(ПолноеИмяФайла, КодировкаТекста.UTF8);
			ТекстПИМ = ФайлПИМ.ПолучитьТекст();
		#КонецЕсли
       	СтруктураПИМ = Новый Структура;
		СтруктураПИМ.Вставить("Тип", ТипПИМФайла()); 
		СтруктураПИМ.Вставить("ИмяФайла", ИмяФайлаБезРаширения);
		СтруктураПИМ.Вставить("Содержимое", ТекстПИМ);
		МассивВыбранныхФайлов.Добавить(СтруктураПИМ);
		ПИМСохранитьНаПодключении(ЭтаФорма.ИдентификаторПодключения, МассивВыбранныхФайлов, 5);
	КонецЦикла;	
	ПИМСохранитьНаПодключении(ЭтаФорма.ИдентификаторПодключения, МассивВыбранныхФайлов);
	ПИМОбновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПИМУдалить(Команда)
	МассивПимФайловИнтеграции = Новый Массив;
	МассивПимФайловПодключения = Новый Массив; 
	МассивФайлов = ПИМВыбранныеСтроки();

	Для Каждого Запись Из МассивФайлов Цикл 
		Если Запись.СтатусИзменения = -1 Тогда
			Продолжить;
		КонецЕсли;	
		СтруктураПИМ = Новый Структура;
		СтруктураПИМ.Вставить("Тип", Запись.DataType); 
		СтруктураПИМ.Вставить("ИмяФайла", Запись.Название);
		СтруктураПИМ.Вставить("Содержимое", Неопределено);
		Если Запись.СтатусПодключения = -1 Тогда
			МассивПимФайловИнтеграции.Добавить(СтруктураПИМ);
		Иначе
			МассивПимФайловПодключения.Добавить(СтруктураПИМ);
		КонецЕсли;	
	КонецЦикла;
    ПИМСохранитьНаПодключении(ЭтаФорма.ИдентификаторПодключения, МассивПимФайловПодключения);
    ПИМСохранитьНаПодключении(ЭтаФорма.context_params.IntegrationUuid, МассивПимФайловИнтеграции);
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = "Программы интеграционных модулей удалены";
	ПИМОбновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПИМСохранить(Команда)
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Заголовок = "Выберите каталог для сохранения";
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		СохранениеПИМНаДиск(ДиалогВыбораКаталога.Каталог);
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Программы интеграционных модулей сохранены в каталог";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПИМНаДиск(МассивПИМ, Количество = 1, Каталог = "") 
	Если МассивПИМ.Количество() < Количество Тогда
		Возврат;
	КонецЕсли;
	ПИМСПодключения = ТранспортИнтеграции.ПрочитатьПИМИзSaby(ЭтаФорма.ИдентификаторПодключения, МассивПИМ, ЭтаФорма.context_params);
	Для Каждого ПИМ Из ПИМСПодключения Цикл 
		Содержимое = ПИМ.Значение;
		Если ТипЗнч(ПИМ.Значение) = Тип("Строка") Тогда
			Расширение = "xml";
		Иначе
			Расширение = "json";
			Содержимое = ТранспортИнтеграции.local_helper_json_encode(Содержимое);
		КонецЕсли;	
		ИмяФайла = Каталог + "\" + ПИМ.Ключ + "." + Расширение;
		Файл = Новый ТекстовыйДокумент;
		Файл.УстановитьТекст(Содержимое);
		Файл.Записать(ИмяФайла, КодировкаТекста.UTF8); 
	КонецЦикла;	
	МассивПИМ.Очистить();
КонецПроцедуры	

&НаКлиенте
Процедура СохранениеПИМНаДиск(Каталог)
	МассивПИМФайлов = ПИМВыбранныеСтроки();
	МассивПИМФайловДляСохранения = Новый Массив;
	Для Каждого Запись Из МассивПИМФайлов Цикл
		СтруктураПИМ = Новый Структура;
		СтруктураПИМ.Вставить("Тип", Запись.DataType); 
		СтруктураПИМ.Вставить("ИмяФайла", Запись.Название);
        МассивПИМФайловДляСохранения.Добавить(СтруктураПИМ);
		ЗаписатьПИМНаДиск(МассивПИМФайловДляСохранения, 5, Каталог);
	КонецЦикла;	 
	ЗаписатьПИМНаДиск(МассивПИМФайловДляСохранения, 1, Каталог);
КонецПроцедуры

&НаКлиенте
Процедура ПереносПИМНаИнтеграцию(МассивПИМФайлов, Количество = 1) 
	Если МассивПИМФайлов.Количество() < Количество Тогда
		Возврат;
	КонецЕсли;
	ПИМСПодключения = ТранспортИнтеграции.ПрочитатьПИМИзSaby(ЭтаФорма.ИдентификаторПодключения, МассивПИМФайлов, ЭтаФорма.context_params);  
	ОбогатитьМассивПИМСодержимым(МассивПИМФайлов, ПИМСПодключения);
	ПИМСохранитьНаПодключении(ЭтаФорма.context_params.IntegrationUuid, МассивПИМФайлов);  
	Для Каждого Запись Из МассивПИМФайлов Цикл
		Запись.Вставить("Содержимое", Неопределено);	
	КонецЦикла;	
	ПИМСохранитьНаПодключении(ЭтаФорма.ИдентификаторПодключения, МассивПИМФайлов);  		
	МассивПИМФайлов.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПИМНаИнтеграцию(Команда)
	МассивПИМФайлов = ПИМВыбранныеСтроки();
	МассивПИМФайловДляПереноса = Новый Массив;
	Для Каждого Запись Из МассивПИМФайлов Цикл
		Если Запись.СтатусПодключения <> 0 Тогда
			Продолжить;
		КонецЕсли; 
		СтруктураПИМ = Новый Структура;
		СтруктураПИМ.Вставить("Тип", Запись.DataType); 
		СтруктураПИМ.Вставить("ИмяФайла", Запись.Название);
        МассивПИМФайловДляПереноса.Добавить(СтруктураПИМ);
		ПереносПИМНаИнтеграцию(МассивПИМФайловДляПереноса, 5);
	КонецЦикла;	
	ПереносПИМНаИнтеграцию(МассивПИМФайловДляПереноса);
	ПИМОбновить(Неопределено); 
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = "Программы интеграционных модулей перенесены для всех пользователей";
КонецПроцедуры

&НаКлиенте
Процедура ПИМПутьККаталогуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Заголовок = "Выберите каталог для хранения ПИМ файлов";
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		ЭтаФорма.ПИМПутьККаталогу = ДиалогВыбораКаталога.Каталог;
   	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПИМЗагрузитьКопиюВОблакоНаПодключение(Команда)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("context_params", 			ЭтаФорма.context_params);
	ДополнительныеПараметры.Вставить("ХранилищеАлгоритмов", 	ЭтаФорма.ПИМПутьККаталогу);
	ДополнительныеПараметры.Вставить("ИдентификаторПодключения", ЭтаФорма.ИдентификаторПодключения);
	ДополнительныеПараметры.Вставить("ДействиеСПИМФайлами", 	"Загрузка копии ПИМ-файлов на подключение");
	ЗагрузитьПИМыВОблако(ДополнительныеПараметры);	
		
КонецПроцедуры

&НаКлиенте
Процедура ПИМЗагрузитьКопиюВОблакоНаИнтеграцию(Команда)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("context_params", 			ЭтаФорма.context_params);
	ДополнительныеПараметры.Вставить("ХранилищеАлгоритмов", 	ЭтаФорма.ПИМПутьККаталогу);
	ДополнительныеПараметры.Вставить("ИдентификаторПодключения", ЭтаФорма.context_params.IntegrationUuid);
	ДополнительныеПараметры.Вставить("ДействиеСПИМФайлами", 	"Загрузка копии ПИМ-файлов на интеграцию");
	ЗагрузитьПИМыВОблако(ДополнительныеПараметры);	
КонецПроцедуры
