
&НаКлиенте
Процедура ПИМЗагрузить(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр ="xml (*.xml)|*.xml";
	Диалог.Заголовок = "Выберите xml файл";
	Диалог.МножественныйВыбор = Истина;
	ОбработкаОкончанияЗагрузки = SabyОписаниеОповещения("ПИМВыборФайлаЗавершение", ЭтаФорма, Диалог);
	НачатьПомещениеФайлов(ОбработкаОкончанияЗагрузки, , Диалог, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Функция ПИМИмяОбластиЭлементов()
	Возврат "include_core_base_ПИМ_Form_Elements";
КонецФункции

&НаКлиенте
Функция ПИМВыбранныеСтроки()
	МассивПИМФайлов = Новый Массив;
	Для Каждого Запись Из ЭтаФорма.ПИМФайлы Цикл 
		Если Не Запись.Отметка Тогда 
			Продолжить;
		КонецЕсли;
		МассивПИМФайлов.Добавить(Запись);
	КонецЦикла;
	Если МассивПИМФайлов.Количество() = 0 Тогда
		ЭлементыФормочки = ПолучитьЭлементыФормы();
		ВыдленныеСтроки = ЭлементыФормочки.ПИМФайлы.ВыделенныеСтроки;
		Для Каждого Запись Из ВыдленныеСтроки Цикл 
			МассивПИМФайлов.Добавить(ЭлементыФормочки.ПИМФайлы.ДанныеСтроки(Запись));	
		КонецЦикла;	
	КонецЕсли;
	Возврат МассивПИМФайлов;
КонецФункции
