
&НаКлиенте
Процедура ПИМЗагрузить(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр ="xml (*.xml)|*.xml";
	Диалог.Заголовок = "Выберите xml файл";
	Диалог.МножественныйВыбор = Истина;  
	Если Диалог.Выбрать() Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Каталог", Диалог.Каталог);
		ПИМВыборФайлаЗавершение(Диалог.ВыбранныеФайлы, ДопПараметры);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПИМИмяОбластиЭлементов()
	Возврат "include_core_base_ПИМ_Form_ElementsOF";
КонецФункции

&НаКлиенте
Функция ПИМВыбранныеСтроки()
	МассивПИМФайлов = Новый Массив;
	Для Каждого Запись Из ЭтаФорма.ПИМФайлы Цикл 
		Если Не Запись.Отметка Тогда 
			Продолжить;
		КонецЕсли;
		МассивПИМФайлов.Добавить(Запись);
	КонецЦикла;
	Если МассивПИМФайлов.Количество() = 0 Тогда
		ЭлементыФормочки = ПолучитьЭлементыФормы();
		ВыдленныеСтроки = ЭлементыФормочки.ПИМФайлы.ВыделенныеСтроки;
		Для Каждого Запись Из ВыдленныеСтроки Цикл 
			МассивПИМФайлов.Добавить(ЭлементыФормочки.ПИМФайлы.ДанныеСтроки(Запись));	
		КонецЦикла;	
	КонецЕсли;
	Возврат МассивПИМФайлов;
КонецФункции

Процедура СообщитьПрогрессОперации(Процент = Неопределено, Текст = Неопределено, 
									ДополнительныеПараметры = Неопределено, ОтображатьПрогрессВыполнения = Истина)
	Если ОтображатьПрогрессВыполнения Тогда
		Если Процент = Неопределено Тогда
			Процент  = get_prop(ДополнительныеПараметры, "Прогресс", 0);
		КонецЕсли;
		Состояние("Выполнение операции", Процент, Текст);
	КонецЕсли;								
КонецПроцедуры
