&НаКлиенте
// BSLLS:UnusedLocalVariable-off
// BSLLS:ExportVariables-off
Перем ТранспортИнтеграции, BlocklyExecutor  Экспорт;
&НаКлиенте
Перем Коннектор;
// BSLLS:ExportVariables-on
// BSLLS:UnusedLocalVariable-on

&НаКлиенте
Процедура ОбновитьЗаголовок()
	ДлинаСтрПротокола = 9;
	ЭтаФорма.Заголовок = Сред(api_url, ДлинаСтрПротокола);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройки() 
	Модуль = МодульОбъекта();
	ЭтаФорма.context_params = Модуль.НастройкиПодключенияПрочитать();
	
	Если ЭтаФорма.context_params <> Неопределено Тогда
		// Заполним элементы формы данными из настроек
		ЭтаФорма.context_params.Свойство("password", password);
		ЭтаФорма.context_params.Свойство("login", login);
		ЭтаФорма.context_params.Свойство("api_url", api_url);
		ЭтаФорма.exchange_method	= get_prop(context_params, ИмяСвойстваТранспорта(), "API");
		ЭтаФорма.GostTls = get_prop(context_params, "GostTls", Ложь);
		Если GostTls = Истина Тогда
			ЭтаФорма.ShowGostTls = 7;
		Иначе
			ЭтаФорма.ShowGostTls = 0;
		КонецЕсли;
		ЭтаФорма.Country = Нрег(get_prop(context_params, "Country", ""));
		ЭтаФорма.context_params.Свойство("ConnectionId", ConnectionId);
		
		ЭтаФорма.ProxyType = get_prop(ЭтаФорма.context_params, "ProxyType", "SystemSettings");
		proxy			= get_prop(ЭтаФорма.context_params, "Proxy");
		ЭтаФорма.ProxyProtocol	= get_prop(proxy, "Protocol", "");
		ЭтаФорма.ProxyServer		= get_prop(proxy, "Server", "");
		ЭтаФорма.ProxyPort		= get_prop(proxy, "Port", 0);
		ЭтаФорма.ProxyLogin		= get_prop(proxy, "User", "");
		ЭтаФорма.ProxyPassword	= get_prop(proxy, "Password", "");
		ИспользоватьАутентификациюОС	= get_prop(proxy, "ProxyUseOSAuthentication", Ложь);
		Если ИспользоватьАутентификациюОС Тогда
			ЭтаФорма.ProxyUseOSAuthentication = "Аутентификация через операционную систему";
		Иначе
			ЭтаФорма.ProxyUseOSAuthentication = "Базовая аутентификация";
		КонецЕсли;
		ЭтаФорма.ЗапомнитьПароль = get_prop(context_params, "AutoAuth", Истина);
		ЭтаФорма.ЗапомнитьСертификат = get_prop(context_params, "AutoAuth", Истина);
	Иначе
		ЭтаФорма.context_params = Новый Структура();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДоступнаАвторизацияПоСертификату()
	Если Метаданные.Справочники.Найти("ПрограммыЭлектроннойПодписиИШифрования") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;		
КонецФункции

#Область include_core_base_Авторизация_Form_Вход_ПриСозданииПереопределяемый
#КонецОбласти

#Область include_core_base_Авторизация_Form_Вход_ПриОткрытииПереопределяемый
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Модуль = МодульОбъекта();
	ЭтаФорма.context_params = Модуль.НастройкиПодключенияПрочитать();
	ЭтаФорма.AuthType = "Login";

	Если ЭтаФорма.context_params <> Неопределено Тогда
		// Сброс сесии при открытии формы входа. 
		// т.к. текущая форма открывается не только с формы настроек
		ЭтаФорма.context_params.Вставить("session", Неопределено);
		ЭтаФорма.context_params.Вставить("password", Неопределено);
		ЭтаФорма.AuthType = get_prop(context_params, "AuthType", "Login");
	КонецЕсли;
	Модуль.НастройкиПодключенияЗаписать(ЭтаФорма.context_params);
	
	ТранспортSabyHttpsClient = (Модуль.ВидТранспорта(ЭтаФорма.context_params) = "SabyHttpsClient");
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ЭлементыФормочки.РежимВходаПоСертификату.Видимость = ДоступнаАвторизацияПоСертификату();
	ПриСозданииНаСервереПереопределяемый();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТранспортИнтеграции = ПолучитьФормуТранспорта(ЭтаФорма.context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();
	
	ЭтаФорма.АвторизацияУспешна	= Ложь;
	ЗаполнитьСписокСтран();
	ПрочитатьНастройки();
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ЭтаФорма.Country = "" Тогда
		ЭтаФорма.Country = ЭлементыФормочки.Country.СписокВыбора.Получить(0).Значение;
	КонецЕсли;
	ЗаполнитьСписокПриложений();
	ЗаполнитьСписокКонтуров();
	ЭтаФорма.Domain = Нрег(get_prop(context_params, "Domain", ЭтаФорма.Domain));
	ЭтаФорма.Contour = get_prop(context_params, "Contour", ЭтаФорма.Contour);
	УстановитьВидимостьВключенияГОСТШифрования();
	УстановитьВидимостьГОСТШифрования();
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Ошибка.Заголовок = "";
	СформироватьУРЛОбновитьЗаголовок();     
	Попытка
		ЭлементыФормочки.Пароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.ПоказатьПароль;  
		ЭлементыФормочки.ПроксиПароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.ПоказатьПароль;
	Исключение                  
		ЭлементыФормочки.Пароль.КнопкаВыбора = Ложь;
		ЭлементыФормочки.ПроксиПароль.КнопкаВыбора = Ложь;
	КонецПопытки;
	Если AuthType = "Certificate" Тогда
		РежимВходаПоСертификатуПриНажатии(Неопределено);
	Иначе
		ЭтаФорма.AuthType = "Login";
	КонецЕсли;
	ПриОткрытииПереопределяемый();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКодАвторизации(ДополнительныеПараметры)
	// Первая стадия двухфакторной авторизации
	ПараметрыМетода	= Новый Структура("Идентификатор", ДополнительныеПараметры.Идентификатор);
	ТранспортИнтеграции.local_helper_exec_method(
		ЭтаФорма.context_params,
		ДополнительныеПараметры.МетодОтправкиКодаПодтверждения,
		ПараметрыМетода, , ,
		ЭтаФорма.context_params.api_url + "/auth/service/");
КонецПроцедуры

&НаКлиенте
Процедура ВходПроверкаКодаСМС(ДополнительныеПараметры, Код)
	// Вторая стадия двухфакторной авторизации
	ПараметрыМетода	= Новый Структура("Идентификатор, Код", ДополнительныеПараметры.Идентификатор, Код);
	res = ТранспортИнтеграции.local_helper_exec_method(
		ЭтаФорма.context_params,
		ДополнительныеПараметры.МетодПроверкиКодаИсключения,
		ПараметрыМетода, , , 
		ЭтаФорма.context_params.api_url + "/auth/service/");
	ПослеПолученияСессии(get_prop(res, "result"));
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОшибкуАвторизации(ОшибкаСтруктура) 
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ExtExceptionToJournal(ОшибкаСтруктура);
	
	type = get_prop(ОшибкаСтруктура, "type");
	Если type = "ChooseIntegration" Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("context_params", ЭтаФорма.context_params);	
		ПараметрыФормы.Вставить("МассивИнтеграций", get_prop(ОшибкаСтруктура, "dump", Новый Массив));	
		ОткрытьФормуОбработки("ВыборИнтеграции", ПараметрыФормы, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
	КонецЕсли;
	
	Если type = "InputSertPassword" Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", "Введите пароль сертификата");
		ПараметрыФормы.Вставить("РасшифровкаВводаПароля", ИмяТекущегоСертификата(" для авторизации"));
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Данные", get_prop(ОшибкаСтруктура, "dump", Новый Массив)); 
		ПослеЗакрытияФормы = SabyОписаниеОповещения("ПослеВводаПароляСертификата", ЭтаФорма, ПараметрыОповещения);
		ОткрытьФормуОбработки("ВводПароля", ПараметрыФормы, ЭтаФорма,, ПослеЗакрытияФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
	КонецЕсли;
	
	ДеталиОшибки = get_prop(ОшибкаСтруктура, "detail");
	Если ТипЗнч(ДеталиОшибки) = Тип("Соответствие") Тогда
		Если	(Врег(ДеталиОшибки["classid"]) = "{00000000-0000-0000-0000-1FA000001002}")
			И ТипЗнч(ДеталиОшибки["addinfo"]) <> Неопределено Тогда
			ПодтвердитьВход(ОшибкаСтруктура, ДеталиОшибки);
		КонецЕсли;
	КонецЕсли;	
	Если ТипЗнч(ДеталиОшибки) = Тип("Строка") И Найти(ДеталиОшибки, "Система не поддерживается") Тогда
		ВыйтиНаСервере();
		ПоказатьОповещениеПользователя(
		"Ошибка", , 
		"Система не поддерживается",
		БиблиотекаКартинок["Ошибка32"],
		СтатусОповещенияПользователя.Важное,
		Новый УникальныйИдентификатор);
		Оповестить("SabySignOut");
		Закрыть(Неопределено);
	КонецЕсли;
	Если AuthType = "Certificate" Тогда
		ЭлементыФормочки.ОшибкаСертификат.Заголовок = ExtExceptionToMessage(ОшибкаСтруктура);
	Иначе
		ЭлементыФормочки.Ошибка.Заголовок = ExtExceptionToMessage(ОшибкаСтруктура);
	КонецЕсли;
	// Если не получилось пользователем 1С, то переключаем на логин/пароль
	Если AuthType = "User1C" Тогда
		ЭтаФорма.AuthType = "Login";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьВход(ОшибкаСтруктура, ДеталиОшибки) 
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ПарметрыФормыВводаСМС = Новый Структура;
	Для Каждого КлЗнч Из ДеталиОшибки["addinfo"] Цикл
		ПарметрыФормыВводаСМС.Вставить(КлЗнч.Ключ, КлЗнч.Значение);
	КонецЦикла;
	ОшибкаСтруктура.Вставить("detail", "");
	ОшибкаСтруктура.Вставить("message", "");
	Попытка 
		СессияВводаСМС = Новый Структура;
		СессияВводаСМС.Вставить("session", ПарметрыФормыВводаСМС.ИдентификаторСессии);
		ТранспортИнтеграции.ЗаписатьСессию(context_params, СессияВводаСМС);
		ОтправитьКодАвторизации(ПарметрыФормыВводаСМС);
		
		ПодсказкаЧ1 = "";
		ПарметрыФормыВводаСМС.Свойство("Сообщение", ПодсказкаЧ1);
		ПодсказкаЧ2 = "";
		ПарметрыФормыВводаСМС.Свойство("Телефон", ПодсказкаЧ2);
		ЭлементыФормочки.ИнформацияПользователю.Заголовок = ПодсказкаЧ1 + " " + ПодсказкаЧ2;
		
		АктивироватьВводСМС();
	Исключение
		СессияВводаСМС = Неопределено;
		ТранспортИнтеграции.ЗаписатьСессию(context_params, СессияВводаСМС);
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПароляСертификата(Результат, ДополнительныеПараметры = Неопределено) Экспорт  
	Если Не ЗначениеЗаполнено(Результат) Тогда
		ЭлементыФормочки = ПолучитьЭлементыФормы();
		ЭлементыФормочки.ОшибкаСертификат.Заголовок = "Не введен пароль закрытого сертификата";
	    Возврат;
	КонецЕсли;         
	ДанныеСессии = get_prop(ДополнительныеПараметры, "Данные");
	ПослеПолученияСессии(ДанныеСессии, Результат);	
КонецПроцедуры	

&НаКлиенте
Функция ИмяТекущегоСертификата(ПостФикс = "")
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ЭлементыФормочки.СписокСертификатовДляАутентификации.ТекущиеДанные = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат get_prop(ЭлементыФормочки.СписокСертификатовДляАутентификации.ТекущиеДанные, "Название", "") + ПостФикс; 
КонецФункции

&НаКлиенте
Процедура ПослеПолученияСессии(ДанныеСессии, ПарольЗакрытогоКлюча = Неопределено)
	Попытка
		Если AuthType = "Certificate" Тогда 
			session = ТранспортИнтеграции.Saby_РасшифроватьДанные(ЭтаФорма.context_params, ДанныеСессии, ,,ПарольЗакрытогоКлюча);	
		Иначе
			session = ДанныеСессии;	
		КонецЕсли;		
		СтруктураСессии = Новый Структура;
		СтруктураСессии.Вставить("session", session);
		// BSLLS:DeprecatedCurrentDate-off
		СтруктураСессии.Вставить("session_begin", ТекущаяДата());
		// BSLLS:DeprecatedCurrentDate-on 
		ТранспортИнтеграции.ЗаписатьСессию(ЭтаФорма.context_params, СтруктураСессии);
		ЭтаФорма.context_params.Вставить("last_token_time", Неопределено);
		ЗаписатьНастройкиНаСервере();
		ПослеУспешнойАвторизации(); 
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		ОбработатьОшибкуАвторизации(ОшибкаСтруктура);
    КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПослеУспешнойАвторизации()
	ТранспортИнтеграции.ПослеАутентификации(ЭтаФорма.context_params);
	ТранспортИнтеграции.ПолучитьСтатусВерсии(Истина);
	ЭтаФорма.АвторизацияУспешна = Истина;
	ЭтаФорма.Закрыть(ЭтаФорма.context_params);
	ПослеАвторизации();
КонецПроцедуры

&НаКлиенте
Процедура Войти(Команда)
	// BSLLS:DuplicateStringLiteral-off
	ЭтаФорма.АвторизацияУспешна = Ложь;
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если AuthType = "Login" И  (НЕ ЗначениеЗаполнено(login) ИЛИ НЕ ЗначениеЗаполнено(password)) Тогда
		ЭлементыФормочки.Ошибка.Заголовок = "Не указан логин или пароль";
		Возврат;
	КонецЕсли;
	ЭтаФорма.context_params.Вставить("AuthType", AuthType);
	ЭтаФорма.context_params.Вставить("login", Неопределено);
	ЭтаФорма.context_params.Вставить("password", Неопределено);
	ЭтаФорма.context_params.Вставить("Certificate", Неопределено);
	Если AuthType = "Login" Тогда 
		encrypt_password = ШифроватьXOR(password);
		ЭтаФорма.context_params.Вставить("login", login);
		ЭтаФорма.context_params.Вставить("password", encrypt_password);
		ЭтаФорма.context_params.Вставить("AutoAuth", ЗапомнитьПароль);
	КонецЕсли;	
	Если AuthType = "Certificate" Тогда  
		ЭлементыФормочки.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницыАвторизации, "ПоСертификату"); // при нажатии enter в строке поиска ТекущаяСтраница устанавливается "ПоЛогину"
		Если ЭлементыФормочки.СписокСертификатовДляАутентификации.ТекущиеДанные = Неопределено Тогда //команда отрабатывает при нажатии enter в строке поиска с незаполненными ТекущимиДанными 
			Возврат;
		КонецЕсли;
		ЭтаФорма.context_params.Вставить("Certificate", ЭлементыФормочки.СписокСертификатовДляАутентификации.ТекущиеДанные.Отпечаток);	
		ЭтаФорма.context_params.Вставить("AutoAuth", ЗапомнитьСертификат);
	КонецЕсли;	
	СформироватьУРЛ();
	ЭтаФорма.context_params.Вставить("ConnectionId", ConnectionId);
	ЗаполнитьПараметрыПрокси();
	Попытка
		ТранспортИнтеграции.ВойтиТранспорт(ЭтаФорма.context_params);
		ПослеУспешнойАвторизации();
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		ОбработатьОшибкуАвторизации(ОшибкаСтруктура);
	КонецПопытки;
	// BSLLS:DuplicateStringLiteral-on
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУРЛ()
	api_url = "https://" + ПрефиксКонтур() + ПрефиксГОСТ() + Domain + "." + Country;
	ЭтаФорма.context_params.Вставить("api_url", api_url);
	ЭтаФорма.context_params.Вставить(ИмяСвойстваТранспорта(), exchange_method);
	ЭтаФорма.context_params.Вставить("GostTls", GostTls);
	ЭтаФорма.context_params.Вставить("Country", Country);
	ЭтаФорма.context_params.Вставить("Domain", Domain);
	ЭтаФорма.context_params.Вставить("Contour", Contour);
КонецПроцедуры

#Область include_core_base_БазовыеКомпоненты_Form_Browser_СформироватьАдресСтраницы
#КонецОбласти



&НаКлиенте
Функция ПрефиксКонтур()
	Если ЗначениеЗаполнено(Contour) Тогда
		Префикс = Contour + "-";
	Иначе
		Префикс = "";
	КонецЕсли;
	Возврат Префикс;	
КонецФункции

&НаКлиенте
Функция ПрефиксГОСТ()
	Если GostTls = Ложь Тогда
		Префикс = "online.";
	Иначе
		Префикс = "g.";
	КонецЕсли;
	Возврат Префикс;	
КонецФункции

&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент) //Из-за ошибки платформы на старых формах пришлось добавить переключение видимости элементов формы, и тогда форма обновляется, иначе пароль не отображается при нажатии
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Попытка
		ЭтаФорма.Password = ЭлементыФормочки.Пароль.ТекстРедактирования;
	Исключение
		ЭтаФорма.Password = ЭлементыФормочки.Пароль.Значение; //если ОФ, то ТекстРедактирования отсутствует, есть Значение
	КонецПопытки;
	ЭлементыФормочки.Пароль.Видимость = Ложь;
	Если ЭлементыФормочки.Пароль.РежимПароля Тогда 	
		ЭлементыФормочки.Пароль.РежимПароля = Ложь;
		Попытка
			ЭлементыФормочки.Пароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.СкрытьПароль;
		Исключение                  
			ЭлементыФормочки.Пароль.КнопкаВыбора = Ложь;	
		КонецПопытки;
   	Иначе
		ЭлементыФормочки.Пароль.РежимПароля = Истина;
		Попытка
			ЭлементыФормочки.Пароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.ПоказатьПароль;
		Исключение                  
			ЭлементыФормочки.Пароль.КнопкаВыбора = Ложь;	
		КонецПопытки;
	КонецЕсли; 
	ЭлементыФормочки.Пароль.Видимость = Истина;
КонецПроцедуры    

&НаКлиенте
Процедура ПроксиПарольНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭтаФорма.ProxyPassword = ЭлементыФормочки.ПроксиПароль.ТекстРедактирования;
	ЭлементыФормочки.ПроксиПароль.Видимость = Ложь;
	Если ЭлементыФормочки.ПроксиПароль.РежимПароля Тогда 	
		ЭлементыФормочки.ПроксиПароль.РежимПароля = Ложь;
		Попытка
			ЭлементыФормочки.ПроксиПароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.СкрытьПароль;
		Исключение                  
			ЭлементыФормочки.ПроксиПароль.КнопкаВыбора = Ложь;	
		КонецПопытки;
   	Иначе
		ЭлементыФормочки.ПроксиПароль.РежимПароля = Истина;
		Попытка
			ЭлементыФормочки.ПроксиПароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.ПоказатьПароль;
		Исключение                  
			ЭлементыФормочки.ПроксиПароль.КнопкаВыбора = Ложь;	
		КонецПопытки;
	КонецЕсли; 
	ЭлементыФормочки.ПроксиПароль.Видимость = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ВойтиЧерезБраузерЗавершение(Результат, Парметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭтаФорма.АвторизацияУспешна = Истина;
	ЭтаФорма.context_params	= НастройкиПодключенияПрочитатьНаСервере();
	
	МассивСтатистики = Новый Массив;
	НаименованиеДействия = "Auth";
	web_interface = get_prop(context_params, "web_interface");
	Если web_interface = "BrowserSabyPlugin" Тогда
		КонтекстДействия = "Lpp";
	Иначе
		КонтекстДействия = "LppBl";
	КонецЕсли;	
	ЭлементСтатистики = ТранспортИнтеграции.local_helper_element_action(НаименованиеДействия, КонтекстДействия, Новый Структура(), 1);
	МассивСтатистики.Добавить(ЭлементСтатистики);
	ТранспортИнтеграции.local_helper_register_actions(ЭтаФорма.context_params, МассивСтатистики);
	
	ЭтаФорма.Закрыть(ЭтаФорма.context_params);
КонецПроцедуры

&НаКлиенте
Процедура ВойтиЧерезБраузер(Команда)
	СформироватьУРЛ();
	АдресСтраницы = api_url+"/auth/";

	ЭтаФорма.context_params.Вставить("login", login);
	ЭтаФорма.context_params.Вставить("password", password);
	ЭтаФорма.context_params.Вставить("api_url", api_url);
	ЭтаФорма.context_params.Вставить("ConnectionId", ConnectionId);
	ЭтаФорма.context_params.Удалить("Proxy");
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок", "Авторизация");
	ПараметрыФормы.Вставить("АвтоЗакрытиеФормы", Истина);
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормы.Вставить("context_params", ЭтаФорма.context_params);

	ОповещениеОЗарытитииФормыАвторизацииВЕБ = Новый ОписаниеОповещения("ВойтиЧерезБраузерЗавершение", ЭтаФорма, ПараметрыФормы);
	
	АдресСтраницы = СформироватьАдресСтраницы();

	Попытка
		СформироватьАдресСоСлужебнымиПараметрами();
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		ОписаниеОшибки = СтруктураОшибки.message;
		ПоказатьОповещениеПользователя(
			"Ошибка", , ОписаниеОшибки,
			БиблиотекаКартинок["Ошибка32"]);
		Возврат;
	КонецПопытки;
	ОбновитьПолеHTML("ПолеHTMLДокумента", АдресСтраницыССлужебнымиПараметрами);
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьКод(Команда)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Попытка
		ВходПроверкаКодаСМС(ПарметрыФормыВводаСМС, code_sms);
		code_sms = "";
		ЭтаФорма.Закрыть(ЭтаФорма.context_params);
	Исключение
		code_sms = "";
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		ПоказатьОшибкуВводаСМС(ExtExceptionToMessage(ОшибкаСтруктура));
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СерверПриИзменении(Элемент)
	ОбновитьЗаголовок();
КонецПроцедуры

#Область include_core_base_Настройки_ЗаписатьНастройки
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключенияНаСервере
#КонецОбласти

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область include_core_base_Авторизация_Выход
#КонецОбласти

&НаКлиенте
Процедура ПолучитьАктуальностьВерсии()
// Заглушка
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокПодсказкуКнопкиВыйти()
// Заглушка
КонецПроцедуры

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_Helpers_FormElementsHTML
#КонецОбласти

#Область include_core_base_Настройки_НастрйкиПроксиСервера
#КонецОбласти

#Область include_core_base_Авторизация_Form_Вход_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_Авторизация_СертификатыДляАвторизации 
#КонецОбласти

&НаКлиенте
Процедура РежимВходаПоЛогинуНажатие(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницыАвторизации, "ПоЛогину");
	ЭтаФорма.AuthType = "Login";
	ЭлементыФормочки.Ошибка.Заголовок = "";
	ЭлементыФормочки.ОшибкаСертификат.Заголовок = "";
	ЭлементыФормочки.ОшибкаКодПодтверждения.Заголовок = "";
КонецПроцедуры

&НаКлиенте
Процедура РежимВходаПоСертификатуПриНажатии(Элемент)
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыАвторизации, "ПоСертификату");
	ЭтаФорма.AuthType = "Certificate";
	СформироватьУРЛ();
	ЗаполнитьСписокСертификатов();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыАвторизации, "НастройкиПодключения");
	УстановитьВидимостьНастроекПрокси(); 	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметрыПрокси(Команда)
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыАвторизации, "НастройкиПрокси");
	УстановитьДоступностьНастройкиПрокси();
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьВводСМС()				
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыАвторизации, "КодПодтверждения");
	ЭлФорм.Подтвердить.КнопкаПоУмолчанию	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуВводаСМС(ТекстОшибки)
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.ОшибкаКодПодтверждения.Заголовок = ТекстОшибки;
КонецПроцедуры

&НаКлиенте
Процедура СписокСертификатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные.Статус = 0 Тогда
		Войти(Неопределено);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВойтиПользователем1С(Элемент)
	ЭтаФорма.AuthType = "User1C";
	Войти(Неопределено);
КонецПроцедуры

#Область include_core_base_Транспорт_ИмяСвойстваТранспорта 
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_Авторизация_СписокСтран
#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьСписокПриложений()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Domain.СписокВыбора.Очистить();
	Если Country = "ru" Тогда
		ЭлементыФормочки.Domain.СписокВыбора.Добавить("saby", "saby");
		ЭлементыФормочки.Domain.СписокВыбора.Добавить("sabytest", "sabytest");
		ЭлементыФормочки.Domain.Подсказка = "saby - рабочий домен; sabytest - тестовый домен";
	Иначе
		ЭлементыФормочки.Domain.СписокВыбора.Добавить("setty", "setty");
		ЭлементыФормочки.Domain.Подсказка = "setty - рабочий домен";
	КонецЕсли;
	Если ЭлементыФормочки.Domain.СписокВыбора.НайтиПоЗначению(Domain) = Неопределено Тогда
		Domain = ЭлементыФормочки.Domain.СписокВыбора[0].Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокКонтуров()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Contour.СписокВыбора.Очистить();
	ЭлементыФормочки.Contour.СписокВыбора.Добавить("", "online");
	ЭлементыФормочки.Contour.СписокВыбора.Добавить("fix", "fix");
	Если Country = "ru" Тогда
		ЭлементыФормочки.Contour.СписокВыбора.Добавить("test", "test");
		ЭлементыФормочки.Contour.СписокВыбора.Добавить("pre-test", "pre-test");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРаботуКомпоненты() 
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ОшибкаНастройки.Заголовок = "";
	Если exchange_method <> "SabyPluginConnector" Тогда
		Возврат;
	КонецЕсли;
	Попытка 
		ПутьКомпоненты = ПолучитьПутьКомпоненты(exchange_method);
		НачатьУстановкуВнешнейКомпоненты(, ПутьКомпоненты);
	Исключение  
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ЭлементыФормочки.ОшибкаНастройки.Заголовок = ExtExceptionToMessage(ОшибкаСтруктура);	
	КонецПопытки;	
КонецПроцедуры	

Функция ПолучитьПутьКомпоненты(ИмяКомпоненты)
	МодульОбъекта = МодульОбъекта();
	ПутьКомпоненты = МодульОбъекта.АдресНативнойКомпонентыИзВнешнейОбработки(ИмяКомпоненты);	
	Возврат ПутьКомпоненты;	
КонецФункции

&НаКлиенте
Процедура СпособОбменаПриИзменении(Элемент)
	УстановитьВидимостьВключенияГОСТШифрования();
	УстановитьВидимостьГОСТШифрования();
	СформироватьУРЛОбновитьЗаголовок();
	ПроверитьРаботуКомпоненты();
	УстановитьВидимостьНастроекПрокси();
	СпособОбменаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНастроекПрокси()
	// BSLLS:LineLength-off
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если exchange_method = "SabyPluginConnector" Или exchange_method = "ExtSdk2" Или exchange_method = "ExtSDK2Crypto" Тогда
		ЭлементыФормочки.ГруппаПараметрыПрокси.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ГруппаПараметрыПрокси, "ПараметрыПроксиНедоступны");
		ЭлементыФормочки.ПроксиПлагин.Заголовок = "Используются параметры прокси десктопного приложения " + ЛокализацияНазваниеПродукта();
	Иначе
		ЭлементыФормочки.ГруппаПараметрыПрокси.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.ГруппаПараметрыПрокси, "ПараметрыПроксиДоступны");		
		УстановитьЗаголовокПроксиИнфо();
	КонецЕсли;
	// BSLLS:LineLength-on
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьВключенияГОСТШифрования()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ShowGostTls.Видимость = exchange_method = "SabyHttpsClient" И Country = "ru";
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГОСТШифрования()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.GostTls.Видимость = exchange_method = "SabyHttpsClient" И Country = "ru" И ShowGostTls > 6;
	Если Не ЭлементыФормочки.GostTls.Видимость тогда
		ЭтаФорма.GostTls = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтранаПриИзменении(Элемент)
	ЗаполнитьСписокПриложений();
	ЗаполнитьСписокКонтуров();
	УстановитьВидимостьВключенияГОСТШифрования();
	УстановитьВидимостьГОСТШифрования();
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ГОСТТЛСПриИзменении(Элемент)
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ПриложениеПриИзменении(Элемент)
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура КонтурПриИзменении(Элемент)
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУРЛОбновитьЗаголовок()
	СформироватьУРЛ();
	ОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьГОСТТЛСНажатие(Элемент)
	ShowGostTls = ShowGostTls + 1;
	УстановитьВидимостьГОСТШифрования();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВыбранаИнтеграция" Тогда  
		ЭтаФорма.context_params.Вставить("ExtSysUid", Параметр);
		Попытка
			ТранспортИнтеграции.ПослеАутентификации(ЭтаФорма.context_params);
			ТранспортИнтеграции.ПолучитьСтатусВерсии(Истина);
			ЭтаФорма.АвторизацияУспешна = Истина;
			ЭтаФорма.Закрыть(ЭтаФорма.context_params);
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
			ОбработатьОшибкуАвторизации(ОшибкаСтруктура);
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипПроксиПриИзменении(Элемент)
	УстановитьДоступностьНастройкиПрокси();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьНастройкиПрокси()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ДоступностьПрокси = ProxyType = "OtherSettings";
	ЭлементыФормочки.ПроксиПротокол.Доступность = ДоступностьПрокси;
	ЭлементыФормочки.ПроксиСервер.Доступность = ДоступностьПрокси;
	ЭлементыФормочки.ПроксиПорт.Доступность = ДоступностьПрокси;
	ЭлементыФормочки.ИспользоватьАутентификациюОС.Доступность = ДоступностьПрокси;
	ЭлементыФормочки.ПроксиЛогин.Доступность = ДоступностьПрокси;
	ЭлементыФормочки.ПроксиПароль.Доступность = ДоступностьПрокси;
	ЭлементыФормочки.ВзятьНастройкиПроксиИз1С.Доступность = ДоступностьПрокси;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокПроксиИнфо()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ProxyType = "NotUse" Тогда
		ЭлементыФормочки.ПроксиИнфо.Заголовок = "Не используется";
	ИначеЕсли ProxyType = "SystemSettings" Тогда
		ЭлементыФормочки.ПроксиИнфо.Заголовок = "Используются системные настройки";
	Иначе
		ЭлементыФормочки.ПроксиИнфо.Заголовок = ProxyProtocol + ";" + ProxyServer + ":" + Строка(ProxyPort);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВВебВерсию(Команда)
	ЭтаФорма.Закрыть();
	ФормаБраузера = ФормаОсновнойОбработки("Browser", ПутьКФормамОбработки());
	ФормаБраузера.context_params = context_params;
	ФормаБраузера.Открыть();
КонецПроцедуры

#Область include_core_base_Авторизация_Form_Вход_ОбработчикиСобытийПереопределяемый
#КонецОбласти

#Область include_core_base_Helpers_XDTO
#КонецОбласти

&НаКлиенте
Функция ОбработатьДействиеНаКлиенте(ИмяДействия, Параметры)
	ПараметрыВызова = DecodeXmlXdto(Параметры);
	Если ИмяДействия = "OpenLink" Тогда
		Результат = API_ADDON_OPENURL(ПараметрыВызова);
	ИначеЕсли ИмяДействия = "OnAuth" Тогда
		ТранспортИнтеграции.API_ADDON_ONAUTH(ПараметрыВызова, ЭтаФорма.context_params);  
		Результат = ПодготовитьРезультат(Неопределено);
		ВернутьРезультат(Результат);
		ВойтиЧерезБраузерЗавершение(Истина, ПараметрыВызова);
		Возврат Неопределено;
	Иначе
		Возврат ОбработатьДействие(ИмяДействия, ПараметрыВызова);	
	КонецЕсли;
	Возврат ПодготовитьРезультат(Результат);
КонецФункции 

&НаСервере
Функция ОбработатьДействие(Знач ИмяДействия, Знач ПараметрыВызова)
	МодульОбъекта = МодульОбъекта();
	Если ИмяДействия = "ReadSystemInfo" Тогда
		Результат = МодульОбъекта.API_ADDON_READSYSTEMINFO(ПараметрыВызова);
	Иначе
		ВызватьИсключение NewExtExceptionСтрока(,"Неизвестная команда", ИмяДействия);
	КонецЕсли;
	Возврат ПодготовитьРезультат(Результат);
КонецФункции

&НаКлиенте
Функция API_ADDON_OPENURL(ПараметрыВызова)
	Ссылка = get_prop(ПараметрыВызова, "Link");
	// BSLLS:UsingSynchronousCalls-off
	ЗапуститьПриложение(Ссылка);
	// BSLLS:UsingSynchronousCalls-on
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ДобавитьВЛог(Тип, Команда, Данные)
КонецПроцедуры

#Область include_core_base_БазовыеКомпоненты_Form_Browser_BrowserEventsHandler
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти

#Область include_core_base_Авторизация_ПослеАвторизации //&НаКлиенте
#КонецОбласти
