&НаКлиенте
// BSLLS:ExportVariables-off
Перем ТранспортИнтеграции, BlocklyExecutor  Экспорт;
// BSLLS:ExportVariables-on

&НаКлиенте
Процедура ОбновитьЗаголовок()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭтаФорма.Заголовок = "Вход в " + Сред(api_url, 9);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройки() 
	Модуль = МодульОбъекта();
	ЭтаФорма.context_params = Модуль.НастройкиПодключенияПрочитать();
	
	Если ЭтаФорма.context_params <> Неопределено Тогда
		// Заполним элементы формы данными из настроек
		ЭтаФорма.context_params.Свойство("password", password);
		ЭтаФорма.context_params.Свойство("login", login);
		ЭтаФорма.context_params.Свойство("api_url", api_url);
		ЭтаФорма.exchange_method	= get_prop(context_params, ИмяСвойстваТранспорта(), "API");
		ЭтаФорма.GostTls = get_prop(context_params, "GostTls", Ложь);
		ЭтаФорма.Country = get_prop(context_params, "Country");
		ЭтаФорма.context_params.Свойство("ConnectionId", ConnectionId);
		
		proxy			= get_prop(ЭтаФорма.context_params, "Proxy");
		Этаформа.ProxyProtocol	= get_prop(proxy, "Protocol", "");
		Этаформа.ProxyServer		= get_prop(proxy, "Server", "");
		Этаформа.ProxyPort		= get_prop(proxy, "Port", 0);
		Этаформа.ProxyLogin		= get_prop(proxy, "User", "");
		Этаформа.ProxyPassword	= get_prop(proxy, "Password", "");
		Этаформа.ИспользоватьАутентификациюОС	= get_prop(proxy, "ИспользоватьАутентификациюОС", Ложь);
	Иначе
		ЭтаФорма.context_params = Новый Структура();
	КонецЕсли;
	
	
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	Если ЭтаФорма.Country = "" Тогда
		ЭтаФорма.Country = ЭлементыФормочки.Country.СписокВыбора.Получить(0).Значение;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДоступнаАвторизацияПоСертификату()
	Если Метаданные.Справочники.Найти("ПрограммыЭлектроннойПодписиИШифрования") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;		
КонецФункции

#Область include_core_base_Авторизация_Form_Вход_ПриСозданииПереопредяемый
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Модуль = МодульОбъекта();
	ЭтаФорма.context_params = Модуль.НастройкиПодключенияПрочитать();
	ЭтаФорма.ВидАвторизации = 1;

	Если ЭтаФорма.context_params <> Неопределено Тогда
		// Сброс сесии при открытии формы входа. 
		// т.к. текущая форма открывается не только с формы настроек
		ЭтаФорма.context_params.Вставить("session", Неопределено);
		ЭтаФорма.context_params.Вставить("password", Неопределено);
		ЭтаФорма.ВидАвторизации = get_prop(context_params,"ВидАвторизации", 1);
	КонецЕсли;
	Модуль.НастройкиПодключенияЗаписать(ЭтаФорма.context_params);
	
	ТранспортSabyHttpsClient = (Модуль.ВидТранспорта(ЭтаФорма.context_params) = "SabyHttpsClient");
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ЭлементыФормочки.РежимВходаПоСертификату.Видимость = ДоступнаАвторизацияПоСертификату();
	ЭлементыФормочки.РежимВходаПоСертификату1.Видимость = ЭлементыФормочки.РежимВходаПоСертификату.Видимость;
	ЭлементыФормочки.Сервер.СписокВыбора.Очистить();
	Для Каждого ЗаписьСервер Из Модуль.СписокСерверовSaby(Истина) Цикл
		ЭлементыФормочки.Сервер.СписокВыбора.Добавить("https://" + ЗаписьСервер.Значение, ЗаписьСервер.Представление);
	КонецЦикла;
	ПриСозданииНаСервереПереопределяемый();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТранспортИнтеграции = ПолучитьФормуТранспорта(ЭтаФорма.context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();
	
	Этаформа.АвторизацияУспешна	= Ложь;
	ЗаполнитьСписокСтран();
	ПрочитатьНастройки();
	ЗаполнитьСписокПриложений();
	ЗаполнитьСписокКонтуров();
	ЭтаФорма.Domain = get_prop(context_params, "Domain", ЭтаФорма.Domain);
	ЭтаФорма.Contour = get_prop(context_params, "Contour", ЭтаФорма.Contour);
	УстановитьВидимостьГОСТШифрования();
	УстановитьВидимостьКонтура();
	ОбновитьЗаголовок();
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Ошибка.Заголовок = "";
	ЭлементыФормочки.Предупреждение.Заголовок =  СтрЗаменить(ЭлементыФормочки.Предупреждение.Заголовок, "%PRODUCTNAME%", ЛокализацияНазваниеПродукта());
	ПереключитьВидАвторизации();     
	Попытка
		ЭлементыФормочки.Пароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.ПоказатьПароль;
	Исключение                  
		ЭлементыФормочки.Пароль.КнопкаВыбора = Ложь;	
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьВидАвторизации()
	Если ЭтаФорма.ВидАвторизации = 2 Тогда
		РежимВходаПоСертификатуПриНажатии(Неопределено);
	Иначе
		РежимВходаПоЛогинуНажатие(Неопределено);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКодАвторизации(ДополнительныеПараметры)
	// Первая стадия двухфакторной авторизации
	ПараметрыМетода	= Новый Структура("Идентификатор", ДополнительныеПараметры.Идентификатор);
	ТранспортИнтеграции.local_helper_exec_method(
		ЭтаФорма.context_params,
		ДополнительныеПараметры.МетодОтправкиКодаПодтверждения,
		ПараметрыМетода, , ,
		ЭтаФорма.context_params.api_url + "/auth/service/");
КонецПроцедуры

&НаКлиенте
Процедура ВходПроверкаКодаСМС(ДополнительныеПараметры, Код)
	// Вторая стадия двухфакторной авторизации
	ПараметрыМетода	= Новый Структура("Идентификатор, Код", ДополнительныеПараметры.Идентификатор, Код);
	res = ТранспортИнтеграции.local_helper_exec_method(
		ЭтаФорма.context_params,
		ДополнительныеПараметры.МетодПроверкиКодаИсключения,
		ПараметрыМетода, , , 
		ЭтаФорма.context_params.api_url + "/auth/service/");
	СтруктураСессии = Новый Структура;
	СтруктураСессии.Вставить("session", res["result"]);
	// BSLLS:DeprecatedCurrentDate-off
	СтруктураСессии.Вставить("session_begin", ТекущаяДата());
	// BSLLS:DeprecatedCurrentDate-on 
	ТранспортИнтеграции.ЗаписатьСессию(ЭтаФорма.context_params, СтруктураСессии);
	ЭтаФорма.context_params.Вставить("last_token_time", Неопределено);
	ЗаписатьНастройкиНаСервере();

	ТранспортИнтеграции.ПослеАутентификации(ЭтаФорма.context_params);
	ТранспортИнтеграции.ПолучитьСтатусВерсии(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СменитьАккаунтНажатие()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	СменитьАккаунтВВыпадающемСписке(ЭлементыФормочки.Логин, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОшибкуАвторизации(ОшибкаСтруктура) 
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ExtExceptionToJournal(ОшибкаСтруктура);
	
	ДеталиОшибки = get_prop(ОшибкаСтруктура, "detail");
	Если ТипЗнч(ДеталиОшибки) = Тип("Соответствие") Тогда
		Если	(Врег(ДеталиОшибки["classid"]) = "{00000000-0000-0000-0000-1FA000001002}")
			И ТипЗнч(ДеталиОшибки["addinfo"]) <> Неопределено Тогда
			ПарметрыФормыВводаСМС = Новый Структура;
			Для Каждого КлЗнч Из ДеталиОшибки["addinfo"] Цикл
				ПарметрыФормыВводаСМС.Вставить(КлЗнч.Ключ, КлЗнч.Значение);
			КонецЦикла;
			ОшибкаСтруктура.Вставить("detail", "");
			ОшибкаСтруктура.Вставить("message", "");
			Попытка 
				СессияВводаСМС = Новый Структура;
				СессияВводаСМС.Вставить("session", ПарметрыФормыВводаСМС.ИдентификаторСессии);
				ТранспортИнтеграции.ЗаписатьСессию(context_params, СессияВводаСМС);
				ОтправитьКодАвторизации(ПарметрыФормыВводаСМС);
				
				ПодсказкаЧ1 = "";
				ПарметрыФормыВводаСМС.Свойство("Сообщение", ПодсказкаЧ1);
				ПодсказкаЧ2 = "";
				ПарметрыФормыВводаСМС.Свойство("Телефон", ПодсказкаЧ2);
				ЭлементыФормочки.ИнформацияПользователю.Заголовок = ПодсказкаЧ1 + " " + ПодсказкаЧ2;
				
				ЭлементыФормочки.ГруппаВводаЛогинаИПароля.Видимость			= Ложь;
				ЭлементыФормочки.ПодтверждениеКода.Видимость				= Истина;
				ЭлементыФормочки.ОтменитьПодтверждение.КнопкаПоУмолчанию	= Истина;
			Исключение
				СессияВводаСМС = Неопределено;
				ТранспортИнтеграции.ЗаписатьСессию(context_params, СессияВводаСМС);
				ИнфОбОшибке = ИнформацияОбОшибке();
				ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
			КонецПопытки;

		КонецЕсли;
	КонецЕсли;	
	Если ТипЗнч(ДеталиОшибки) = Тип("Строка") И Найти(ДеталиОшибки, "Система не поддерживается") Тогда
		ВыйтиНаСервере();
		ПоказатьОповещениеПользователя(
		"Ошибка",,
		"Система не поддерживается",
		БиблиотекаКартинок["Ошибка32"],
		СтатусОповещенияПользователя.Важное,
		Новый УникальныйИдентификатор
		);
		Оповестить("SabySignOut");
		Закрыть(Неопределено);
	КонецЕсли;
	ЭлементыФормочки.Ошибка.Заголовок = ExtExceptionToMessage(ОшибкаСтруктура);
КонецПроцедуры	

&НаКлиенте
Процедура Войти(Команда)
	Если Команда <> Неопределено И  ВидАвторизации = 3 Тогда
		Этаформа.ВидАвторизации = 1;
	КонецЕсли;
	Этаформа.АвторизацияУспешна = Ложь;
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ВидАвторизации = 1 И  (НЕ ЗначениеЗаполнено(login) ИЛИ НЕ ЗначениеЗаполнено(password)) Тогда
		ЭлементыФормочки.Ошибка.Заголовок = "Не указан логин или пароль";
		Возврат;
	КонецЕсли;
	ЭтаФорма.context_params.Вставить("ВидАвторизации", ВидАвторизации);
	ЭтаФорма.context_params.Вставить("login", Неопределено);
	ЭтаФорма.context_params.Вставить("password", Неопределено);
	ЭтаФорма.context_params.Вставить("Сертификат", Неопределено);
	Если ВидАвторизации = 1 Тогда 
		ЭтаФорма.context_params.Вставить("login", login);
		ЭтаФорма.context_params.Вставить("password", password);
	КонецЕсли;	
	Если ВидАвторизации = 2 Тогда  
		ЭтаФорма.context_params.Вставить("Сертификат", ЭлементыФормочки.СписокСертификатов.ТекущиеДанные.Значение);	
	КонецЕсли;	
	СформироватьУРЛ();
	ЭтаФорма.context_params.Вставить("ConnectionId", ConnectionId);
	ЗаполнитьПараметрыПрокси();
	Попытка
		ТранспортИнтеграции.ВойтиТранспорт(ЭтаФорма.context_params);
		BlocklyExecutor.ПослеАутентификации(ЭтаФорма.context_params);
		BlocklyExecutor.ПолучитьСтатусВерсии(Истина);
		Этаформа.АвторизацияУспешна = Истина;
		СменитьАккаунтНажатие();
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		ОбработатьОшибкуАвторизации(ОшибкаСтруктура);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУРЛ()
	api_url = "https://" + ПрефиксКонтур() + ПрефиксГОСТ() + ПрефиксПриложение() + ПрефиксСтрана();
	ЭтаФорма.context_params.Вставить("api_url", api_url);
	ЭтаФорма.context_params.Вставить(ИмяСвойстваТранспорта(), exchange_method);
	ЭтаФорма.context_params.Вставить("GostTls", GostTls);
	ЭтаФорма.context_params.Вставить("Country", Country);
	ЭтаФорма.context_params.Вставить("Domain", Domain);
	ЭтаФорма.context_params.Вставить("Contour", Contour);
КонецПроцедуры

&НаКлиенте
Функция ПрефиксКонтур()
	Если ЗначениеЗаполнено(Contour) Тогда
		Префикс = Contour + "-";
	Иначе
		Префикс = "";
	КонецЕсли;
	Возврат Префикс;	
КонецФункции

&НаКлиенте
Функция ПрефиксГОСТ()
	Если GostTls = Ложь Тогда
		Префикс = "online.";
	Иначе
		Префикс = "g.";
	КонецЕсли;
	Возврат Префикс;	
КонецФункции

&НаКлиенте
Функция ПрефиксПриложение()
	Возврат Нрег(Domain);	
КонецФункции

&НаКлиенте
Функция ПрефиксСтрана()
	Если Country = "RU" Тогда
		Префикс = ".ru";
	Иначе
		Префикс = ".kz";
	КонецЕсли;
	Возврат Префикс;	
КонецФункции

&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ЭлементыФормочки.Пароль.РежимПароля Тогда
		ЭлементыФормочки.Пароль.РежимПароля = Ложь;
	Иначе
		ЭлементыФормочки.Пароль.РежимПароля = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВойтиЧерезБраузерЗавершение(Результат, Парметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Этаформа.АвторизацияУспешна = Истина;
	ВойтиЧерезБраузерЗавершениеПеречитптьНастройки();
	СменитьАккаунтНажатие();
КонецПроцедуры

&НаСервере
Процедура ВойтиЧерезБраузерЗавершениеПеречитптьНастройки()
	Модуль = МодульОбъекта();
	Этаформа.context_params = Модуль.НастройкиПодключенияПрочитать();
КонецПроцедуры

&НаКлиенте
Процедура ВойтиЧерезБраузер(Команда)
	СформироватьУРЛ();
	АдресСтраницы = api_url+"/auth/";

	ЭтаФорма.context_params.Вставить("login", login);
	ЭтаФорма.context_params.Вставить("password", password);
	ЭтаФорма.context_params.Вставить("api_url", api_url);
	ЭтаФорма.context_params.Вставить("ConnectionId", ConnectionId);
	ЭтаФорма.context_params.Удалить("Proxy");
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок", "Авторизация");
	ПараметрыФормы.Вставить("АвтоЗакрытиеФормы", Истина);
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормы.Вставить("context_params", ЭтаФорма.context_params);

	ОповещениеОЗарытитииФормыАвторизацииВЕБ = Новый ОписаниеОповещения("ВойтиЧерезБраузерЗавершение", ЭтаФорма, ПараметрыФормы);
	ОткрытьФормуОбработки("Browser", ПараметрыФормы,,"Авторизация", ОповещениеОЗарытитииФормыАвторизацииВЕБ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьКод(Команда)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Попытка
		ВходПроверкаКодаСМС(ПарметрыФормыВводаСМС, code_sms);
		code_sms = "";
		ЭлементыФормочки.ГруппаВводаЛогинаИПароля.Видимость	= Истина;
		ЭлементыФормочки.ПодтверждениеКода.Видимость		= Ложь;
		ЭлементыФормочки.Войти.КнопкаПоУмолчанию			= Истина;
		СменитьАккаунтНажатие();
	Исключение
		code_sms = "";
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		ЭлементыФормочки.Ошибка.Заголовок = ExtExceptionToMessage(ОшибкаСтруктура);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПодтверждение(Команда)
	Этаформа.code_sms = "";
	Этаформа.ПарметрыФормыВводаСМС = Неопределено;
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ГруппаВводаЛогинаИПароля.Видимость	= Истина;
	ЭлементыФормочки.ПодтверждениеКода.Видимость		= Ложь;
	ЭлементыФормочки.Войти.КнопкаПоУмолчанию			= Истина;
КонецПроцедуры

&НаКлиенте
Процедура СерверПриИзменении(Элемент)
	ОбновитьЗаголовок();
КонецПроцедуры

#Область include_core_base_Настройки_ЗаписатьНастройки
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключенияНаСервере
#КонецОбласти

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область include_core_base_Авторизация_Выход
#КонецОбласти

&НаКлиенте
Процедура ПолучитьАктуальностьВерсии()
// Заглушка
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокПодсказкуКнопкиВыйти()
// Заглушка
КонецПроцедуры

#Область include_core_base_Авторизация_СменаАккаунта
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСЭлементамиФормы
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_ФормаНастроекНастрйкиПроксиСервера
#КонецОбласти

#Область include_core_base_ФормаНастроекНастрйкиПроксиСервераВзятьПроксиИз1С
#КонецОбласти

#Область include_core_base_Авторизация_Form_Вход_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_Авторизация_СертификатыДляАвторизации 
#КонецОбласти

&НаКлиенте
Процедура РежимВходаПоЛогинуНажатие(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницыАвторизации, "ПоЛогину");
	ЭлементыФормочки.СписокСертификатов.Видимость = Ложь;
	ЭтаФорма.ВидАвторизации = 1;
КонецПроцедуры

&НаКлиенте
Процедура РежимВходаПоСертификатуПриНажатии(Элемент)
	СписокСертификатов.Очистить();
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницыАвторизации, "ПоСертификату");
	ЭлементыФормочки.СписокСертификатов.Видимость = Истина;
	ЭтаФорма.ВидАвторизации = 2;
	ЗаполнитьСписокСертификатов();
КонецПроцедуры

&НаКлиенте
Процедура СписокСертификатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Войти(Неопределено);	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПоТокенуНажатие(Элемент)
	ЭтаФорма.ВидАвторизации = 3;
	Войти(Неопределено);
КонецПроцедуры

#Область include_core_base_Транспорт_ИмяСвойстваТранспорта 
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_Авторизация_СписокСтран
#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьСписокПриложений()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Domain.СписокВыбора.Очистить();
	Если Country = "RU" Тогда
		ЭлементыФормочки.Domain.СписокВыбора.Добавить("Saby", "Saby");
		ЭлементыФормочки.Domain.СписокВыбора.Добавить("Sabytest", "Sabytest");
		ЭлементыФормочки.Domain.Подсказка = "Saby - рабочий домен; Sabytest - тестовый домен";
	Иначе
		ЭлементыФормочки.Domain.СписокВыбора.Добавить("Setty", "Setty");
		ЭлементыФормочки.Domain.Подсказка = "Setty - рабочий домен";
	КонецЕсли;
	Если ЭлементыФормочки.Domain.СписокВыбора.НайтиПоЗначению(Domain) = Неопределено Тогда
		Domain = ЭлементыФормочки.Domain.СписокВыбора[0].Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокКонтуров()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Contour.СписокВыбора.Очистить();
	ЭлементыФормочки.Contour.СписокВыбора.Добавить("fix", "fix");
	Если Country = "RU" Тогда
		ЭлементыФормочки.Contour.СписокВыбора.Добавить("test", "test");
		ЭлементыФормочки.Contour.СписокВыбора.Добавить("pre-test", "pretest");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СпособОбменаПриИзменении(Элемент)
	УстановитьВидимостьГОСТШифрования();
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГОСТШифрования()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.GostTls.Видимость = exchange_method = "SabyHttpsClient" И Country = "RU" ;
	Если Не ЭлементыФормочки.GostTls.Видимость тогда
		ЭтаФорма.GostTls = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКонтура()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ЗначениеЗаполнено(Contour) Тогда
		ЭтаФорма.UseTestContour	= Истина;
		ЭлементыФормочки.ГруппаКонтур.Видимость = Истина;
	Иначе
		ЭтаФорма.UseTestContour	= Ложь;
		ЭлементыФормочки.ГруппаКонтур.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтранаПриИзменении(Элемент)
	ЗаполнитьСписокПриложений();
	ЗаполнитьСписокКонтуров();
	УстановитьВидимостьГОСТШифрования();
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ГОСТТЛСПриИзменении(Элемент)
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ПриложениеПриИзменении(Элемент)
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура КонтурПриИзменении(Элемент)
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУРЛОбновитьЗаголовок()
	СформироватьУРЛ();
	ОбновитьЗаголовок();
	ПереключитьВидАвторизации();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТестовыйКонтурПриИзменении(Элемент)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если UseTestContour Тогда
		ЭлементыФормочки.ГруппаКонтур.Видимость = Истина;
		ЭтаФорма.Contour = "fix";
	Иначе
		ЭлементыФормочки.ГруппаКонтур.Видимость = Ложь;
		ЭтаФорма.Contour = "";
	КонецЕсли;
	СформироватьУРЛОбновитьЗаголовок();
КонецПроцедуры

