&НаКлиенте
// BSLLS:UnusedLocalVariable-off
// BSLLS:ExportVariables-off
Перем ТранспортИнтеграции, BlocklyExecutor  Экспорт;
&НаКлиенте
Перем Коннектор;
// BSLLS:ExportVariables-on
// BSLLS:UnusedLocalVariable-on


#Область include_core_base_Авторизация_НастройкиПодключенияПрокси   
#КонецОбласти

#Область include_core_base_Авторизация_Демо_Методы
#КонецОбласти

#Область include_core_base_Авторизация_Form_Вход_ПерейтиВВебВерсию
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

&НаКлиенте
Процедура ПереключитьСтраницуНастройкиПодключенияПрокси()
	ЭлФорм = ПолучитьЭлементыФормы(); 
	ЭлФорм.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыАвторизации, "НастройкиПодключенияПрокси");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовок()
	ДлинаСтрПротокола = 9;
	Заголовок = Сред(api_url, ДлинаСтрПротокола);
	ЭтаФорма.Заголовок = Заголовок;
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.ПодключитьсяК.Заголовок = Заголовок;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройки() 
	Модуль = МодульОбъекта();
	ЭтаФорма.context_params = Модуль.НастройкиПодключенияПрочитать();
	
	Если ЭтаФорма.context_params = Неопределено Тогда
		ЭтаФорма.context_params = Новый Структура();
	КонецЕсли;
	ЭтаФорма.password		 = get_prop(context_params, "password", "");
	Если ЭтаФорма.password <> "" Тогда
		ЭтаФорма.password = РасшифроватьXOR(ЭтаФорма.password, context_params);  	
	КонецЕсли;
	ЭтаФорма.login			 = get_prop(context_params, "login", "");
	ЭтаФорма.api_url		 = get_prop(context_params, "ApiUrl", "");
	ЭтаФорма.AuthSSOUrl		 = get_prop(context_params, "AuthSSOUrl", "");
	ЭтаФорма.exchange_method = get_prop(context_params, ИмяСвойстваТранспорта(), "API");
	ЭтаФорма.GostTls 		 = get_prop(context_params, "GostTls", Ложь);
	Если GostTls = Истина Тогда
		ЭтаФорма.ShowGostTls = 7;
	Иначе
		ЭтаФорма.ShowGostTls = 0;
	КонецЕсли;
	ЭтаФорма.Country 		 = Нрег(get_prop(context_params, "Country", ""));
	ЭтаФорма.ConnectionId 	 = get_prop(context_params, "ConnectionUuid", "");
	ЭтаФорма.ProxyType		 = get_prop(ЭтаФорма.context_params, "ProxyType", "SystemSettings");
	proxy					 = get_prop(ЭтаФорма.context_params, "Proxy");
	ЭтаФорма.ProxyProtocol	 = get_prop(proxy, "Protocol", "");
	ЭтаФорма.ProxyServer	 = get_prop(proxy, "Server", "");
	ЭтаФорма.ProxyPort		 = get_prop(proxy, "Port", 0);
	ЭтаФорма.ProxyLogin		 = get_prop(proxy, "User", "");
	ЭтаФорма.ProxyPassword	 = get_prop(proxy, "Password", "");
	ИспользоватьАутентификациюОС = get_prop(proxy, "ProxyUseOSAuthentication", Ложь);
	Если ИспользоватьАутентификациюОС Тогда
		ЭтаФорма.ProxyUseOSAuthentication = "Аутентификация через операционную систему";
	Иначе
		ЭтаФорма.ProxyUseOSAuthentication = "Базовая аутентификация";
	КонецЕсли;
	ЭтаФорма.ЗапомнитьПароль	 = get_prop(context_params, "AutoAuth", Истина);
	ЭтаФорма.ЗапомнитьСертификат = get_prop(context_params, "AutoAuth", Истина);
	ЭтаФорма.ExchangeCatalog	 = get_prop(context_params, "ExchangeCatalog", "");
	ЭтаФорма.EncryptSelectively  = get_prop(context_params, "EncryptSelectively", Ложь);
	ЭтаФорма.Timeout 			 = get_prop(context_params, "Timeout", 60);
	ЭтаФорма.AdvancedLog		 = get_prop(context_params, "AdvancedLog", Ложь);
	ЭтаФорма.LoggingCatalog		 = get_prop(context_params, "LoggingCatalog", "");
КонецПроцедуры

&НаСервере
Функция ДоступнаАвторизацияПоСертификату(ВидТранспорта)
	Если ВидТранспорта = "ExtSdk" Или ВидТранспорта = "ExtSdkCrypto" Или ВидТранспорта = "SabyPluginConnector" Тогда
		Возврат Истина;
	КонецЕсли;
	Если Метаданные.Справочники.Найти("ПрограммыЭлектроннойПодписиИШифрования") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;		
КонецФункции

#Область include_core_base_Авторизация_Form_Вход_ПриСозданииПереопределяемый
#КонецОбласти

#Область include_core_base_Авторизация_Form_Вход_ПриОткрытииПереопределяемый
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Модуль = МодульОбъекта();
	ЭтаФорма.context_params = Модуль.НастройкиПодключенияПрочитать();
	ЭтаФорма.AuthType = "Login";
	AutoAuth = get_prop(ЭтаФорма.context_params, "AutoAuth", Ложь);
	
	Если ЭтаФорма.context_params <> Неопределено Тогда
		// Сброс сесии при открытии формы входа. 
		// т.к. текущая форма открывается не только с формы настроек
		ЭтаФорма.context_params.Вставить("session", Неопределено);
		Если AutoAuth = Ложь Тогда
			ЭтаФорма.context_params.Вставить("password", Неопределено); 
		КонецЕсли;	
		ЭтаФорма.AuthType = get_prop(context_params, "AuthType", "Login");
	КонецЕсли;
	Модуль.НастройкиПодключенияЗаписать(ЭтаФорма.context_params);
	
	ВидТранспорта = Модуль.ВидТранспорта(ЭтаФорма.context_params);
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ЭлементыФормочки.РежимВходаПоСертификату.Видимость = ДоступнаАвторизацияПоСертификату(ВидТранспорта);
	ПриСозданииНаСервереПереопределяемый();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТранспортИнтеграции = ПолучитьФормуТранспорта(ЭтаФорма.context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();
	ЭтаФорма.АвторизацияУспешна	= Ложь;
	ЗаполнитьСписокСтран();
	ПрочитатьНастройки();
	ЭтаФорма.AdvancedLog = get_prop(context_params, "AdvancedLog", ЭтаФорма.AdvancedLog);
	AdvancedLogПриИзменении(ЭтаФорма.AdvancedLog);
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ЭтаФорма.Country = "" Тогда
		ЭтаФорма.Country = ЭлементыФормочки.Country.СписокВыбора.Получить(0).Значение;
	КонецЕсли;
	ЗаполнитьСписокПриложений();
	ЗаполнитьСписокКонтуров();
	ЭтаФорма.Domain = Нрег(get_prop(context_params, "Domain", ЭтаФорма.Domain));
	ЭтаФорма.Contour = get_prop(context_params, "Contour", ЭтаФорма.Contour);
	УстановитьВидимостьВключенияГОСТШифрования();
	УстановитьВидимостьГОСТШифрования();
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	#Если ВебКлиент Тогда  
	ЭлементыФормочки.РежимВходаПоСертификату.Видимость = Ложь;		
	#КонецЕсли
	ЭлементыФормочки.Ошибка.Заголовок = "";
	СформироватьУРЛОбновитьЗаголовок();     
	Попытка
		УстановитьКартинкуПоказатьПароль(ЭлементыФормочки, "Пароль", ЭтаФорма.Password);
		УстановитьКартинкуПоказатьПароль(ЭлементыФормочки, "ПроксиПароль", ЭтаФорма.ProxyPassword);
	Исключение                  
		ЭлементыФормочки.Пароль.КнопкаВыбора = Ложь;
		ЭлементыФормочки.ПроксиПароль.КнопкаВыбора = Ложь;
	КонецПопытки;
	Если AuthType = "Certificate" И exchange_method <> "SabyConnect" Тогда
		РежимВходаПоСертификатуПриНажатии(Неопределено);
	Иначе
		ЭтаФорма.AuthType = "Login";
		РежимВходаПоЛогинуНажатие(Неопределено)
	КонецЕсли;
	ПриОткрытииПереопределяемый();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкуПоказатьПароль(ЭлементыФормочки, ПолеПароль, РеквизитПароль = "")
	Попытка
		ЭлементыФормочки[ПолеПароль].КартинкаКнопкиВыбора = БиблиотекаКартинок.ПоказатьПароль;  
	Исключение                  
		ЭлементыФормочки[ПолеПароль].КартинкаКнопкиВыбора = ЭлементыФормочки.ПоказатьПароль.Картинка;
		ЭлементыФормочки[ПолеПароль].Значение = РеквизитПароль;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкуСкрытьПароль(ЭлементыФормочки, ПолеПароль, РеквизитПароль = "")
	Попытка
		ЭлементыФормочки[ПолеПароль].КартинкаКнопкиВыбора = БиблиотекаКартинок.СкрытьПароль;  
	Исключение                  
		ЭлементыФормочки[ПолеПароль].КартинкаКнопкиВыбора = ЭлементыФормочки.СкрытьПароль.Картинка;
		ЭлементыФормочки[ПолеПароль].Значение = РеквизитПароль;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКодАвторизации(ДополнительныеПараметры)
	// Первая стадия двухфакторной авторизации    
	ВидТранспорта = ТранспортИнтеграции.ВидТранспорта(ЭтаФорма.context_params);
	Если Не (ВидТранспорта = "ExtSdk" Или ВидТранспорта = "ExtSdkCrypto" Или ВидТранспорта = "SabyPluginConnector") Тогда 
		ПараметрыМетода	= Новый Структура("Идентификатор", ДополнительныеПараметры.Идентификатор);
		ТранспортИнтеграции.local_helper_exec_method(
			ЭтаФорма.context_params,
			ДополнительныеПараметры.МетодОтправкиКодаПодтверждения,
			ПараметрыМетода, , ,
			ЭтаФорма.context_params.ApiUrl + "/auth/service/");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВходПроверкаКодаСМС(ДополнительныеПараметры, Код)
	// Вторая стадия двухфакторной авторизации    
	ВидТранспорта = ТранспортИнтеграции.ВидТранспорта(ЭтаФорма.context_params);
	Если ВидТранспорта = "ExtSdk" Или ВидТранспорта = "ExtSdkCrypto" Или ВидТранспорта = "SabyPluginConnector" Тогда  
		Session = ТранспортИнтеграции.AuthConfirmCode(ЭтаФорма.context_params, Код, ДополнительныеПараметры.Идентификатор, ДополнительныеПараметры.МетодПроверкиКодаИсключения);
	Иначе	
		ПараметрыМетода	= Новый Структура("Идентификатор, Код", ДополнительныеПараметры.Идентификатор, Код);
		res = ТранспортИнтеграции.local_helper_exec_method(
			ЭтаФорма.context_params,
			ДополнительныеПараметры.МетодПроверкиКодаИсключения,
			ПараметрыМетода, , , 
			ЭтаФорма.context_params.ApiUrl + "/auth/service/"); 
		Session = get_prop(res, "result");	
	КонецЕсли;		
	ПослеПолученияСессии(Session,, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОшибкуАвторизации(ОшибкаСтруктура) 
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ExtExceptionToJournal(ОшибкаСтруктура);
	
	type = get_prop(ОшибкаСтруктура, "type");
	Если type = "ChooseIntegration" Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("context_params", ЭтаФорма.context_params);	
		ПараметрыФормы.Вставить("МассивИнтеграций", get_prop(ОшибкаСтруктура, "dump", Новый Массив));	
		ОткрытьФормуОбработки("ВыборИнтеграции", ПараметрыФормы, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
	КонецЕсли;
	
	Если type = "InputSertPassword" Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", "Введите пароль сертификата");
		ПараметрыФормы.Вставить("РасшифровкаВводаПароля", ИмяТекущегоСертификата(" для авторизации"));
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Данные", get_prop(ОшибкаСтруктура, "dump", Новый Массив)); 
		ПослеЗакрытияФормы = SabyОписаниеОповещения("ПослеВводаПароляСертификата", ЭтаФорма, ПараметрыОповещения);
		ОткрытьФормуОбработки("ВводПароля", ПараметрыФормы, ЭтаФорма,, ПослеЗакрытияФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
	КонецЕсли;
	
	ДеталиОшибки = get_prop(ОшибкаСтруктура, "detail");
	Если ТипЗнч(ДеталиОшибки) = Тип("Соответствие") Тогда
		Если	(ДеталиОшибки["code"] = 303)
			И ТипЗнч(ДеталиОшибки["addinfo"]) <> Неопределено Тогда
			ПодтвердитьВход(ОшибкаСтруктура, ДеталиОшибки);
		КонецЕсли;
	КонецЕсли;	

	Если ТипЗнч(ДеталиОшибки) = Тип("Строка") И Найти(ДеталиОшибки, "Система не поддерживается") Тогда
		ВыйтиНаСервере();
		ПоказатьВажноеОповещениеПользователя(
		"Ошибка", , 
		"Система не поддерживается",
		БиблиотекаКартинок["Ошибка32"]);
		Оповестить("SabySignOut");
		Закрыть(Неопределено);
	КонецЕсли;
	Если Найти(ExtExceptionToMessage(ОшибкаСтруктура), "не может быть аутентифицирован через внешний интерфейс") Тогда
		ТекстОшибки = "Вы пытаетесь авторизоваться по электронной подписи, которую ранее не использовали для авторизации и работы в ЛК Saby, авторизуйтесь в ЛК, затем повторите авторизацию во Внешней обработке";
	Иначе
		ТекстОшибки = ExtExceptionToMessage(ОшибкаСтруктура);
	КонецЕсли;	
	Если AuthType = "Certificate" Тогда
		ЭлементыФормочки.ОшибкаСертификат.Заголовок = ТекстОшибки;
	Иначе
		ЭлементыФормочки.Ошибка.Заголовок = ТекстОшибки;
	КонецЕсли;
	// Если не получилось пользователем 1С, то переключаем на логин/пароль
	Если AuthType = "User1C" Тогда
		ЭтаФорма.AuthType = "Login";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьВход(ОшибкаСтруктура, ДеталиОшибки) 
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ПарметрыФормыВводаСМС = Новый Структура;
	Для Каждого КлЗнч Из ДеталиОшибки["addinfo"] Цикл
		ПарметрыФормыВводаСМС.Вставить(КлЗнч.Ключ, КлЗнч.Значение);
	КонецЦикла;
	ОшибкаСтруктура.Вставить("detail", "");
	ОшибкаСтруктура.Вставить("message", "");
	Попытка 
		СессияВводаСМС = Новый Структура;
		СессияВводаСМС.Вставить("session", ПарметрыФормыВводаСМС.ИдентификаторСессии);
		ТранспортИнтеграции.ЗаписатьСессию(context_params, СессияВводаСМС);
		ОтправитьКодАвторизации(ПарметрыФормыВводаСМС);
		
		ПодсказкаЧ1 = "";
		ПарметрыФормыВводаСМС.Свойство("Сообщение", ПодсказкаЧ1);
		ПодсказкаЧ2 = "";
		ПарметрыФормыВводаСМС.Свойство("Телефон", ПодсказкаЧ2);
		ЭлементыФормочки.ИнформацияПользователю.Заголовок = ПодсказкаЧ1 + " " + ПодсказкаЧ2;
		
		АктивироватьВводСМС();
	Исключение
		СессияВводаСМС = Неопределено;
		ТранспортИнтеграции.ЗаписатьСессию(context_params, СессияВводаСМС);
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПароляСертификата(Результат, ДополнительныеПараметры = Неопределено) Экспорт  
	Если Не ЗначениеЗаполнено(Результат) Тогда
		ЭлементыФормочки = ПолучитьЭлементыФормы();
		ЭлементыФормочки.ОшибкаСертификат.Заголовок = "Не введен пароль закрытого сертификата";
	    Возврат;
	КонецЕсли;         
	ДанныеСессии = get_prop(ДополнительныеПараметры, "Данные");
	ПослеПолученияСессии(ДанныеСессии, Результат);	
КонецПроцедуры	

&НаКлиенте
Функция ИмяТекущегоСертификата(ПостФикс = "")
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если ЭлементыФормочки.СписокСертификатовДляАутентификации.ТекущиеДанные = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат get_prop(ЭлементыФормочки.СписокСертификатовДляАутентификации.ТекущиеДанные, "Название", "") + ПостФикс; 
КонецФункции

&НаКлиенте
Процедура ПослеПолученияСессии(ДанныеСессии, ПарольЗакрытогоКлюча = Неопределено, ТребуетсяРасшифровка = Истина)
	Попытка
		Если AuthType = "Certificate" И ТребуетсяРасшифровка Тогда 
			session = ТранспортИнтеграции.Saby_РасшифроватьДанные(ЭтаФорма.context_params, ДанныеСессии, ,,ПарольЗакрытогоКлюча);	
		Иначе
			session = ДанныеСессии;	
		КонецЕсли;		
		СтруктураСессии = Новый Структура;
		СтруктураСессии.Вставить("Session", session);
		ТранспортИнтеграции.ЗаписатьСессию(ЭтаФорма.context_params, СтруктураСессии);
		ЗаписатьНастройкиНаСервере();
		ПослеАвторизацииПереопределяемый();
		ПослеУспешнойАвторизации(); 
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		ОбработатьОшибкуАвторизации(ОшибкаСтруктура);
    КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПослеУспешнойАвторизации()
	// Условие - костыль, пока нет подсистемы транспорта для всех способов обмена
	Если exchange_method <> "SabyConnect" Тогда
		Попытка
			ТранспортИнтеграции.ПослеАутентификации(ЭтаФорма.context_params);
			ТранспортИнтеграции.ПолучитьСтатусВерсии(Истина);
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
			Картинка = КартинкаОшибка();
			ПоказатьВажноеОповещениеПользователя(
				"Ошибка",,
				СтруктураОшибки.message,
				Картинка);
			КонецПопытки;
	КонецЕсли;
	ЭтаФорма.АвторизацияУспешна = Истина;
	ЭтаФорма.Закрыть(ЭтаФорма.context_params);
	ПослеАвторизации();
КонецПроцедуры

&НаКлиенте
Процедура Войти(Команда)
	// BSLLS:DuplicateStringLiteral-off
	ЭтаФорма.АвторизацияУспешна = Ложь;
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭтаФорма.context_params.Вставить("AuthType", AuthType);
	ЭтаФорма.context_params.Вставить("login", Неопределено);
	ЭтаФорма.context_params.Вставить("password", Неопределено);
	ЭтаФорма.context_params.Вставить("Certificate", Неопределено);
	Если AuthType = "Login" Тогда 
		encrypt_password = ШифроватьXOR(password);
		ЭтаФорма.context_params.Вставить("login", login);
		ЭтаФорма.context_params.Вставить("password", encrypt_password);
		ЭтаФорма.context_params.Вставить("AutoAuth", ЗапомнитьПароль);
	КонецЕсли;	
	Если AuthType = "Certificate" Тогда  
		ЭлементыФормочки.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницыАвторизации, "ПоСертификату"); // при нажатии enter в строке поиска ТекущаяСтраница устанавливается "ПоЛогину"
		Если ЭлементыФормочки.СписокСертификатовДляАутентификации.ТекущиеДанные = Неопределено Тогда //команда отрабатывает при нажатии enter в строке поиска с незаполненными ТекущимиДанными 
			Возврат;
		КонецЕсли;
		ЭтаФорма.context_params.Вставить("Certificate", ЭлементыФормочки.СписокСертификатовДляАутентификации.ТекущиеДанные.Отпечаток);	
		ЭтаФорма.context_params.Вставить("AutoAuth", ЗапомнитьСертификат);
	КонецЕсли;	
	СформироватьУРЛ();
	ЭтаФорма.context_params.Вставить("ConnectionUuid", ConnectionId);
	ЭтаФорма.context_params.Вставить("ExchangeCatalog", ExchangeCatalog);
	ЭтаФорма.context_params.Вставить("EncryptSelectively", EncryptSelectively);
	ЭтаФорма.context_params.Вставить("Timeout", Timeout);
	ЭтаФорма.context_params.Вставить("AdvancedLog", AdvancedLog);
	ЭтаФорма.context_params.Вставить("LoggingCatalog", LoggingCatalog);
	ЗаполнитьПараметрыПрокси();
	
	Попытка
		ПередАвторизациейПереопределяемый();
		ТранспортИнтеграции.ВойтиТранспорт(ЭтаФорма.context_params);
		ПослеАвторизацииПереопределяемый();
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		ОбработатьОшибкуАвторизации(ОшибкаСтруктура);
		Возврат;
	КонецПопытки;
	ПослеУспешнойАвторизации();
	// BSLLS:DuplicateStringLiteral-on
КонецПроцедуры

#Область include_core_base_БазовыеКомпоненты_Form_Browser_СформироватьАдресСтраницы
#КонецОбласти



&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент) //Из-за ошибки платформы на старых формах пришлось добавить переключение видимости элементов формы, и тогда форма обновляется, иначе пароль не отображается при нажатии
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Попытка
		ЭтаФорма.Password = ЭлементыФормочки.Пароль.ТекстРедактирования;
	Исключение
		ЭтаФорма.Password = ЭлементыФормочки.Пароль.Значение; //если ОФ, то ТекстРедактирования отсутствует, есть Значение
	КонецПопытки;
	ЭлементыФормочки.Пароль.Видимость = Ложь;
	Если ЭлементыФормочки.Пароль.РежимПароля Тогда 	
		ЭлементыФормочки.Пароль.РежимПароля = Ложь;
		Попытка
			УстановитьКартинкуСкрытьПароль(ЭлементыФормочки, "Пароль", ЭтаФорма.Password);
		Исключение                  
			ЭлементыФормочки.Пароль.КнопкаВыбора = Ложь;	
		КонецПопытки;
   	Иначе
		ЭлементыФормочки.Пароль.РежимПароля = Истина;
		Попытка
			УстановитьКартинкуПоказатьПароль(ЭлементыФормочки, "Пароль", ЭтаФорма.Password);
		Исключение                  
			ЭлементыФормочки.Пароль.КнопкаВыбора = Ложь;	
		КонецПопытки;
	КонецЕсли; 
	ЭлементыФормочки.Пароль.Видимость = Истина;
КонецПроцедуры    


&НаКлиенте
Процедура ВойтиЧерезБраузерЗавершение(Результат, Парметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭтаФорма.АвторизацияУспешна = Истина;
	ЭтаФорма.context_params	= НастройкиПодключенияПрочитатьНаСервере();
	ПослеАвторизацииПереопределяемый();
	
	МассивСтатистики = Новый Массив;
	НаименованиеДействия = "Auth";
	web_interface = get_prop(context_params, "web_interface");
	Если web_interface = "BrowserSabyPlugin" Тогда
		КонтекстДействия = "Lpp";
	Иначе
		КонтекстДействия = "LppBl";
	КонецЕсли;	
	ЭлементСтатистики = ТранспортИнтеграции.local_helper_element_action(НаименованиеДействия, КонтекстДействия, Новый Структура(), 1);
	МассивСтатистики.Добавить(ЭлементСтатистики);
	ТранспортИнтеграции.local_helper_register_actions(ЭтаФорма.context_params, МассивСтатистики);
	
	ЭтаФорма.Закрыть(ЭтаФорма.context_params);
КонецПроцедуры

&НаКлиенте
Процедура ВойтиЧерезБраузер(Команда)
	СформироватьУРЛ();
	ВойтиЧерезСтраницаБраузера(api_url+"/auth/")
КонецПроцедуры

&НаКлиенте
Процедура ВойтиЧерезСтраницаБраузера(УРЛ)
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыАвторизации, "Служебная");
	СформироватьУРЛ();
	АдресСтраницы = УРЛ;

	ЭтаФорма.context_params.Вставить("login", login);
	ЭтаФорма.context_params.Вставить("password", password);
	ЭтаФорма.context_params.Вставить("ApiUrl", api_url);
	ЭтаФорма.context_params.Вставить("ConnectionUuid", ConnectionId);
	ЭтаФорма.context_params.Удалить("Proxy");
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок", "Авторизация");
	ПараметрыФормы.Вставить("АвтоЗакрытиеФормы", Истина);
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
	ПараметрыФормы.Вставить("context_params", ЭтаФорма.context_params);

	АдресСтраницы = СформироватьАдресСтраницы();

	Попытка
		СформироватьАдресСоСлужебнымиПараметрами();
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		ОписаниеОшибки = СтруктураОшибки.message;
		ПоказатьОповещениеПользователя(
			"Ошибка", , ОписаниеОшибки,
			БиблиотекаКартинок["Ошибка32"]);
		Возврат;
	КонецПопытки;
	
	#Если ВебКлиент Тогда
		УстановитьРежимWebInWeb();
	#КонецЕсли
	
	ПередАвторизациейПереопределяемый();
	ОбновитьПолеHTML("ПолеHTMLДокумента", АдресСтраницыССлужебнымиПараметрами);
	ЭлФорм.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыАвторизации, "ПоЛогину");
КонецПроцедуры

#Область include_core_base_ОсобенностиПлатформы_УстановитьРежимWebInWeb
#КонецОбласти

&НаКлиенте
Процедура ПодтвердитьКод(Команда)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Попытка
		ВходПроверкаКодаСМС(ПарметрыФормыВводаСМС, code_sms);
		code_sms = "";
		ЭтаФорма.Закрыть(ЭтаФорма.context_params);
	Исключение
		code_sms = "";
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		ПоказатьОшибкуВводаСМС(ExtExceptionToMessage(ОшибкаСтруктура));
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СерверПриИзменении(Элемент)
	ОбновитьЗаголовок();
КонецПроцедуры

#Область include_core_base_Настройки_ЗаписатьНастройки
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключенияНаСервере
#КонецОбласти

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область include_core_base_Авторизация_Выход
#КонецОбласти

&НаКлиенте
Процедура ПолучитьАктуальностьВерсии()
// Заглушка
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокПодсказкуКнопкиВыйти()
// Заглушка
КонецПроцедуры

#Область include_core_base_Helpers_FormElementsHTML
#КонецОбласти

#Область include_core_base_Авторизация_Form_Вход_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_Авторизация_СертификатыДляАвторизации 
#КонецОбласти

&НаКлиенте
Процедура ВыполнитьРежимВходаПоЛогину(ОчищатьСообщения = Истина)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если exchange_method = "SabyConnect" Тогда
		ЭлементыФормочки.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницыАвторизации, "Каталог");
	Иначе
		ЭлементыФормочки.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлементыФормочки.СтраницыАвторизации, "ПоЛогину");
	КонецЕсли;
	ЭтаФорма.AuthType = "Login";
	Если ОчищатьСообщения Тогда 
		ЭлементыФормочки.Ошибка.Заголовок = "";
		ЭлементыФормочки.ОшибкаСертификат.Заголовок = "";
		ЭлементыФормочки.ОшибкаКодПодтверждения.Заголовок = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РежимВходаПоЛогинуНажатие(Элемент)
	ВыполнитьРежимВходаПоЛогину(Истина);
КонецПроцедуры

&НаКлиенте  
Процедура ЗаполнитьСписокСертификатов()
	ЗаполнитьПараметрыПрокси();
	СписокСертификатовДляАутентификации.Очистить();
	
	ОбработчикРезультата = SabyОписаниеОповещения("СписокСертификатовДляАвторизации", ЭтаФорма);
	
	ВидТранспорта = ТранспортИнтеграции.ВидТранспорта(ЭтаФорма.context_params);
	Если ВидТранспорта = "ExtSdk" Или ВидТранспорта = "SabyPluginConnector" Или ВидТранспорта = "ExtSdkCrypto"  Тогда 
		Результат = ТранспортИнтеграции.ReadCertListForAuthExtSDK2(context_params);
		ВыполнитьSabyОписаниеОповещения(ОбработчикРезультата, Результат);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ОбработчикРезультата,context_params", ОбработчикРезультата, ЭтаФорма.context_params);
	ОповещениеПослеОбновленияКэшаЛокальныхСертификатов = SabyОписаниеОповещения("ПослеОбновленияКэшаЛокальныхСертификатов",
														ЭтаФорма, ДополнительныеПараметры);
	ТранспортИнтеграции.ОбновитьКэшЛокальныхСертификатов(ОповещениеПослеОбновленияКэшаЛокальныхСертификатов, 0);
	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеОбновленияКэшаЛокальныхСертификатов(Результат, ДополнительныеПараметры) Экспорт
	// Шаг 1
	СертификатыДляАвторизации = СписокСертификатовДляАвторизацииНаКлиенте(Результат);
	ДополнительныеПараметры.Вставить("СертификатыНаКлиенте", Результат);
	ДополнительныеПараметры.Вставить("СертификатыДляАвторизации", СертификатыДляАвторизации);
	ПолучитьДДСертификатовДляАвторизации(Неопределено, ДополнительныеПараметры);			
КонецПроцедуры

&НаКлиенте

Процедура ПолучитьДДСертификатовДляАвторизации(ДвоичныеДанныеСертификата = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	// Шаг 2
	СертификатыДляАвторизации = ДополнительныеПараметры.СертификатыДляАвторизации;
	ВсеДанныеОбработаны = Истина;
	
	// Обновим таблицу сертификатов авторизации
	СертДвоичныеДанные = Неопределено;
	Если ТипЗнч(ДвоичныеДанныеСертификата) = Тип("ДвоичныеДанные") Тогда
		СертДвоичныеДанные = СтрЗаменить(СтрЗаменить(Base64Строка(ДвоичныеДанныеСертификата), Символы.ПС, ""), Символы.ВК, "");
		Для Каждого СтрокаСерификатаАвт Из СертификатыДляАвторизации Цикл
			Если get_prop(СтрокаСерификатаАвт, "ИдСтроки") = ДополнительныеПараметры.ИдСтроки Тогда
				СтрокаСерификатаАвт.Удалить("ИдСтроки");
				СтрокаСерификатаАвт.Удалить("Сертификат");
				СтрокаСерификатаАвт.Вставить("ДвоичныеДанные", СертДвоичныеДанные);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ДополнительныеПараметры.СертификатыДляАвторизации = СертификатыДляАвторизации;
	КонецЕсли;
	
	// Проверим наличие не обработанных строк
	Для Каждого СтрокаСертификатаАвторизации Из СертификатыДляАвторизации Цикл
		Если СтрокаСертификатаАвторизации.ДвоичныеДанные = Неопределено Тогда
			ВсеДанныеОбработаны = Ложь;
			ДополнительныеПараметры.Вставить("ИдСтроки", СтрокаСертификатаАвторизации.ИдСтроки);
			ОповещениеПолучениеДД = SabyОписаниеОповещения(
				"ПолучитьДДСертификатовДляАвторизации",
				ЭтаФорма,
				ДополнительныеПараметры);
			СтрокаСертификатаАвторизации.Сертификат.НачатьВыгрузку(ОповещениеПолучениеДД);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Переход к следующему шагу
	Если ВсеДанныеОбработаны Тогда
		// Удалим лишнее
		ДополнительныеПараметры.Удалить("ИдСтроки");
		ДополнительныеПараметры.Удалить("СертификатыНаКлиенте");
		СписокСертификатовДляАвторизацииПослеПолученияСертификатовНаКлиенте(
			Неопределено, 
			ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры				

&НаКлиенте

Функция СписокСертификатовДляАвторизацииНаКлиенте(СертификатыНаКлиенте)
	СертификатыДляАвторизации = Новый Массив();
	Если ТипЗнч(СертификатыНаКлиенте) = Тип("Массив") Тогда
		ИдСтроки = 0;
		Для Каждого Серт из СертификатыНаКлиенте Цикл
			ИдСтроки = ИдСтроки + 1;
			Попытка
				СертОтпечаток = СтрЗаменить(Строка(Серт.Отпечаток), " ", ""); 
				Должность = "";
				Если Серт.Субъект.Свойство("T") Тогда 
					Должность = Серт.Субъект.T;
				КонецЕсли;
				Сертификат = Новый Структура;

				СертДвоичныеДанные = Неопределено;
				Сертификат.Вставить("ИдСтроки", ИдСтроки);
				Сертификат.Вставить("Сертификат", Серт);
				
				Сертификат.Вставить("ДвоичныеДанные", СертДвоичныеДанные);
				Сертификат.Вставить("Отпечаток", СертОтпечаток);
				Сертификат.Вставить("Название", Серт.Субъект.CN);
				Сертификат.Вставить("ФИО", Серт.Субъект.SN+" "+Серт.Субъект.GN);
				Сертификат.Вставить("Должность", Должность);
				Сертификат.Вставить("ДействителенПо", Серт.ДатаОкончания);
				СертификатыДляАвторизации.Добавить(Сертификат);
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	Возврат СертификатыДляАвторизации;
КонецФункции

#Область include_core_base_Авторизация_Form_Вход_СерверныеСертификатыДляАвторизации
#КонецОбласти

&НаКлиенте
Процедура СписокСертификатовДляАвторизацииПослеПолученияСертификатовНаКлиенте(СертификатыНаКлиенте, ДополнительныеПараметры) Экспорт
	// Шаг 3
	СертификатыДляАвторизации = ДополнительныеПараметры.СертификатыДляАвторизации;
	
	СертификатыНаСервере = СписокСертификатовДляАвторизацииПолучитьСерверные();
		
	Для Каждого Серт Из СертификатыНаСервере Цикл     
		ДобавлятьСертификат = Истина;
		Для Каждого СертНаКлиенте Из СертификатыДляАвторизации Цикл 
			Если СертНаКлиенте.Отпечаток = Серт.Отпечаток Тогда 
				ДобавлятьСертификат = Ложь;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Если ДобавлятьСертификат Тогда
			СертификатыДляАвторизации.Добавить(Серт);	
		КонецЕсли;	
	КонецЦикла;	
	
	context_params = get_prop(ДополнительныеПараметры, "context_params");
	
	Попытка
		РезультатЗапроса = ТранспортИнтеграции.local_helper_get_sertlist_for_auth(context_params, СертификатыДляАвторизации);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		РезультатЗапроса = ОшибкаСтруктура;
	КонецПопытки;
	
	Если ДополнительныеПараметры.Свойство("ОбработчикРезультата") = Ложь Тогда
		Возврат;
	КонецЕсли;	
	ВыполнитьSabyОписаниеОповещения(ДополнительныеПараметры.ОбработчикРезультата, РезультатЗапроса);		
КонецПроцедуры

&НаКлиенте
Процедура РежимВходаПоСертификатуПриНажатии(Элемент)
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыАвторизации, "ПоСертификату");
	ЭтаФорма.AuthType = "Certificate";
	СформироватьУРЛ();
	ПередАвторизациейПереопределяемый();
	Попытка 
		ЗаполнитьСписокСертификатов();
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		ОбработатьОшибкуАвторизации(ОшибкаСтруктура);	
	КонецПопытки	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьВводСМС()				
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.СтраницыАвторизации.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ЭлФорм.СтраницыАвторизации, "КодПодтверждения");
	ЭлФорм.Подтвердить.КнопкаПоУмолчанию	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуВводаСМС(ТекстОшибки)
	ЭлФорм = ПолучитьЭлементыФормы();
	ЭлФорм.ОшибкаКодПодтверждения.Заголовок = ТекстОшибки;
КонецПроцедуры

&НаКлиенте
Процедура СписокСертификатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные.Статус = 0 Тогда
		Войти(Неопределено);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВойтиПользователем1С(Элемент)
	ЭтаФорма.AuthType = "User1C";
	Войти(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВыбранаИнтеграция" Тогда  
		ЭтаФорма.context_params.Вставить("ExtSysUid", Параметр);
		Попытка
			ТранспортИнтеграции.ПослеАутентификации(ЭтаФорма.context_params);
			ТранспортИнтеграции.ПолучитьСтатусВерсии(Истина);
			ЭтаФорма.АвторизацияУспешна = Истина;
			ЭтаФорма.Закрыть(ЭтаФорма.context_params);
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
			ОбработатьОшибкуАвторизации(ОшибкаСтруктура);
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВойтиПоSSO(Команда)
	Если ПустаяСтрока(ЭтаФорма.AuthSSOUrl) Тогда
		ЭлементыФормочки = ПолучитьЭлементыФормы();
		ЭлементыФормочки.Ошибка.Заголовок = "Укажите параметры авторизации SSO в настройках.";
		Возврат;
	КонецЕсли;
	СформироватьУРЛ();
	// Должна быль полная ссылка со странницы настроек SSO кабинета
	УРЛРедиректа = api_url  + "/integration_config/integration-auto-close";
	ВойтиЧерезСтраницаБраузера(AuthSSOUrl + "&ret=" + УРЛРедиректа)
КонецПроцедуры

#Область include_core_base_Авторизация_Form_Вход_ОбработчикиСобытийПереопределяемый
#КонецОбласти

#Область include_core_base_Helpers_XDTO
#КонецОбласти

&НаКлиенте
Функция ОбработатьДействиеНаКлиенте(ИмяДействия, Параметры)
	ПараметрыВызова = DecodeXmlXdto(Параметры);
	Если ИмяДействия = "OpenLink" Тогда
		Результат = API_ADDON_OPENURL(ПараметрыВызова);
	ИначеЕсли ИмяДействия = "OnAuth" Тогда
		ТранспортИнтеграции.API_ADDON_ONAUTH(ПараметрыВызова, ЭтаФорма.context_params, ЭтаФорма);  
		Результат = ПодготовитьРезультат(Неопределено);
		ВернутьРезультат(Результат);
		ВойтиЧерезБраузерЗавершение(Истина, ПараметрыВызова);
		Возврат Неопределено;
	Иначе
		Возврат ОбработатьДействие(ИмяДействия, ПараметрыВызова);	
	КонецЕсли;
	Возврат ПодготовитьРезультат(Результат);
КонецФункции 

&НаСервере
Функция ОбработатьДействие(Знач ИмяДействия, Знач ПараметрыВызова)
	МодульОбъекта = МодульОбъекта();
	Если ИмяДействия = "ReadSystemInfo" Тогда
		Результат = МодульОбъекта.API_ADDON_READSYSTEMINFO(ПараметрыВызова);
	Иначе
		ВызватьИсключение NewExtExceptionСтрока(,"Неизвестная команда", ИмяДействия);
	КонецЕсли;
	Возврат ПодготовитьРезультат(Результат);
КонецФункции

&НаКлиенте
Процедура ДобавитьВЛог(Тип, Команда, Данные)
КонецПроцедуры

#Область include_core_base_БазовыеКомпоненты_Form_Browser_BrowserEventsHandler
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти

#Область include_core_base_Авторизация_ПослеАвторизации //&НаКлиенте
#КонецОбласти

#Область include_core_base_Авторизация_Form_Вход_ПередАвторизациейПереопределяемый
#КонецОбласти

#Область include_core_base_Авторизация_Form_Вход_ПослеАвторизацииПереопределяемый
#КонецОбласти

#Область include_core_base_Helpers_ПоказатьОповещениеПользователя
#КонецОбласти
