
&НаКлиенте
Процедура СпособОбменаПриИзмененииПереопределяемый(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройкиЭЦПAPI()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.НастройкаЭП.Видимость = Ложь;
	ЭлементыФормочки.НастройкаЭП1.Видимость = Ложь;	
	ЭлементыФормочки.НастройкаЭП2.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройкиХраненияНастроек()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ГруппаНастройкиИзКаталога.Видимость = Ложь;
	ЭлементыФормочки.ИспользоватьНастройкиИзКаталога.Видимость = Ложь;
	ЭлементыФормочки.КаталогХраненияНастроек.Видимость = Ложь;
КонецПроцедуры

