		ОткрытьФормуОбработки("Вход", Неопределено,,, ПроверкаВведенныхДанныхАутентификации, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		//Мы не знаем результа авторизации. поэтому закрываем форму авторизации.
		//Повторное открытие формы отправки документов на обычных формах не получается реализовать
		ЭтаФорма.Закрыть(Неопределено);
		ПоказатьОповещениеПользователя(
			"Внимание",,
			"После авторизации повторите попытку отправить документы!",
			БиблиотекаКартинок["Внимание48"],
			СтатусОповещенияПользователя.Важное);
