
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить(ЛокализацияНазваниеПродукта() + "_ЗакрытиеФормыАвторизации",
		Новый Структура("АвторизацияУспешна, ДальнейшееДействие", АвторизацияУспешна, ""));
КонецПроцедуры
	
Процедура СписокСертификатовДляАутентификацииПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ДанныеСтроки.Статус <> -1 Тогда
		ОформлениеСтроки.Ячейки.Статус.ОтображатьКартинку = Истина;
		ОформлениеСтроки.Ячейки.Статус.ИндексКартинки = ДанныеСтроки.Статус;
	КонецЕсли;
	ОформлениеСтроки.Ячейки.Статус.ОтображатьТекст = Ложь;
	Если ДанныеСтроки.НадписьНедействительные = "" Тогда
		ОформлениеСтроки.Ячейки.НадписьНедействительные.Видимость = Ложь;
	КонецЕсли;
	Если ДанныеСтроки.Комментарий = "" Тогда
		ОформлениеСтроки.Ячейки.Комментарий.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ПоискСертификатаНачалоВыбора(Элемент, СтандартнаяОбработка)
	// BSLLS:UsingLikeInQuery-off
	// BSLLS:LogicalOrInTheWhereSectionOfQuery-off
	Запрос = Новый Запрос("ВЫБРАТЬ *
	| ПОМЕСТИТЬ ТаблицаСертификатов
	| ИЗ &ТаблицаСертификатов КАК ТаблСерт
	| ГДЕ Название ПОДОБНО &ПоискСертификата Или ФИО ПОДОБНО &ПоискСертификата;
	| ВЫБРАТЬ * Из ТаблицаСертификатов");
	Запрос.УстановитьПараметр("ТаблицаСертификатов", СписокСертификатовДляАутентификации); 
	Запрос.УстановитьПараметр("ПоискСертификата", "%" + ПоискСертификата + "%");
	СписокСертификатовДляАутентификации = Запрос.Выполнить().Выгрузить();
	// BSLLS:LogicalOrInTheWhereSectionOfQuery-on
	// BSLLS:UsingLikeInQuery-on
КонецПроцедуры

Процедура ПоискСертификатаОчистка(Элемент, СтандартнаяОбработка)
	ЗаполнитьСписокСертификатов();
КонецПроцедуры

Процедура НеНайденаПодписьНажатие(Элемент)
	Попытка
		СсылкаДляСкачивания = Элемент.Подсказка;
	Исключение
		СсылкаДляСкачивания = "";
	КонецПопытки;
	Если ЗначениеЗаполнено(СсылкаДляСкачивания) Тогда
		// BSLLS:UsingSynchronousCalls-off
		ЗапуститьПриложение(СсылкаДляСкачивания);
		// BSLLS:UsingSynchronousCalls-on
	КонецЕсли;
КонецПроцедуры
