#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_ExtException
#КонецОбласти

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Элементы.ГруппаНастройкиПодключения.Скрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("Saby_ЗакрытиеФормыАвторизации",
		Новый Структура("АвторизацияУспешна, ДальнейшееДействие", АвторизацияУспешна, Параметры.ДальнейшееДействие));
КонецПроцедуры

&НаСервере
Процедура ВойтиНаСервере(context_param)
	Модуль = МодульОбъекта();
	Модуль.ВойтиНаСервере(context_param);
КонецПроцедуры

