
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;
	Оповестить(ЛокализацияНазваниеПродукта() + "_ЗакрытиеФормыАвторизации",
		Новый Структура("АвторизацияУспешна, ДальнейшееДействие", АвторизацияУспешна, Параметры.ДальнейшееДействие));
КонецПроцедуры

&НаСервере
Процедура ВойтиНаСервере(context_param)
	Модуль = МодульОбъекта();
	Модуль.ВойтиНаСервере(context_param);
КонецПроцедуры

&НаКлиенте
Процедура ПоискСертификатаНачалоВыбораНаКлиенте(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	Поиск = СокрЛП(Элемент.ТекстРедактирования);
	ПоискСертификатаНачалоВыбора(Поиск);	                
КонецПроцедуры

&НаСервере
Процедура ПоискСертификатаНачалоВыбора(Знач Поиск)
	// BSLLS:UnusedLocalVariable-off
	ПоискСертификата = Поиск;
	// BSLLS:UnusedLocalVariable-on
	ТаблицаСертификатов = РеквизитФормыВЗначение("СписокСертификатовДляАутентификации");
	// BSLLS:UsingLikeInQuery-off
	// BSLLS:LogicalOrInTheWhereSectionOfQuery-off
	Запрос = Новый Запрос("ВЫБРАТЬ *
	| ПОМЕСТИТЬ ТаблицаСертификатов
	| ИЗ &ТаблицаСертификатов КАК ТаблСерт
	| ГДЕ Название ПОДОБНО &ПоискСертификата Или ФИО ПОДОБНО &ПоискСертификата;
	| ВЫБРАТЬ * Из ТаблицаСертификатов");
	Запрос.УстановитьПараметр("ТаблицаСертификатов", ТаблицаСертификатов); 
	Запрос.УстановитьПараметр("ПоискСертификата", "%" + Поиск + "%");
	ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "СписокСертификатовДляАутентификации");
	// BSLLS:LogicalOrInTheWhereSectionOfQuery-on
	// BSLLS:UsingLikeInQuery-on
КонецПроцедуры

&НаКлиенте
Процедура ПоискСертификатаОчистка(Элемент, СтандартнаяОбработка)
	ЗаполнитьСписокСертификатов();
КонецПроцедуры

&НаКлиенте
Функция ИННПоСертификату(Сертификат);
	ЭлФорм = ПолучитьЭлементыФормы();
	ИНН = "";
	Если ЗначениеЗаполнено(get_prop(Сертификат, "ИНН")) Тогда
		ЭлФорм.СписокСертификатовДляАутентификацииИНН.Видимость = Истина;
		ИНН =  "ИНН " + Сертификат["ИНН"];
	Иначе
		ЭлФорм.СписокСертификатовДляАутентификацииИНН.Видимость = Ложь;
	КонецЕсли;
	Возврат ИНН;               
КонецФункции

#Область include_core_base_Helpers_ШифрованиеXOR
#КонецОбласти

#Область include_base_НазваниеПродукта
#КонецОбласти
