
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	ПеречитатьНастройкиПроксиСервераНаСервере();
	УстановитьВысотуФормы();
КонецПроцедуры

Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить(ЛокализацияНазваниеПродукта() + "_ЗакрытиеФормыАвторизации",
		Новый Структура("АвторизацияУспешна, ДальнейшееДействие", АвторизацияУспешна, ""));
КонецПроцедуры

Процедура ГруппаНастройкиПодключенияНажатие(Элемент)
	ЭлементыФормы.ПанельНастройкиПодключения.Видимость = Не ЭлементыФормы.ПанельНастройкиПодключения.Видимость;
	УстановитьВысотуФормы();
КонецПроцедуры

Процедура УстановитьВысотуФормы()
	Если ЭлементыФормы.ПанельНастройкиПодключения.Видимость Тогда
		ЭтаФорма.Высота = 530;
	Иначе
		ЭтаФорма.Высота = 260;
	КонецЕсли;
КонецПроцедуры


Процедура АктивироватьВводСМС()
	ЭтаФорма.Панель.ТекущаяСтраница = ЭтаФорма.Панель.Страницы.ВводСМС;
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Подтвердить.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

Процедура ДеактивироватьВводСМС()				
	ЭтаФорма.Панель.ТекущаяСтраница = ЭтаФорма.Панель.Страницы.Основная;
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Войти.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

Процедура ПоказатьОшибкуВводаСМС(ТекстОшибки)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ОшибкаВводСМС.Заголовок = ТекстОшибки;	
КонецПроцедуры
