
#Область include_core_base_ExtException
#КонецОбласти

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;
	Оповестить(ЛокализацияНазваниеПродукта() + "_ЗакрытиеФормыАвторизации",
		Новый Структура("АвторизацияУспешна, ДальнейшееДействие", АвторизацияУспешна, Параметры.ДальнейшееДействие));
КонецПроцедуры

&НаСервере
Процедура ВойтиНаСервере(context_param)
	Модуль = МодульОбъекта();
	Модуль.ВойтиНаСервере(context_param);
КонецПроцедуры

#Область include_core_base_locale_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_ШифрованиеXOR
#КонецОбласти

