
#Область include_core_base_ExtException
#КонецОбласти

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Элементы.ГруппаНастройкиПодключения.Скрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить(ЛокализацияНазваниеПродукта() + "_ЗакрытиеФормыАвторизации",
		Новый Структура("АвторизацияУспешна, ДальнейшееДействие", АвторизацияУспешна, Параметры.ДальнейшееДействие));
КонецПроцедуры

&НаСервере
Процедура ВойтиНаСервере(context_param)
	Модуль = МодульОбъекта();
	Модуль.ВойтиНаСервере(context_param);
КонецПроцедуры

#Область include_core_base_locale_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_ШифрованиеXOR
#КонецОбласти

&НаКлиенте
Процедура АктивироватьВводСМС()				
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ГруппаВводаЛогинаИПароля.Видимость			= Ложь;
	ЭлементыФормочки.ПодтверждениеКода.Видимость				= Истина;
	ЭлементыФормочки.ОтменитьПодтверждение.КнопкаПоУмолчанию	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеактивироватьВводСМС()				
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ГруппаВводаЛогинаИПароля.Видимость	= Истина;
	ЭлементыФормочки.ПодтверждениеКода.Видимость		= Ложь;
	ЭлементыФормочки.Войти.КнопкаПоУмолчанию			= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуВводаСМС(ТекстОшибки)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Ошибка.Заголовок = ТекстОшибки;
КонецПроцедуры
