
&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый()
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	НайденныйExtSdk2 = ЭлементыФормочки.exchange_method.СписокВыбора.НайтиПоЗначению("ExtSdk2");
	Если НайденныйExtSdk2 <> Неопределено Тогда
		ЭлементыФормочки.exchange_method.СписокВыбора.Удалить(НайденныйExtSdk2);
	КонецЕсли;	
	НайденныйSabyPluginConnector = ЭлементыФормочки.exchange_method.СписокВыбора.НайтиПоЗначению("SabyPluginConnector");
	Если НайденныйSabyPluginConnector <> Неопределено Тогда
		ЭлементыФормочки.exchange_method.СписокВыбора.Удалить(НайденныйSabyPluginConnector);
	КонецЕсли;	
КонецПроцедуры
