
&НаКлиенте
Функция СписокСертификатовДляАвторизацииПолучитьСерверные(СертификатыДляАвторизации)
	НастройкиКриптографии = МодульОбъектаКлиент().ПолучитьЗначениеПараметраСБИС("НастройкиКриптографии");
	ПодписьНаСервере = get_prop(НастройкиКриптографии, "ПодписьНаСервере", Ложь);
	#Если ТолстыйКлиентОбычноеПриложение Тогда 
		ПодписьНаСервере = Истина;	
	#КонецЕсли		
	Если ПодписьНаСервере = Истина Тогда   
		МассивПрограмм = Новый Массив;
		МассивПрограмм.Добавить(НастройкиКриптографии);       
		// BSLLS:FunctionOutParameter-off
		СертификатыДляАвторизации = Новый Массив;
		// BSLLS:FunctionOutParameter-on
		Возврат ТранспортИнтеграции.сбисСписокСертификатовДляАвторизацииНаСервере(МассивПрограмм);	
	КонецЕсли;	
	Возврат Новый Массив;

КонецФункции
