
Процедура ИнициироватьТранспорт() Экспорт
КонецПроцедуры

Функция ЭтоСервер() Экспорт
	Возврат Ложь;
КонецФункции 

Функция ПолучитьФормуBlockly()
	Возврат ЭтотОбъект;
КонецФункции

Функция ЭтотОбъектНаСервере()
	Возврат ЭтотОбъект;
КонецФункции

Функция МодульОбъекта()
	Возврат ЭтотОбъект;
КонецФункции

Процедура ЗапуститьINI(Контекст) Экспорт
	context_param = НастройкиПодключенияПрочитать();
	ПараметрыВызова = ПодготовитьПараметрыЗапускINIФоновымЗаданием(Контекст.algorithm, Контекст.ПараметрыВызова, context_param);
	ПараметрыВызова.Вставить("ДлительнаяОперацияИмяМетода", "API_BLOCKLY_RUN_BACKGROUND");
	ПараметрыВызова.Вставить("НазваниеОперации", Контекст.НазваниеОперации);
	Фрм = ЭтотОбъект.ПолучитьФорму("ДлительнаяОперация"); 
	Фрм.Команда = ПараметрыВызова;
	Фрм.ОткрытьМодально();
КонецПроцедуры

ТранспортИнтеграции = МодульОбъекта();
