
Процедура ИнициироватьТранспорт(ТранспортИнтеграции) Экспорт
КонецПроцедуры

Функция ЭтоСервер() Экспорт
	Возврат Ложь;
КонецФункции 

Функция ПолучитьФормуBlockly()
	Возврат ЭтотОбъект;
КонецФункции

Функция ЭтотОбъектНаСервере()
	Возврат ЭтотОбъект;
КонецФункции

Функция ЭтотОбъектНаКлиенте() 
	Возврат ЭтотОбъект;
КонецФункции

Функция МодульОбъекта()
	Возврат ЭтотОбъект;
КонецФункции

Процедура ЗапуститьINI(Контекст) Экспорт
	context_param = НастройкиПодключенияПрочитать();
	ПараметрыВызова = ПодготовитьПараметрыЗапускINIФоновымЗаданием(Контекст.algorithm, Контекст.ПараметрыВызова, context_param);
	ПараметрыВызова.Вставить("ДлительнаяОперацияИмяМетода", "API_BLOCKLY_RUN_BACKGROUND");
	ПараметрыВызова.Вставить("НазваниеОперации", Контекст.НазваниеОперации);
	// BSLLS:GetFormMethod-off
	Фрм = ЭтотОбъект.ПолучитьФорму("ДлительнаяОперация");
	// BSLLS:GetFormMethod-on
	Фрм.Команда = ПараметрыВызова;
	Фрм.ОткрытьМодально();
КонецПроцедуры

Функция МодульФоновогоЗаданияСервер()
	Возврат ЭтотОбъект;
КонецФункции 

Функция МодульФоновогоЗаданияКлиент()
	Возврат ЭтотОбъект;
КонецФункции

#Область include_core_base_ДлительныеОперации_ИмяМодуляДлительныеОперации 
#КонецОбласти

#Область include_core_base_Криптография_НаКлиенте1С
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандыОбщееНаСервере
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_ВстраиваемыеОбъекты
#КонецОбласти

// BSLLS:UnusedLocalVariable-off переменная внутри модуля
ТранспортИнтеграции = МодульОбъекта();
// BSLLS:UnusedLocalVariable-on
