
Процедура ИнициироватьТранспорт() Экспорт
КонецПроцедуры

Функция МодульОбъекта()
	Возврат ЭтотОбъект;
КонецФункции

Функция ЭтоСервер() Экспорт
	Возврат Ложь;
КонецФункции 

Функция ЭтотОбъектНаСервере()
	Возврат ЭтотОбъект;
КонецФункции

Функция ПолучитьФормуBlockly()
	Возврат ЭтотОбъект;
КонецФункции

Функция МодульФоновогоЗаданияСервер()
    Возврат ЭтотОбъект; 
КонецФункции


// BSLLS:UnusedLocalVariable-off склеивание областей модуля обработки
ТранспортИнтеграции = МодульОбъекта();
// BSLLS:UnusedLocalVariable-on
