
Процедура ИнициироватьТранспорт() Экспорт
КонецПроцедуры

Функция МодульОбъекта()
	Возврат ЭтотОбъект;
КонецФункции

Функция ЭтоСервер() Экспорт
	Возврат Ложь;
КонецФункции 

Функция ЭтотОбъектНаСервере()
	Возврат ЭтотОбъект;
КонецФункции

Функция ПолучитьФормуBlockly()
	Возврат ЭтотОбъект;
КонецФункции

Функция МодульФоновогоЗаданияСервер()
    Возврат ЭтотОбъект; 
КонецФункции

#Область include_core_base_ДлительныеОперации_ИмяМодуляДлительныеОперации 
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_ВстраиваемыеОбъекты
#КонецОбласти

#Область include_core_base_Криптография_ПрограммыЭП
#КонецОбласти

// BSLLS:UnusedLocalVariable-off склеивание областей модуля обработки
ТранспортИнтеграции = МодульОбъекта();
// BSLLS:UnusedLocalVariable-on
