
#Область include_core_base_ГлавноеОкно_СписокУФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ПанельОперацийУФ
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаСервере
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта //&НаСервере
#КонецОбласти

#Область include_core_base_ExtException
#КонецОбласти

Процедура ПолучитьИмяФормы()
	// Заглушка
КонецПроцедуры

#Область include_core_base_ВстраиваниеВФормы_КомандаПоискНачалоВыбораНажатие
#КонецОбласти

