
&После("ПриСозданииНаСервере")
Процедура Saby_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	Если Отказ Тогда Возврат; КонецЕсли;
	#Область include_core_base_ПереопределениеОбработчиков_ОтчетыДобавлениеЭлементовУправленияЗаглушка
	#КонецОбласти
КонецПроцедуры

Процедура ДобавлениеКомандНаФорму(Форма,Команды)
	ГруппаSABY = Форма.Элементы.Найти("SABYГруппаКоманд");
	Если ГруппаSABY = Неопределено Тогда
		ГруппаSABY = Форма.Элементы.Добавить("SABYГруппаКоманд", Тип("ГруппаФормы"), Форма.Элементы.Найти("ОсновнаяКоманднаяПанель"));
	КонецЕсли;
	ГруппаSABY.Заголовок = ЛокализацияНазваниеПродукта();
	
	Для Каждого Команда Из Команды Цикл
		Обработчик = ?(СтрЧислоВхождений(Команда.Действие, ".") = 0, "", Команда.Действие);
		Форма.ПостоянныеКоманды.Добавить(Команда.Имя, Обработчик);
		Команда.Действие = "Подключаемый_Команда";
		
		Кнопка = Форма.Элементы.Вставить(Команда.Имя, Тип("КнопкаФормы"), ГруппаSABY, Неопределено);
		Кнопка.ИмяКоманды = Команда.Имя;
	КонецЦикла;		
КонецПроцедуры

