
// Получаем системную информацию
//
// Параметры:
//  ПараметрыВызова - Структура - параметры вызова.
//
// Возвращаемое значение:
//  Структура - Системная информация.
//
Функция API_ADDON_READSYSTEMINFO(ПараметрыВызова) Экспорт
	ОбщиеПараметры = ОбщиеНастройкиПрочитать();
	ExtSysUid = get_prop(ОбщиеПараметры, "ExtSysUid", Неопределено);
	
//	Инишки = Новый Массив();
//	Инишки.Добавить("Аккордион");                
	//Инишки.Добавить("ПараметрыСистемы");
	//Инишки.Добавить("ПараметрыПодключения");
	Результат = Новый Структура("ExtSysType, ExtSysSubtype, ExtSysSubtypeVersion, Connector, ProductId, ProductVersion, ExtSysUid", //ConnectionId",//, ExtSysSettings",
		"1С",
		Метаданные.Имя,
		Метаданные.Версия,
		"Dom1C",
		НазваниеПродукта(),
		ПолучитьИмяФайлаИНомерТекущейВерсии()[1],		
		ExtSysUid
//		"", //get_prop(params, "ConnectionId", Неопределено),
		//Новый Структура("Format, Type, Id",
		//	"Dom1C",
		//	"Система",
		//	Инишки,
		//)
	);
	Возврат Результат;	
КонецФункции
 
// Заполнение контекста при аутентификации
//
// Параметры:
//  ПараметрыВызова - Структура - параметры вызова.
//  context_param - Структура - Контекст.
//	Обработчики - Форма - источник выполнения обработчиков формы вызова
//
//DynamicDirective
Процедура API_ADDON_ONAUTH(ПараметрыВызова, context_param = Неопределено, Обработчики = Неопределено) Экспорт
	Если context_param = Неопределено Тогда
		ИмяНастроек = ИмяПродукта();
		context_param	= ПрочитатьИзХранилища(ИмяНастроек, "params");
		Если context_param = Неопределено Тогда
			context_param = новый Структура;
		КонецЕсли;
	КонецЕсли;
	УРЛ = get_prop(ПараметрыВызова,"Url", Неопределено);
	Если ЗначениеЗаполнено(УРЛ) Тогда 
		УРЛ = РазобратьСтрокуУРЛ(УРЛ);
		УРЛ.host = СтрЗаменить(УРЛ.host, "sso.", "online.");
		context_param.Вставить("ApiUrl", УРЛ.scheme +"://"+ УРЛ.host);
	КонецЕсли;     
	ВидТранспорта = ВидТранспорта(context_param);
	session = ПараметрыВызова["SessionId"];
	Если ВидТранспорта = "ExtSdk" Или ВидТранспорта = "ExtSdkCrypto" Или ВидТранспорта = "SabyPluginConnector"  Тогда 
		session = ТранспортИнтеграции.AuthenticateBySession(context_param, session);		
	КонецЕсли;	
	ТекущаяСессия = УИДСессии(context_param);
	ТекущийПользователь = СвойствоСессии(context_param, "UserFio");
	ПользовательВБраузере = get_prop(ПараметрыВызова, "UserFio");
	Если Не ТекущаяСессия = Неопределено И НЕ ТекущийПользователь = ПользовательВБраузере Тогда
		 Сообщить("Произошла смена авторизации по данным браузера"); 
	КонецЕсли;
	СтруктураСессии = Новый Структура;
	СтруктураСессии.Вставить("Session", session );
	ТранспортИнтеграции.ЗаписатьСессию(context_param, СтруктураСессии);
	Попытка
		Если Обработчики <> Неопределено Тогда
			Обработчики.ПослеАвторизацииПереопределяемый();  
		КонецЕсли;
		ТранспортИнтеграции.ПослеАутентификации(context_param);
	Исключение 
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		Сообщить(ExtExceptionToMessage(ОшибкаСтруктура));			
	КонецПопытки;
КонецПроцедуры

