
// Возвращает ПараметрыТранспортаПочты
//
// Параметры:
//	context_params - Структура - параметры настроке пользователя
//
// Возвращаемое значение:
//  - Структура - Результат обсчета алгоритма
//DynamicDirective
Функция  ПараметрыТранспортаПочты(context_params)
	BlocklyExecutor = ПолучитьФормуBlockly();
	
	ПараметрыВызова	= Новый Соответствие(); 
	ПараметрыВызова.Вставить("Endpoint",		"get_send_setting_mail");
	ПараметрыВызова.Вставить("Algorithm",	"Blockly_Конфигурация");
	РезультатВыполнения = BlocklyExecutor.API_BLOCKLY_RUN(ПараметрыВызова);
	
	Если РезультатВыполнения.Status = "error" Тогда
		РезультатВыполнения = Неопределено;
	Иначе
		РезультатВыполнения = РезультатВыполнения.Result;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
КонецФункции

// Запускает SabySendMail на сервере
//
// Параметры:
//	ТемаПисьма - Строка - тема письма
//	Получатели - Строка - получатели письма
//	ТекстПисьма - Строка - Текст письма
//
// Возвращаемое значение:
//  - Булево - Результат обсчета алгоритма
Функция SabySendMailServer(ТемаПисьма, Получатели, ТекстПисьма)
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.SabySendMail(ТемаПисьма, Получатели, ТекстПисьма);
КонецФункции

// Создает профиль переданной почты для подключения к почтовому серверу.
// 
// Параметры:
//  Выборка - Соответствие
//  
// Возвращаемое значение:
//  ИнтернетПочтовыйПрофиль - профиль учетной записи;
//  Неопределено - не удалось получить учетную запись по ссылке.
//
//DynamicDirective
Функция СоздатьИнтернетПочтовыйПрофиль(Выборка) Экспорт
	
	УчетнаяЗапись = get_prop(Выборка, "Ссылка");
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ВызватьИсключение "Отсутствуют настройки e-mail";
	КонецЕсли;
	
	Результат = Новый ИнтернетПочтовыйПрофиль;
	Результат.Таймаут = 3;
	ТребуемыеСвойства = Новый Массив;

	ТребуемыеСвойства.Добавить("АдресСервераSMTP");
	ТребуемыеСвойства.Добавить("ПортSMTP");
	ТребуемыеСвойства.Добавить("ИспользоватьSSLSMTP");

	Если get_prop(Выборка, "ПриОтправкеПисемТребуетсяАвторизация", Ложь) И Не get_prop(Выборка, "POP3ПередSMTP", Ложь) Тогда
		ТребуемыеСвойства.Добавить("ПользовательSMTP");
	КонецЕсли;

	Результат.ПарольSMTP = get_prop(Выборка, "ПарольSMTP");
	
	Если get_prop(Выборка, "Протокол") = "IMAP" Тогда
		ТребуемыеСвойства.Добавить("ИспользоватьSSLIMAP");
		ТребуемыеСвойства.Добавить("АдресСервераIMAP");
		ТребуемыеСвойства.Добавить("ПортIMAP");
		ТребуемыеСвойства.Добавить("ПользовательIMAP");
		
		Результат.ПарольIMAP =	get_prop(Выборка, "Пароль");
	КонецЕсли;
	
	ТребуемыеСвойства.Добавить("Таймаут");
	
	Если ЗначениеЗаполнено(ТребуемыеСвойства) Тогда
		ВыборкаСтруктура = ПолучитьСтруктуруИзСоответствия(Выборка);
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаСтруктура, Saby_СтрСоединить82(ТребуемыеСвойства, ","));
	КонецЕсли;
	
	Если Результат.ПользовательSMTP = "" Тогда
		Результат.ПарольSMTP = "";
	КонецЕсли;
	
	Если Результат.ПарольIMAP = "" Тогда
		Результат.ПарольIMAP = Результат.ПарольSMTP;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Запускает SabySendMail
//
// Параметры:
//	ТемаПисьма - Строка - тема письма
//	Получатели - Строка - получатели письма
//	ТекстПисьма - Строка - Текст письма
//
// Возвращаемое значение:
//  - Булево - Результат обсчета алгоритма
//  
//DynamicDirective
Функция  SabySendMail(ТемаПисьма, Получатели, ТекстПисьма) Экспорт
	Результат = Ложь;
	context_params = НастройкиПодключенияПрочитать();
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Результат = Ложь;
	#Иначе
	Если Не ЭтоВидТранспортаКлиент(context_params) Тогда
		Результат = SabySendMailServer(ТемаПисьма, Получатели, ТекстПисьма); 
		Возврат Результат;
	КонецЕсли;
	#КонецЕсли
	
	ПараметрыПочтовогоТранспорта =  ПараметрыТранспортаПочты(context_params);

	Профиль	= СоздатьИнтернетПочтовыйПрофиль(ПараметрыПочтовогоТранспорта);
	Сообщение	= Новый ИнтернетПочтовоеСообщение;
	Сообщение.Отправитель = get_prop(ПараметрыПочтовогоТранспорта, "Пользователь", "");
	Сообщение.Тема = ТемаПисьма;
	Сообщение.Получатели.Добавить(Получатели);
	Сообщение.Тексты.Добавить(ТекстПисьма);

	Почта = Новый ИнтернетПочта;
	Попытка 
		Почта.Подключиться(Профиль);
		Почта.Послать(Сообщение);
		Результат = Истина;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		Сообщить("Ошибка отправки письма по причине: " + ИнфОбОшибке.Причина);
		Сообщить(ИнфОбОшибке.Описание);
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

