
//DynamicDirective

Функция ОбработкаРезультатаЗапросаExtSdk2(РезультатЗапроса)  
	Тип = get_prop(РезультатЗапроса, "Тип", Неопределено);
	Если Тип = "Message" Тогда
		code = 200;
	Иначе
		code = 500;
	КонецЕсли;	
	Результат = get_prop(РезультатЗапроса, "Данные", Неопределено);
	Result = Новый Структура;
	Result.Вставить("code", code);
	Result.Вставить("result", Результат);
	Если code <> 200 И code <> 201 Тогда  
		Error = Новый Структура("message", Результат);
		res = Новый Структура("Error", Error); 
		Result.Вставить("result", res);	
	КонецЕсли;
	Возврат Result;
КонецФункции

//DynamicDirective

Процедура ExtSDK2_get_answer_request(ВидТранспорта)	
	Интеграция = ТранспортИнтеграции.ВладелецФормы.Кэш.Интеграция;
	МодульОбъектаКлиент = Интеграция.МодульОбъектаКлиент();
	МодульОбъектаКлиент.ГлобальныйКэш_ЧтениеОтветовИВызовСобытий();
	НеизвестныеОтветы = МодульОбъектаКлиент.ГлобальныйКэш.СБИС.ДанныеИнтеграции.НеизвестныеОтветы;
	Для Каждого Запись Из НеизвестныеОтветы Цикл
		ЗаписьQueryId = Запись["Ключ"]; 
		ПараметрыЗапроса = async_requests.Получить(ЗаписьQueryId);
		Если ПараметрыЗапроса <> Неопределено Тогда 
			async_responce = Новый Структура("ПараметрыЗапроса,РезультатЗапроса", ПараметрыЗапроса, Запись["Значение"][0]);
			async_responces.Вставить(ЗаписьQueryId, async_responce);   
		КонецЕсли;
		async_requests.Удалить(ЗаписьQueryId);
	КонецЦикла;
КонецПроцедуры

// Вызывается метод ExtSdk2
//
// Параметры:
//  MethodName - Строка - имя метода.
//  ПараметрыВызова - Структура - параметры.
//  context_params - Структура - контекст.
//	multithread_mode - Булево - признак мультипоточного выполнения
//	ДопПараметры - Структура - дополнительные параметры
//
// Возвращаемое значение:
//   Структура - "code","result"
//
//DynamicDirective
Функция CallMethod(Знач MethodName, ПараметрыВызова, context_params, multithread_mode = Ложь, ДопПараметры = Неопределено)
	Result = Неопределено;
	Если ЛЕВ(MethodName,8) = "ExtSdk2." Тогда
		MethodName = СтрЗаменить(MethodName,"ExtSdk2.","");
	КонецЕсли;
	ПараметрыКоманды = Новый Структура;
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		ПараметрыКоманды = ДопПараметры;	
	КонецЕсли;
	ПараметрыКоманды.Вставить("ВерсияФорматаОтвета", 3); 
	ПараметрыКоманды.Вставить("СообщатьПриОшибке", Ложь);
	Отказ = Ложь;   
	Интеграция = ТранспортИнтеграции.ВладелецФормы.Кэш.Интеграция;
	МодульОбъектаКлиент = Интеграция.МодульОбъектаКлиент();
	Кэш = МодульОбъектаКлиент.ПолучитьТекущийЛокальныйКэш();
	Если multithread_mode = Истина Тогда 
		ДопПараметрыДляВызовов	= Новый Структура("Кэш, ДополнительныеПараметры", Кэш, ПараметрыКоманды);
		Форма_ExtSDK = Кэш.СБИС.ДанныеИнтеграции.Объекты.Форма_ExtSDK;
    	ОбработчикКоманды		= МодульОбъектаКлиент.НовыйСбисОписаниеОповещения("СбисОтправитьКоманду_Асинхронно", Форма_ExtSDK, ДопПараметрыДляВызовов);
	 	АсинхроннаяСбисКоманда = МодульОбъектаКлиент.НовыйАсинхроннаяСбисКоманда(ОбработчикКоманды);
		АсинхроннаяСбисКоманда.АргументВызова = Новый Структура("Метод, ПараметрыМетода", MethodName, ПараметрыВызова);
	    АсинхроннаяСбисКоманда.ПараметрыСобытий = ДопПараметрыДляВызовов; 
		МодульОбъектаКлиент.АсинхроннаяСбисКоманда_Выполнить(АсинхроннаяСбисКоманда);
		// BSLLS:DeprecatedCurrentDate-off
		Deadline = ТекущаяДата() + 60;
		// BSLLS:DeprecatedCurrentDate-on
		dump = Новый Структура;
		dump.Вставить("QueryId", 				АсинхроннаяСбисКоманда.Идентификатор);
		dump.Вставить("Deadline", 				Deadline);
		ВызватьИсключение NewExtExceptionСтрока(,"AsyncRequest",,,dump,"AsyncRequest");		
	Иначе	
		Результат = Интеграция.СбисОтправитьИОбработатьКоманду(Кэш, MethodName, ПараметрыВызова, ПараметрыКоманды, Отказ);
	КонецЕсли;	
	Если Отказ = Истина Тогда 
		message = get_prop(Результат,"message");
		details = DetailsПоОшибкеExtSdk2(Результат);	
		ВызватьИсключение NewExtExceptionСтрока(Неопределено,message,details);
	КонецЕсли;	
	code = 200;	
	Result = Новый Структура;
	Result.Вставить("code",code);
	Result.Вставить("result",Новый Структура("result",Результат));
	Возврат Result;
КонецФункции

