
//DynamicDirective

Функция ОбработкаРезультатаЗапросаExtSdk2(РезультатЗапроса)
	Возврат Неопределено;
КонецФункции

//DynamicDirective

Процедура ExtSDK2_get_answer_request(ВидТранспорта)	
КонецПроцедуры

// Вызывается метод ExtSdk2
//
// Параметры:
//  MethodName - Строка - имя метода.
//  ПараметрыВызова - Структура - параметры.
//  context_params - Структура - контекст.
//	multithread_mode - Булево - признак мультипоточного выполнения
//
// Возвращаемое значение:
//   Структура - "code","result"
//
//DynamicDirective
Функция CallMethod(Знач MethodName, ПараметрыВызова, context_params, multithread_mode = Ложь)
	Result = Неопределено;
	Если ЛЕВ(MethodName,8) = "ExtSdk2." Тогда
		MethodName = СтрЗаменить(MethodName,"ExtSdk2.","");
	КонецЕсли;
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("ВерсияФорматаОтвета", 3); 
	ПараметрыКоманды.Вставить("СообщатьПриОшибке", Ложь);
	Отказ = Ложь;
	Интеграция = ПолучитьЗначениеПараметраТекущегоСеанса("Интеграция");
	Результат = Интеграция.СбисОтправитьИОбработатьКоманду(ПолучитьТекущийЛокальныйКэш(), MethodName, ПараметрыВызова, ПараметрыКоманды, Отказ);
	Если Отказ = Истина Тогда 
		message = get_prop(Результат,"message");
		details = get_prop(Результат,"details");
		ВызватьИсключение NewExtExceptionСтрока(Неопределено,message,details);
	КонецЕсли;	
	code = 200;	
	Result = Новый Структура;
	Result.Вставить("code",code);
	Result.Вставить("result",Новый Структура("result",Результат));
	Возврат Result;
КонецФункции

