
//DynamicDirective
Процедура ВойтиТранспорт(context_params, Кэш = Неопределено) Экспорт
	ВидТранспорта = ВидТранспорта(context_params);
	Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда 
		ВойтиExtSdk2(context_params, Кэш);
	Иначе
		ВойтиНаСервере(context_params);
	КонецЕсли;	
КонецПроцедуры 

//DynamicDirective
Функция ПолучитьСписокАккаунтов() Экспорт
	context_params = НастройкиПодключенияПрочитать();
	ВидТранспорта = ВидТранспорта(context_params);
	Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда 
		Результат = AccountListExtSDK2(context_params); 
	Иначе     
		Результат = local_helper_get_accoutslist(Неопределено);	
	КонецЕсли;	
	СписокАккаунтов	= Новый СписокЗначений;
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для Каждого ЭлементАккаунт Из Результат Цикл
			Если get_prop(ЭлементАккаунт, "НазваниеАккаунта") <> "Физики" Тогда
				СписокАккаунтов.Добавить(get_prop(ЭлементАккаунт, "НомерАккаунта"),
					get_prop(ЭлементАккаунт, "НазваниеАккаунта")); 
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	Возврат СписокАккаунтов;
КонецФункции

//DynamicDirective
Функция ПереключитьАккаунт(НомерАккаунта) Экспорт
	context_params = НастройкиПодключенияПрочитать();
	ВидТранспорта = ВидТранспорта(context_params);
	Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда 
		Результат = SwitchAccountExtSDK2(context_params, НомерАккаунта); 
	Иначе     
		Результат = local_helper_switch_account(Неопределено, НомерАккаунта);;	
	КонецЕсли;
КонецФункции
