
// Вход, в зависимости от вида транспорта
//
// Параметры:
//  context_params - Структура - контекст.
//  Кэш - Структура - Кэш.
//
//DynamicDirective
Процедура ВойтиТранспорт(context_params, Кэш = Неопределено) Экспорт
	ВидТранспорта = ВидТранспорта(context_params);
	Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда 
		ВойтиExtSdk2(context_params, Кэш);
	Иначе
		ВойтиНаСервере(context_params);
	КонецЕсли;	
КонецПроцедуры 

// Возвращает список аккаунтов
//
// Возвращаемое значение:
//   СписокЗначений - список номеров аккаунтов
//
//DynamicDirective
Функция ПолучитьСписокАккаунтов() Экспорт
	context_params = НастройкиПодключенияПрочитать();
	ВидТранспорта = ВидТранспорта(context_params);
	Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда 
		Результат = AccountListExtSDK2(context_params); 
	Иначе     
		Результат = local_helper_get_accoutslist(Неопределено);	
	КонецЕсли;	
	СписокАккаунтов	= Новый СписокЗначений;
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для Каждого ЭлементАккаунт Из Результат Цикл
			НазваниеАккаунта = get_prop(ЭлементАккаунт, "НазваниеАккаунта");
			Если Не (НазваниеАккаунта = "Физики" Или НазваниеАккаунта = "Личный аккаунт") Тогда
				СписокАккаунтов.Добавить(get_prop(ЭлементАккаунт, "НомерАккаунта"),
					НазваниеАккаунта); 
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	Возврат СписокАккаунтов;
КонецФункции

// Переключает аккаунт
//
// Параметры:
//  НомерАккаунта - Строка - нмоер аккаунта.
//
// Возвращаемое значение:
//   Строка - идентификатор сессии
//
//DynamicDirective
Функция ПереключитьАккаунт(НомерАккаунта) Экспорт
	context_params = НастройкиПодключенияПрочитать();
	ВидТранспорта = ВидТранспорта(context_params);
	Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда 
		Результат = SwitchAccountExtSDK2(context_params, НомерАккаунта); 
	Иначе     
		Результат = local_helper_switch_account(Неопределено, НомерАккаунта);;	
	КонецЕсли;
	Возврат Результат;
КонецФункции

