
#Область include_core_base_Авторизация_ПоТокену 
#КонецОбласти

#Область include_core_base_Авторизация_ПоСертификату 
#КонецОбласти

// Вход, в зависимости от вида транспорта
//
// Параметры:
//  context_params - Структура - контекст.
//  Кэш - Структура - Кэш.
//
//DynamicDirective
Процедура ВойтиТранспорт(context_params, Кэш = Неопределено) Экспорт
	ВидТранспорта = ВидТранспорта(context_params);
	Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда 
		ВойтиExtSdk2(context_params, Кэш);
	Иначе
		ВойтиAPI(context_params);
	КонецЕсли;	
КонецПроцедуры 

//DynamicDirective

Процедура ВойтиAPI(context_params) 
	ВидАвторизации = get_prop(context_params, "ВидАвторизации", 1); 
	Если ВидАвторизации = 1 Тогда
		session = local_helper_auth_by_login(context_params, Неопределено );
	ИначеЕсли ВидАвторизации = 2 Тогда   
		session = АвторизоватьсяПоСертификату(context_params); 
	ИначеЕсли ВидАвторизации = 3 Тогда
		result = АвторизоватьсяПоТокену(context_params);
		session = result.Получить("result");
	Иначе
		ВызватьИсключение NewExtExceptionСтрока(,"Указан неизвестный вид авторизации", , , ,"Unauthorized"); 
	КонецЕсли;	
	СтруктураСессии = Новый Структура;
	СтруктураСессии.Вставить("session", session);
	// BSLLS:DeprecatedCurrentDate-off
	СтруктураСессии.Вставить("session_begin", ТекущаяДата());
	// BSLLS:DeprecatedCurrentDate-on
	ЗаписатьСессию(context_params, СтруктураСессии);
	НастройкиПодключенияЗаписать(context_params);
КонецПроцедуры


// Возвращает список аккаунтов
//
// Возвращаемое значение:
//   СписокЗначений - список номеров аккаунтов
//
//DynamicDirective
Функция ПолучитьСписокАккаунтов() Экспорт
	context_params = НастройкиПодключенияПрочитать();
	ВидТранспорта = ВидТранспорта(context_params);
	Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда 
		Результат = AccountListExtSDK2(context_params); 
	Иначе     
		Результат = local_helper_get_accoutslist(context_params);	
	КонецЕсли;	
	СписокАккаунтов	= Новый СписокЗначений;
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для Каждого ЭлементАккаунт Из Результат Цикл
			НазваниеАккаунта = get_prop(ЭлементАккаунт, "НазваниеАккаунта");
			Если Не (НазваниеАккаунта = "Физики" Или НазваниеАккаунта = "Личный аккаунт") Тогда
				СписокАккаунтов.Добавить(get_prop(ЭлементАккаунт, "НомерАккаунта"),
					НазваниеАккаунта); 
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	Возврат СписокАккаунтов;
КонецФункции

// Переключает аккаунт
//
// Параметры:
//  НомерАккаунта - Строка - нмоер аккаунта.
//
// Возвращаемое значение:
//   Строка - идентификатор сессии
//
//DynamicDirective
Функция ПереключитьАккаунт(НомерАккаунта) Экспорт
	context_params = НастройкиПодключенияПрочитать();
	ВидТранспорта = ВидТранспорта(context_params);
	Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда 
		Результат = SwitchAccountExtSDK2(context_params, НомерАккаунта); 
	Иначе     
		Результат = local_helper_switch_account(context_params, НомерАккаунта);	
	КонецЕсли;
	СтруктураСессии = Новый Структура;
	СтруктураСессии.Вставить("session", Результат );
	// BSLLS:DeprecatedCurrentDate-off
	СтруктураСессии.Вставить("session_begin", ТекущаяДата());
	// BSLLS:DeprecatedCurrentDate-on
	ЗаписатьСессию(context_params, СтруктураСессии);
	НастройкиПодключенияЗаписать(context_params);	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СписокСертификатовДляАутентификации(Сертификаты) Экспорт
	context_params = НастройкиПодключенияПрочитать();
	ВидТранспорта = ВидТранспорта(context_params);
	Если ВидТранспорта = "ExtSdk2" Или ВидТранспорта = "SabyPluginConnector"  Тогда 
		Результат = ReadCertListForAuthExtSDK2(context_params); 
	Иначе     
		Результат = local_helper_get_sertlist_for_auth(context_params, Сертификаты);	
	КонецЕсли;
	Возврат Результат;
КонецФункции
