
// Вызывается метод через транспорт SabyPluginConnector
//
// Параметры:
//  request_type - Строка - тип запроса.
//  request_url - Строка - ссылка.
//  response_type - Строка - тип ответа.
//  __kwargs - Структура - параметры.
//  context_params - Структура - контекст.
//  НомПереадресации - Число - номер переадресации.
//
// Возвращаемое значение:
//   Структура - "code","result"
//
//DynamicDirective
Функция local_helper_exec_request_sabypluginconnector(request_type, Знач request_url, response_type,
		__kwargs = Неопределено, context_params = Неопределено, Знач НомПереадресации = 0)
	ПараметрыCallMethod = local_helper_exec_request_extsdk2_get_parameters(__kwargs, request_url);
	MethodName = get_prop(ПараметрыCallMethod, "MethodName");
	ПараметрыВызова = get_prop(ПараметрыCallMethod, "ПараметрыВызова");
	multithread_mode = get_prop(__kwargs, "multithread_mode", Ложь);
	Result = CallMethod(MethodName, ПараметрыВызова, context_params, multithread_mode);
	Возврат Result;		
КонецФункции		

// Возвращает компоненту SabyPluginConnector
//
// Возвращаемое значение:
//   Произвольный - компонента
//
//DynamicDirective
Функция КомпонентаSABYPluginConnector() Экспорт
	Если КомпонентаИнтеграции <> Неопределено Тогда
		Возврат КомпонентаИнтеграции;
	КонецЕсли;
	ПутьКомпоненты = ПолучитьПутьКомпонентыSABYPluginConnector(); 
	ПодключитьКомпоненту(ПутьКомпоненты);
	КомпонентаИнтеграции = Новый("AddIn.Community.SabyPluginConnector");
	Если КомпонентаИнтеграции = Неопределено Тогда
		ВызватьИсключение "Не удалось создать объект компоненты";
	КонецЕсли;
	Возврат КомпонентаИнтеграции;

КонецФункции

Функция ПолучитьПутьКомпонентыSABYPluginConnector()
	МодульОбъекта = МодульОбъекта();
	ПутьКомпоненты = МодульОбъекта.АдресНативнойКомпонентыИзВнешнейОбработки("SabyPluginConnector");	
	Возврат ПутьКомпоненты;	
КонецФункции

// Возвращает результат запроса через транспорт SabyPluginConnector
//
// Параметры:
//  ОбъектПлагина - Произвольный - объект плагина.
//  QueryId - Произвольный - идентификатор запроса.
//  request_type - Строка - тип запроса.
//
// Возвращаемое значение:
//   Произвольный - ответ
//
//DynamicDirective
Функция РезультатЗапросаSabyPluginConnector(ОбъектПлагина, QueryId = Неопределено, request_type = "") 
	ОтветНеПолучен = Истина;
	СчетчикЦиклов = 1;
	Результат = Неопределено;
	Пока ОтветНеПолучен Цикл	 
		Если СчетчикЦиклов > 1800 Тогда
			ВызватьИсключение "Долгое выполнение запроса "+request_type;	
		КонецЕсли;
		Ответы = decode_xml_xdto(ОбъектПлагина.ReadEvents());
		Ответы = get_prop(Ответы,"Response", Новый Массив);
		Для Каждого Ответ Из Ответы Цикл 
			Если  get_prop(Ответ, "queryID", Ложь) = QueryId Тогда 
				ОтветНеПолучен = Ложь;
				Результат = Ответ; 
			Иначе
				ОбработатьОтветExtSDK2(Ответ);		
			КонецЕсли;	
			Если QueryId = Неопределено Тогда
				Прервать;	
			КонецЕсли;	
		КонецЦикла;  
		Если ОтветНеПолучен Тогда
			ОбъектПлагина.Sleep(300);
		КонецЕсли;
		СчетчикЦиклов = СчетчикЦиклов + 1;
	КонецЦикла;
	Возврат Результат;
КонецФункции

