
// Загрузка файлов на СБИС диск
//
// Параметры:
//  context_params - Структура - контекст.
//  ДанныеДляЗагрузки - Произвольный - данные.
//
// Возвращаемое значение:
//   Произвольный - данные
//
//DynamicDirective
Функция ЗагрузитьВременныеФайлыНаДискСБИС(Знач context_params, Знач ДанныеДляЗагрузки) Экспорт
	Возврат UploadToSbisDisk(context_params, ДанныеДляЗагрузки);	
КонецФункции

// Читает данные документа
//
// Параметры:
//  context_params - Структура - контекст.
//  Документ - Произвольный - документ.
//
// Возвращаемое значение:
//   Структура - ответ
//
//DynamicDirective
Функция ПрочитатьДокумент(context_params, Документ) Экспорт
	Возврат local_helper_read_document(context_params, Документ);	
КонецФункции
