
Функция АдресНативнойКомпонентыИзВнешнейОбработки(ИмяВнешнейОбработки) Экспорт
	СправочникДополнительныеОтчетыИОбработки = Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки");
	ДополнительнаяОбработка = Неопределено;
	МодульДополнительныеОтчетыИОбработки = Неопределено;
	Если СправочникДополнительныеОтчетыИОбработки <> Неопределено Тогда
		МодульДополнительныеОтчетыИОбработки = ОбщийМодульКонфигурации("ДополнительныеОтчетыИОбработки");
		ДополнительнаяОбработка = Справочники["ДополнительныеОтчетыИОбработки"].НайтиПоНаименованию(ИмяВнешнейОбработки);
	КонецЕсли;	
	Если ЗначениеЗаполнено(ДополнительнаяОбработка) Тогда   
		ИмяОбработки = МодульДополнительныеОтчетыИОбработки.ПодключитьВнешнююОбработку(ДополнительнаяОбработка); 
		ОбъектОбработкиНативнойКомпоненты = 	ВнешниеОбработки.Создать(ИмяОбработки); 
		Если ИмяВнешнейОбработки = "SabyPluginConnector" Тогда
			макет = ОбъектОбработкиНативнойКомпоненты.ПолучитьМакетSABYPluginConnector();
		ИначеЕсли ИмяВнешнейОбработки = "SABYHttpClient" Тогда  
			макет = ОбъектОбработкиНативнойКомпоненты.ПолучитьМакетSABYHttpsClient();
		Иначе
			ВызватьИсключение "Неизвестная компонента";	
		КонецЕсли;	
		ПутьКомпоненты = ПоместитьВоВременноеХранилище(макет, Новый УникальныйИдентификатор);
	Иначе
		ВызватьИсключение "Не удалось найти компоненту. Установите внешнюю обработку "+ИмяВнешнейОбработки+".epf";
	КонецЕсли;
	Возврат ПутьКомпоненты;
КонецФункции
