
Функция АдресНативнойКомпонентыИзВнешнейОбработки(ИмяВнешнейОбработки) Экспорт
	СправочникВнешниеОбработки = Метаданные.Справочники.Найти("ВнешниеОбработки");
	ВнешняяОбработка = Неопределено;
	Если СправочникВнешниеОбработки <> Неопределено Тогда
		ВнешняяОбработка = Справочники["ВнешниеОбработки"].НайтиПоНаименованию(ИмяВнешнейОбработки);
	КонецЕсли;	
	Если ЗначениеЗаполнено(ВнешняяОбработка) Тогда   
		ИмяОбработки = ПолучитьИмяВременногоФайла("epf");
		ХранилищеВнешнейОбработки = ВнешняяОбработка.ХранилищеВнешнейОбработки.Получить();
		ХранилищеВнешнейОбработки.Записать(ИмяОбработки);
		// BSLLS:UsingExternalCodeTools-off
		ОбъектОбработкиНативнойКомпоненты = 	ВнешниеОбработки.Создать(ИмяОбработки); 
		// BSLLS:UsingExternalCodeTools-on
		Если ИмяВнешнейОбработки = "SabyPluginConnector" Тогда
			макет = ОбъектОбработкиНативнойКомпоненты.ПолучитьМакетSABYPluginConnector();
		ИначеЕсли ИмяВнешнейОбработки = "SABYHttpClient" Тогда  
			макет = ОбъектОбработкиНативнойКомпоненты.ПолучитьМакетSABYHttpsClient();
		Иначе
			ВызватьИсключение "Неизвестная компонента";	
		КонецЕсли;	 
		// BSLLS:UsingSynchronousCalls-off
		Попытка
			УдалитьФайлы(ИмяОбработки);
		Исключение  
			ТекстОшибки = "Не удалось удалить файл обработки " + ИмяВнешнейОбработки + ".epf";
			ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка, , , ИнформацияОбОшибке());	
		КонецПопытки;
		// BSLLS:UsingSynchronousCalls-on
		ПутьКомпоненты = ПоместитьВоВременноеХранилище(макет, Новый УникальныйИдентификатор);
	Иначе
		ВызватьИсключение "Не удалось найти компоненту. Установите внешнюю обработку " + ИмяВнешнейОбработки + ".epf";
	КонецЕсли;
	Возврат ПутьКомпоненты;
КонецФункции
