
&НаКлиенте
Функция ПолучитьВидОбъекта()
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Возврат ЭлементыФормочки.Объекты.ТекущиеДанные.ВидОбъекта;
КонецФункции

&НаКлиенте
Процедура ВыборФайлаЗавершениеДействиеСТекущейСтрокой(ВыбранныйФайл = Неопределено, ТипВложения = Неопределено,
		ВидОбъекта = Неопределено)
		
	УстановитьФильтрПФПоТипуДокумента(ВидОбъекта);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершениеДействиеПослеОбработкиДанных()
	//Для кода обновления формы списка и т.а
КонецПроцедуры

