
&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ВыбранныйФайл Из ВыбранныеФайлы Цикл
			ВидОбъекта				= ПолучитьВидОбъекта();
            ТипВложения				= "ФайлСДиска";
			
			ИмяФайла				= ВыбранныйФайл.Имя;
			ТипФайла				= ПолучитьТипФайла(ИмяФайла);
			ИмяФайлаБезРаширения	= СтрЗаменить(ИмяФайла, "." + ТипФайла, "");
			
			НоваяПФ					= ВложенияПоТипамОбъектов1С.Добавить();
			НоваяПФ.ОтметкаВыбора	= Истина;
			НоваяПФ.Представление	= ИмяФайлаБезРаширения;
			НоваяПФ.ПолноеИмяФайла	= ИмяФайла;
			НоваяПФ.ТипВложения     = ТипВложения;
			НоваяПФ.ИндексКартинки	= 0;
			НоваяПФ.ВидОбъекта		= ВидОбъекта;
			
			#Если ВебКлиент Тогда
				ФайлДД				= ПолучитьИзВременногоХранилища(ВыбранныйФайл.Хранение);
	        #Иначе
				ФайлДД				= Новый ДвоичныеДанные(ВыбранныйФайл.ПолноеИмя);
	        #КонецЕсли
			ФайлBase64			= Base64Строка(ФайлДД);
			АдресВХранилище		= ПоместитьВоВременноеХранилище(ФайлBase64, Новый УникальныйИдентификатор);
			
			НоваяПФ.Команда			= Новый Структура("ИмяФайла, АдресВХранилище", ИмяФайла, АдресВХранилище);
			ВыборФайлаЗавершениеДействиеСТекущейСтрокой(ВыбранныйФайл, ТипВложения, ВидОбъекта);
		КонецЦикла;
	КонецЕсли;
	ВыборФайлаЗавершениеДействиеПослеОбработкиДанных();
КонецПроцедуры

