
&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ВыбранныйФайл Из ВыбранныеФайлы Цикл
			ВидОбъекта				= ПолучитьВидОбъекта();
            ТипВложения				= "ФайлСДиска";
			Если ТипЗнч(ВыбранныйФайл) = Тип("Строка") Тогда 
				ИмяФайла = ВыбранныйФайл;
				ПолноеИмяФайла = ВыбранныйФайл;
			Иначе	
				ИмяФайла = ВыбранныйФайл.Имя; 
				ПолноеИмяФайла = ВыбранныйФайл.ПолноеИмя;
			КонецЕсли;	
			ТипФайла				= ПолучитьТипФайла(ИмяФайла);
			ИмяФайлаБезРаширения	= СтрЗаменить(ИмяФайла, "." + ТипФайла, "");
			
			НоваяПФ					= ВложенияПоТипамОбъектов1С.Добавить();
			НоваяПФ.ОтметкаВыбора	= Истина;
			НоваяПФ.Представление	= ИмяФайлаБезРаширения;
			НоваяПФ.ПолноеИмяФайла	= ИмяФайла;
			НоваяПФ.ТипВложения     = ТипВложения;
			НоваяПФ.ИндексКартинки	= 0;
			НоваяПФ.ВидОбъекта		= ВидОбъекта;
			
			#Если ВебКлиент Тогда
				ФайлДД				= ПолучитьИзВременногоХранилища(ВыбранныйФайл.Хранение);
				УдалитьИзВременногоХранилища(ВыбранныйФайл.Хранение);
			#Иначе   
				ФайлДД				= Новый ДвоичныеДанные(ПолноеИмяФайла);
	        #КонецЕсли
			ФайлBase64			= Base64Строка(ФайлДД);
			АдресВХранилище		= ПоместитьВоВременноеХранилище(ФайлBase64, Новый УникальныйИдентификатор);
			
			НоваяПФ.Команда			= Новый Структура("ИмяФайла, АдресВХранилище", ИмяФайла, АдресВХранилище);
			ВыборФайлаЗавершениеДействиеСТекущейСтрокой(ВыбранныйФайл, ТипВложения, ВидОбъекта);
		КонецЦикла;
	КонецЕсли;
	ВыборФайлаЗавершениеДействиеПослеОбработкиДанных();
КонецПроцедуры

