
// Получаем системную информацию
//
// Параметры:
//  ПараметрыВызова - Структура - параметры вызова.
//
// Возвращаемое значение:
//  Структура - Системная информация.
//
Функция API_ADDON_READSYSTEMINFO(ПараметрыВызова) Экспорт
	ОбщиеПараметры = ОбщиеНастройкиПрочитать();
	ExtSysUid = get_prop(ОбщиеПараметры, "ExtSysUid", Неопределено);
	
//	Инишки = Новый Массив();
//	Инишки.Добавить("Аккордион");                
	//Инишки.Добавить("ПараметрыСистемы");
	//Инишки.Добавить("ПараметрыПодключения");
	Результат = Новый Структура("ExtSysType, ExtSysSubtype, ExtSysSubtypeVersion, Connector, ProductId, ProductVersion, ExtSysUid", //ConnectionId",//, ExtSysSettings",
		"1С",
		Метаданные.Имя,
		Метаданные.Версия,
		"Dom1C",
		НазваниеПродукта(),
		ПолучитьИмяФайлаИНомерТекущейВерсии()[1],		
		ExtSysUid
//		"", //get_prop(params, "ConnectionId", Неопределено),
		//Новый Структура("Format, Type, Id",
		//	"Dom1C",
		//	"Система",
		//	Инишки,
		//)
	);
	Возврат Результат;	
КонецФункции

// Заполнение контекста при аутентификации
//
// Параметры:
//  ПараметрыВызова - Структура - параметры вызова.
//  context_param - Структура - Контекст.
//
//DynamicDirective
Процедура API_ADDON_ONAUTH(ПараметрыВызова, context_param = Неопределено) Экспорт
	Если context_param = Неопределено Тогда
		ИмяНастроек = ИмяПродукта();
		context_param	= ПрочитатьИзХранилища(ИмяНастроек, "params");
		Если context_param = Неопределено Тогда
			context_param = новый Структура;
		КонецЕсли;
	КонецЕсли;
	url = get_prop(ПараметрыВызова,"url", Неопределено);
	Если ЗначениеЗаполнено(url) Тогда 
		url = РазобратьСтрокуУРЛ(url);
		context_param.Вставить("api_url", url.scheme +"://"+ url.host);
   	КонецЕсли;
	СтруктураСессии = Новый Структура;
	СтруктураСессии.Вставить("session", ПараметрыВызова["sessionId"] );
	// BSLLS:DeprecatedCurrentDate-off
	СтруктураСессии.Вставить("session_begin", ТекущаяДата());
	// BSLLS:DeprecatedCurrentDate-on
	СтруктураСессии.Вставить("last_token_time", Неопределено);  
	ТранспортИнтеграции.ЗаписатьСессию(context_param, СтруктураСессии);
	ПослеАутентификации(context_param);
КонецПроцедуры

