
&НаСервереБезКонтекста
Функция ПолучитьРасписание(Знач ИдентификаторРегламентногоЗадания)
	УстановитьПривилегированныйРежим(Истина);
	РасписаниеРегламентногоЗадания = РегламентныеЗаданияСервер.РасписаниеРегламентногоЗадания(
		ИдентификаторРегламентногоЗадания);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат РасписаниеРегламентногоЗадания;	
КонецФункции

&НаСервере
Функция НайтиРегламентноеЗаданиеИПолучитьЕгоРасписаниеСервер()
	ИдентификаторРегламентногоЗадания = Неопределено;
	Возврат ПолучитьРасписание(ИдентификаторРегламентногоЗадания);
КонецФункции

&НаКлиенте
Процедура ПоискРегламентногоЗадания()
	ИдентификаторРегламентногоЗадания	= "";
	Этаформа.РегламентноеЗаданиеВключено		= Ложь;
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.ДействиеСРегламентнымЗаданием.Заголовок = "Регламентное задание отсутствует";
	
	БлокируеыйЭлемент = ЭлементыФормочки.Найти("грАвтообновление");
	Если БлокируеыйЭлемент = Неопределено Тогда
		БлокируеыйЭлемент = ЭлементыФормочки.Найти("ДействиеСРегламентнымЗаданием");
	КонецЕсли;

	БлокируеыйЭлемент.Доступность = Ложь;
	ЭлементыФормочки.РегламентноеЗаданиеВключено.Доступность = Ложь;
	ЛокализацияНазвание = ЛокализацияНазваниеПродукта();
	ПоискРегламентногоЗаданияСервер(ЛокализацияНазвание);
	Если Не ПустаяСтрока(ЭтаФорма.ИдентификаторРегламентногоЗадания) Тогда
		ЭлементыФормочки.ДействиеСРегламентнымЗаданием.Заголовок = "Настроить расписание";
		ЭлементыФормочки.РегламентноеЗаданиеВключено.Доступность = Истина;
		БлокируеыйЭлемент.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПоискРегламентногоЗаданияСервер(Знач ЛокализацияНазвание)
	// Ищем  - "Обновление статусов"
	УстановитьПривилегированныйРежим(Истина); //Необходимо пользователям с отсутствием полных прав
	Отбор = Новый Структура("Ключ",	ЛокализацияНазвание + "_АвтоматическоеОбновлениеСтатусов");
	НайденныеРегЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	Если ТипЗнч(НайденныеРегЗадания) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого НайденныеРегЗадание Из НайденныеРегЗадания Цикл
		Если ТипЗнч(НайденныеРегЗадание) = Тип("РегламентноеЗадание") Тогда
			ЭтаФорма.ИдентификаторРегламентногоЗадания	= НайденныеРегЗадание.УникальныйИдентификатор;
			ЭтаФорма.РегламентноеЗаданиеВключено		= НайденныеРегЗадание.Использование;
		КонецЕсли;
		Прервать;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьРегламентноеЗадание()
	Задание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(ИдентификаторРегламентногоЗадания);
    Возврат Задание;
КонецФункции

&НаСервере
Функция ПолучитьРасписаниеРегламентногоЗадания()
	Расписание = Неопределено;
	Задание = ПолучитьРегламентноеЗадание();
	Если Задание.Метаданные <> Неопределено Тогда
		Расписание = Задание.Расписание;
	КонецЕсли;
	Возврат Расписание;
КонецФункции

&НаКлиенте
Процедура ИспольваниеРегламентногоЗаданияПриИзменении(Элемент)
	ПараметрыЗадания = Новый Структура("Использование", РегламентноеЗаданиеВключено);
	ИзменитьРегламентноеЗадание(ИдентификаторРегламентногоЗадания, ПараметрыЗадания);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьРегламентноеЗадание(НовоеРасписание)
	ПараметрыЗадания = Новый Структура("Расписание", НовоеРасписание);
	ИзменитьРегламентноеЗадание(ИдентификаторРегламентногоЗадания, ПараметрыЗадания);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеРасписаниеЗавершение(НовоеРасписание, Контекст) Экспорт
	Если НовоеРасписание <> Неопределено Тогда
		ЗаписатьРегламентноеЗадание(НовоеРасписание);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДействиеСРегламентнымЗаданиемНажатие(Элемент)
	Расписание = ПолучитьРасписаниеРегламентногоЗадания();
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	Диалог.Показать(Новый ОписаниеОповещения("ОткрытиеРасписаниеЗавершение", ЭтаФорма));
	// При ином заголовке просто выход
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьРегламентноеЗадание(Знач ИдентификаторРегламентногоЗадания, Знач ПараметрыЗадания)
	УстановитьПривилегированныйРежим(Истина);
	Попытка
	    //3.1.19
	    РегламентныеЗаданияСервер.ИзменитьЗадание(ИдентификаторРегламентногоЗадания, ПараметрыЗадания);
	Исключение
	    //3.1.24
	    РегламентныеЗаданияСервер.ИзменитьРегламентноеЗадание(ИдентификаторРегламентногоЗадания, ПараметрыЗадания);
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
