
&НаКлиенте
Процедура ПослеОткрытия()
	ПоискРегламентногоЗадания();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьРегламентноеЗадание(ИдентификаторРегламентногоЗадания, ПараметрыЗадания)
	УстановитьПривилегированныйРежим(Истина);
	Попытка
	    //3.1.19
	    РегламентныеЗаданияСервер.ИзменитьЗадание(ИдентификаторРегламентногоЗадания, ПараметрыЗадания);
	Исключение
	    //3.1.24
	    РегламентныеЗаданияСервер.ИзменитьРегламентноеЗадание(ИдентификаторРегламентногоЗадания, ПараметрыЗадания);
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

