Функция ОтправитьПриглашение(СписокСотрудников) Экспорт
	context_params	= ПроверитьНаличиеПараметровПодключения();
	
	Если context_params.public.send_invitations = Ложь Тогда
		Возврат Новый Структура("data, status", "Отправка приглашений отключена в настройках", "error");
	ИначеЕсли Найти(context_params.public.send_invitations, "my" ) > 0 Тогда
		RedirectApplicationId = "b2b356e2-daa8-4fe7-b86e-0e2dd353f8c6";	
	ИначеЕсли Найти(context_params.public.send_invitations, "staff" ) > 0 Тогда
		RedirectApplicationId = "71627822-061a-42a9-9ad0-b90112a2d2a3";
	ИначеЕсли Найти(context_params.public.send_invitations, "lk" ) > 0 Тогда
		RedirectApplicationId = "7c1ff9a6-69ef-4908-ac7c-5dfcf52ae2a7";
	Иначе
		RedirectApplicationId = "d7b1d6a5-e59d-4b03-b823-726fbdc35d09";	
	КонецЕсли;	
	КоличествоСотрудниковВсего = СписокСотрудников.Количество();
	КоличествоСотрудников = 0;
	КоличествоПриглашений = 0;
	СписокИдСБИС = Новый Массив;
	ТекстОшибки = "";
	СтатусОтправки = "complete";
	Для каждого _Сотрудник из СписокСотрудников Цикл
		ДанныеСотрудника = ПолучитьДанныеПоСотруднику(_Сотрудник);			                                           
		ПоискВСБИС = local_helper_find_sbis_object(context_params, "ЧастноеЛицо", Новый Структура("Название, Ключ2, Ключ3", 
			Строка(_Сотрудник),  ДанныеСотрудника["ИНН"],  ДанныеСотрудника["СНИЛС"]));
		Если get_prop(ПоискВСБИС,"result", Новый Массив).Количество() > 0 Тогда
			КоличествоСотрудников = КоличествоСотрудников + 1;
			Для Каждого _знач из ПоискВСБИС["result"] Цикл
				InputData = Новый Структура ("FaceId, RedirectApplicationId, FirstName, LastName, TransportType, DoNotInviteIfUserLoggedOnce",
				Число(_знач["ИдСБИС"]),
				RedirectApplicationId,
				ДанныеСотрудника["Имя"],
				ДанныеСотрудника["Фамилия"],
				context_params.public.send_type,
				Ложь);
				Если ЗначениеЗаполнено(ДанныеСотрудника["Телефон"]) Тогда
					InputData.Вставить("Phone", ДанныеСотрудника["Телефон"]);	
				КонецЕсли;
				Если ЗначениеЗаполнено(ДанныеСотрудника["Почта"]) Тогда
					InputData.Вставить("Email", ДанныеСотрудника["Почта"]);
				КонецЕсли; 
				Попытка
					local_helper_invite_user_ext(context_params, InputData);
					КоличествоПриглашений = КоличествоПриглашений + 1;
				Исключение
					ИнфОбОшибке = ИнформацияОбОшибке();
					СтатусОтправки = "error";
					ТекстОшибки = ТекстОшибки + Строка(_Сотрудник) + ": " + NewExtExceptionСтруктура(ИнфОбОшибке,,,"Ошибка отправки приглашения").detail + Символы.ПС;
					//ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке,,,"Ошибка отправки приглашения"));	
				КонецПопытки	
			КонецЦикла;	
		Иначе
			ТекстОшибки = ТекстОшибки + Строка(_Сотрудник) + ": " + "не оформлен в "+ЛокализацияНазваниеПродукта() + Символы.ПС;	
		КонецЕсли;
			
	КонецЦикла;
	Если КоличествоСотрудников = 0 Тогда
		ТекстРезультат = "Ни одного сотрудника нет в "+ЛокализацияНазваниеПродукта();
	Иначе
		ТекстРезультат = "Приглашений отправлено: " + Строка(КоличествоПриглашений) + "/" + Строка(КоличествоСотрудников);
		Если ТекстОшибки <> "" Тогда
			ТекстРезультат = ТекстРезультат  + Символы.ПС + ТекстОшибки;
		КонецЕсли;	
	КонецЕсли;
	Возврат Новый Структура("data, status", ТекстРезультат, СтатусОтправки);
КонецФункции

Функция ПолучитьДанныеПоСотруднику(_Сотрудник) Экспорт
	context_params	= ПроверитьНаличиеПараметровПодключения();
	context_params.public.kedo_mark = Ложь;
	
	объект_сотр = Новый Структура("object", Новый Структура("ИдИС, ТипИС, ИмяИС", Строка(_Сотрудник.УникальныйИдентификатор()), "Справочники", "Сотрудники"));
	ПараметрыВызова = Новый Структура("algorithm, object, endpoint, params, connection_uuid", "Blockly_Сотрудники_read", объект_сотр, Неопределено, context_params, context_params["ConnectionId"]);
	РезультатСотрудник	= LocalCalcIni(ПараметрыВызова);
	
	ТипИС = СтрРазделить82(РезультатСотрудник.data["НашаОрганизация"].ИмяИС,".");
	Если типИС.Количество() > 1 Тогда
		ТипОбъекта = ТипИС[1];
	КонецЕсли;	
	ПараметрыВызова = Новый Структура("algorithm, object, endpoint, params, connection_uuid", "Blockly_"+ТипОбъекта+"_read", РезультатСотрудник.data["НашаОрганизация"], Неопределено, context_params, context_params["ConnectionId"]);
	РезультатНашаОрганизация	= LocalCalcIni(ПараметрыВызова);
	ПоискВСБИСНашаОрганизация = local_helper_find_sbis_object(context_params, "НашаОрганизация", Новый Структура("Ключ1_1, Ключ1_2, Ключ1_3", 
		get_prop(РезультатНашаОрганизация["data"],"ИНН"), 
		get_prop(РезультатНашаОрганизация["data"],"КПП"),
		""));
		
	Если get_prop(ПоискВСБИСНашаОрганизация,"result", Новый Массив).Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипИС = СтрРазделить82(РезультатСотрудник.data["ЧастноеЛицо"].ИмяИС,".");
	Если типИС.Количество() > 1 Тогда
		ТипОбъекта = ТипИС[1];
	КонецЕсли;	
	ПараметрыВызова = Новый Структура("algorithm, object, endpoint, params, connection_uuid", "Blockly_"+ТипОбъекта+"_read", РезультатСотрудник.data["ЧастноеЛицо"], Неопределено, context_params, context_params["ConnectionId"]);
	РезультатЧастноеЛицо	= LocalCalcIni(ПараметрыВызова);
	ПоискВСБИСЧастноеЛицо = local_helper_find_sbis_object(context_params, "ЧастноеЛицо", Новый Структура("Ключ2", РезультатЧастноеЛицо["data"]["ИНН"]));
	
	Если get_prop(ПоискВСБИСЧастноеЛицо,"result", Новый Массив).Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПоискВСБИССотрудник = local_helper_find_sbis_object(context_params, "Сотрудник", Новый Структура("Ключ1_1, Ключ1_2, Ключ1_3", 
	ПоискВСБИСЧастноеЛицо["result"][0]["ИдСБИС"], 
	ПоискВСБИСНашаОрганизация["result"][0]["ИдСБИС"], 
	РезультатСотрудник["data"]["ТабельныйНомер"]));
	
	Если get_prop(ПоискВСБИССотрудник,"result", Новый Массив).Количество() > 0 Тогда
		МассивИд = Новый Массив;
		МассивИд.Добавить(ПоискВСБИССотрудник["result"][0]["ИдСБИС"]);
		ОбъектСотрудник = local_helper_get_sbis_object(context_params, "Сотрудник", МассивИд);
		Если ОбъектСотрудник.Количество() > 0 Тогда	
			Если get_prop(ОбъектСотрудник[0], "ДатаСоглашенияКЭДО", Неопределено) <> Неопределено Тогда
				Возврат Истина;	
			Иначе
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
	Иначе
		Возврат Неопределено;
	КонецЕсли;			
КонецФункции	

