
Функция МассивРегламентныхЗаданий() Экспорт
	
	ИмяПродукта = ПолучитьИмяПродукта(); 

	РегЗадания = Новый Массив;

	РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
	РасписаниеЗадания.ПериодПовтораДней = 1;
	РасписаниеЗадания.ПериодПовтораВТечениеДня = 3600*24; //Раз в день

	ИнфоОЗадании = Новый Структура;
	ИнфоОЗадании.Вставить("Наименование", "Обновление статусов");
	ИнфоОЗадании.Вставить("Ключ", ИмяПродукта+"_АвтоматическоеОбновлениеСтатусов");
	ИнфоОЗадании.Вставить("Расписание", РасписаниеЗадания);
	РегЗадания.Добавить(ИнфоОЗадании);
	
	РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
	РасписаниеЗадания.ПериодПовтораДней = 1;
	РасписаниеЗадания.ПериодПовтораВТечениеДня = 3600*1; //Раз в час

	ИнфоОЗадании = Новый Структура;
	ИнфоОЗадании.Вставить("Наименование", "Запуск автоматических операций "+ИмяПродукта);
	ИнфоОЗадании.Вставить("Ключ", ИмяПродукта+"_ЗапускАвтоматическихОпераций");
	ИнфоОЗадании.Вставить("Расписание", РасписаниеЗадания);
	РегЗадания.Добавить(ИнфоОЗадании);
	
	// ЭПД. В конфигурации присутствует подсистема ЭПД
	ИмяМодуля = "Saby_ТНОбщегоНазначенияСервер";
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) <> Неопределено Тогда
		
		МодульКонфигурации = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);		
		МодульКонфигурации.ДобавитьРегламентныеЗаданияЭПД(РегЗадания);			
				
	КонецЕсли;	
	// - ЭПД
	
	Возврат РегЗадания;
	
КонецФункции

