
Функция ПараметрыРегЗадания(Задание)
	Расписание = get_prop(Задание, "Расписание");
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Использование", Ложь);
	ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
	ПараметрыЗадания.Вставить("Наименование", Задание.Наименование);
	ПараметрыЗадания.Вставить("Ключ", Задание.Ключ);
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка());
	МассивПараметров.Добавить(Задание.Ключ);
	ПараметрыЗадания.Вставить("Параметры", МассивПараметров);
	Если Расписание = Неопределено Тогда
		ПараметрыЗадания.Вставить("Расписание", Новый РасписаниеРегламентногоЗадания);
	Иначе
		ПараметрыЗадания.Вставить("Использование", Истина);
		ПараметрыЗадания.Вставить("Расписание", Расписание);
	КонецЕсли;		
	Возврат ПараметрыЗадания;

КонецФункции

