
Функция МассивРегламентныхЗаданий() Экспорт
	
	ЛокализацияНазвание = ЛокализацияНазваниеПродукта(); 

	РегЗадания = Новый Массив;

	ИнфоОЗадании = Новый Структура;
	ИнфоОЗадании.Вставить("Наименование", "Запуск автоматических операций " + ЛокализацияНазвание);
	ИнфоОЗадании.Вставить("Ключ", ЛокализацияНазвание + "_ЗапускАвтоматическихОпераций");
	РегЗадания.Добавить(ИнфоОЗадании);
	
	РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
	РасписаниеЗадания.ПериодПовтораДней = 1;
	РасписаниеЗадания.ПериодПовтораВТечениеДня = 3600*24; //Раз в день

	ИнфоОЗадании = Новый Структура;
	ИнфоОЗадании.Вставить("Наименование", "Обновление статусов");
	ИнфоОЗадании.Вставить("Ключ", ЛокализацияНазвание + "_АвтоматическоеОбновлениеСтатусов");
	ИнфоОЗадании.Вставить("Расписание", РасписаниеЗадания);
	РегЗадания.Добавить(ИнфоОЗадании);
		
	// ЭПД. В конфигурации присутствует подсистема ЭПД
	ИмяМодуля = ПрефиксПродукта() + "ТНОбщегоНазначенияСервер";
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) <> Неопределено Тогда
		
		МодульКонфигурации = ОбщийМодуль(ИмяМодуля);        
		МодульКонфигурации.ДобавитьРегламентныеЗаданияЭПД(РегЗадания);			
				
	КонецЕсли;	
	// - ЭПД
	
	Возврат РегЗадания;
	
КонецФункции

