
&НаСервере
Функция ИмяФайлаОбработки()
	Возврат РеквизитФормыВЗначение("Объект").ИспользуемоеИмяФайла;	
КонецФункции 

&НаСервереБезКонтекста
Функция КопияОбработкиНаСервере(Хранение)
	Результат = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Хранение);
	УдалитьИзВременногоХранилища(Хранение);
	ДвоичныеДанные.Записать(Результат);	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ИмяОбработки()
	Возврат РеквизитФормыВЗначение("Объект").Метаданные().Имя; 
КонецФункции

