
&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ЭтаФорма.context_params	= НастройкиПодключенияПрочитатьНаСервере();
	Если ЭтаФорма.context_params = Неопределено Тогда
		ЭтаФорма.context_params = Новый Структура();
	КонецЕсли;
	link			= api_url + "/!ping/";
	ЭтаФорма.context_params.Вставить("password",	password);
	ЭтаФорма.context_params.Вставить("login",	login);
	ЭтаФорма.context_params.Вставить("api_url",	api_url);

	ЗаполнитьПараметрыПрокси();
	
	КартинкаУспешно = КартинкаУспешно();
	КартинкаОшибка = КартинкаОшибка();
	
	ОтветСервера = Неопределено;
	Попытка
		ОтветСервера = ТранспортИнтеграции.local_helper_exec_request("get", link, "text", Неопределено, ЭтаФорма.context_params);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
		ПоказатьОповещениеПользователя(
			"Ошибка",,СтруктураОшибки.message,
			КартинкаОшибка,
			СтатусОповещенияПользователя.Важное);
		Возврат;
	КонецПопытки;

	Если ОтветСервера <> Неопределено Тогда
		// Обработываетя корень домена, т.ч. ни каких ошибок быть не может
		// только 307, редирект на авторизацию
		Если ОтветСервера.code = 200 Тогда
			ПоказатьОповещениеПользователя(
				"Проверка сервисов",,"Проверка доступа к "+ЛокализацияНазваниеПродукта()+" прошла успешно.",
				КартинкаУспешно,
				СтатусОповещенияПользователя.Важное);
		Иначе
			ПоказатьОповещениеПользователя(
				"Проверка сервисов",,"Проверка доступа к "+ЛокализацияНазваниеПродукта()+" завершилась с ошибкой. Error code - " + Формат(ОтветСервера.code),
				КартинкаОшибка,
				СтатусОповещенияПользователя.Важное);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыПрокси()
	ЭтаФорма.context_params.Удалить("Proxy");
	Если Не ПустаяСтрока(ProxyProtocol) И Не ПустаяСтрока(ProxyServer) И (ProxyPort > 0 И ProxyPort <= 65535) Тогда
		Proxy = Новый Структура;
		Proxy.Вставить("Protocol", ProxyProtocol);
		Proxy.Вставить("Server", ProxyServer);
		Proxy.Вставить("Port", ProxyPort);
		Proxy.Вставить("User", ProxyLogin);
		Proxy.Вставить("Password", ProxyPassword);
		Proxy.Вставить("ИспользоватьАутентификациюОС", ИспользоватьАутентификациюОС);
		ЭтаФорма.context_params.Вставить("Proxy", Proxy);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция НастройкиПодключенияПрочитатьНаСервере()
	Модуль = МодульОбъекта();
	НастройкиПодключения = Модуль.НастройкиПодключенияПрочитать();
	Возврат НастройкиПодключения;
КонецФункции

&НаСервере
Процедура ПеречитатьНастройкиПроксиСервераНаСервере()
	Модуль	= МодульОбъекта();
	ЭтаФорма.context_params	= Модуль.НастройкиПодключенияПрочитать();
	proxy			= get_prop(ЭтаФорма.context_params, "Proxy");
	ЭтаФорма.ProxyProtocol	= get_prop(proxy, "Protocol", "");
	ЭтаФорма.ProxyServer		= get_prop(proxy, "Server", "");
	ЭтаФорма.ProxyPort		= get_prop(proxy, "Port", 0);
	ЭтаФорма.ProxyLogin		= get_prop(proxy, "User", "");
	ЭтаФорма.ProxyPassword	= get_prop(proxy, "Password", "");
	ЭтаФорма.ИспользоватьАутентификациюОС = get_prop(proxy, "ИспользоватьАутентификациюОС", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНастройкиПроксиСервера(Команда)
	ПеречитатьНастройкиПроксиСервераНаСервере();
КонецПроцедуры

