
&НаСервере
Процедура ВзятьНастройкиПроксиИз1СНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	НастройкаПроксиСервера = Константы.НастройкаПроксиСервера.Получить().Получить();
	НастройкаПроксиСервера = ?(ТипЗнч(НастройкаПроксиСервера) = Тип("Соответствие"),
		НастройкаПроксиСервера,
		Неопределено);
	Если 	НастройкаПроксиСервера = Неопределено Тогда
		НастройкаПроксиСервера = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкаПроксиСервера", "");
	КонецЕсли;
	
	ProxyPort		= get_prop(НастройкаПроксиСервера, "Порт", 0);
	ProxyServer		= get_prop(НастройкаПроксиСервера, "Сервер", "");
	ProxyServer		= Нрег(ProxyServer);
	ProxyPassword	= get_prop(НастройкаПроксиСервера, "Пароль", "");
	ProxyLogin		= get_prop(НастройкаПроксиСервера, "Пользователь", "");
	
	ProxyProtocol = "";
	Если Найти(ProxyServer, "https") Тогда
		ProxyProtocol = "https";
		ProxyServer = СтрЗаменить(ProxyServer, "https://", "");
	ИначеЕсли Найти(ProxyServer, "http") Тогда
		ProxyProtocol = "http";
		ProxyServer = СтрЗаменить(ProxyServer, "http://", "");
	Иначе
		Если СтрДлина(ProxyServer) Тогда
			ProxyProtocol = "https";
		КонецЕсли;
	КонецЕсли;
	
	ИспользоватьАутентификациюОС = get_prop(НастройкаПроксиСервера, "ИспользоватьАутентификациюОС", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВзятьНастройкиПроксиИз1С(Команда)
	ВзятьНастройкиПроксиИз1СНаСервере();
КонецПроцедуры

