
&НаСервере
Процедура ВзятьНастройкиПроксиИз1СНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	НастройкаПроксиСервера = Константы.НастройкаПроксиСервера.Получить().Получить();
	НастройкаПроксиСервера = ?(ТипЗнч(НастройкаПроксиСервера) = Тип("Соответствие"),
		НастройкаПроксиСервера,
		Неопределено);
	Если 	НастройкаПроксиСервера = Неопределено Тогда
		МодульОбъекта = МодульОбъекта();	
		ОбщийМодульОбщегоНазначения = МодульОбъекта.ОбщийМодуль("ОбщегоНазначения");
		Если ОбщийМодульОбщегоНазначения <> Неопределено Тогда
			НастройкаПроксиСервера = ОбщийМодульОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкаПроксиСервера", "");
		КонецЕсли;	
	КонецЕсли;
	
	ЭтаФорма.ProxyPort		= get_prop(НастройкаПроксиСервера, "Порт", 0);
	ProxyServer		= get_prop(НастройкаПроксиСервера, "Сервер", "");
	ProxyServer		= Нрег(ProxyServer);
	ЭтаФорма.ProxyPassword	= get_prop(НастройкаПроксиСервера, "Пароль", "");
	ЭтаФорма.ProxyLogin		= get_prop(НастройкаПроксиСервера, "Пользователь", "");
	
	ЭтаФорма.ProxyProtocol = "";
	Если Найти(ProxyServer, "https") Тогда
		ЭтаФорма.ProxyProtocol = "https";
		ЭтаФорма.ProxyServer = СтрЗаменить(ProxyServer, "https://", "");
	ИначеЕсли Найти(ProxyServer, "http") Тогда
		ЭтаФорма.ProxyProtocol = "http";
		ЭтаФорма.ProxyServer = СтрЗаменить(ProxyServer, "http://", "");
	Иначе
		Если СтрДлина(ProxyServer) Тогда
			ЭтаФорма.ProxyProtocol = "https";
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.ИспользоватьАутентификациюОС = get_prop(НастройкаПроксиСервера, "ИспользоватьАутентификациюОС", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВзятьНастройкиПроксиИз1С(Команда)
	ВзятьНастройкиПроксиИз1СНаСервере();
КонецПроцедуры

