&НаКлиенте
Перем ТранспортИнтеграции;

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры <> Неопределено Тогда
		// BSLLS:UnusedLocalVariable-off интерфейсные переменные
		Идентификатор = ?(Параметры.Свойство("Идентификатор"),	Параметры.Идентификатор,	""); 
		Версия = ?(Параметры.Свойство("Версия"),			Параметры.Версия,			""); 
	 	context_params = ?(Параметры.Свойство("context_param"),	Параметры.context_param,	"");
		// BSLLS:UnusedLocalVariable-on	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "SabySignOut" Тогда
		Закрыть();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	ОбновитьАлгоритмы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаАлгоритмов

&НаКлиенте
Процедура Изменить(Команда)
	ЭлемФормы = ПолучитьЭлементыФормы();
	ТекущиеДанные = ЭлемФормы.ТаблицаАлгоритмов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда   
		ОткрытьФормуРедактора(ТекущиеДанные.Алгоритм)
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ОткрытьФормуРедактора();	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАлгоритмовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ЭлемФормы = ПолучитьЭлементыФормы();
	ТекущиеДанные = ЭлемФормы.ТаблицаАлгоритмов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда   
		Закрыть(ТекущиеДанные.Алгоритм); 
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьАлгоритмы()  
	ТаблицаАлгоритмов.Очистить();
	СписокИНИ = СписокИниБлокли();
	Для Каждого Запись ИЗ СписокИНИ Цикл  
		Если ПРАВ(Запись.Ключ,6) <> "_robot" Тогда 
			Продолжить;
		КонецЕсли;	
		НоваяСтрока = ТаблицаАлгоритмов.Добавить();
		НоваяСтрока.Алгоритм = Запись.Ключ;
		Если ТипЗнч(Запись.Значение) = Тип("Соответствие") И Запись.Значение.Получить("custom") = 1 Тогда
			НоваяСтрока.Пользовательский = Истина;
		КонецЕсли;						
	КонецЦикла;				
	ТаблицаАлгоритмов.Сортировать("Алгоритм");	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КодироватьСтрокуНаСервере(Знач НазваниеАлгоритма) 
	Возврат КодироватьСтроку(НазваниеАлгоритма,СпособКодированияСтроки.КодировкаURL); 
КонецФункции	

&НаСервере
Функция local_helper_json_decode_onServer(Знач Источник)
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.local_helper_json_decode(Источник);
КонецФункции

&НаКлиенте 
Функция	СписокИниБлокли() 
    МассивИНИ = Новый Массив();
	МассивИНИ.Добавить(Новый Структура("type", "Blockly"));
	props = Новый Структура;
	props.Вставить("id", 			Идентификатор);
	props.Вставить("version", 		Версия);
	props.Вставить("read_config", 	Истина);
	props.Вставить("new_format",	Истина);
	props.Вставить("requested_ini_format", "Dom1C");
	props.Вставить("need_lite_data", Истина);
	params = Новый Структура("props,ini", props, МассивИНИ);
	АвтоматическаяОперация = ТранспортИнтеграции.local_helper_integration_api(context_params, "IntegrationConnection.ReadConnection", params, "int-settings");
	СписокБлокли = local_helper_json_decode_onServer(АвтоматическаяОперация["Inis"]);
	Возврат СписокБлокли;
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияРедактораФормы(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьАлгоритмы();	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактора(Алгоритм = Неопределено)
	ДополнениеАдресаСтраницы = "";
	Если ЗначениеЗаполнено(Алгоритм) Тогда
		НазваниеАлгоритма = КодироватьСтрокуНаСервере(Алгоритм);
		ДополнениеАдресаСтраницы = "&endpoint=&algorithm="+НазваниеАлгоритма;
	КонецЕсли;	
	АдресСтраницы = context_params.ApiUrl+"/blockly_editor_1c/page/?connection_id="+Идентификатор+"&connector=1C&command=1C"+ДополнениеАдресаСтраницы;	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Редактор файлов настроек");
	ПараметрыФормы.Вставить("АдресСтраницы", АдресСтраницы);
	ОповещениеПослеЗакрытияРедактора = Новый ОписаниеОповещения("ПослеЗакрытияРедактораФормы", ЭтаФорма);
	ОткрытьФормуОбработки("Browser",ПараметрыФормы,,,ОповещениеПослеЗакрытияРедактора);
КонецПроцедуры	

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти