
Перем МодульОбъекта;
// BSLLS:UnusedLocalVariable-off Переменные формы
&НаКлиенте
Перем ТранспортИнтеграции, BlocklyExecutor;
// BSLLS:UnusedLocalVariable-on

#Область include_core_base_ЭДО_Form_Задачи_УстановитьЛокализацию
#КонецОбласти

#Область include_core_base_ЭДО_СопоставлениеТиповОбъектов
#КонецОбласти

#Область include_core_base_Авторизация_ОткрытьФормуАвторизацииПриОтсутствииСессии
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МодульОбъекта = МодульОбъекта();
	ДобавитьИнформациюОВерсии(Элементы.ВерсияПродукта);
	ЭтаФорма.ЭтоВнешняяОбработка = ЭтоВнешняяОбработка();
	УстановитьЛокализацию();
	ПоказатьТекстСообщения();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	context_param = СБИСПараметры(); 
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_param);
	BlocklyExecutor = ПолучитьФормуBlockly();
	
	ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ПриОткрытииПослеАвторизации", ЭтаФорма);
	ОткрытьФормуАвторизацииПриОтсутствииСессии(context_param, ТранспортИнтеграции, ОбработчикПослеАвторизации);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПослеАвторизации(Результат, ДопПараметры = Неопределено) Экспорт
	Если Результат = Неопределено Тогда
		ЭтаФорма.Закрыть();
		Возврат;	
	КонецЕсли;

	СтатусВерсии = ПолучитьИнформациюОВерсииПоУмолчанию();
	СтатусВерсии = ПолучитьСтатусВерсииНаФорме(Ложь);
	ОбновитьИнформациюОВерсии(СтатусВерсии);

	ЭтаФорма.Тип = "Мои";
	ОбновитьСписокЗадач();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = НазваниеПродукта() + "SabySignOut" Тогда
		Закрыть();
	ИначеЕсли ИмяСобытия = "Saby_ЗавершениеДлительнойОперации" Или ИмяСобытия = "Saby_ЗавершениеВыполнитьДействие" Тогда
		ОбновитьСписокЗадач();
	ИначеЕсли ИмяСобытия = "ПереносСтатусовSABY" Тогда
		ПоказатьТекстСообщения();
	Иначе
		Возврат;
	КонецЕсли;
	
	// TODO Переписать на обновление только выделенных строк.
КонецПроцедуры

#Область ФильтрыСпискаЗадач

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	ОбновитьСписокЗадач();
КонецПроцедуры

&НаКлиенте
Процедура ПросроченныеПриИзменении(Элемент)
	ОбновитьСписокЗадач();
КонецПроцедуры

&НаКлиенте
Процедура ПоискОчистка(Элемент, СтандартнаяОбработка)	
	ЭтаФорма.СтрокаПоиска = "";
	ОбновитьСписокЗадач();	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПользователю(ТекстСообщения) Экспорт 

	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = ТекстСообщения;
	СообщениеПользователю.Сообщить();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)	
	ЭтаФорма.СтрокаПоиска = Текст;
	ОбновитьСписокЗадач();	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСписокЗадач(Команда)
	ОбновитьСписокЗадач();
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеСпискаЗадач

&НаКлиенте
Процедура _ПослеАутентификации(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Если ЭтаФорма.Открыта() Тогда
			Закрыть();
		КонецЕсли;
		Возврат;
	КонецЕсли;		
	ОбновитьСписокЗадач();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗадач(ОчиститьСписок=Истина)
	
	ИндексСтраницыНачала = 0;
	Если ОчиститьСписок Тогда 
		СписокЗадач.Очистить();
	Иначе
		ИндексСтраницыНачала = ТекущаяСтраница;
	КонецЕсли;
	
	Попытка
		context_param = ПроверитьНаличиеПараметровПодключенияНаСервере(); 
		
		Для ИндексСтраницы = ИндексСтраницыНачала По ТекущаяСтраница Цикл
			СтруктураНавигации = Новый Структура("Страница, РазмерСтраницы", ИндексСтраницы, 30);
			
			Ответ = ТранспортИнтеграции.local_helper_task_list(context_param, Тип, СтрокаПоиска, Просроченные, СтруктураНавигации);	
			ДополнитьСписокДокументовСбисСвязьюСДокументом1С(get_prop(Ответ, "Реестр", Новый Массив) );
			Навигация = get_prop(Ответ,"Навигация");
			
			ЕстьЕще 		= get_prop(Навигация,"ЕстьЕще");
			//Страница 		= get_prop(Навигация,"Страница");
			//РазмерСтраницы 	= get_prop(Навигация,"РазмерСтраницы");
		КонецЦикла;
		
		Если ЕстьЕще Тогда 
			СтрокаСпискаЗадач 			= СписокЗадач.Добавить();
			СтрокаСпискаЗадач.Подразделение = "Загрузить ещё";
			СтрокаСпискаЗадач.Статус = 100;
		КонецЕсли;		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		ОписаниеОшибки = СтруктураОшибки.detail;
		ПоказатьОповещениеПользователя(
			"Ошибка",,ОписаниеОшибки,
			БиблиотекаКартинок["Ошибка32"],
			СтатусОповещенияПользователя.Важное, Новый УникальныйИдентификатор);
		Возврат;
	КонецПопытки;
	//
	//// Навигация
	//Навигация = ТаблицаЗадач.Получить("Навигация");
	//
	//ЕстьЕще 		= Навигация.Получить("ЕстьЕще");
	//Страница 		= Навигация.Получить("Страница");
	//РазмерСтраницы 	= Навигация.Получить("РазмерСтраницы");
	//
	//Если ЕстьЕще Тогда 
	//	СтрокаСпискаЗадач 			= СписокЗадач.Добавить();
	//	СтрокаСпискаЗадач.Подразделение 	= "Загрузить ещё...";
	//КонецЕсли;	
	
КонецПроцедуры

// Дополняет список документов связью СБИС-1С
//
// Параметры:
//  СписокДокументовСбис - Массив - список документов.
//
&НаСервере
// BSLLS:TransferringParametersBetweenClientAndServer-off
Процедура ДополнитьСписокДокументовСбисСвязьюСДокументом1С(СписокДокументовСбис)
	
	ТаблицаИдентификаторов = ПолучитьТаблицуИдентификаторовДокументовСбис(СписокДокументовСбис);
	МодульОбъекта = МодульОбъекта();
	ТаблицаСсылок = МодульОбъекта.СтатусыДокументовПолучитьСостоянияОбъектов(ТаблицаИдентификаторов);
	
	Для Сч=0 По СписокДокументовСбис.Количество() - 1 Цикл 
		ЗадачаСбис = СписокДокументовСбис[Сч]["Документ"];
		СтрокаСпискаЗадач = СписокЗадач.Добавить(); 
		ЗаполнитьСтрокуЗадачиИзЗадачиСбис(СтрокаСпискаЗадач, ЗадачаСбис);
		ЗаполнитьСтрокуЗадачиИзСтатуса1С(СтрокаСпискаЗадач, ТаблицаСсылок);
	КонецЦикла;
КонецПроцедуры
// BSLLS:TransferringParametersBetweenClientAndServer-on

&НаСервере
Процедура ЗаполнитьСтрокуЗадачиИзСтатуса1С(СтрокаЗадачи, Статусы1С)
	ОтборСтрок = Новый Структура("Uuid", СтрокаЗадачи.Идентификатор);
	СтрокиДокументов = Статусы1С.НайтиСтроки(ОтборСтрок);
	Для Каждого Статус1С Из СтрокиДокументов Цикл
		СтрокаЗадачи.Документ1С = Статус1С["Link"];
		// Для корректного вывода удаляем обработанную строку
		Статусы1С.Удалить(Статус1С);
		Прервать;
	КонецЦикла;
КонецПроцедуры	
&НаСервере
Процедура ДобавитьПодразделение(_Сотрудник, Сотрудники, Подразделение, КоличествоПодразделений)
	ДобавитьПодразделение = Истина;
	Если КоличествоПодразделений < 2 Тогда 
		Если СтрНайти(Подразделение, _Сотрудник["Подразделение"]) = 0 Тогда 
			Подразделение = Подразделение + _Сотрудник["Подразделение"] + ?(Сотрудники.Количество()>1, Символы.ПС, "");
		Иначе
			ДобавитьПодразделение = Ложь;	
		КонецЕсли;	
	КонецЕсли;	
	Если ДобавитьПодразделение Тогда
		КоличествоПодразделений = КоличествоПодразделений + 1;
	КонецЕсли;		
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДанныеСотрудникПодразделение(СтрокаЗадачи, ЗадачаСбис)
	СотрудникСБИС = "";
	Подразделение = "";
	Сотрудники = ЗадачаСбис["Сотрудники"];
	КоличествоСотрудников = Сотрудники.Количество();
	КоличествоПодразделений = 0;
	Сч = 0;
	Для Каждого _Сотрудник Из Сотрудники Цикл
		Если Сч < 2 Тогда
			СотрудникСБИС = СотрудникСБИС + _Сотрудник["ФИО"] + ?(Сотрудники.Количество()>1, Символы.ПС, "");
		КОнецЕсли;	
		Сч = Сч + 1;
		
		Если get_prop(_Сотрудник,"Подразделение" ,"") = "" Тогда 
			Продолжить;
		КонецЕсли;
		ДобавитьПодразделение(_Сотрудник, Сотрудники, Подразделение, КоличествоПодразделений);
	КонецЦикла;
	Если КоличествоПодразделений > 2 Тогда
		Подразделение = Подразделение + "и еще " + Строка(КоличествоПодразделений - 2) +	" подразделени(я/й)";
	КонецЕсли;	
	СтрокаЗадачи.Подразделение = Подразделение;
	Если КоличествоСотрудников > 2 Тогда
		СотрудникСБИС = СотрудникСБИС + "и еще " + Строка(КоличествоСотрудников - 2) +	" сотрудник(а/ов)";		
	КонецЕсли;		
	СтрокаЗадачи.Сотрудник = СотрудникСБИС;	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСтрокуЗадачиИзЗадачиСбис(СтрокаЗадачи, ЗадачаСбис)
	СтрокаЗадачи.Дата = МодульОбъекта.ПреобразоватьСтрокуВДату("dd.MM.yyyy", ЗадачаСбис["Дата"]);
	СтрокаЗадачи.Идентификатор = ЗадачаСбис.Получить("Идентификатор");
	СтрокаЗадачи.Название = Тип1СПоТипуБЛ(ЗадачаСбис.Получить("ИмяСБИС"), ЗадачаСбис.Получить("Примечание"));
	СтрокаЗадачи.Номер = ЗадачаСбис.Получить("Номер");
	СтрокаЗадачи.Регламент = ЗадачаСбис.Получить("Регламент");
	СтрокаЗадачи.Примечание = ЗадачаСбис.Получить("Примечание");
	СтрокаЗадачи.Контрагент = get_prop(get_prop(ЗадачаСбис, "Контрагент"), "Название");
	СтрокаЗадачи.Организация = get_prop(get_prop(ЗадачаСбис, "НашаОрганизация"), "Название");
	
	Состояние = get_prop(ЗадачаСбис, "Состояние"); 
	КодСостояния = Строка(get_prop(Состояние, "Код", "0"));
	СостояниеСБИС = Справочники[ПрефиксПродукта() + "СостоянияОбъектов"].ПолучитьСтатусДокументаСБИС(КодСостояния);
	СтрокаЗадачи.Статус = СостояниеСБИС.ИндексКартинки;
	
	Этап = get_prop(ЗадачаСбис, "Этап"); 
	Если get_prop(Этап, "Название") <> Неопределено Тогда
		СтрокаЗадачи.Этап = get_prop(Этап, "Название");
	Иначе
		Если КодСостояния = "7" Тогда
			СтрокаЗадачи.Этап = "Выполнение завершено успешно";
		ИначеЕсли КодСостояния = "0" Тогда
			СтрокаЗадачи.Этап = "Документ редактируется";
		Иначе
			СтрокаЗадачи.Этап = "Выполнение завершено с проблемами";
		КонецЕсли;
	КонецЕсли;	
	СтрокаЗадачи.Отправитель = get_prop(get_prop(Этап, "Отправитель"), "Название");
	Срок = get_prop(Этап, "Срок");
	Если ЗначениеЗаполнено(Срок) Тогда
		СтрокаЗадачи.Срок = МодульОбъекта.ПреобразоватьСтрокуВДату("yyyy-MM-dd HH:mm:ss", Срок);
	КонецЕсли;
	СтрокаЗадачи.СсылкаСБИС = ЗадачаСбис.Получить("СсылкаДляНашаОрганизация");
	СтрокаЗадачи.ИмяСБИС = ЗадачаСбис.Получить("ИмяСБИС");
	СтрокаЗадачи.ИдСБИС = ЗадачаСбис.Получить("ИдСБИС");
	СтрокаЗадачи.Комментарий = get_prop(ЗадачаСбис, "Комментарий");
	
	ЗаполнитьДанныеСотрудникПодразделение(СтрокаЗадачи, ЗадачаСбис);
	
	Вложения = get_prop(ЗадачаСбис, "Вложение", Новый Массив());
	СтрокаЗадачи.Вложения = ""; 
	Для Каждого Вложение Из Вложения Цикл
		Если Вложение["Служебный"] = "Нет" Тогда
			СтрокаЗадачи.Вложения = ?(ЗначениеЗаполнено(СтрокаЗадачи.Вложения), СтрокаЗадачи.Вложения + ", " + Вложение["Название"], Вложение["Название"]);		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьТаблицуИдентификаторовДокументовСбис(СписокДокументовСбис)
	tUID = Новый ТаблицаЗначений;
	tUID.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка") );
	Для Каждого ДокументСбис Из СписокДокументовСбис Цикл
		ДокументСбис = ДокументСбис["Документ"];
		НовСтрока = tUID.Добавить();
		UID = get_prop(ДокументСбис,"Идентификатор");    //TODO удаить ИдИС когда UID до онлайна доедет
		НовСтрока.UID = Формат(UID, "ЧГ=0");
	КонецЦикла;
	Возврат tUID; 
КонецФункции

Функция СтатусДокумента(СтатусДокумента) Экспорт 
	
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить("0", "Документ редактируется");
	СоответствиеСтатусов.Вставить("1", "Есть документ");
	СоответствиеСтатусов.Вставить("2", "Отправлено приглашение");
	СоответствиеСтатусов.Вставить("3", "Отправлен");
	СоответствиеСтатусов.Вставить("4", "Доставлен");
	СоответствиеСтатусов.Вставить("6", "Ошибка");
	СоответствиеСтатусов.Вставить("7", "Выполнение завершено успешно");
	СоответствиеСтатусов.Вставить("9", "Выполнение завершено с проблемами");
	СоответствиеСтатусов.Вставить("10", "В обработке");
	СоответствиеСтатусов.Вставить("19", "Отозван мной");
	СоответствиеСтатусов.Вставить("20", "Удален контрагентом");
	СоответствиеСтатусов.Вставить("22", "Аннулирован по соглашению");
	СоответствиеСтатусов.Вставить("23", "Ожидает подписания");
	СоответствиеСтатусов.Вставить("27", "Ожидает аннулирования");
	
	Возврат СоответствиеСтатусов.Получить(СтатусДокумента);
	
КонецФункции


#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура СписокЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СписокЗадачОбработкаВыбораСтроки();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачКомандаОткрыть(Команда)
	ТекущиеДанные = Элементы.СписокЗадач.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Документ1С) Тогда 
		ПоказатьЗначение(, ТекущиеДанные.Документ1С);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция АлгоритмПоВидуЗадачи() 
	СоответствиеАлгоритмов = Новый Соответствие;
	СоответствиеАлгоритмов.Вставить("Мои", 					"Blockly_TasksInWork_list");
	СоответствиеАлгоритмов.Вставить("ОтМеня", 				"Blockly_TasksFromMe_list");
	СоответствиеАлгоритмов.Вставить("Нераспределенные", 	"Blockly_TasksUnallocated_list");
	СоответствиеАлгоритмов.Вставить("Выполненные", 			"Blockly_TasksCompleted_list");	
	Возврат СоответствиеАлгоритмов[Тип];
		
КонецФункции	

&НаКлиенте
Функция ТулбарЗадач(context_params)
	_data = "Result";
	ИмяИни = АлгоритмПоВидуЗадачи();
	ПараметрыВызова = Новый Структура();
	ПараметрыВызова.Вставить("Algorithm", ИмяИни);
	ПараметрыВызова.Вставить("object", Новый Структура("object", Неопределено));
	ПараметрыВызова.Вставить("Endpoint", "toolbar"); 
	ПараметрыВызова.Вставить("EndpointArgs", Неопределено); 
	ПараметрыВызова.Вставить("ContextId", Неопределено); 
	ПараметрыВызова.Вставить("ConnectionId", context_params.ConnectionUuid);
	ПараметрыВызова.Вставить("ReadPublicParam", Ложь);
	result	= BlocklyExecutor.API_BLOCKLY_RUN(ПараметрыВызова);
	Если get_prop(result, "Status", Неопределено) = "complete" Тогда
		data = get_prop(result, _data, Неопределено);
		Возврат data;	
	КонецЕсли;
	ПараметрыВызова.Вставить("Endpoint", "view"); 
	result	= BlocklyExecutor.API_BLOCKLY_RUN(ПараметрыВызова);
	Если get_prop(result, "Status", Неопределено) = "complete" Тогда
		data = get_prop(result, _data, Неопределено);
		toolbar = get_prop(data, "Toolbar", get_prop(data, "ACTIONS", Неопределено));
		Если ЗначениеЗаполнено(toolbar) Тогда
			Возврат toolbar; 
		КонецЕсли;	
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура СписокЗадачОбработкаВыбораСтроки()
	
	ТекущиеДанные = Элементы.СписокЗадач.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущийЭлементСпискаЗадач = Элементы.СписокЗадач.ТекущийЭлемент;
	
	Если ТекущиеДанные.Подразделение = "Загрузить ещё" Тогда
		ТекущаяСтраница = ТекущаяСтраница + 1;
		СписокЗадач.Удалить(ТекущиеДанные);
		ОбновитьСписокЗадач(Ложь);
		Возврат;
	КонецЕсли;
	
	Если ТекущийЭлементСпискаЗадач.Имя = "СписокЗадачДокумент1С" и Не ТекущиеДанные.Документ1С = Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Документ1С);
	Иначе
		ПараметрыФормы = Новый Структура();
		
		ПараметрыФормы.Вставить("Идентификатор", ТекущиеДанные["Идентификатор"]);
		ПараметрыФормы.Вставить("ИдСБИС", ТекущиеДанные["ИдСБИС"]);
		ПараметрыФормы.Вставить("Сотрудник", ТекущиеДанные["Сотрудник"]);
		ПараметрыФормы.Вставить("Подразделение", ТекущиеДанные["Подразделение"]);
		ПараметрыФормы.Вставить("Название", ТекущиеДанные["Название"]);
		ПараметрыФормы.Вставить("Примечание", ТекущиеДанные["Примечание"]);
		
		Форма = ФормаОсновнойОбработки("ПросмотрДокумента", ПутьКФормамОбработки(), ПараметрыФормы, ЭтаФорма, ТекущиеДанные["Идентификатор"]);  
		context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();	
		КомандыПанели = ТулбарЗадач(context_params);
		
		Форма.Показать(ТекущиеДанные["Идентификатор"], ТекущиеДанные["Документ1С"], context_params, Новый Структура("КомандыПанели", КомандыПанели));

	КонецЕсли;
	
КонецПроцедуры

#Область include_core_base_Helpers_ПолучитьПрямуюСсылку
#КонецОбласти

&НаКлиенте
Процедура СписокЗадачКомандаОткрытьВСБИС(Команда)
	ТД = Элементы.СписокЗадач.ТекущиеДанные;
	Если ТД <> Неопределено И ЗначениеЗаполнено(ТД.СсылкаСБИС) Тогда
		ЗадачаСсылка = ПолучитьПрямуюССылку(ТД.СсылкаСБИС);
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		// BSLLS:UsingSynchronousCalls-off
		ЗапуститьПриложение(ЗадачаСсылка);
		// BSLLS:UsingSynchronousCalls-on
		#Иначе	
		ПерейтиПоНавигационнойСсылке(ЗадачаСсылка);	
		#КонецЕсли
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СБИСПараметры()
	МодульОбъекта = МодульОбъекта();
	saby_param = МодульОбъекта.НастройкиПодключенияПрочитать();
	Возврат saby_param;
КонецФункции

&НаСервере
Функция ОбщиеНастройкиПрочитать()
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.ОбщиеНастройкиПрочитать();
КонецФункции

&НаКлиенте
Процедура СформироватьМассивыДокументов(СписокДокументовСБИС, СписокДокументов1С)
	Для Каждого Стр Из Элементы.СписокЗадач.ВыделенныеСтроки Цикл 
		СтрокаСпискаЗадач = СписокЗадач.НайтиПоИдентификатору(Стр);
		СсылкаДокумент1С = СтрокаСпискаЗадач["Документ1С"];
		Если СтрокаСпискаЗадач.Подразделение = "Загрузить ещё" Тогда
			Продолжить;
		КонецЕсли;
		ДокументСБИС = Новый Структура("Идентификатор, ПервичныйКлюч, Документ1С", 
		СтрокаСпискаЗадач["Идентификатор"], СтрокаСпискаЗадач["ИдСБИС"], СсылкаДокумент1С);	
		СписокДокументовСБИС.Добавить(ДокументСБИС);
		Если СтрокаСпискаЗадач["Документ1С"] <> Неопределено Тогда
			СписокДокументов1С.Добавить(СсылкаДокумент1С);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

#Область include_core_base_ВстраиваниеВФормы_КомандаВыполнитьВSABY
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_ОберткаСерверныхКоманд
#КонецОбласти

&НаКлиенте
Функция СформироватьМассивВыгружаемыхДокументов()  
	ВыгружаемыеДокументы = Новый Массив();
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	Для Каждого ВыгружаемыйДокумент Из Элементы.СписокЗадач.ВыделенныеСтроки Цикл
		СтрокаСпискаЗадач = СписокЗадач.НайтиПоИдентификатору(ВыгружаемыйДокумент);
		Если СтрокаСпискаЗадач.Подразделение = "Загрузить ещё" Тогда
			Продолжить;
		КонецЕсли;
		ИмяСБИС = СтрокаСпискаЗадач.ИмяСБИС;
		ПримечаниеСБИС = СтрокаСпискаЗадач.Примечание;
		ИдентификаторДокумента = СтрокаСпискаЗадач.Идентификатор;
		ИмяСБИС = ТипОбъектаАПИПоТипуСБИС(ИмяСБИС, ПримечаниеСБИС, ИдентификаторДокумента, context_params);
		
		API3_ref = Новый Структура; 
		API3_ref.Вставить("SbisId",		СтрокаСпискаЗадач.ИдСБИС);
		API3_ref.Вставить("SbisType",	ИмяСБИС);
		API3_ref.Вставить("Type",		ИмяСБИС);
		API3_ref.Вставить("Title",		СтрокаСпискаЗадач.Название);
		ВыгружаемыеДокументы.Добавить(API3_ref);
	КонецЦикла;
	Возврат ВыгружаемыеДокументы; 	
КонецФункции	

Функция СформироватьМассивВыгружаемыхДокументов1С()
	ВыгружаемыеДокументы = Новый Массив();
	Для Каждого ВыгружаемыйДокумент Из Элементы.СписокЗадач.ВыделенныеСтроки Цикл
		СтрокаСпискаЗадач = СписокЗадач.НайтиПоИдентификатору(ВыгружаемыйДокумент);
		Если Не ЗначениеЗаполнено(СтрокаСпискаЗадач.Документ1С) Тогда
			Продолжить; 
		КонецЕсли;
		ВыгружаемыеДокументы.Добавить(СтрокаСпискаЗадач.Документ1С);
	КонецЦикла;
	Возврат ВыгружаемыеДокументы;	
КонецФункции

#Область include_core_base_ВстраиваниеВФормы_ВыгрузитьВложенияИзСБИСОбщее
#КонецОбласти

&НаКлиенте
Функция КнопкаВыгрузитьВ1С()
	Возврат Элементы.ВыгрузитьВ1СНажатие;
КонецФункции

&НаКлиенте
Процедура ПоказатьМенюВыгрузитьВ1С(СписокКнопок)
	ОписаниеОповещения = Новый ОписаниеОповещения("МенюВыгрузитьВ1СОбработкаОповещения", ЭтаФорма);
	ПоказатьВыборИзМеню(ОписаниеОповещения, СписокКнопок, КнопкаВыгрузитьВ1С());
КонецПроцедуры

#Область include_core_base_ВстраиваниеВФормы_КомандаВыгрузитьВ1С
#КонецОбласти

&НаКлиенте
Функция ТекущийДокументИС() 
	ТД = Элементы.СписокЗадач.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ТД.Документ1С;
КонецФункции

#Область include_core_base_ВстраиваниеВФормы_КомандаОбновитьВSABY
#КонецОбласти

#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_Helpers_ExtException
#КонецОбласти

#Область include_base_НазваниеПродукта
#КонецОбласти

#Область include_core_base_ЗапускМодуля_ПроверкаВерсии_ПолучитьИмяФайлаИНомерТекущейВерсии
#КонецОбласти

#Область include_core_base_ЗапускМодуля_ПроверкаВерсии_НаФорме
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСервер
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

#Область include_core_base_АвтоматическиеОперации_ВызовФорм
#КонецОбласти

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_СтатусыДокументов_ПоказатьТекстСообщения
#КонецОбласти

#Область include_core_base_Helpers_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Транспорт_ВидТранспорта
#КонецОбласти

#Область include_core_base_Транспорт_ИмяСвойстваТранспорта 
#КонецОбласти
