
&НаСервере
Процедура УстановитьЛокализацию()
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ЭтаФорма.Заголовок = "Задачи "+ЛокализацияНазваниеПродукта();
	
	ЭлементыФормочки.ВыполнитьВSABYНажатие.Заголовок = "Выполнить в "+ЛокализацияНазваниеПродукта();
	ЭтаФорма.Команды.ВыполнитьВSABYНажатие.Подсказка = "Движение по регламенту в "+ЛокализацияНазваниеПродукта();
	
	ЭтаФорма.Команды.СписокЗадачКомандаОткрытьВСБИС.Подсказка = "Список задач команда открыть в "+ЛокализацияНазваниеПродукта();

	ЭлементыФормочки.ОбновитьВСБИСНажатие.Заголовок = "Обновить в "+ЛокализацияНазваниеПродукта();
	ЭтаФорма.Команды.ОбновитьВСБИСНажатие.Подсказка = "Обновить реквизиты документа в "+ЛокализацияНазваниеПродукта();

	ЭлементыФормочки.ОткрытьВСБИС.Заголовок = "Открыть в "+ЛокализацияНазваниеПродукта();
	ЭтаФорма.Команды.СписокЗадачКомандаОткрытьВСБИС.Подсказка = "Открыть в "+ЛокализацияНазваниеПродукта();
КонецПроцедуры

