
#Область includr_core_base_ГлавнаяСтраница1С_ОбработкаОбщейКомандыОткрытиеФормыБраузера
#КонецОбласти

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	context_params = МодульCoreКлиент().ПроверитьНаличиеПараметровПодключения();
	АдресСтраницы = "/page/connection-card?connectionId=" + МодульCoreКлиент().get_prop(context_params, "ConnectionUuid", "");
	ОткрытьАдресВФормеБраузера(АдресСтраницы, "Настройки");
КонецПроцедуры

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область includr_core_base_МодульCoreКлиент
#КонецОбласти
