
// Получаем признак запуска транспорта на клиенте
//
// Параметры:
//  context_params - Структура - Контекст.
//
// Возвращаемое значение:
//  Булево - признак транспорта на клиенте 
//
//DynamicDirective
Функция  ЭтоВидТранспортаКлиент(context_params)
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Возврат Ложь;
	#Иначе
		Возврат ВидТранспорта(context_params) = "APIClient" 
			Или ЭтоВидТранспортаExtSdk(context_params);
	#КонецЕсли
КонецФункции

// Получаем признак транспорта ExtSdk
//
// Параметры:
//  context_params - Структура - Контекст.
//
// Возвращаемое значение:
//  Булево - признак транспорта ExtSdk
//
//DynamicDirective
Функция  ЭтоВидТранспортаExtSdk(context_params)
	ВидТранспорта = ВидТранспорта(context_params);
	Возврат ВидТранспорта = "ExtSdk" Или ВидТранспорта = "ExtSdkCrypto" Или ВидТранспорта = "SabyPluginConnector";
КонецФункции
