
&НаСервере
Функция СписокДемоПродуктов()
	ДемоПродукты = Новый Массив();
#Область include_core_base_Авторизация_Демо_ДемоПродуктыБухгалтерия
#КонецОбласти
#Область include_core_base_Авторизация_Демо_ДемоПродуктыКЭДО
#КонецОбласти
#Область include_core_base_Авторизация_Демо_ДемоПродуктыЭДО
#КонецОбласти
#Область include_core_base_Авторизация_Демо_ДемоПродуктыЭТРН
#КонецОбласти

	Возврат ДемоПродукты;
КонецФункции

&НаСервере
Процедура ЗаполнитьМакетДемоВхода(Знач ДемоПродукты)
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Текст", Истина);
	ТекстСтраницы = МодульОбъекта().ПолучитьМакетОбработкиНаСервере("Демо", ДопПараметры);
	БлокПродуктов = "";
	ОбработанныеПродукты = Новый Соответствие;
	
	Для Каждого ДанныеПродукта Из ДемоПродукты Цикл
		// Наверняка кажрый продукт бует отдавать пересекающиеся поддерживаемые продукты
		// Проверка на обработку дуьлей
		Если ОбработанныеПродукты[ДанныеПродукта.App] = Истина Тогда
			Продолжить;
		КонецЕсли;
		ОбработанныеПродукты.Вставить(ДанныеПродукта.Name, Истина);
		
		БлокПродукта = 
			"<div class=""transport-button"" id=""%App%"">
			|    <div>
			|        <p class=""transport-button__product"">%Name%</p>
			|        <p class=""transport-button__name"">%Caption%</p>
			|    </div>
			|    <p class=""transport-button__description"">%Description%</p>
			|</div>
			|";
		БлокПродукта = СтрЗаменить(БлокПродукта, "%App%", ДанныеПродукта.App);
		БлокПродукта = СтрЗаменить(БлокПродукта, "%Name%", ДанныеПродукта.Name);
		БлокПродукта = СтрЗаменить(БлокПродукта, "%Caption%",  ДанныеПродукта.Caption);
		БлокПродукта = СтрЗаменить(БлокПродукта, "%Description%",  ДанныеПродукта.Description);
		БлокПродуктов = БлокПродуктов + БлокПродукта;
	КонецЦикла;
	
	ТекстСтраницы = СтрЗаменить(ТекстСтраницы, "%productlist%", БлокПродуктов);
	УстановитьHTML("СтраницаДемоВхода", ТекстСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВДемоАвторизацию(Команда)
	ДемоПродукты = СписокДемоПродуктов();
	Если ДемоПродукты.Количество() = 1 Тогда
		ДемоАвторизацияВыбраннымПродуктом(ДемоПродукты[0].App);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьМакетДемоВхода(ДемоПродукты);
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.СтраницыАвторизации.ТекущаяСтраница = 
		ПолучитьСтраницуНаКлиенте(
			ЭлементыФормочки.СтраницыАвторизации,
			"include_core_base_Авторизация_Демо_СтраницаПриложений");
КонецПроцедуры

&НаКлиенте
Функция ОбъектПродуктДемо(ЭлементСобытия)
	Результат = ЭлементСобытия;
	
	Пока ТипЗнч(Результат) = Тип("ВнешнийОбъект") 
		И ПустаяСтрока(Результат["id"]) Цикл
		Если Результат.nodeName = "BODY" Тогда
			// Нажатие вне блока продукта
			Результат = Неопределено;
			Возврат Результат;
		КонецЕсли;
		Результат = Результат.parentNode;
	КонецЦикла;
	
	Если Результат["id"] = "main"
		Или Результат["id"] = "demo-buttons" Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ДемоАвторизацияВыбраннымПродуктом(ИмяПродукта)
	ЭтаФорма.Country = "ru";
	ЭтаФорма.Domain = "sabyd";
	ЭтаФорма.context_params.Вставить("AutoAuth", Истина);
	СформироватьУРЛ();
	ПередАвторизациейПереопределяемый();
	
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Ошибка.Заголовок = "";
	Попытка
		// Получим демо сессию
		ВидТранспорта = ВидТранспорта(ЭтаФорма.context_params);
		Если ЭтоВидТранспортаExtSdk(ЭтаФорма.context_params) Тогда
			context_params_copy = Saby_КопияСтруктуры(ЭтаФорма.context_params);
			context_params_copy.Вставить(ИмяСвойстваТранспорта(), "APIClient");
			session = ТранспортИнтеграции.local_helper_demoentry_getsid(context_params_copy, ИмяПродукта);
			session = ТранспортИнтеграции.AuthenticateBySession(ЭтаФорма.context_params, session);		
		Иначе
			session = ТранспортИнтеграции.local_helper_demoentry_getsid(ЭтаФорма.context_params, ИмяПродукта);
		КонецЕсли;
		СтруктураСессии = Новый Структура;
		СтруктураСессии.Вставить("Session", session );
		ЭтаФорма.context_params.Вставить(ИмяСвойстваТранспорта(), ВидТранспорта);
		ТранспортИнтеграции.ЗаписатьСессию(ЭтаФорма.context_params, СтруктураСессии);
		ПослеАвторизацииПереопределяемый();
	Исключение
		// Ошибка демо авторизации
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ЭлементыФормочки.Ошибка.Заголовок = ExtExceptionToMessage(ОшибкаСтруктура);
		
		ВыполнитьРежимВходаПоЛогину(Ложь);
		Возврат;
	КонецПопытки;
	
	Попытка
		// Завершение авторизации
		ТранспортИнтеграции.ПослеАутентификации(context_params);
		ПослеУспешнойАвторизации();
	Исключение 
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ЭлементыФормочки.ОшибкаНастройки.Заголовок = ExtExceptionToMessage(ОшибкаСтруктура);
		ВыполнитьРежимВходаПоЛогину(Ложь);
		Возврат;
	КонецПопытки;
	
КонецПроцедуры	

// BSLLS:MissingCodeTryCatchEx-off
// BSLLS:SpaceAtStartComment-off
// BSLLS:CommentedCode-off

// BSLLS:SpaceAtStartComment-on

&НаКлиенте
Процедура СтраницаДемоВходаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	ЭлементСобытия = ЭлементСобытияПоляHTML(ДанныеСобытия);
	ЭлементСобытия = ОбъектПродуктДемо(ЭлементСобытия);
	Если ТипЗнч(ЭлементСобытия) = Тип("ВнешнийОбъект") Тогда
		Попытка
			ИмяПродукта = ЭлементСобытия["id"];
			ДемоАвторизацияВыбраннымПродуктом(ИмяПродукта);
		Исключение
			// ИнфоОбОшибке = ИнформацияОбОшибке();
			// СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

// BSLLS:SpaceAtStartComment-off


// BSLLS:CommentedCode-on
// BSLLS:SpaceAtStartComment-on
// BSLLS:MissingCodeTryCatchEx-on
