
&НаСервере
Функция ПолучитьИнформациюОВерсииПоУмолчанию() 
	//Возврат Новый Структура("client_version_status, current_version_number", 0);
	Возврат Неопределено; // для расширения
КонецФункции 

&НаСервере
Процедура ДобавитьИнформациюОВерсии(Родитель)
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	Если ЭлементыФормочки.Найти("ТекущаяВерсия") <> Неопределено Тогда
		// В обычных формах реквизиты уже добавлены на форму!
		Возврат;
	КонецЕсли;
	
	Элемент = ЭлементыФормочки.Вставить("ТекущаяВерсия", Тип("ДекорацияФормы"), Родитель);
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.Видимость = Ложь;
	Элемент = ЭлементыФормочки.Вставить("АктуальнаяВерсия", Тип("ДекорацияФормы"), Родитель);
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.Видимость = Ложь;
	Элемент = ЭлементыФормочки.Вставить("ДемоЛицензия", Тип("ДекорацияФормы"), Родитель);
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СкачатьАктуальнуюВерсию(Элемент = Неопределено)
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Попытка
		СсылкаДляСкачивания = Элемент.Подсказка;
	Исключение
		СсылкаДляСкачивания = "";
	КонецПопытки;
	Если ЗначениеЗаполнено(СсылкаДляСкачивания) Тогда
		ЗапуститьПриложение(СсылкаДляСкачивания);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОВерсииНаСервере(СтатусВерсии)
	ЭлементыФормочки		= ПолучитьЭлементыФормыНаСервере();
	ЭлементТекущаяВерсия	= ЭлементыФормочки.ТекущаяВерсия;
	ЭлементАктуальнаяВерсия = ЭлементыФормочки.АктуальнаяВерсия;
	ЭлементДемоЛицензия     = ЭлементыФормочки.ДемоЛицензия;
	ЭлементСписокИзменений	= ЭлементыФормочки.Найти("НадписьСписокИзменений");
	
	ЭлементАктуальнаяВерсия.Подсказка = "";
	ЭлементАктуальнаяВерсия.Гиперссылка = Истина;
	Если ЭлементСписокИзменений <> Неопределено Тогда
		ЭлементСписокИзменений.Видимость = Ложь;
	КонецЕсли;
	
	Если СтатусВерсии = Неопределено Тогда
		Шаблон = Неопределено;
	Иначе
		Шаблон = СтатусВерсии.Шаблон;
		ЭлементТекущаяВерсия.Видимость = Истина;
		ЭлементТекущаяВерсия.Заголовок = "v." + СтатусВерсии.НомерТекущейВерсии;
	КонецЕсли;
	Если Шаблон = 0 Тогда
		ЭлементАктуальнаяВерсия.Видимость = Ложь;
		Если ЭлементСписокИзменений <> Неопределено Тогда
			ЭлементСписокИзменений.Видимость = Истина;
		КонецЕсли;
	ИначеЕсли Шаблон = 1 ИЛИ Шаблон = -1 Тогда
		ЭлементАктуальнаяВерсия.Заголовок = "Доступна новая версия"; //TODO синий + ссылка на скачивание
		ЭлементАктуальнаяВерсия.Видимость = Истина;
		ЭлементАктуальнаяВерсия.ЦветТекста = WebЦвета.Красный;
		ЭлементАктуальнаяВерсия.Гиперссылка = Истина;
		ЭлементАктуальнаяВерсия.Подсказка = СтатусВерсии.СсылкаДляСкачивания;
		Если ЭлементСписокИзменений <> Неопределено Тогда
			ЭлементСписокИзменений.Видимость = Истина;
		КонецЕсли;
	ИначеЕсли Шаблон = 2 Тогда
		ЭлементАктуальнаяВерсия.Заголовок = "Версия устарела"; //TODO красный + ссылка на скачивание
		ЭлементАктуальнаяВерсия.Видимость = Истина;
		ЭлементАктуальнаяВерсия.ЦветТекста = WebЦвета.Красный;
		ЭлементАктуальнаяВерсия.Гиперссылка = Истина;
		ЭлементАктуальнаяВерсия.Подсказка = СтатусВерсии.СсылкаДляСкачивания;
		Если ЭлементСписокИзменений <> Неопределено Тогда
			ЭлементСписокИзменений.Видимость = Истина;
		КонецЕсли;
	ИначеЕсли Шаблон = 3 Тогда
		ЭлементАктуальнаяВерсия.Заголовок = "ВЕРСИЯ НЕ СОВМЕСТИМА";
		ЭлементАктуальнаяВерсия.Видимость = Истина;
		ЭлементАктуальнаяВерсия.ЦветТекста = WebЦвета.Красный;
		ЭлементАктуальнаяВерсия.Гиперссылка = Истина;
		ЭлементАктуальнаяВерсия.Подсказка = СтатусВерсии.СсылкаДляСкачивания;
		Если ЭлементСписокИзменений <> Неопределено Тогда
			ЭлементСписокИзменений.Видимость = Истина;
		КонецЕсли;
	ИначеЕсли Шаблон = 4 Тогда
		ЭлементАктуальнаяВерсия.Заголовок = "ВЕРСИЯ СОДЕРЖИТ КРИТИЧЕСКИЕ ОШИБКИ";
		ЭлементАктуальнаяВерсия.Видимость = Истина;
		ЭлементАктуальнаяВерсия.ЦветТекста = WebЦвета.Красный;
		ЭлементАктуальнаяВерсия.Гиперссылка = Истина;
		ЭлементАктуальнаяВерсия.Подсказка = СтатусВерсии.СсылкаДляСкачивания;	
		Если ЭлементСписокИзменений <> Неопределено Тогда
			ЭлементСписокИзменений.Видимость = Истина;
		КонецЕсли;
	ИначеЕсли Шаблон = "Ошибка" Тогда
		ЭлементАктуальнаяВерсия.Заголовок = "Ошибка при получении информации о версии";
		ЭлементАктуальнаяВерсия.Подсказка = СтатусВерсии.НомерАктуальнойВерсии;
		ЭлементАктуальнаяВерсия.Видимость = Истина;
		ЭлементАктуальнаяВерсия.ЦветТекста = WebЦвета.Красный;
		ЭлементАктуальнаяВерсия.Гиперссылка = Ложь;
		//Злемент.Гиперссылка = Истина;	
	ИначеЕсли Шаблон = Неопределено Тогда
		ЭлементАктуальнаяВерсия.Заголовок = "";
		ЭлементАктуальнаяВерсия.Видимость = Ложь;
		ЭлементАктуальнаяВерсия.Гиперссылка = Ложь;
	Иначе
		ЭлементАктуальнаяВерсия.Заголовок = "ОШИБКА ПРИ ПОЛУЧЕНИИ НОМЕРА АКТУАЛЬНОЙ ВЕРСИИ";
		ЭлементАктуальнаяВерсия.Видимость = Истина;
		ЭлементАктуальнаяВерсия.ЦветТекста = WebЦвета.Красный;
		ЭлементАктуальнаяВерсия.Гиперссылка = Ложь;
	КонецЕсли;
	
	Если get_prop(СтатусВерсии, "ДемоЛицензия") <> Неопределено Тогда
		ЭлементДемоЛицензия.Заголовок = "Тестовый доступ до "+СтатусВерсии.ДемоЛицензия;
		ЭлементДемоЛицензия.Видимость = Истина;
		ЭлементДемоЛицензия.ЦветТекста = WebЦвета.Красный;
		ЭлементДемоЛицензия.Шрифт = Новый Шрифт(,,Истина);
	КонецЕсли;
	
	ОбновитьИнформациюОбновленияНаСервере(СтатусВерсии);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюОВерсии(СтатусВерсии)
	ОбновитьИнформациюОВерсииНаСервере(СтатусВерсии);
КонецПроцедуры

&НаСервере
Функция НаличиеПараметровПодключения()
	МодульОбъекта	= ПолучитьМодульОбъекта();
	context_params	= МодульОбъекта.ПроверитьНаличиеПараметровПодключения();
	Возврат НЕ (context_params = Неопределено);
КонецФункции

&НаКлиенте
Процедура ПроверитьАктуальностьВерсииНажатие(Элемент)
	//По нажатию с формы мы проверяем на необходимость авторизоваться
	Если НаличиеПараметровПодключения() Тогда
		ПолучитьАктуальностьВерсии();
	Иначе
		ПроверкаВведенныхДанныхАутентификации = Новый ОписаниеОповещения("ОбработкаРезультатаЗакрытияФормыАвторизации",
			ЭтаФорма);
        ОткрытьФормуОбработки("Вход",, ЭтаФорма,, ПроверкаВведенныхДанныхАутентификации);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьАктуальностьВерсии(ФормаОткрыта = Истина)
	//При просто вызове ни авторизацию не проверяем а пробуем получить версию хотяб и с ошибкой
	Если ФормаОткрыта Тогда
		СтатусВерсии = ПолучитьСтатусВерсииНаФорме(Истина);
		ОбновитьИнформациюОВерсииНаСервере(СтатусВерсии);
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_ПроверкаВерсии_ПолучитьСтатусВерсииНаФорме
#КонецОбласти

#Область include_core_base_ПроверкаВерсии_НаФормеОсобенностиПродукта
#КонецОбласти

