
&НаСервере
Процедура ОбновитьИнформациюОбновленияНаСервере(СтатусВерсии)
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ЭлементАктуальнаяВерсия = ЭлементыФормочки.АктуальнаяВерсия;
	Если СтатусВерсии <> Неопределено и ЗначениеЗаполнено(СтатусВерсии.СсылкаДляСкачивания) Тогда
		ЭлементАктуальнаяВерсия.Гиперссылка = Истина;
		ЭлементАктуальнаяВерсия.Подсказка = "Обновить обработку";
		УстановитьДействиеНаЭлемент(ЭлементАктуальнаяВерсия, "Нажатие", "СбисОбновитьОбработкуНаКлиенте");
		ЭлементТекущаяВерсия = ЭлементыФормочки.ТекущаяВерсия;
		ЭлементТекущаяВерсия.Гиперссылка = Истина;
		ЭлементТекущаяВерсия.Подсказка = СтатусВерсии.СсылкаДляСкачивания;
		УстановитьДействиеНаЭлемент(ЭлементТекущаяВерсия, "Нажатие", "СкачатьАктуальнуюВерсию");
	Иначе
		ЭлементАктуальнаяВерсия.Заголовок = "";
		ЭлементАктуальнаяВерсия.Видимость = Ложь;
		ЭлементАктуальнаяВерсия.Гиперссылка = Ложь;
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_ПроверкаВерсии_НаФормеОбновлениеОбработки
#КонецОбласти

