
Функция ПолучитьИмяФайлаИНомерТекущейВерсии() Экспорт
	МодульОбъекта = МодульОбъекта();
	Результат = Новый Массив(2);
	Результат[0] = "";
	Результат[1] = "00.0000.0";  
	Комментарий = СтрРазделить82(МодульОбъекта.Метаданные().Комментарий, ":");
	РазмерКомментария = Комментарий.Количество();
	Если  РазмерКомментария = 3 Тогда
		Результат[0] = Комментарий[РазмерКомментария - 2];
		Результат[1] = Комментарий[РазмерКомментария - 1];
		Если Результат[1] = "" Тогда
			//Для VO2
			Попытка 
				СведенияОВнешнейОбработке = МодульОбъекта.СведенияОВнешнейОбработке();
				Результат[1] = get_prop(СведенияОВнешнейОбработке, "Версия", "");
			Исключение  
				Возврат Результат;
			КонецПопытки;
			//--
		КонецЕсли;	
	КонецЕсли;
	Возврат Результат;	
КонецФункции

Функция ПолучитьТипМетаданныхОбработки()
	Возврат "ВнешняяОбработка";
КонецФункции
