
Функция ПолучитьМетаданныеРасширения() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	МетаданныеРасширения = Неопределено;
	Для каждого Расширение из РасширенияКонфигурации.Получить() Цикл
		Если СокрЛП(Расширение.Имя) = ЛокализацияНазваниеПродукта() Тогда 
			МетаданныеРасширения = Новый ОбъектМетаданныхКонфигурация(Расширение.ПолучитьДанные());
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МетаданныеРасширения;
КонецФункции

Функция ПолучитьИмяФайлаИНомерТекущейВерсии() Экспорт
	Результат = Новый Массив(2);
	Результат[0] = "";
	Результат[1] = "00.0000.0";
	МетаданныеРасширения = ПолучитьМетаданныеРасширения();
	Если МетаданныеРасширения <> Неопределено Тогда
		Комментарий = СтрРазделить82(МетаданныеРасширения.Комментарий, ";");
		РазмерКомментария = Комментарий.Количество();
		Если  РазмерКомментария > 2 Тогда
			Результат[0] = Комментарий[РазмерКомментария - 2];
			Результат[1] = Комментарий[РазмерКомментария - 1];
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;	
КонецФункции

Функция ПолучитьТипМетаданныхОбработки()
	Возврат "Обработка";
КонецФункции
