
#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьОбработку
#КонецОбласти

Функция ПолучитьМетаданныеРасширения() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	МетаданныеРасширения = Неопределено;
	Для каждого Расширение из РасширенияКонфигурации.Получить() Цикл
		Если СокрЛП(Расширение.Имя) = ЛокализацияНазваниеПродукта() Тогда 
			МетаданныеРасширения = Новый ОбъектМетаданныхКонфигурация(Расширение.ПолучитьДанные());
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МетаданныеРасширения;
КонецФункции

Функция ПолучитьИмяФайлаИНомерТекущейВерсии() Экспорт
	Результат = Новый Массив(2);
	Результат[0] = "";
	Результат[1] = "00.0000.0";  
	
	МодульОбработки = ПолучитьОбъектОбработки();
	КомментарийОбработки = МодульОбработки.Метаданные().Комментарий;
	КомментарийМассив = СтрРазделить82(КомментарийОбработки, ":");	
	РазмерКомментария = КомментарийМассив.Количество();
	Если  РазмерКомментария = 2 Тогда
		Результат[0] = НазваниеПродукта();
		Результат[1] = КомментарийМассив[РазмерКомментария - 1];
	КонецЕсли;	
	Возврат Результат;	
КонецФункции

Функция ПолучитьТипМетаданныхОбработки()
	Возврат "Обработка";
КонецФункции
