&НаКлиенте
// BSLLS:UnusedLocalVariable-off
// BSLLS:ExportVariables-off
Перем ТранспортИнтеграции, BlocklyExecutor, ОбработкаМенеджерыКриптографии Экспорт;
// BSLLS:ExportVariables-on
&НаКлиенте
Перем КоннекторИнтеграция;
// BSLLS:UnusedLocalVariable-on

#Область include_core_base_Helpers_Константы
#КонецОбласти

&НаКлиенте
Процедура АвтоматическиеОперации(Команда) 
	ОткрытьФормуОбработки("РоботСписок",, ЭтаФорма);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПродолжение() Экспорт
	//1. Вначале это код исполняется!!!.
	
	// TODO в обработках делается по команде SETCONNECTIONINFO
	СтатусВерсии = ПолучитьИнформациюОВерсииПоУмолчанию();
	СтатусВерсии = ПолучитьСтатусВерсииНаФорме(Ложь);
	ОбновитьИнформациюОВерсии(СтатусВерсии);
	
	//2. Затем этот. Хватит затирать.
	Попытка
		СформироватьАдресСоСлужебнымиПараметрами();
		ЭтаФорма.РазрешитьЗакрытиеФормы = Истина;//Установить в лож когда будет открыт редактор BLOKLY
		ПолучитьЭлементыФормы().АдресСтраницы.Подсказка = АдресСтраницыССлужебнымиПараметрами;
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		ОписаниеОшибки = СтруктураОшибки.message;
		ПоказатьОповещениеПользователя(
			"Ошибка", , ОписаниеОшибки,
			БиблиотекаКартинок["Ошибка32"]);
		Возврат;
	КонецПопытки;


	#Если ВебКлиент Тогда
		УстановитьРежимWebInWeb();
	#КонецЕсли
	
	ОбновитьПолеHTML("ПолеHTMLДокумента", АдресСтраницыССлужебнымиПараметрами); 
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЕстьЛиЕщеОткрытыеОкнаБраузера()
	ФормаНайдена = Ложь;
	
	//В режиме запуска ОбычноеПриложение возвращает Неопределено.
	ОкнаПриложения		= ПолучитьОкна();
	Если ОкнаПриложения = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	Для каждого ОкноПриложения Из ОкнаПриложения Цикл
		//При открытии формы окна в ПолучитьОкна
		Для Каждого ФормаОкна Из ОкноПриложения.Содержимое Цикл
			Попытка 
				//Пока тут только выбранная итератором форма - форма, но воизбежание в дальнейшем ошибок
				//обернём в исключением. Мы же не знаем, что туда может 1ц положить
				ФормаНайдена = Найти(ФормаОкна.ИмяФормы, ".Browser") > 0;
				Если ФормаНайдена Тогда Прервать; КонецЕсли;
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЦикла;
		Если ФормаНайдена Тогда Прервать; КонецЕсли;
	КонецЦикла;
	
	Возврат ФормаНайдена;
КонецФункции

#Область include_core_base_ОсобенностиПлатформы_УстановитьРежимWebInWeb
#КонецОбласти

#Область include_core_base_Helpers_ПоказатьОповещениеПользователя
#КонецОбласти

#Область include_core_base_БазовыеКомпоненты_Form_Browser_ОсобенностиПродукта
#КонецОбласти

#Область include_core_base_БазовыеКомпоненты_Form_Browser_СформироватьАдресСтраницы
#КонецОбласти

&НаКлиенте
Процедура ПоказатьЛог(Команда)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	ЭлементыФормочки.Лог.Видимость = НЕ ЭлементыФормочки.Лог.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВБуфферОбмена(Данные)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Окно = ЭлементыФормочки.Поле_HTML_Документа.Документ.ParentWindow;
	Окно.ClipboardData.SetData("Text", Данные);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЛог(Команда)
	Лог.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСправке(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

#Область include_core_base_Helpers_XDTO
#КонецОбласти

#Область include_core_base_БазовыеКомпоненты_Form_Browser_FormEventsHandler
#КонецОбласти

#Область include_core_base_БазовыеКомпоненты_Form_Browser_ProductEventsHandler
#КонецОбласти

#Область include_core_base_БазовыеКомпоненты_Form_Browser_BrowserEventsHandler
#КонецОбласти

#Область include_core_base_ЗапускМодуля_ПроверкаВерсии_НаФорме
#КонецОбласти

#Область include_core_base_БазовыеКомпоненты_Form_Browser_ОсобенностиПлатформы
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_Helpers_FormElementsHTML
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти

&НаКлиенте
Процедура ОткрытьФормуНастроек(Элемент) Экспорт    
	
	ЗаписатьНастройкиНаСервере();
	Форма = ФормаОсновнойОбработки("Настройки", ПутьКФормамОбработки(),,ЭтаФорма);
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
	МодульОбъекта().НастройкиПодключенияЗаписать(context_params);
КонецПроцедуры

&НаКлиенте
Функция ЭтотОбъектНаКлиенте() 
	Возврат ЭтаФорма;
КонецФункции


#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти
