
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПолеHTML(ИмяПоляHTML, Адрес)
	ЭлементыФормы[ИмяПоляHTML].Перейти(Адрес);
КонецПроцедуры

&НаКлиенте
Функция ЭлементСобытияПоляHTML(ДанныеСобытия)
	Возврат ДанныеСобытия.srcElement;
КонецФункции

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура();
	КонецЕсли;
	ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
КонецПроцедуры

Процедура ДомНажатие(Элемент)
	СформироватьАдресАддона();
	ЭлементыФормы.ПолеHTMLДокумента.Перейти(АдресСтраницыССлужебнымиПараметрами);
КонецПроцедуры

Процедура НалоговыйМониторингНажатие(Элемент)
	ЭтаФорма.АдресСтраницы = context_params.api_url+"/page/import-taxmon";
	СформироватьАдресСоСлужебнымиПараметрами();
	ЭлементыФормы.ПолеHTMLДокумента.Перейти(АдресСтраницыССлужебнымиПараметрами);
КонецПроцедуры


