
&НаКлиенте
Процедура _ПослеАутентификации(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Закрыть();
		Возврат;
	КонецЕсли;		
	ОбновитьСтраницу(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтраницу(Команда)
	#Если Не ВебКлиент Тогда
	АдресСтраницыССлужебнымиПараметрами = "";
	ОбновитьПолеHTML("ПолеHTMLДокумента", АдресСтраницыССлужебнымиПараметрами);
	
	Попытка
		СформироватьАдресСоСлужебнымиПараметрами();
		ПолучитьЭлементыФормы().АдресСтраницы.Подсказка = АдресСтраницыССлужебнымиПараметрами;
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		ОписаниеОшибки = СтруктураОшибки.detail;
		ПоказатьОповещениеПользователя(
			"Ошибка",,ОписаниеОшибки,
			БиблиотекаКартинок["Ошибка32"]);

		Возврат;
	КонецПопытки;
	
	ОбновитьПолеHTML("ПолеHTMLДокумента", АдресСтраницыССлужебнымиПараметрами);
	#КонецЕсли
КонецПроцедуры

