
&НаКлиенте
Процедура _ПослеАутентификации(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Закрыть();
		Возврат;
	КонецЕсли;		
	ОбновитьСтраницу(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтраницу(Команда)
	#Если Не ВебКлиент Тогда
	АдресСтраницыССлужебнымиПараметрами = "";
	ОбновитьПолеHTML("ПолеHTMLДокумента", АдресСтраницыССлужебнымиПараметрами);
	
	Попытка
		СформироватьАдресСоСлужебнымиПараметрами();
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		Если СтруктураОшибки.type = "Unauthorized" Тогда
			ВходяшиеПараметры	= Новый Структура("Метод", "ОбновитьСтраницу");
			ПроверкаВведенныхДанныхАутентификации = Новый ОписаниеОповещения("_ПослеАутентификации", ЭтаФорма, ВходяшиеПараметры);
			ОткрытьФормуОбработки("Вход",, ЭтаФорма,, ПроверкаВведенныхДанныхАутентификации);
		Иначе
			ОписаниеОшибки = СтруктураОшибки.detail;
			ПоказатьОповещениеПользователя(
				"Ошибка",,ОписаниеОшибки,
				БиблиотекаКартинок["Ошибка32"],
				СтатусОповещенияПользователя.Важное, Новый УникальныйИдентификатор);
		КонецЕсли;
		Возврат;
	КонецПопытки;
	
	ОбновитьПолеHTML("ПолеHTMLДокумента", АдресСтраницыССлужебнымиПараметрами);
	#КонецЕсли
КонецПроцедуры

