
&НаКлиенте
Процедура ОтложенноеЗакрытиеФормы() Экспорт
	ЭтаФорма.Закрыть(Истина);		
КонецПроцедуры

&НаКлиенте
Функция ОбработатьДействиеНаКлиенте(ИмяДействия, Параметры)
	ПараметрыВызова = DecodeXmlXdto(Параметры);
	Если ИмяДействия = "OpenForm" Тогда
		API_ADDON_OPENFORM(ПараметрыВызова);
		Результат = Неопределено;
	ИначеЕсли ИмяДействия = "OpenLink" Тогда
		Результат = API_ADDON_OPENURL(ПараметрыВызова);
	ИначеЕсли ИмяДействия = "SetConnectionInfo" Тогда
		Результат = API_ADDON_SETCONNECTIONINFO(ПараметрыВызова);
	ИначеЕсли ИмяДействия = "BlocklySaveIni" Тогда
		Результат = API_BLOCKLY_SAVE_INI(ПараметрыВызова);
	ИначеЕсли ИмяДействия = "ExecuteBlockly" Тогда		
		Результат = BlocklyExecutor.API_BLOCKLY_RUN(ПараметрыВызова);
	ИначеЕсли ИмяДействия = "ExecuteOperation" Тогда
		Попытка
			params = Новый Структура();
			EndpointArgs = ПараметрыВызова["Params"];
			params.Вставить("EndpointArgs", EndpointArgs);
			params.Вставить("Algorithm", EndpointArgs["algorithm"]);	
			params.Вставить("Endpoint", EndpointArgs["endpoint"]);
			params.Вставить("ContextId", EndpointArgs["operation_uuid"]);
			params.Вставить("ConnectionId", EndpointArgs["connection_uuid"]);
			МодульФоновогоЗаданияКлиент().ЗапуститьINIФоновымЗаданием(EndpointArgs["ini_name"],
				params, context_params, ЭтаФорма.ВладелецФормы, "Загрузка...");
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
			ПоказатьОповещениеПользователя("Ошибка",, СтруктураОшибки.message);
		КонецПопытки;
		Возврат Неопределено;
	ИначеЕсли ИмяДействия = "OnAuth" Тогда
#Область include_core_base_БазовыеКомпоненты_Form_Browser_AddURL
#КонецОбласти		
		ТранспортИнтеграции.API_ADDON_ONAUTH(ПараметрыВызова, ЭтаФорма.context_params);  
		Результат = Неопределено;
		Оповестить(ЛокализацияНазваниеПродукта()+"_ЗакрытиеФормыАвторизации", Новый Структура("АвторизацияУспешна", Истина));
		//Смысл такой. если мы зашли с целью авторизоваться то нам нужно закрыть форму сразу же после аворизации
		//А если была просто авторизация для продолжения работы на открытой странице, то форма не закрывается
		Если get_prop(ЭтаФорма.Параметры, "АвтоЗакрытиеФормы") = Истина Тогда
			ПодключитьОбработчикОжидания("ОтложенноеЗакрытиеФормы", 2, Истина);
		КонецЕсли;
	ИначеЕсли ИмяДействия = "AddonActionResponse" Тогда 
		Оповестить("AddonActionResponse",ПараметрыВызова, ЭтаФорма);
		Результат = Истина;
	Иначе
		Возврат ОбработатьДействие(ИмяДействия, ПараметрыВызова);	
	КонецЕсли;
	Возврат ПодготовитьРезультат(Результат);
КонецФункции 

&НаСервере
Функция ОбработатьДействие(Знач ИмяДействия, Знач ПараметрыВызова)
	МодульОбъекта = МодульОбъекта();
	Если ИмяДействия = "ExecuteCommands" Тогда
		Результат = МодульОбъекта.API_BLOCKLY_COMMANDS(ПараметрыВызова);
	ИначеЕсли ИмяДействия = "BlocklyUpdateIni" Тогда
		Результат = МодульОбъекта.API_BLOCKLY_UPDATE_INI(ПараметрыВызова);
	ИначеЕсли ИмяДействия = "DocumentsReadStatus" Тогда
		Результат = МодульОбъекта.API_DOCUMENT_READ_STATUS(ПараметрыВызова);
	ИначеЕсли ИмяДействия = "ReadSystemInfo" Тогда
		Результат = МодульОбъекта.API_ADDON_READSYSTEMINFO(ПараметрыВызова);
	ИначеЕсли ИмяДействия = "BrowserUpdateUrl" Тогда
		АдресСтраницы	= get_prop(ПараметрыВызова, "Url", АдресСтраницы);
		Результат = Истина;
	Иначе
		ВызватьИсключение NewExtExceptionСтрока(,"Неизвестная команда", ИмяДействия);
	КонецЕсли;
	Возврат ПодготовитьРезультат(Результат);
КонецФункции

&НаКлиенте
Процедура API_ADDON_OPENFORM(ПараметрыВызова)
	Ссылка = get_prop(ПараметрыВызова, "LINK");
	Если Ссылка = Неопределено Тогда
		ИдИС = get_prop(ПараметрыВызова, "ИдИС");
		Если ИдИС = Неопределено Тогда 
			ИдИС = get_prop(ПараметрыВызова, "Id");
		КонецЕсли;
		Если ИдИС = Неопределено Тогда
			Возврат;
		КонецЕсли;	
		ИмяИС = get_prop(ПараметрыВызова, "ИмяИС", "");
		Если ИмяИС = "" Тогда
			ИмяИС = get_prop(ПараметрыВызова, "Type", "");
		КонецЕсли;
		
		Если Найти(ИмяИС, ".") = 0 Тогда 
			ТипИС = get_prop(ПараметрыВызова, "ТипИС", ""); 
			ИмяИС = ТипИС + "." + ИмяИС;
		КонецЕсли;
		Ссылка = Новый Соответствие;
		Ссылка.Вставить("ИдИС", ИдИС);
		Ссылка.Вставить("ИмяИС", ИмяИС);
	КонецЕсли;
	Если ТипЗнч(Ссылка) = Тип("Соответствие") Тогда
		Ссылка = ПолучитьСсылкуПоИдИС(Ссылка["ИмяИС"], Ссылка["ИдИС"]);
	КонецЕсли;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		// BSLLS:UsingSynchronousCalls-off
		ОткрытьЗначение(Ссылка);
		// BSLLS:UsingSynchronousCalls-on
	#Иначе                 
		ПоказатьЗначение(,Ссылка);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Функция API_ADDON_SETCONNECTIONINFO(ПараметрыВызова)
	СтатусВерсииПродукта = get_prop(ПараметрыВызова, "ProductVersionStatus");
	Если СтатусВерсииПродукта <> Неопределено Тогда	
		СтатусВерсии = ПолучитьСтатусВерсииНаФорме(Ложь);
		ОбновитьИнформациюОВерсии(СтатусВерсии);
	КонецЕсли;
	Возврат "";
КонецФункции

&НаКлиенте
Функция API_BLOCKLY_SAVE_INI(ПараметрыВызова)
	Попытка
		ПараметрыВызова["Name"] = ?(Найти(ПараметрыВызова["Name"], "Blockly_") = 1, ПараметрыВызова["Name"], "Blockly_"+ПараметрыВызова["Name"]);
		ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохраненияФайла.ПолноеИмяФайла = ПараметрыВызова["Name"];
		ДиалогСохраненияФайла.Расширение = "xml"; 
		ДиалогСохраненияФайла.Фильтр = НСтр("ru='xml|*.xml'");
		ДиалогСохраненияФайла.Заголовок = НСтр("ru='Выберите файл'");
		ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
		Если ДиалогСохраненияФайла.Выбрать() Тогда 
			ПутьКФайлу = ДиалогСохраненияФайла.ПолноеИмяФайла;	
			ФайлИни = Новый ЗаписьТекста(ПутьКФайлу);
			ФайлИни.ЗаписатьСтроку(ПараметрыВызова["Value"]);
			ФайлИни.Закрыть();
		КонецЕсли;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, "Ошибка сохранения ini", ПараметрыВызова["Name"]));
	КонецПопытки;
	Возврат "";
КонецФункции

&НаКлиенте
Функция API_ADDON_OPENURL(ПараметрыВызова)
	Ссылка = get_prop(ПараметрыВызова, "Link");
	// BSLLS:UsingSynchronousCalls-off
	ЗапуститьПриложение(Ссылка);
	// BSLLS:UsingSynchronousCalls-on
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ДобавитьВЛог(Тип, Команда, Данные)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Если НЕ ЭлементыФормочки.Лог.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	СейчасВМилисекундах = ДатаВМиллисекундах();
	Сейчас = Дата(1, 1, 1) + СейчасВМилисекундах/1000;
	СейчасБезМилисекунд = Дата(Год(Сейчас), Месяц(Сейчас), День(Сейчас), Час(Сейчас), Минута(Сейчас), Секунда(Сейчас))- Дата(1,1,1);
	Милисекунды = СейчасВМилисекундах - СейчасБезМилисекунд * 1000;
	Время = Формат(Сейчас, "ДФ='mm:ss.'") + Формат(Милисекунды, "ЧЦ=3; ЧВН=; ЧГ=0");
	
	ЗаписьЛога = Лог.Вставить(0);
	ЗаписьЛога.Тип = Тип;
	ЗаписьЛога.Время = Время;
	ЗаписьЛога.Команда = Команда;
	ЗаписьЛога.Данные = Данные;
КонецПроцедуры


