
&НаКлиенте
Процедура ПослеОтветаНаВопросОЗакрытииФормы(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.РазрешитьЗакрытиеФормы = Истина;
		Закрыть();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы <> Истина И Не РазрешитьЗакрытиеФормы Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗакрытииФормы", ЭтотОбъектНаКлиенте());
		ПоказатьВопрос(
			Оповещение,
			"При закрытии пропадут все не сохраненные данные, продолжить закрытие?",
			РежимДиалогаВопрос.ДаНет,
			0,
			КодВозвратаДиалога.Нет,
			"Подтвердите закрытие формы.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПолеHTML(ИмяПоляHTML, Адрес)
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Функция ЭлементСобытияПоляHTML(ДанныеСобытия)
	Возврат ДанныеСобытия.Element;
КонецФункции

#Область include_base_НазваниеПродукта
#КонецОбласти

#Область include_core_base_ПроверкаВерсии_ПолучитьИмяФайлаИНомерТекущейВерсии
#КонецОбласти

#Область include_core_base_ExtException
#КонецОбласти

#Область include_core_base_Helpers
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти
