
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// только для обработки
	МодульОбъекта = МодульОбъекта();
	
	Параметры.Свойство("context_params", context_params);
	// авторизация, корректный домен в context_params переданных параметрах
	Если Не ЗначениеЗаполнено(context_params) Тогда
		context_params = МодульОбъекта.НастройкиПодключенияПрочитать();
	КонецЕсли;
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	
	ДобавитьИнформациюОВерсии(ЭлемФормы.ВерсияПродукта);
	Заголовок = "";
	Параметры.Свойство("Заголовок", Заголовок);
	Заголовок = Заголовок +" "+ ЛокализацияНазваниеПродукта();
	АдресСтраницы	= "";
	Параметры.Свойство("АдресСтраницы", АдресСтраницы);
	Если ПустаяСтрока(АдресСтраницы) Тогда
		СформироватьАдресАддона();
	КонецЕсли;
	Если Параметры.Свойство("context_param") Тогда
		// При авторизхации НастройкиПодключенияПрочитать может вернуть НЕОПРЕДЕЛЕНО, да и выбранный домен на форме авторизации отличается
		ЭтаФорма.context_params = Параметры.context_param;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьАдресLPP(Адрес, Префикс, Домен, GostTls)
	Если GostTls Тогда 
		Префикс = СтрЗаменить(Префикс, "online-", "online-g-");
		Адрес = СтрЗаменить(Адрес, "g.saby", Префикс + Домен);
	Иначе
		Адрес = СтрЗаменить(Адрес, "online.", Префикс);
		Адрес = СтрЗаменить(Адрес, "online-lpp1c.setty.kz", "lpp1c.setty.kz");
	КонецЕсли;
	// Удалить после 25.5100
	Адрес = СтрЗаменить(Адрес, "ie-1c.saby", Префикс + Домен);
	Адрес = СтрЗаменить(Адрес, "ieg-1c.sbis", Префикс + Домен);
	Адрес = СтрЗаменить(Адрес, "ie-1c.setty", Префикс + Домен);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАдресАддона()
	МодульОбъекта = МодульОбъекта();
	api_url = get_prop(context_params, "api_url", МодульОбъекта.ПолучитьСервисПоУмолчанию());
	ЭтаФорма.АдресСтраницы = api_url + "/addon4/page/";
КонецПроцедуры

Функция УрлСКорректнымиСимволамиПеременных(Знач ИсходныйУРЛ)
	ИсходныйУРЛ = СтрЗаменить(ИсходныйУРЛ, "?&", "?");
	ИсходныйУРЛ = СтрЗаменить(ИсходныйУРЛ, "??", "?");
	ИсходныйУРЛ = СтрЗаменить(ИсходныйУРЛ, "&&", "&");
	Результат = ИсходныйУРЛ;
	НовыйУРЛМассивом = Новый Массив;
	
	// Привести URL к корректному виду, Первый перефикс параметров в URL должен быть "?"
	мУРЛ1гоУровня = СтрРазделитьПодстрокой(ИсходныйУРЛ, "://");
	
	Для Каждого СтрокаАдреса Из мУРЛ1гоУровня Цикл
		СтрокаАдреса = СтрЗаменить(СтрокаАдреса, "?", "&");
		НомерПервогоЗнВопр = Найти(СтрокаАдреса, "&");
		Если НомерПервогоЗнВопр > 0 Тогда
			СтрокаАдреса = Лев(СтрокаАдреса, НомерПервогоЗнВопр-1) +
							"?" + Сред(СтрокаАдреса, НомерПервогоЗнВопр+1);
		КонецЕсли;
		НовыйУРЛМассивом.Добавить(СтрокаАдреса);
	КонецЦикла;
	Результат = СтрСоединить82(НовыйУРЛМассивом, "://");
	Возврат Результат;
КонецФункции

&НаСервере
Процедура СформироватьАдресСоСлужебнымиПараметрамиНаСервере(Знач Тикет=Неопределено)
	//МодульОбъекта = МодульОбъекта();
	
	
   	
КонецПроцедуры	

&НаКлиенте
Процедура СформироватьАдресСоСлужебнымиПараметрами()
	АдресСтраницыССлужебнымиПараметрами = АдресСтраницы;
	Если Не ЭтоАдресСБИС(АдресСтраницы) Тогда
		Возврат;
	КонецЕсли;
	ЭтаФорма.РазрешитьЗакрытиеФормы = Истина;//Установить в лож когда будет открыт редактор BLOKLY
	Если Найти(АдресСтраницыССлужебнымиПараметрами,"?") = 0 Тогда
		АдресСтраницыССлужебнымиПараметрами = АдресСтраницыССлужебнымиПараметрами + "?";
	КонецЕсли;
	ДобавитьСлужебныйПараметр(АдресСтраницыССлужебнымиПараметрами, "nocheck", "1");
	ДобавитьСлужебныйПараметр(АдресСтраницыССлужебнымиПараметрами, "ext_connector", Коннектор);
	ДобавитьСлужебныйПараметр(АдресСтраницыССлужебнымиПараметрами, "ext_command_connector", Коннектор);
	ДобавитьСлужебныйПараметр(АдресСтраницыССлужебнымиПараметрами, "ext_seance", Строка(Новый УникальныйИдентификатор()));
	АдресСтраницыССлужебнымиПараметрами = УрлСКорректнымиСимволамиПеременных(АдресСтраницыССлужебнымиПараметрами);
	ПолучитьЭлементыФормы().АдресСтраницы.Подсказка = АдресСтраницыССлужебнымиПараметрами;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСлужебныйПараметр(Адрес, ИмяПараметра, ЗначениеПараметра)
	Адрес = Адрес + "&" + ИмяПараметра + "=" + ЗначениеПараметра;
КонецПроцедуры


&НаСервере
Функция ЭтоАдресСБИС(Адрес)
	Если Найти(Адрес, ".sbis.ru") > 0 ИЛИ  Найти(Адрес, ".saby.ru") > 0  ИЛИ  Найти(Адрес, ".sabytest.ru") > 0 
		ИЛИ  Найти(Адрес, ".setty.kz") > 0 ИЛИ  Лев(Адрес, 16) = "http://localhost" Тогда
		Возврат Истина;
	Иначе
		Сообщить("Браузер открывает только сервера "+ЛокализацияНазваниеПродукта()+" или localhost (" + Адрес + ")");
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "SabySignOut" Тогда
		Закрыть();
	ИначеЕсли ИмяСобытия = "Saby_ЗавершениеДлительнойОперации" Тогда
		Результат = ПодготовитьРезультат(Параметр);
		ВернутьРезультат(Результат);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПунктовМенюОтНаличияФорм(ИмяПунктаМеню, ИмяФормы)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Попытка
		ФормаОсновнойОбработки(ИмяФормы, ПутьКФормамОбработки(),,ЭтаФорма);
	Исключение
		Если ЭлементыФормочки.Найти(ИмяПунктаМеню) <> Неопределено Тогда
			ЭлементыФормочки[ИмяПунктаМеню].Видимость = Ложь;
		КонецЕсли;	
	КонецПопытки; 	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// BSLLS:UnusedLocalVariable-off Переменные формы
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();
	
	Префикс = "";
	
	УстановитьВидимостьПунктовМенюОтНаличияФорм("Настройки", "Настройки");
	УстановитьВидимостьПунктовМенюОтНаличияФорм("АвтоматическиеОперации", "РоботСписок");
	
	GostTls = get_prop(context_params, "GostTls", Ложь);
	Domain = Нрег(get_prop(context_params, "Domain", "saby"));
	#Если ВебКлиент Тогда 
		Коннектор = "1c-dom";
	#Иначе
	web_interface = get_prop(context_params, "web_interface");
	Если web_interface = "BrowserSabyPlugin" Тогда
		Префикс = "http://localhost:9100/?pool=ExtLongPollingProxy&method=ExtLongPollingProxy.UI&id=0&protocol=6&params=eyJwYXRoIjogImluZGV4MUMuaHRtbCJ9&target=";  
		Коннектор = "1c-lpp";
	Иначе //web_interface = "BrowserSaby"
		api_url = get_prop(context_params, "api_url");
		Префикс = api_url + "/long_polling_proxy/service/?pool=ExtLongPollingProxy&method=LongPollingProxy.UI&id=0&protocol=6&params=eyJwYXRoIjogImluZGV4MUMuaHRtbCJ9&target=";
		Коннектор = "1c-lppbl";
	КонецЕсли;
	#КонецЕсли
	АдресСтраницы = Префикс + АдресСтраницы;
	// BSLLS:UnusedLocalVariable-on
	ПодключитьОбработчикОжидания("ПриОткрытииПродолжение", 1, Истина);	
КонецПроцедуры
