
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// только для обработки
	МодульОбъекта = МодульОбъекта();
	
	Параметры.Свойство("context_params", context_params);
	// авторизация, корректный домен в context_params переданных параметрах
	Если Не ЗначениеЗаполнено(context_params) Тогда
		context_params = МодульОбъекта.НастройкиПодключенияПрочитать();
	КонецЕсли;
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	
	ДобавитьИнформациюОВерсии(ЭлемФормы.ВерсияПродукта);
	// BSLLS:UnusedLocalVariable-off
	Заголовок = "Транспортная страница";
	// BSLLS:UnusedLocalVariable-on
	Если get_prop(context_params, "ApiUrl") = Неопределено Тогда
		СервисПоУмолчанию = МодульОбъекта.СервисПоУмолчанию();
		context_params.Вставить("ApiUrl", СервисПоУмолчанию);
	КонецЕсли;
	АдресСтраницы	= "";
	Параметры.Свойство("АдресСтраницы", АдресСтраницы);
	Если ПустаяСтрока(АдресСтраницы) Тогда
		СформироватьАдресАддона();
	КонецЕсли;
	Если Параметры.Свойство("context_param") Тогда
		// При авторизхации НастройкиПодключенияПрочитать может вернуть НЕОПРЕДЕЛЕНО, да и выбранный домен на форме авторизации отличается
		ЭтаФорма.context_params = Параметры.context_param;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьАдресLPP(Адрес, Префикс, Домен, GostTls)
	Если GostTls Тогда 
		Префикс = СтрЗаменить(Префикс, "online-", "online-g-");
		Адрес = СтрЗаменить(Адрес, "g.saby", Префикс + Домен);
	Иначе
		Адрес = СтрЗаменить(Адрес, "online.", Префикс);
		Адрес = СтрЗаменить(Адрес, "online-lpp1c.setty.kz", "lpp1c.setty.kz");
	КонецЕсли;
	// Удалить после 25.5100
	Адрес = СтрЗаменить(Адрес, "ie-1c.saby", Префикс + Домен);
	Адрес = СтрЗаменить(Адрес, "ieg-1c.sbis", Префикс + Домен);
	Адрес = СтрЗаменить(Адрес, "ie-1c.setty", Префикс + Домен);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАдресАддона()
	api_url = get_prop(context_params, "ApiUrl");
	ЭтаФорма.АдресСтраницы = api_url + "/addon4/page/";
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = НазваниеПродукта() + "SabySignOut" Тогда
		Закрыть();
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПунктовМенюОтНаличияФорм(ИмяПунктаМеню, ИмяФормы)
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Попытка
		ФормаОсновнойОбработки(ИмяФормы, ПутьКФормамОбработки(),,ЭтаФорма);
	Исключение
		Если ЭлементыФормочки.Найти(ИмяПунктаМеню) <> Неопределено Тогда
			ЭлементыФормочки[ИмяПунктаМеню].Видимость = Ложь;
		КонецЕсли;	
	КонецПопытки; 	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// BSLLS:UnusedLocalVariable-off Переменные формы
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();
	
	Префикс = "";
	
	УстановитьВидимостьПунктовМенюОтНаличияФорм("Настройки", "Настройки");
	УстановитьВидимостьПунктовМенюОтНаличияФорм("АвтоматическиеОперации", "РоботСписок");
	
	GostTls = get_prop(context_params, "GostTls", Ложь);
	Domain = Нрег(get_prop(context_params, "Domain", "saby"));
	АдресСтраницы = СформироватьАдресСтраницы();
	// BSLLS:UnusedLocalVariable-on
	ПодключитьОбработчикОжидания("ПриОткрытииПродолжение", 1, Истина);	
КонецПроцедуры

