Функция УрлСКорректнымиСимволамиПеременных(Знач ИсходныйУРЛ)
	ИсходныйУРЛ = СтрЗаменить(ИсходныйУРЛ, "?&", "?");
	ИсходныйУРЛ = СтрЗаменить(ИсходныйУРЛ, "??", "?");
	ИсходныйУРЛ = СтрЗаменить(ИсходныйУРЛ, "&&", "&");
	Результат = ИсходныйУРЛ;
	НовыйУРЛМассивом = Новый Массив;
	
	// Привести URL к корректному виду, Первый перефикс параметров в URL должен быть "?"
	мУРЛ1гоУровня = СтрРазделитьПодстрокой(ИсходныйУРЛ, "://");
	
	Для Каждого СтрокаАдреса Из мУРЛ1гоУровня Цикл
		СтрокаАдреса = СтрЗаменить(СтрокаАдреса, "?", "&");
		НомерПервогоЗнВопр = Найти(СтрокаАдреса, "&");
		Если НомерПервогоЗнВопр > 0 Тогда
			СтрокаАдреса = Лев(СтрокаАдреса, НомерПервогоЗнВопр-1) +
							"?" + Сред(СтрокаАдреса, НомерПервогоЗнВопр+1);
		КонецЕсли;
		НовыйУРЛМассивом.Добавить(СтрокаАдреса);
	КонецЦикла;
	Результат = СтрСоединить82(НовыйУРЛМассивом, "://");
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СформироватьАдресСоСлужебнымиПараметрами()
	АдресСтраницыССлужебнымиПараметрами = АдресСтраницы;
	Если Не ЭтоАдресСБИС(АдресСтраницы) Тогда
		Возврат;
	КонецЕсли;
	Если Найти(АдресСтраницыССлужебнымиПараметрами,"?") = 0 Тогда
		АдресСтраницыССлужебнымиПараметрами = АдресСтраницыССлужебнымиПараметрами + "?";
	КонецЕсли;
	ДобавитьСлужебныйПараметр(АдресСтраницыССлужебнымиПараметрами, "nocheck", "1");
	ДобавитьСлужебныйПараметр(АдресСтраницыССлужебнымиПараметрами, "ext_connector", Коннектор);
	ДобавитьСлужебныйПараметр(АдресСтраницыССлужебнымиПараметрами, "ext_command_connector", Коннектор);
	ДобавитьСлужебныйПараметр(АдресСтраницыССлужебнымиПараметрами, "ext_seance", Строка(Новый УникальныйИдентификатор()));
	АдресСтраницыССлужебнымиПараметрами = УрлСКорректнымиСимволамиПеременных(АдресСтраницыССлужебнымиПараметрами);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСлужебныйПараметр(Адрес, ИмяПараметра, ЗначениеПараметра)
	Адрес = Адрес + "&" + ИмяПараметра + "=" + ЗначениеПараметра;
КонецПроцедуры


&НаСервере
Функция ЭтоАдресСБИС(Знач Адрес)
	мЛегитимныеДомены = Новый Массив;
	мЛегитимныеДомены.Добавить(".sbis.ru");
	мЛегитимныеДомены.Добавить(".saby.ru");
	мЛегитимныеДомены.Добавить(".sabyd.ru");
	мЛегитимныеДомены.Добавить(".sabytest.ru");
	мЛегитимныеДомены.Добавить(".setty.kz");
	
	Если Лев(Адрес, 16) = "http://localhost" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого ПроверяемыйДомен из мЛегитимныеДомены Цикл
		Если Найти(Адрес, ПроверяемыйДомен) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Сообщить("Браузер открывает только сервера "+ЛокализацияНазваниеПродукта()+" или localhost (" + Адрес + ")");
	Возврат Ложь;
КонецФункции

// BSLLS:UnusedLocalVariable-off

&НаКлиенте
Функция СформироватьАдресСтраницы()
	Префикс = "";
	#Если ВебКлиент Тогда 
		Коннектор = "1c-dom";
	#Иначе
	web_interface = get_prop(context_params, "web_interface");
	Если web_interface = "BrowserSabyPlugin" Тогда
		Префикс = "http://localhost:9100/?pool=ExtLongPollingProxy&method=ExtLongPollingProxy.UI&id=0&protocol=6&params=eyJwYXRoIjogImluZGV4MUMuaHRtbCJ9&target=";  
		Коннектор = "1c-lpp";
	Иначе //web_interface = "BrowserSaby"
		api_url = get_prop(context_params, "ApiUrl");
		Префикс = Строка(api_url) + "/long_polling_proxy/service/?pool=ExtLongPollingProxy&method=LongPollingProxy.UI&id=0&protocol=6&params=eyJwYXRoIjogImluZGV4MUMuaHRtbCJ9&target=";
		Коннектор = "1c-lppbl";
	КонецЕсли;
	#КонецЕсли
	АдресСтраницы = Префикс + АдресСтраницы;
	Возврат АдресСтраницы;
КонецФункции

// BSLLS:UnusedLocalVariable-on

