&НаКлиенте
// BSLLS:ExportVariables-off
Перем ТранспортИнтеграции, BlocklyExecutor Экспорт;
// BSLLS:ExportVariables-on

#Область include_core_base_ЭДО_Form_ВыполнитьДействие_ОсобенностиПродукта
#КонецОбласти

#Область include_core_base_ЭДО_Form_ВыполнитьДействие_УстановитьЛокализацию
#КонецОбласти

#Область include_core_base_ЭДО_Form_ВыполнитьДействие_ОсобенностиПродуктаМетодыФормы
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключенияНаСервере
#КонецОбласти

#Область МетодыФормы

&НаКлиенте
Процедура ДобавитьИсполнителя(Команда)
	ДобавитьСотрудника(Команда);
КонецПроцедуры

&НаКлиенте
Процедура СписокИсполнителейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокДействийСБИС(Документ)
	СписокДействий = ПолучитьСписокДействийИзОбъектаДокументСБИС(Документ);
	Если СписокДействий = Неопределено Тогда
		Если context_params = Неопределено Тогда
			Параметры.Свойство("context_params", context_params);
			Если context_params = Неопределено Тогда
				context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
			КонецЕсли;
		КонецЕсли;
		ДокументСБИС = ТранспортИнтеграции.local_helper_read_document(context_params, Новый Структура("Идентификатор", Документ.Идентификатор));
		ЭтаФорма.ТипСБИС	= get_prop(ДокументСБИС, "Тип", "");
		СписокДействий = ПолучитьСписокДействийИзОбъектаДокументСБИС(ДокументСБИС);
	КонецЕсли;
	Возврат СписокДействий;
КонецФункции

&НаКлиенте
Функция ПолучитьСписокДействийИзОбъектаДокументСБИС(Документ)
	Попытка
		Возврат Документ["Этап"][0]["Действие"];
	Исключение
		Возврат Неопределено;
	КонецПопытки
КонецФункции


&НаКлиенте
Процедура ПереотправитьДокумент(Команда)
	//TODO обновить списко после зартытия - ЗагрузкаДокументов
	//ДопПараметры = Новый Структура("ПараметрКоманды", ПараметрКоманды);
	//ОповешениеОЗакрытии = Новый ОписаниеОповещения("ПослеОтправитьВСБИС", Saby_КомандыОбменаДляФормыКлиент, ДопПараметры);
		
	ДокументПереотправить = Новый Массив;
	Для Каждого ДокументДляДействия Из ПараметрыВызова["Документы"] Цикл
		Если ДокументДляДействия["Документ1С"] <> Неопределено Тогда
			ДокументПереотправить.Добавить(СтруктураВыгрузкиДокумента(ДокументДляДействия["Документ1С"]));
		КонецЕсли;
	КонецЦикла;
	ПараметрыВФорму = Новый Структура();
	ПараметрыВФорму.Вставить("Источник", ДокументПереотправить);
	ПараметрыВФорму.Вставить("ПерезапуститьДО", Истина);
	ОткрытьФормуОбработки("ЗагрузкаДокументов", ПараметрыВФорму,ЭтаФорма.ВладелецФормы);
	Закрыть();
КонецПроцедуры

&НаСервере
Функция СтруктураВыгрузкиДокумента(Знач Документ1С)
	Возврат Новый Структура("Ссылка,UID,ТипМетаданных,ВидОбъекта,ИмяИни", 
							Документ1С.Ссылка,
							Неопределено,
							Документ1С.Ссылка.Метаданные().Имя,
							Неопределено,
							Неопределено); 	
КонецФункции	

&НаСервере
Функция ПолучитьПечатныеФормыНаСервере(Знач СсылкаНаОбъект, Знач Вложения = Неопределено, Знач БезСодержимого = Ложь)
    МодульОбработки = МодульОбъекта();
	Возврат МодульОбработки.ПолучитьПечатныеФормы(СсылкаНаОбъект, Вложения, БезСодержимого);
КонецФункции

&НаСервереБезКонтекста
Функция ИмяМетаданных(Знач СсылкаНаОбъект)
	Возврат СсылкаНаОбъект.Метаданные().Имя;
КонецФункции

&НаКлиенте
Функция ТипSabyПоТипуApi(ТипApi)
	СловарьSabyвApi3 = Новый Соответствие;
	СловарьSabyвApi3.Вставить("Allowance", "Больничный");
	СловарьSabyвApi3.Вставить("СлужЗап", "Задача");
	СловарьSabyвApi3.Вставить("АвансОтчёт", "АвансовыйОтчёт");
	СловарьSabyвApi3.Вставить("АвансОтчет", "АвансовыйОтчет");
	СловарьSabyвApi3.Вставить("ВнутрПрм", "ВнутреннееПеремещение");
	СловарьSabyвApi3.Вставить("ВыдачаЗарплаты", "ДоговорДок");
	СловарьSabyвApi3.Вставить("Договор", "PriceChange");
	СловарьSabyвApi3.Вставить("PriceChange", "ИзменениеЦен");
	СловарьSabyвApi3.Вставить("Номенклатура", "ПоказательОстатокНаСкладе");
	СловарьSabyвApi3.Вставить("ДокОтгрВх", "Поступление");
	СловарьSabyвApi3.Вставить("Прайсы", "Прайс");
	СловарьSabyвApi3.Вставить("ДокОтгрИсх", "Реализация");
	СловарьSabyвApi3.Вставить("СчетИсх", "СчетНаОплату");
	СловарьSabyвApi3.Вставить("УдержанияПоЗарплате", "УдержаниеПоЗарплате");
	СловарьSabyвApi3.Вставить("ШтатнаяДолжность", "ШтатноеРасписание");
	СловарьSabyвApi3.Вставить("Согласование", "ГрафикОтпусков");
	СловарьSabyвApi3.Вставить("CadresOther", "ПрочийКадровыйДокумент");
	СловарьSabyвApi3.Вставить("НачисленияПоЗарплате", "НачислениеПоЗарплате");
	СловарьSabyвApi3.Вставить("PlanVacationScheduleChange", "ПереносОтпусков");
	СловарьSabyвApi3.Вставить("ТабельДокумент", "Табель");
	СловарьSabyвApi3.Вставить("ИзмененияОклада", "ИзменениеУсловийОплаты");
	СловарьSabyвApi3.Вставить("Indexation", "ИндексацияЗаработка");
	СловарьSabyвApi3.Вставить("GphAct", "АктПриемки");
	СловарьSabyвApi3.Вставить("CombinationPositions", "СовмещениеДолжностей");
	СловарьSabyвApi3.Вставить("BusinessTrip", "СписочнаяКомандировка");
	СловарьSabyвApi3.Вставить("GphContract", "ПриемНаРаботуГПХ");
	СловарьSabyвApi3.Вставить("CombinationCancel", "ОтменаСовмещенияДолжностей");
	СловарьSabyвApi3.Вставить("BTCorrection", "КорректировкаСписочнойКомандировки");
	СловарьSabyвApi3.Вставить("TimesheetCorrection", "КорректировкаТабеля");
	СловарьSabyвApi3.Вставить("РеалВх", "Поступление");
	СловарьSabyвApi3.Вставить("StaffStatements", "Заявление");
	Результат = СловарьSabyвApi3.Получить(ТипApi);
	Если Результат = Неопределено Тогда
		Результат = "ПрочийКадровыйДокумент";
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИсториюОбмена(РезультатЗаписиВложений, НаименованиеДокумента, objects, begin, end)
	_Вложения = Новый Массив;
	Для Каждого РезультатВложение Из РезультатЗаписиВложений.Получить("Вложение")  Цикл
		_Вложение = Новый Соответствие;
		_Вложение.Вставить("Название", РезультатВложение.Получить("Название"));
		_Вложение.Вставить("Файл", РезультатВложение.Получить("Файл"));
		_Вложения.Добавить(_Вложение);
	КонецЦикла;
	
	ТипSaby = ТипSabyПоТипуApi(РезультатЗаписиВложений.Получить("Тип"));
	
	_actions = Новый Массив;
	action = Новый Структура;
	elapsedTime = end - begin;
	СЕКУНДА = 1000;
	action.Вставить("Begin", Формат(Дата(1, 1, 1) + begin / СЕКУНДА, "ДФ='yyyy-MM-dd HH:mm:ss'") + "." + (begin % СЕКУНДА));
	action.Вставить("End", Формат(Дата(1, 1, 1) + end / СЕКУНДА, "ДФ='yyyy-MM-dd HH:mm:ss'") + "." + (end % СЕКУНДА));
	action.Вставить("Title", "Загрузка вложений");
	action.Вставить("ElapsedTime", elapsedTime);
	action.Вставить("Status", 0);
	action.Вставить("Subtitle", ТипSaby);
	_actions.Добавить(action);
	
	_data_is = Новый Соответствие;
	_data_is.Вставить("Вложение", _Вложения);
	_data = Новый Соответствие;
	_data.Вставить("data_is", _data_is);
	_data.Вставить("name", НаименованиеДокумента);
	_data.Вставить("ini_name", "");
	
	_ExtSyncObj = Новый Соответствие;
	
	_ExtSyncObj.Вставить("Title", НаименованиеДокумента);
	_ExtSyncObj.Вставить("StatusId", "Синхронизирован");
	_ExtSyncObj.Вставить("SbisType", ТипSaby);
	_ExtSyncObj.Вставить("Actions",_actions);
	_ExtSyncObj.Вставить("Data", _data);
	objects.Добавить(_ExtSyncObj);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВложенияНаКлиенте(context_params)
    
	Если ТипЗнч(Параметры.СписокДокументовСБИС) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
    Для Каждого ОбновлДок Из Параметры.СписокДокументовСБИС Цикл
		ВидОбъекта = Неопределено;
		ВложенияДляДокумента = Новый Массив();
	    //ПечатныеФормы    = МодульОбработки.ЗаполнитьСтруктуруПечатныхФормДляПередачи(ВложенияПоТипамОбъектов1С);
	     
        Попытка
			ИмяЗапроса = "";
			// ВложенияПоТипамОбъектов1С - Это имя реквизита формы
			ВыбранныеПечатныеФормы = ЗаполнитьСтруктуруПечатныхФормДляПередачиНаСервере(ИмяЗапроса);
			Документ1СОбновлДок = get_prop(ОбновлДок,"Документ1С",Неопределено);
			Если Документ1СОбновлДок <> Неопределено Тогда
				ВидОбъекта = ИмяМетаданных(Документ1СОбновлДок);
			Иначе			
				ВидОбъекта = "БезОбъекта";
			КонецЕсли;
			ВложенияДляДокумента = ?(ВыбранныеПечатныеФормы.Свойство(ВидОбъекта),ВыбранныеПечатныеФормы[ВидОбъекта],Новый Массив);
        
			ДокИВложения    = Новый Структура;
            Идентификатор = get_prop(ОбновлДок,"Идентификатор","");
			ДокИВложения.Вставить("Идентификатор", Идентификатор);
			ДокИВложения.Вставить("Вложение", Новый Массив);
			ВложенияДляДокумента = ПолучитьПечатныеФормыНаСервере(Документ1СОбновлДок, ВложенияДляДокумента);
			Для Каждого ПФ_ Из ВложенияДляДокумента Цикл
                
                ВложениеДок = Новый Структура;
                //ВложениеДок.Вставить("Тип", "ДокументОж");
                ВложениеДок.Вставить("Название", ПФ_.Название);
                ВложениеДок.Вставить("Файл", ПФ_.Файл);        
                
                ДокИВложения.Вложение.Добавить(ВложениеДок);
            КонецЦикла;
            ИмяЗапроса = "Вложения_"+Идентификатор;	
            begin = ТекущаяУниверсальнаяДатаВМиллисекундах();
			РезультатЗаписиВложений = ЗаписатьВложенияНаСайт(context_params, ДокИВложения, ИмяЗапроса);
			end = ТекущаяУниверсальнаяДатаВМиллисекундах();
			objects = Новый Массив;
			НаименованиеДокумента = Строка(ОбновлДок.Документ1С);
			ЗаполнитьИсториюОбмена(РезультатЗаписиВложений, НаименованиеДокумента, objects, begin, end);
			ИдентификаторОтчета = Новый УникальныйИдентификатор();

			ТранспортИнтеграции.local_helper_extsyncdoc_write(
				context_params,
				context_params.ConnectionId, 
				Новый Структура("Uuid", Строка(ИдентификаторОтчета)),
				objects);
				
			ТранспортИнтеграции.local_helper_extsyncdoc_execute_lrs(
				context_params, 
				Строка(ИдентификаторОтчета), 
				1);
        Исключение
            ИнфОбОшибке = ИнформацияОбОшибке();
			ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
			Если ОшибкаСтруктура.type = "AddonRequest" Тогда  
				ОшибкаСтруктура.dump.Вставить("ИмяЗапроса", ИмяЗапроса);
				ВызватьИсключение NewExtExceptionСтрока(,"AddonRequest",,,ОшибкаСтруктура.dump, "AddonRequest");;
			КонецЕсли;
            СтруктураОшибки    = ExtExceptionAnalyse(ИнфОбОшибке);
            ExtExceptionToJournal(СтруктураОшибки);
            ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке));
        КонецПопытки;
    КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область РасчётINI

&НаКлиенте
Процедура ЗарегистрироватьДействия(context_params, МассивУспехов, МассивОшибок) 
	Если МассивОшибок.Количество() > 0 Тогда
		ТранспортИнтеграции.local_helper_register_actions(context_params, МассивОшибок);
 	КонецЕсли;
	Если МассивУспехов.Количество() > 0 Тогда
		ТранспортИнтеграции.local_helper_register_actions(context_params, МассивУспехов);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыполненияINI(Результат)
	Если get_prop(Результат["data"],"ОбъектовСОшибками", 0) > 0 Тогда
		Результат.status = "error";
		Результат["data"].Вставить("message", "Не удалось выполнить действие. Возникла ошибка");
		data = get_prop(Результат,"data"); 
		ДокументыСБИС =get_prop(data,"Результат"); 
		detail = "";
		Если ТипЗнч(ДокументыСБИС) = Тип("Массив") Тогда
			Для Каждого Запись Из ДокументыСБИС Цикл
				ДокументСбис = get_prop(Запись,"ДокументСБИС");
				messagedoc = get_prop(ДокументСбис,"message","");
				detaildoc = get_prop(ДокументСбис,"detail","");
				detail = ?(detaildoc = "","",detaildoc+": ")+messagedoc+"; ";
			КонецЦикла;	
		КонецЕсли;
		Результат["data"].Вставить("detail", detail);
	КонецЕсли;
	
	code			= 500;
	data			= get_prop(Результат, "data");
	error_detail	= get_prop(data, "detail");
	error_name	= get_prop(data, "message", "");
 	ВсегоОбъектов	= get_prop(data, "ВсегоОбъектов", 0);
	НаименованиеДействия = "EdoAction";
	
	МассивОшибок	= Новый Массив;
	МассивУспехов	= Новый Массив;
	
	ДокументыМассив	= get_prop(data, "Результат");
	Если ДокументыМассив = Неопределено Тогда
		//Ошибка
		ЭлементСтатистики	= ТранспортИнтеграции.local_helper_element_err(НаименованиеДействия, ТипСБИС, error_name, error_detail, data, code, ВсегоОбъектов);
    	МассивОшибок.Добавить(ЭлементСтатистики);
    ИначеЕсли ТипЗнч(ДокументыМассив) = Тип("Массив") Тогда
        //Корректное завершение
        Для каждого ДокЭлемент Из ДокументыМассив Цикл
        	ДанныеДокументаСБИС	= get_prop(ДокЭлемент, "ДокументСБИС");
        	ТипСБИС	= get_prop(ДанныеДокументаСБИС, "Тип", "");
			ЭлементСтатистики	= ТранспортИнтеграции.local_helper_element_action(НаименованиеДействия, ТипСБИС, Новый Структура(), 1);
 			МассивУспехов.Добавить(ЭлементСтатистики);
		КонецЦикла;
	Иначе
		МассивОшибок	= Новый Массив;
		МассивУспехов	= Новый Массив;	
	КонецЕсли;
	
	ЗарегистрироватьДействия(context_params, МассивУспехов, МассивОшибок);

КонецПроцедуры	

&НаКлиенте
Функция Saby_Команда_ВыполнитьINI(ПараметрыМетода, ДополнительныеПараметры )
	context_params	= get_prop(ПараметрыМетода, "context_params");
	ini_name 		= get_prop(ПараметрыМетода, "ini_name", "");
	Результат = Неопределено;
	Если context_params = Неопределено Тогда
		context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	КонецЕсли;
	
	ПараметрыВызоваБлокли	= Новый Соответствие();
	ПараметрыВызоваБлокли.Вставить("params", context_params );
	ПараметрыВызоваБлокли.Вставить("commands_result", get_prop(ДополнительныеПараметры, "commands_result", Новый Массив));
	ПараметрыВызоваБлокли.Вставить("current_block", get_prop(ДополнительныеПараметры, "step", Неопределено));
	ПараметрыВызоваБлокли.Вставить("endpoint","");
	ПараметрыВызоваБлокли.Вставить("operation_uuid", СокрЛП(Новый УникальныйИдентификатор));
	ПараметрыВызоваБлокли.Вставить("algorithm",ini_name);
	ConnectionId	= Неопределено;
	context_params.Свойство("ConnectionId", ConnectionId);
	ПараметрыВызоваБлокли.Вставить("connection_uuid", ConnectionId);
	ПараметрыВызоваБлокли.Вставить("object",Новый Соответствие());
	ВидОбъекта = Неопределено;
	Если ini_name	= "Документы_execute" Тогда
		action_ref		= Новый Структура;
		Документ		= get_prop(ПараметрыВызова["Документы"][0],"Документ1С");
		ВидОбъекта		= ?(ВложенияПоТипамОбъектов1С.Количество() > 0,ВложенияПоТипамОбъектов1С[0]["ВидОбъекта"], Неопределено);
		
		ВыбранныеПечатныеФормы = ЗаполнитьСтруктуруПечатныхФормДляПередачиНаСервере();
		Если Документ = Неопределено Тогда
			
			action_ref.Вставить("ИдИС", "");
			action_ref.Вставить("ТипИС", "");
			action_ref.Вставить("ИмяИС", "");
			action_ref.Вставить("ini_name", "");
			action_ref.Вставить("Название", СокрЛП(Документ));
			action_ref.Вставить("_print_forms", Неопределено);
			
		Иначе
			
			ТипМетаданных = ПолучитьТипМетаданных(Документ);
			action_ref.Вставить("ИдИС", СокрЛП(Документ.УникальныйИдентификатор()) );
			action_ref.Вставить("ТипИС", ТипМетаданных);
			action_ref.Вставить("ИмяИС", ВидОбъекта);
			action_ref.Вставить("ini_name", "СинхВыгрузка_"+ВидОбъекта);
			action_ref.Вставить("Название", СокрЛП(Документ) );
			
		КонецЕсли;		
		Если ВидОбъекта <> Неопределено Тогда
			Если ПустаяСтрока(ВидОбъекта) Тогда
				ВидОбъекта = "БезОбъекта";
			КонецЕсли;
			action_ref.Вставить("_print_forms", get_prop(ВыбранныеПечатныеФормы,ВидОбъекта,Новый Массив));
		КонецЕсли;
		
		ПараметрыВызоваБлокли.Вставить("Документы", ПараметрыВызова.Документы );
		ПараметрыВызоваБлокли.Вставить("Действие", ПараметрыВызова.Действие );
		ПараметрыВызоваБлокли.Вставить("Формы", get_prop(action_ref,"_print_forms", Новый Массив) );
		ПараметрыВызоваБлокли.Вставить("Filter", Фильтр);
	КонецЕсли;	
	
	Результат = BlocklyExecutor.API_BLOCKLY_RUN(ПараметрыВызоваБлокли);
	ОбработатьРезультатВыполненияINI(Результат);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ДействияОбъекта

#Область КомандаВыполнитьДействие

&НаКлиенте
Процедура КомандаВыполнитьДействиеЗавершение(Результат, Контекст) экспорт
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ПоказатьРезультатВыполнения

&НаКлиенте
Процедура ПоказатьРезультатВыполнения(ОбработчикРезультата, Результат, context_params, ПараметрыДействия)
	
	Если ТипЗнч(Результат) = Тип("Структура") или ТипЗнч(Результат) = Тип("Соответствие") Тогда
		Если Результат.status = "complete" Тогда
			ЗаголовокСообщения = "Фаза """ + ПараметрыДействия["Название"] + """";
			message = "выполнена успешно";
			КартинкаСообщения = КартинкаУспешно();
		КонецЕсли;	
		Если Результат.status = "run" Тогда
			// Выполняем команду через оповещение
			Контекст = Новый Структура;
			Контекст.Вставить("Результат", Результат);
			Контекст.Вставить("context_params", context_params);
			Контекст.Вставить("ПараметрыДействия", ПараметрыДействия);
			Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
			
			ОбработчикСледующегоШага = Новый ОписаниеОповещения("ПерезапуститьВыполнениеНаСервереПослеВыполненияКомандыНаКлиенте", ЭтотОбъектНаКлиенте(), Контекст);
			ВыполнитьКоманды_Клиент(ОбработчикСледующегоШага, Результат.commands, Результат.commands_data);
			Возврат;
		КонецЕсли;	
		Если Результат.status = "error" Тогда
			ЗаголовокСообщения = "Ошибка при выполнении "+ПараметрыДействия["Название"];
			КартинкаСообщения = КартинкаОшибка();
			Если Результат["data"] <> Неопределено Тогда
				message = Результат.data["message"];
				detail = Результат.data["detail"];
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Оповестить("Saby_ЗавершениеВыполнитьДействие", Результат, ЭтаФорма.ВладелецФормы);
	
	ПоказатьОповещениеПользователя(
		ЗаголовокСообщения,
		,
		СокрЛП(message)+" "+СокрЛП(detail),
		КартинкаСообщения,
		СтатусОповещенияПользователя.Важное,
		Новый УникальныйИдентификатор);
		
	ВыполнитьОбработкуОповещения(ОбработчикРезультата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезапуститьВыполнениеНаСервереПослеВыполненияКомандыНаКлиенте(commands_result, Контекст) Экспорт
	
	Контекст.ПараметрыДействия.Вставить("commands_result", commands_result);
	Контекст.ПараметрыДействия.Вставить("step", Контекст.Результат.step);
	
	Контекст.Результат = ВыполнитьДействие("Документы_execute", Контекст.context_params, Контекст.ПараметрыДействия);
	
    ПоказатьРезультатВыполнения(Контекст.ОбработчикРезультата, Контекст.Результат, Контекст.context_params, Контекст.ПараметрыДействия);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ВыполнитьДействие(ini_name, context_params, ДополнительныеПараметры)
	ПараметрыМетода = Новый Структура("ДанныеОбъекта, ini_name, context_params", "", ini_name, context_params ); 
	
	Результат = Saby_Команда_ВыполнитьINI(ПараметрыМетода, ДополнительныеПараметры);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ПрикрепляемыеФайлы

#Область include_core_base_ЭДО_ВыборФайлаЗавершение_МетодыФормыВыполнитьДействие
#КонецОбласти

#Область include_core_base_ЭДО_ВыборФайлаЗавершение_ОбщийМетод
#КонецОбласти

&НаСервере
Функция ПолучитьИмяПрисоединенногоФайла(Знач СсылкаНаПрисоединенныйФайл) Экспорт
	Возврат СсылкаНаПрисоединенныйФайл.Наименование;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораВложения(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		Для Каждого СсылкаНаПрисоединенныйФайл Из ВыбранныеФайлы Цикл
			ВидОбъекта				= ПолучитьВидОбъекта();
			НоваяПФ					= ВложенияПоТипамОбъектов1С.Добавить();
			НоваяПФ.ОтметкаВыбора	= Истина;
			НоваяПФ.Представление	= ПолучитьИмяПрисоединенногоФайла(СсылкаНаПрисоединенныйФайл);
			НоваяПФ.ТипВложения     = "ПрисоединенныйФайл";
			НоваяПФ.ИндексКартинки	= 0;
			НоваяПФ.ВидОбъекта		= ВидОбъекта;
			НоваяПФ.Команда			= Новый Структура("Ссылка",СсылкаНаПрисоединенныйФайл);
			ЗаполнитьВложенияТекущегоТипаОбъекта(ВидОбъекта);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФизЛицоСотрудника(Знач Сотрудник)
	Возврат	Сотрудник.ФизическоеЛицо;
КонецФункции

&НаКлиенте
Процедура ДобавитьВложениеИзПрикреплёныхФайлов(Команда)
	
	ВладелецФайла = ПараметрыВызова["Документы"][0]["Документ1С"];
	
	ДобавитьВложениеИзПрикреплёныхФайловВладельца(ВладелецФайла);
	
КонецПроцедуры

#Область include_core_base_ЭДО_РаботаСТаблицейВложений
#КонецОбласти

&НаКлиенте
Процедура УдалитьВложение(Команда)
	ДанныеСтроки = ПолучитьЭлементыФормы().ВложенияТипаДокумента.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено ИЛИ ДанныеСтроки.ТипВложения = "ПечатнаяФорма" Тогда
		Возврат;
	КонецЕсли;
	//Удаление из общей таблицы
	УдалитьВложениеИзТаблицы("ВложенияПоТипамОбъектов1С", ДанныеСтроки);
	//Удаление из таблицы на форме
	УдалитьВложениеИзТаблицы("ВложенияТекущегоТипаОбъекта1С", ДанныеСтроки);
	ВложенияТипаДокументаПриИзменении(Неопределено);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьМетаданные(Знач Тип, Знач Имя)

	Возврат Метаданные[Тип].Найти(Имя) <> Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "AddonActionResponse" Тогда
		ОбработатьРезультатСобытия(Параметр);	
	КонецЕсли;

КонецПроцедуры
		
&НаКлиенте
Функция ЭтотОбъектНаКлиенте() 
    Возврат ЭтаФорма;
КонецФункции
	
#КонецОбласти

#Область include_core_base_ЭДО_РаботаСТаблицейИсполнителей
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСерверСКлиента
#КонецОбласти

#Область include_BlocklyExecutor_base_Commands
#КонецОбласти

#Область include_core_base_Криптография_НаКлиенте1С_МодульФормы
#КонецОбласти

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти

#Область include_core_base_ЭДО_Form_ВыполнитьДействие_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

