&НаКлиенте
// BSLLS:ExportVariables-off
Перем ТранспортИнтеграции, BlocklyExecutor Экспорт;
// BSLLS:ExportVariables-on

#Область include_core_base_ЭДО_Form_ВыполнитьДействие_ОсобенностиПродукта
#КонецОбласти

#Область include_core_base_ЭДО_Form_ВыполнитьДействие_УстановитьЛокализацию
#КонецОбласти

#Область include_core_base_ЭДО_Form_ВыполнитьДействие_ОсобенностиПродуктаМетодыФормы
#КонецОбласти

#Область include_core_base_Helpers_НастройкиПодключенияНаСервере
#КонецОбласти

#Область МетодыФормы

&НаКлиенте
Процедура ДобавитьИсполнителя(Команда)
	ДобавитьСотрудника(Команда);
КонецПроцедуры

&НаКлиенте
Процедура СписокИсполнителейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокДействийСБИС(Документ, Принудительно = Ложь)
	СписокДействий = Неопределено;
	Если Не Принудительно Тогда
		СписокДействий = ПолучитьСписокДействийИзОбъектаДокументСБИС(Документ);
	КонецЕсли;	
	Если СписокДействий = Неопределено И ТекущийЭтап <> "" Тогда
		Если context_params = Неопределено Тогда
			Параметры.Свойство("context_params", context_params);
			Если context_params = Неопределено Тогда
				context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
			КонецЕсли;
		КонецЕсли;  
		Этап = Новый Структура("Название", ТекущийЭтап);
		ПараметрыДокумента = Новый Структура("Идентификатор,Этап,ДопПоля", Документ.Идентификатор, Этап, "ЭтапВернутьВсеСертификаты");
		ДокументЭтапСБИС = ТранспортИнтеграции.local_helper_read_stage_document(context_params, ПараметрыДокумента);
	    СписокДействий = ПолучитьСписокДействийИзОбъектаДокументСБИС(ДокументЭтапСБИС);	
	Иначе
		ЭтаФорма.ТекущийЭтап	= get_prop(get_prop(get_prop(Документ, "Этап"), 0), "Название");
	КонецЕсли;
	Возврат СписокДействий;
КонецФункции

&НаКлиенте
Функция ПолучитьСписокДействийИзОбъектаДокументСБИС(Документ)
	Попытка
		ЭтапДокумента = Документ["Этап"][0]; 
		ЭтапДокумента.Удалить("Идентификатор");
		ЭтаФорма.ПараметрыЭтапа = Новый Структура("Этап", ЭтапДокумента); 
		Возврат Документ["Этап"][0]["Действие"];
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции


&НаКлиенте
Процедура ПереотправитьДокумент(Команда)
	//TODO обновить списко после зартытия - ЗагрузкаДокументов
	//ДопПараметры = Новый Структура("ПараметрКоманды", ПараметрКоманды);
	//ОповешениеОЗакрытии = Новый ОписаниеОповещения("ПослеОтправитьВСБИС", Saby_КомандыОбменаДляФормыКлиент, ДопПараметры);
		
	ДокументПереотправить = Новый Массив;
	Для Каждого ДокументДляДействия Из ПараметрыВызова["Документы"] Цикл
		СсылкаДокумент = ДокументДляДействия["Документ1С"];
		Если СсылкаДокумент <> Неопределено Тогда
			ДокументПереотправить.Добавить(СтруктураВыгрузкиДокумента(СсылкаДокумент));
		КонецЕсли;
	КонецЦикла;
	ПараметрыВФорму = Новый Структура();
	ПараметрыВФорму.Вставить("Источник", ДокументПереотправить);
	ПараметрыВФорму.Вставить("ПерезапуститьДО", Истина);
	ОткрытьФормуОбработки("ЗагрузкаДокументов", ПараметрыВФорму,ЭтаФорма.ВладелецФормы);
	Закрыть();
КонецПроцедуры

&НаСервере
Функция СтруктураВыгрузкиДокумента(Знач Документ1С)
	Возврат Новый Структура("Ссылка,UID,ТипМетаданных,ВидОбъекта,ИмяИни", 
							Документ1С.Ссылка,
							Неопределено,
							Документ1С.Ссылка.Метаданные().Имя,
							Неопределено,
							Неопределено); 	
КонецФункции	

&НаСервере
Функция ПолучитьПечатныеФормыНаСервере(Знач СсылкаНаОбъект, Знач Вложения = Неопределено, Знач БезСодержимого = Ложь)
    МодульОбработки = МодульОбъекта();
	Возврат МодульОбработки.ПолучитьПечатныеФормы(СсылкаНаОбъект, Вложения, БезСодержимого);
КонецФункции

&НаСервереБезКонтекста
Функция ИмяМетаданных(Знач СсылкаНаОбъект)
	Возврат СсылкаНаОбъект.Метаданные().Имя;
КонецФункции

&НаКлиенте
Процедура ОтправитьВложенияНаКлиенте(context_params)
    
	Если ТипЗнч(Параметры.СписокДокументовСБИС) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	ОбрабатываемыеОбъекты = Новый Массив();
    Для Каждого ОбновлДок Из Параметры.СписокДокументовСБИС Цикл
		ВидОбъекта = Неопределено;
		ВложенияДляДокумента = Новый Массив();
	     
        Попытка
			ИмяЗапроса = "";
			// ВложенияПоТипамОбъектов1С - Это имя реквизита формы
			ВыбранныеПечатныеФормы = ЗаполнитьСтруктуруПечатныхФормДляПередачиНаСервере(ИмяЗапроса);
			Документ1СОбновлДок = get_prop(ОбновлДок,"Документ1С",Неопределено);
			Если Документ1СОбновлДок <> Неопределено Тогда
				ВидОбъекта = ИмяМетаданных(Документ1СОбновлДок);
			Иначе			
				ВидОбъекта = "БезОбъекта";
			КонецЕсли;
			ВложенияДляДокумента = ?(ВыбранныеПечатныеФормы.Свойство(ВидОбъекта),ВыбранныеПечатныеФормы[ВидОбъекта],Новый Массив);
        
			ДокИВложения    = Новый Структура;
            Идентификатор = get_prop(ОбновлДок,"Идентификатор","");
			ДокИВложения.Вставить("Идентификатор", Идентификатор);
			ДокИВложения.Вставить("Вложение", Новый Массив);
			ВложенияДляДокумента = ПолучитьПечатныеФормыНаСервере(Документ1СОбновлДок, ВложенияДляДокумента);
			Для Каждого ПФ_ Из ВложенияДляДокумента Цикл
                
                ВложениеДок = Новый Структура;
                //ВложениеДок.Вставить("Тип", "ДокументОж");
                ВложениеДок.Вставить("Название", ПФ_.Название);
                ВложениеДок.Вставить("Файл", ПФ_.Файл);        
                
                ДокИВложения.Вложение.Добавить(ВложениеДок);
            КонецЦикла;
            ИмяЗапроса = "Вложения_" + Идентификатор;
			begin = ТекущаяУниверсальнаяДатаВМиллисекундах();	
			РезультатЗаписиВложений = ЗаписатьВложенияНаСайт(context_params, ДокИВложения, ИмяЗапроса);
			end = ТекущаяУниверсальнаяДатаВМиллисекундах();

			_Документ = Новый Структура;
			_Документ.Вставить("НаименованиеДокумента", Строка(ОбновлДок.Документ1С));
			_Документ.Вставить("ИдентификаторSaby", Строка(ОбновлДок.Идентификатор));
			_Документ.Вставить("РезультатЗаписи", РезультатЗаписиВложений);
			_Документ.Вставить("begin", begin);
			_Документ.Вставить("end", end);
			ОбрабатываемыеОбъекты.Добавить(_Документ);
        Исключение
            ИнфОбОшибке = ИнформацияОбОшибке();
			ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
			Если ОшибкаСтруктура.type = "AddonRequest" Тогда  
				ОшибкаСтруктура.dump.Вставить("ИмяЗапроса", ИмяЗапроса);
				ВызватьИсключение NewExtExceptionСтрока(,"AddonRequest",,,ОшибкаСтруктура.dump, "AddonRequest");;
			КонецЕсли;
            СтруктураОшибки    = ExtExceptionAnalyse(ИнфОбОшибке);
            ExtExceptionToJournal(СтруктураОшибки);
            ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке));
        КонецПопытки;
    КонецЦикла;
	Если ПрефиксПродукта() <> "ESD_" Тогда
		BlocklyExecutor = ПолучитьФормуBlockly();
		Контекст = Новый Структура;
		Контекст.Вставить("algorithm", "ОтправитьВложения_1");
		EndpointArgs = Новый Структура;
		EndpointArgs.Вставить("МассивСсылок", ОбрабатываемыеОбъекты);
		ПараметрыВызова = Новый Структура;
		ПараметрыВызова.Вставить("EndpointArgs", EndpointArgs);
		Контекст.Вставить("ПараметрыВызова", ПараметрыВызова);
		Контекст.Вставить("context_params", context_params);
		Контекст.Вставить("НазваниеОперации", "Запись загрузки в историю обмена " + ЛокализацияНазваниеПродукта());
		BlocklyExecutor.ЗапуститьINI(Контекст);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область РасчётINI

&НаКлиенте
Процедура ЗарегистрироватьДействия(context_params, МассивУспехов, МассивОшибок) 
	Если МассивОшибок.Количество() > 0 Тогда
		ТранспортИнтеграции.local_helper_register_actions(context_params, МассивОшибок);
 	КонецЕсли;
	Если МассивУспехов.Количество() > 0 Тогда
		ТранспортИнтеграции.local_helper_register_actions(context_params, МассивУспехов);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыполненияINI(Результат)
	Если get_prop(Результат["Result"],"ОбъектовСОшибками", 0) > 0 Тогда
		Результат.Status = "error";
		Результат["Result"].Вставить("message", "Не удалось выполнить действие. Возникла ошибка");
		data = get_prop(Результат,"Result"); 
		ДокументыСБИС =get_prop(data,"Результат"); 
		detail = "";
		Если ТипЗнч(ДокументыСБИС) = Тип("Массив") Тогда
			Для Каждого Запись Из ДокументыСБИС Цикл
				ДокументСбис = get_prop(Запись,"ДокументСБИС");
				messagedoc = get_prop(ДокументСбис,"message","");
				detaildoc = get_prop(ДокументСбис,"detail","");
				detail = ?(detaildoc = "","",detaildoc+": ")+messagedoc+"; ";
			КонецЦикла;	
		КонецЕсли;
		Результат["Result"].Вставить("detail", detail);
	КонецЕсли;
	
	code			= 500;
	data			= get_prop(Результат, "Result");
	error_detail	= get_prop(data, "detail");
	error_name	= get_prop(data, "message", "");
 	ВсегоОбъектов	= get_prop(data, "ВсегоОбъектов", 0);
	НаименованиеДействия = "EdoAction";
	
	МассивОшибок	= Новый Массив;
	МассивУспехов	= Новый Массив;
	
	ДокументыМассив	= get_prop(data, "Результат");
	Если ДокументыМассив = Неопределено Тогда
		//Ошибка
		ЭлементСтатистики	= ТранспортИнтеграции.local_helper_element_err(НаименованиеДействия, ТипСБИС, error_name, error_detail, data, code, ВсегоОбъектов);
    	МассивОшибок.Добавить(ЭлементСтатистики);
    ИначеЕсли ТипЗнч(ДокументыМассив) = Тип("Массив") Тогда
        //Корректное завершение
        Для каждого ДокЭлемент Из ДокументыМассив Цикл
        	ДанныеДокументаСБИС	= get_prop(ДокЭлемент, "ДокументСБИС");
        	ТипСБИС	= get_prop(ДанныеДокументаСБИС, "Тип", "");
			ЭлементСтатистики	= ТранспортИнтеграции.local_helper_element_action(НаименованиеДействия, ТипСБИС, Новый Структура(), 1);
 			МассивУспехов.Добавить(ЭлементСтатистики);
		КонецЦикла;
	Иначе
		МассивОшибок	= Новый Массив;
		МассивУспехов	= Новый Массив;	
	КонецЕсли;
	
	ЗарегистрироватьДействия(context_params, МассивУспехов, МассивОшибок);

КонецПроцедуры	

&НаКлиенте
Функция Saby_Команда_ВыполнитьINI(ПараметрыМетода, ДополнительныеПараметры )
	context_params	= get_prop(ПараметрыМетода, "context_params");
	ini_name 		= get_prop(ПараметрыМетода, "ini_name", "");
	Результат = Неопределено;
	Если context_params = Неопределено Тогда
		context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	КонецЕсли;
	
	ПараметрыВызоваБлокли	= Новый Соответствие();
	ПараметрыВызоваБлокли.Вставить("params", context_params );
	ПараметрыВызоваБлокли.Вставить("CommandsResult", get_prop(ДополнительныеПараметры, "CommandsResult", Новый Массив));
	ПараметрыВызоваБлокли.Вставить("CurrentBlock", get_prop(ДополнительныеПараметры, "CurrentBlock", Неопределено));
	ПараметрыВызоваБлокли.Вставить("Endpoint","");
	ПараметрыВызоваБлокли.Вставить("ContextId", Неопределено);
	ПараметрыВызоваБлокли.Вставить("Algorithm",ini_name);
	ConnectionId	= Неопределено;
	context_params.Свойство("ConnectionId", ConnectionId);
	ПараметрыВызоваБлокли.Вставить("ConnectionId", ConnectionId);
	ВидОбъекта = Неопределено;
	Если ini_name	= "Документы_execute" Тогда
		action_ref		= Новый Структура;
		Документ		= get_prop(ПараметрыВызова["Документы"][0],"Документ1С");
		ВидОбъекта		= ?(ВложенияПоТипамОбъектов1С.Количество() > 0,ВложенияПоТипамОбъектов1С[0]["ВидОбъекта"], Неопределено);
		
		ВыбранныеПечатныеФормы = ЗаполнитьСтруктуруПечатныхФормДляПередачиНаСервере();
		
		Если ВидОбъекта <> Неопределено Тогда
			Если ПустаяСтрока(ВидОбъекта) Тогда
				ВидОбъекта = "БезОбъекта";
			КонецЕсли;
			action_ref.Вставить("_print_forms", get_prop(ВыбранныеПечатныеФормы,ВидОбъекта,Новый Массив));
		КонецЕсли;
		
		EndpointArgs = Новый Структура;
		EndpointArgs.Вставить("Документы", ПараметрыВызова.Документы );
		EndpointArgs.Вставить("Действие", ПараметрыВызова.Действие );
		EndpointArgs.Вставить("Формы", get_prop(action_ref,"_print_forms", Новый Массив) );
		EndpointArgs.Вставить("Filter", Фильтр);
		EndpointArgs.Вставить("Этап", get_prop(ПараметрыЭтапа, "Этап") );
		ПараметрыВызоваБлокли.Вставить("EndpointArgs", EndpointArgs);
	КонецЕсли;	
	
	Результат = BlocklyExecutor.API_BLOCKLY_RUN(ПараметрыВызоваБлокли);
	ОбработатьРезультатВыполненияINI(Результат);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ДействияОбъекта

#Область КомандаВыполнитьДействие

&НаКлиенте
Процедура КомандаВыполнитьДействиеЗавершение(Результат, Контекст) экспорт
	
	ЭтаФорма.Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ПоказатьРезультатВыполнения

&НаКлиенте
Процедура ПоказатьРезультатВыполнения(ОбработчикРезультата, Результат, context_params, ПараметрыДействия)
	
	Если ТипЗнч(Результат) = Тип("Структура") или ТипЗнч(Результат) = Тип("Соответствие") Тогда
		Если Результат.Status = "complete" Тогда
			ЗаголовокСообщения = "Фаза """ + ПараметрыДействия["Название"] + """";
			message = "выполнена успешно";
			КартинкаСообщения = КартинкаУспешно();
		КонецЕсли;	
		Если Результат.Status = "run" Тогда
			// Выполняем команду через оповещение
			Контекст = Новый Структура;
			Контекст.Вставить("Результат", Результат);
			Контекст.Вставить("context_params", context_params);
			Контекст.Вставить("ПараметрыДействия", ПараметрыДействия);
			Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
			
			ОбработчикСледующегоШага = Новый ОписаниеОповещения("ПерезапуститьВыполнениеНаСервереПослеВыполненияКомандыНаКлиенте", ЭтотОбъектНаКлиенте(), Контекст);
			ВыполнитьКоманды_Клиент(ОбработчикСледующегоШага, Результат.Commands, Результат.CommandsData);
			Возврат;
		КонецЕсли;	
		Если Результат.Status = "error" Тогда
			ЗаголовокСообщения = "Ошибка при выполнении "+ПараметрыДействия["Название"];
			КартинкаСообщения = КартинкаОшибка();
			Если Результат["Result"] <> Неопределено Тогда
				message = Результат.Result["message"];
				detail = Результат.Result["detail"];
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Оповестить("Saby_ЗавершениеВыполнитьДействие", Результат, ЭтаФорма.ВладелецФормы);
	
	ПоказатьОповещениеПользователя(
		ЗаголовокСообщения,
		,
		СокрЛП(message)+" "+СокрЛП(detail),
		КартинкаСообщения,
		СтатусОповещенияПользователя.Важное,
		Новый УникальныйИдентификатор);
		
	ВыполнитьОбработкуОповещения(ОбработчикРезультата, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезапуститьВыполнениеНаСервереПослеВыполненияКомандыНаКлиенте(commands_result, Контекст) Экспорт
	
	Контекст.ПараметрыДействия.Вставить("CommandsResult", commands_result);
	Контекст.ПараметрыДействия.Вставить("CurrentBlock", Контекст.Результат.CurrentBlock);
	
	Контекст.Результат = ВыполнитьДействие("Документы_execute", Контекст.context_params, Контекст.ПараметрыДействия);
	
    ПоказатьРезультатВыполнения(Контекст.ОбработчикРезультата, Контекст.Результат, Контекст.context_params, Контекст.ПараметрыДействия);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ВыполнитьДействие(ini_name, context_params, ДополнительныеПараметры)
	ПараметрыМетода = Новый Структура("ДанныеОбъекта, ini_name, context_params", "", ini_name, context_params ); 
	
	Результат = Saby_Команда_ВыполнитьINI(ПараметрыМетода, ДополнительныеПараметры);
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ЭтапыДокумента(Документ)
	ТекущиеЭтапы = Новый Массив;
	ДокументСБИС = ТранспортИнтеграции.local_helper_read_document(context_params, Новый Структура("Идентификатор,ДопПоля", Документ.Идентификатор, ""));
	ТекущиеЭтапыДокумента = get_prop(ДокументСБИС, "ТекущиеЭтапы", Неопределено);
	Если ТекущиеЭтапыДокумента = Неопределено Тогда
		ТекущиеЭтапы.Добавить(get_prop(get_prop(get_prop(ДокументСБИС, "Этап"), 0), "Название"));
		Если get_prop(Документ, "Этап") = Неопределено Тогда
			Документ.Вставить("Этап", get_prop(ДокументСБИС, "Этап"));
		КонецЕсли;	
	Иначе
		Для Каждого ЭтапДокумента Из ТекущиеЭтапыДокумента Цикл
			ТекущиеЭтапы.Добавить(get_prop(ЭтапДокумента, "Наименование"));		
		КонецЦикла;	
	КонецЕсли;
	Возврат ТекущиеЭтапы;
КонецФункции

&НаКлиенте
Процедура ОтобразитьТекущиеЭтапы(Документ)
	ТекущиеЭтапы = ЭтапыДокумента(Документ); 
	Если ТекущиеЭтапы.Количество() = 1 Тогда  
		ЭтаФорма.ТекущийЭтап = ТекущиеЭтапы.Получить(0);
	КонецЕсли;	
	Если ТекущиеЭтапы.Количество() > 1 Тогда 
		ПоказатьСписокТекущихЭтапов(ТекущиеЭтапы);
	КонецЕсли;
	Если ЭтаФорма.ТекущийЭтап = "" Тогда
		ЭтаФорма.ТекущийЭтап = get_prop(ТекущиеЭтапы, 0, "");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийЭтапОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТекущийЭтапПриИзменении(Элемент)
	УдалитьДействия();
	Попытка
		СписокДействий = ПолучитьСписокДействийСБИС(ПараметрыВызова.Документы[0], Истина);	
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке));		
	КонецПопытки;
		
	Если СписокДействий <> Неопределено Тогда
		ДобавитьДействияНаФорму(СписокДействий);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПрикрепляемыеФайлы

#Область include_core_base_ЭДО_ВыборФайлаЗавершение_МетодыФормыВыполнитьДействие
#КонецОбласти

#Область include_core_base_ЭДО_ВыборФайлаЗавершение_ОбщийМетод
#КонецОбласти

&НаСервере
Функция ПолучитьИмяПрисоединенногоФайла(Знач СсылкаНаПрисоединенныйФайл) Экспорт
	Возврат СсылкаНаПрисоединенныйФайл.Наименование;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораВложения(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		Для Каждого СсылкаНаПрисоединенныйФайл Из ВыбранныеФайлы Цикл
			ВидОбъекта				= ПолучитьВидОбъекта();
			НоваяПФ					= ВложенияПоТипамОбъектов1С.Добавить();
			НоваяПФ.ОтметкаВыбора	= Истина;
			НоваяПФ.Представление	= ПолучитьИмяПрисоединенногоФайла(СсылкаНаПрисоединенныйФайл);
			НоваяПФ.ТипВложения     = "ПрисоединенныйФайл";
			НоваяПФ.ИндексКартинки	= 0;
			НоваяПФ.ВидОбъекта		= ВидОбъекта;
			НоваяПФ.Команда			= Новый Структура("Ссылка",СсылкаНаПрисоединенныйФайл);
			ЗаполнитьВложенияТекущегоТипаОбъекта(ВидОбъекта);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложениеИзПрикреплёныхФайлов(Команда)
	
	ВладелецФайла = ПараметрыВызова["Документы"][0]["Документ1С"];
	Если ВладелецФайла = Неопределено Тогда 
		КартинкаСообщения = КартинкаОшибка();
		ПоказатьОповещениеПользователя(
			"Документ отсутствует в 1С",
			,
			"",
			КартинкаСообщения,
			СтатусОповещенияПользователя.Важное,
			Новый УникальныйИдентификатор);
		
		Возврат;
	КонецЕсли;
	ДобавитьВложениеИзПрикреплёныхФайловВладельца(ВладелецФайла);
	
КонецПроцедуры

#Область include_core_base_ЭДО_РаботаСТаблицейВложений
#КонецОбласти

&НаКлиенте
Процедура УдалитьВложение(Команда)
	ДанныеСтроки = ПолучитьЭлементыФормы().ВложенияТипаДокумента.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено ИЛИ ДанныеСтроки.ТипВложения = "ПечатнаяФорма" Тогда
		Возврат;
	КонецЕсли;
	//Удаление из общей таблицы
	УдалитьВложениеИзТаблицы("ВложенияПоТипамОбъектов1С", ДанныеСтроки);
	//Удаление из таблицы на форме
	УдалитьВложениеИзТаблицы("ВложенияТекущегоТипаОбъекта1С", ДанныеСтроки);
	ВложенияТипаДокументаПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "AddonActionResponse" Тогда
		ОбработатьРезультатСобытия(Параметр);	
	КонецЕсли;

КонецПроцедуры
		
&НаКлиенте
Функция ЭтотОбъектНаКлиенте() 
    Возврат ЭтаФорма;
КонецФункции

#Область include_core_base_Helpers_РаботаСМетаданными //&НаСервереБезКонтекста
#КонецОбласти

#КонецОбласти

#Область include_core_base_ЭДО_РаботаСТаблицейИсполнителей
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияСерверСКлиента
#КонецОбласти

#Область include_BlocklyExecutor_base_Commands
#КонецОбласти

#Область include_core_base_Криптография_НаКлиенте1С_МодульФормы
#КонецОбласти

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти

#Область include_core_base_ЭДО_Form_ВыполнитьДействие_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти
