
#Область ПечатныеФормы

&НаСервере
Процедура ПолучитьСписокПечатныхФормОбъекта1С(МетаданныеОбъекта, ВложенияПоТипамОбъекта1С)
	// Заглушка
КонецПроцедуры

&НаСервере
Функция ПрочитатьВыборПФДляВидаДокумента( ВидОбъекта, Действие = "Отправка")
	// Заглушка
КонецФункции

&НаКлиенте
Процедура ЗаполнитьВложенияТекущегоТипаОбъекта(ВидОбъекта = Неопределено)
	ВложенияТекущегоТипаОбъекта1С.Очистить();
	Отбор = Новый Структура("ВидОбъекта", ВидОбъекта);
	СтрокиПФ = ВложенияПоТипамОбъектов1С.НайтиСтроки(Отбор);
	Для Каждого СтрокаДокПФ Из СтрокиПФ Цикл
		ЗаполнитьЗначенияСвойств(ВложенияТекущегоТипаОбъекта1С.Добавить(), СтрокаДокПФ);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область include_core_base_ЭДО_Form_ВыполнитьДействие_ОсобенностиОбработки
#КонецОбласти

