
// BSLLS:UnusedLocalVariable-off
Перем ОбработкаМенеджерыКриптографии;
// BSLLS:UnusedLocalVariable-on

#Область include_core_base_ЭДО_Form_ВыполнитьДействие_ОсобенностиОбработки
#КонецОбласти

&НаСервере
Процедура УстановитьКартинкуНаКнопеДействия(КнопкаДействие, Действие,ТребуетсяВыборИсполнителя,ТребуетсяКомментарий)
	КнопкаДействие.Отображение	= ОтображениеКнопки.Текст;
КонецПроцедуры

#Область ПечатныеФормы

&НаСервере
Процедура ПолучитьСписокПечатныхФормОбъекта1С(МетаданныеОбъекта, ВложенияПоТипамОбъекта1С)
	// Заглушка
КонецПроцедуры

&НаСервере
Процедура ПрочитатьВыборПФДляВидаДокумента( ВидОбъекта, Действие = "Отправка")
	// Заглушка
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВложенияТекущегоТипаОбъекта(ВидОбъекта = Неопределено)
	ВложенияТекущегоТипаОбъекта1С.Очистить();
	Отбор = Новый Структура("ВидОбъекта", ВидОбъекта);
	СтрокиПФ = ВложенияПоТипамОбъектов1С.НайтиСтроки(Отбор);
	Для Каждого СтрокаДокПФ Из СтрокиПФ Цикл
		ЗаполнитьЗначенияСвойств(ВложенияТекущегоТипаОбъекта1С.Добавить(), СтрокаДокПФ);
	КонецЦикла;
	ВложенияТипаДокументаПриИзменении(Неопределено);
КонецПроцедуры

#КонецОбласти
