
Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	ПриЗакрытииФормыВыбораСотрудника(ЗначениеВыбора, "ПодборРеализации");
КонецПроцедуры

#Область ПечатныеФормы

&НаСервере
Процедура ПолучитьСписокПечатныхФормОбъекта1С(МетаданныеОбъекта, ВложенияПоТипамОбъекта1С)
	// Заглушка
КонецПроцедуры

&НаСервере
Функция ПрочитатьВыборПФДляВидаДокумента( ВидОбъекта, Действие = "Отправка")
	// Заглушка
КонецФункции

&НаКлиенте
Процедура ЗаполнитьВложенияТекущегоТипаОбъекта(ВидОбъекта = Неопределено)
	ВложенияТекущегоТипаОбъекта1С.Очистить();
	Отбор = Новый Структура("ВидОбъекта", ВидОбъекта);
	СтрокиПФ = ВложенияПоТипамОбъектов1С.НайтиСтроки(Отбор);
	Для Каждого СтрокаДокПФ Из СтрокиПФ Цикл
		ЗаполнитьЗначенияСвойств(ВложенияТекущегоТипаОбъекта1С.Добавить(), СтрокаДокПФ);
	КонецЦикла;
	ВложенияТипаДокументаПриИзменении(Неопределено);
КонецПроцедуры

#КонецОбласти

