
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МодульОбъекта = ПолучитьМодульОбъекта();
	
	СписокДокументовСБИС = Неопределено;
	СписокДействий       = Неопределено;
	ПараметрыВызова      = Неопределено;
	ТипТекущегоОбъекта1С = Неопределено;
	
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	
	ЭлементыФормочки.ОтправитьВложения.Видимость = Истина;
		
	ВложенияТекущегоТипаОбъекта1С.Очистить();
	ВложенияПоТипамОбъектов1С.Очистить();
	
	Параметры.Свойство("СписокДокументовСБИС", СписокДокументовСБИС);
	Если СписокДокументовСБИС.Количество() = 0 ТОгда   
		Отказ = Истина;
		Сообщить("Отсутствуют документы в списке");
		Возврат;
	КонецЕсли;
	ПараметрыВызова = Новый Структура("Документы, Действие, _print_forms", СписокДокументовСБИС,,Новый Массив()); 
		
	Документ1С = get_prop(ПараметрыВызова["Документы"][0],"Документ1С");
	
	УстановитьЛокализацию(ЭлементыФормочки);

	Документы1С = get_prop(ПараметрыВызова,"Документы");
	Если Документы1С = Неопределено Или Документы1С.Количество() = 0 Тогда
		//  Во входящих параметрах отсутствуют документы
		Отказ	= Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	ПараметрыВызова = Новый Структура("Документы, Действие, _print_forms", СписокДокументовСБИС,,Новый Массив()); 
		
	Документ1С = get_prop(ПараметрыВызова["Документы"][0],"Документ1С");
	
	Если ТипЗнч(Документ1С) =  Тип("Массив") Тогда
		Если Документ1С.Количество() > 0 Тогда
			Документ1С = Документ1С[0];
		Иначе
			Документ1С = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Документ1С <> Неопределено Тогда
		МетаданныеОбъекта    = Документ1С.Метаданные();
		ТипТекущегоОбъекта1С = МетаданныеОбъекта.Имя;
		ПолучитьСписокПечатныхФормОбъекта1С(МетаданныеОбъекта, ВложенияПоТипамОбъектов1С);
	КонецЕсли;
	
	Если context_params = Неопределено Тогда
		context_params	= МодульОбъекта.ПроверитьНаличиеПараметровПодключения();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Транспорт = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();
	
	СписокДокументовСБИС = ПараметрыВызова.Документы;
	Если СписокДокументовСБИС.Количество() > 0 Тогда
		
		ПараметрыВызова = Новый Структура("Документы, Действие, _print_forms", СписокДокументовСБИС,,Новый Массив()); 
		Попытка
			СписокДействий = ПолучитьСписокДействийСБИС(СписокДокументовСБИС[0]);	
		Исключение
			Отказ  = Истина;	
			ИнфОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке));		
		КонецПопытки;
	//Иначе
		// todo добавить закрытие формы с сообщение пользователю
	КонецЕсли;

		
	Если СписокДействий <> Неопределено Тогда
		ДобавитьДействияНаФорму(СписокДействий);
		СписокДействийКоличество = СписокДействий.Количество();
	КонецЕсли;

	// нет доступных действий
	Если Не ЗначениеЗаполнено(СписокДействийКоличество)
		И Не ПолучитьЭлементыФормы().ГруппаПереотправка.Видимость Тогда
		
		КартинкаСообщения = БиблиотекаКартинок["Ошибка32"];
				
		ПоказатьОповещениеПользователя(
			"Нет доступных действий",
			,
			"",
			КартинкаСообщения,
			СтатусОповещенияПользователя.Важное,
			Новый УникальныйИдентификатор);
			
		Отказ = Истина;
		Закрыть();
		Возврат;
			
	КонецЕсли;	
		
	ЗаполнитьВложенияТекущегоТипаОбъекта(ТипТекущегоОбъекта1С);
	
	//Вызов с клиента, тк всё храниться в переменных формы
	ПрочитатьВыборПФДляВидаДокумента(ТипТекущегоОбъекта1С, "Действие");
	//ЗаполнитьКоментарииДокументовКОтправке();
	ВложенияТипаДокументаПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВложения(Команда)
    Попытка
        ОтправитьВложенияНаКлиенте(context_params);
        ПоказатьОповещениеПользователя(
            "Вложения успешно обновлены.",
            ,
            "",
            КартинкаУспешно(),
            СтатусОповещенияПользователя.Важное,
            Новый УникальныйИдентификатор);
    Исключение
        ИнфОбОшибке = ИнформацияОбОшибке();
        СтруктураОшибки    = ExtExceptionAnalyse(ИнфОбОшибке);
        
        ПоказатьОповещениеПользователя(
            "Ошибка при передаче вложений.",
            ,
            СтруктураОшибки.message,
            КартинкаОшибка(),
            СтатусОповещенияПользователя.Важное,
            Новый УникальныйИдентификатор);
    КонецПопытки;
    ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция Сконвертироватьto_pdfa(context_params, ДвоичныеДанные, Имя, ИмяЗапроса)
	МодульОбработки = ПолучитьМодульОбъекта();
	Возврат МодульОбработки.local_helper_convert_to_pdfa_to_disk_x(context_params,ДвоичныеДанные, Имя);
КонецФункции

&НаКлиенте
Функция ЗаписатьВложенияНаСайт(context_params, ДокИВложения, ИмяЗапроса) 
	Возврат Транспорт.local_helper_write_attachment(context_params, ДокИВложения);	
КонецФункции

&НаСервере
Функция ПрочитатьДокумент(context_params, Документ)
	МодульОбработки = ПолучитьМодульОбъекта();
	Возврат МодульОбработки.local_helper_read_document(context_params, Документ);	
КонецФункции

&НаКлиенте
Процедура КомандаВыполнитьДействиеПослеОбновленияКэшаЛокальныхСертификатов(РезультатОбновленияКеша, Контекст) Экспорт
	
	Результат = ВыполнитьДействие("Документы_execute", Контекст.context_params, Контекст.ПараметрыДействия);
    	
	ОбработчикРезультата = Новый ОписаниеОповещения("КомандаВыполнитьДействиеЗавершение", ЭтаФорма, Контекст);
	ПоказатьРезультатВыполнения(ОбработчикРезультата, Результат, Контекст.context_params, Контекст.ПараметрыДействия);
	
КонецПроцедуры

&НаКлиенте
Функция ОбработатьРезультатСобытия(Параметры)
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ЗаполнитьСтруктуруПечатныхФормДляПередачиНаСервере(ИмяЗапроса = "")
	МодульОбработки = ПолучитьМодульОбъекта();
	// ВложенияПоТипамОбъектов1С - Это имя реквизита формы
	Возврат МодульОбработки.ЗаполнитьСтруктуруПечатныхФормДляПередачи(ВложенияПоТипамОбъектов1С);
КонецФункции
