
#Область ПечатныеФормы

&НаСервере
Процедура ПолучитьСписокПечатныхФормОбъекта1С(МетаданныеОбъекта, ВложенияПоТипамОбъекта1С)
	ВидОбъекта = МетаданныеОбъекта.Имя;
	Попытка
		КомандыПечатиФормыВр	= УправлениеПечатью.КомандыПечатиОбъекта(МетаданныеОбъекта);
	Исключение
		//У объекта в менеджере объекта отсутствует процедура - ДобавитьКомандыПечати
		Возврат;
	КонецПопытки;
	ДобавленныеПФ = Новый Соответствие();
	//Общие ПФ формы
	ИспКомандыПФ = КомандыПечатиФормыВр.НайтиСтроки( Новый Структура("Отключена, СкрытаФункциональнымиОпциями", Ложь, Ложь) );
	Для Каждого КомандаПечати Из ИспКомандыПФ Цикл
		//Отключим дублирование ПФ, используются при включении ФО - "Работа в росии"
		Если Найти(КомандаПечати.Обработчик, "КадровыйЭДОКлиент") > 0 Тогда Продолжить; КонецЕсли;
		Если ДобавленныеПФ[КомандаПечати.Представление] <> Неопределено Тогда Продолжить; КонецЕсли;
		Если НЕ (ПустаяСтрока(КомандаПечати.СписокФорм)
			ИЛИ Найти(КомандаПечати.СписокФорм,"ФормаДокумента") > 0
			ИЛИ Найти(КомандаПечати.СписокФорм,"ФормаЭлемента") > 0
			ИЛИ Найти(КомандаПечати.СписокФорм,"ФормаСписка") > 0) Тогда
			Продолжить;
		КонецЕсли;
		ДобавленныеПФ.Вставить(КомандаПечати.Представление, Истина);

		КомандаП = Новый Структура("Обработчик, МенеджерПечати, Идентификатор, Представление, ПроверкаПроведенияПередПечатью, ПроверкаПроведенияПередПечатью, ФункциональныеОпции",);
		ЗаполнитьЗначенияСвойств(КомандаП, КомандаПечати);
		НоваяПФ					= ВложенияПоТипамОбъекта1С.Добавить();
		НоваяПФ.Представление	= КомандаПечати.Представление;
		НоваяПФ.ТипВложения     = "ПечатнаяФорма";
		НоваяПФ.ИндексКартинки	= 0;
		НоваяПФ.ВидОбъекта		= ВидОбъекта;
		НоваяПФ.Команда			= КомандаП;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСтруктуруПечатныхФормДляПередачи(ВложенияПоТипамДокументов) Экспорт
	ВыбранныеПечатныеФормы = Новый Структура();
	Для каждого ПечатнаяФормаДокумента Из ВложенияПоТипамДокументов Цикл

		Если НЕ ВыбранныеПечатныеФормы.Свойство(ПечатнаяФормаДокумента.ВидОбъекта) Тогда
			ВыбранныеПечатныеФормы.Вставить(ПечатнаяФормаДокумента.ВидОбъекта, Новый Массив());
		КонецЕсли;
		Если ПечатнаяФормаДокумента.ТипВложения = "ПечатнаяФорма" И ПечатнаяФормаДокумента.ОтметкаВыбора Тогда
			//Печатная форма
			Вложение = Новый Структура("Название, Файл", ПечатнаяФормаДокумента.Представление, Новый Структура("ПечатнаяФормаДокумента", ПечатнаяФормаДокумента.Представление));
			ВыбранныеПечатныеФормы[ПечатнаяФормаДокумента.ВидОбъекта].Добавить(Вложение);
		ИначеЕсли ПечатнаяФормаДокумента.ТипВложения = "ФайлСДиска" И ПечатнаяФормаДокумента.ОтметкаВыбора Тогда
			//Прикреплённый файл
			ИмяФайла	= ПечатнаяФормаДокумента.Команда.ИмяФайла;
			ТипКонтента	= ПолучитьКонтентТипВложения(ИмяФайла);
			АдресВХранилище = get_prop(ПечатнаяФормаДокумента.Команда, "АдресВХранилище");
			ФайлBase64	= ПолучитьИзВременногоХранилища(АдресВХранилище);
			Вложение = Новый Структура("Название, Файл", ПечатнаяФормаДокумента.Представление, Новый Структура("Имя, ДвоичныеДанные, ContentType", ИмяФайла, ФайлBase64, ТипКонтента) );
			ВыбранныеПечатныеФормы[ПечатнаяФормаДокумента.ВидОбъекта].Добавить(Вложение);
		ИначеЕсли ПечатнаяФормаДокумента.ТипВложения = "ПрисоединенныйФайл" И ПечатнаяФормаДокумента.ОтметкаВыбора Тогда
			ДанныеФайла	= РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(ПечатнаяФормаДокумента.Команда.Ссылка,,Истина);
			ИмяФайла	= ДанныеФайла.ИмяФайла;
			ТипКонтента	= ПолучитьКонтентТипВложения(ИмяФайла);
			Вложение = Новый Структура("Название, Файл", ПечатнаяФормаДокумента.Представление, Новый Структура("Имя, ПрисоединенныйФайл, ContentType",ИмяФайла, Истина, ТипКонтента) );
			ВыбранныеПечатныеФормы[ПечатнаяФормаДокумента.ВидОбъекта].Добавить(Вложение);
		КонецЕсли;
	КонецЦикла;

	Возврат ВыбранныеПечатныеФормы;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКлючНастроекВыбораПФ(ВидОбъекта, Действие)
	Возврат "ПФ_" + ВидОбъекта + "_" + Действие;
КонецФункции

&НаСервере
Функция ПрочитатьВыборПФДляВидаДокумента( ВидОбъекта, Действие="Отправка" )
	МассивПечатныхФорм = ХранилищеОбщихНастроек.Загрузить("Saby", ПолучитьКлючНастроекВыбораПФ(ВидОбъекта, Действие) ,,);
	Если ТипЗнч(МассивПечатныхФорм) = Тип("Массив") Тогда
		Для Каждого ПФорма из МассивПечатныхФорм Цикл
			//Обновим общие данные
			мПФ	= ВложенияПоТипамОбъектов1С.НайтиСтроки( Новый Структура("Представление, ВидОбъекта", ПФорма, ВидОбъекта) );
			Для Каждого СтрокаВл Из мПФ Цикл
				СтрокаВл.ОтметкаВыбора = Истина;
			КонецЦикла;
			//Обновим данные на форме
			мПФ	= ВложенияТекущегоТипаОбъекта1С.НайтиСтроки( Новый Структура("Представление, ВидОбъекта", ПФорма, ВидОбъекта) );
			Для Каждого СтрокаВл Из мПФ Цикл
				СтрокаВл.ОтметкаВыбора = Истина;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаписатьВыборПФДляВидаДокумента(ВидОбъекта, Действие="Отправка")
	МассивПечатныхФорм	= Новый Массив();
	мВыбрПечатныхФорм = ВложенияТекущегоТипаОбъекта1С.НайтиСтроки( Новый Структура("ОтметкаВыбора, ВидОбъекта", Истина, ВидОбъекта) );
	Для Каждого ПФорма из мВыбрПечатныхФорм Цикл
		МассивПечатныхФорм.Добавить( ПФорма.Представление );
	КонецЦикла;

	//Обновим отметки в глобальной таблице ПечатныхФорм
	мВыбрПечатныхФорм = ВложенияТекущегоТипаОбъекта1С.НайтиСтроки( Новый Структура("ВидОбъекта", ВидОбъекта) );
	Для Каждого ПФорма из мВыбрПечатныхФорм Цикл
		мПФ	= ВложенияПоТипамОбъектов1С.НайтиСтроки( Новый Структура("Представление, ВидОбъекта", ПФорма.Представление, ВидОбъекта) );
		Для Каждого СтрокаВл Из мПФ Цикл
			СтрокаВл.ОтметкаВыбора = ПФорма.ОтметкаВыбора;
			Прервать;
		КонецЦикла;
	КонецЦикла;
	ХранилищеОбщихНастроек.Сохранить("Saby", ПолучитьКлючНастроекВыбораПФ(ВидОбъекта, Действие), МассивПечатныхФорм,,);      // todo переделать Saby - ПФ + Тип + Действие
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВложенияТекущегоТипаОбъекта(ВидОбъекта = Неопределено)
	ВложенияТекущегоТипаОбъекта1С.Очистить();
	Отбор = Новый Структура("ВидОбъекта", ВидОбъекта);
	СтрокиПФ = ВложенияПоТипамОбъектов1С.НайтиСтроки(Отбор);
	Для Каждого СтрокаДокПФ Из СтрокиПФ Цикл
		ЗаполнитьЗначенияСвойств(ВложенияТекущегоТипаОбъекта1С.Добавить(), СтрокаДокПФ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВложенийОтметкаПриИзменении(Элемент)
	ЗаписатьВыборПФДляВидаДокумента(ТипТекущегоОбъекта1С, "Действие");
КонецПроцедуры

#КонецОбласти

