
#Область include_core_base_ЭДО_Form_ВыполнитьДействие_ПриСозданииНаСервереПереопределяемый
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МодульОбъекта = МодульОбъекта();
	
	СписокДокументовСБИС = Неопределено;
	ПараметрыВызова      = Неопределено;
	ЭтаФорма.ТипТекущегоОбъекта1С = Неопределено;
	
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	
	ЭлементыФормочки.ОтправитьВложения.Видимость = Истина;
		
	ВложенияТекущегоТипаОбъекта1С.Очистить();
	ВложенияПоТипамОбъектов1С.Очистить();
	
	Если Параметры.Свойство("Filter") Тогда
		СписокДокументовСБИС = Параметры.Filter.Selection.Marked;
		ЭтаФорма.Фильтр = Параметры.Filter;
	ИначеЕсли Параметры.Свойство("СписокДокументовСБИС") Тогда
		СписокДокументовСБИС = Параметры.СписокДокументовСБИС
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если СписокДокументовСБИС.Количество() = 0 ТОгда   
		Отказ = Истина;
		Сообщить("Отсутствуют документы в списке");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	УстановитьЛокализацию(ЭлементыФормочки);

	ПараметрыВызова = Новый Структура("Документы, Действие, _print_forms", СписокДокументовСБИС,,Новый Массив()); 
		
	Документ1С = get_prop(ПараметрыВызова["Документы"][0],"Документ1С");
	
	Если ТипЗнч(Документ1С) =  Тип("Массив") Тогда
		Если Документ1С.Количество() > 0 Тогда
			Документ1С = Документ1С[0];
		Иначе
			Документ1С = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Документ1С <> Неопределено Тогда
		МетаданныеОбъекта    = Документ1С.Метаданные();
		ЭтаФорма.ТипТекущегоОбъекта1С = МетаданныеОбъекта.Имя;
		ПолучитьСписокПечатныхФормОбъекта1С(МетаданныеОбъекта, ВложенияПоТипамОбъектов1С);
	КонецЕсли;
	
	Если context_params = Неопределено Тогда
		context_params	= МодульОбъекта.ПроверитьНаличиеПараметровПодключения();
	КонецЕсли;
	ЭтаФорма.ТекущийЭтап = get_prop(get_prop(Параметры, "Этап"), "Наименование", "");
 	
	ПриСозданииНаСервереПереопределяемый();
	
КонецПроцедуры

// BSLLS:CognitiveComplexity-off

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // Инициализация Обычные формы
// BSLLS:UsingCancelParameter-off
    Отказ = Ложь;
// BSLLS:UsingCancelParameter-on
	
	// BSLLS:UnusedLocalVariable-off Определение переменных формы
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();
	// BSLLS:UnusedLocalVariable-on
	
	СписокДокументовСБИС = ПараметрыВызова.Документы;
	ПараметрыВызова = Новый Структура("Документы, Действие, _print_forms", СписокДокументовСБИС,, Новый Массив());

	ПервыйДокументСписка = СписокДокументовСБИС[0];
	Если ПустаяСтрока(ТекущийЭтап) Тогда 
    	ОтобразитьТекущиеЭтапы(ПервыйДокументСписка);
	КонецЕсли;
	
	Попытка
		СписокДействий = ПолучитьСписокДействийСБИС(ПервыйДокументСписка);	
	Исключение
		Отказ  = Истина;	
		ИнфОбОшибке = ИнформацияОбОшибке();
		ПоказатьОповещениеПользователя(
			"Ошибка при получении доступных действий",
			,
			"",
			КартинкаОшибка());
		Отказ = Истина;
	КонецПопытки;
	
	СписокДействийКоличество = Неопределено;
	Если Не Отказ И ТипЗнч(СписокДействий) = Тип("Массив") Тогда
		ДобавитьДействияНаФорму(СписокДействий);
		СписокДействийКоличество = СписокДействий.Количество();
	КонецЕсли;
	
	// нет доступных действий
	Если Не ЗначениеЗаполнено(СписокДействийКоличество) Тогда
		КартинкаСообщения = БиблиотекаКартинок["Ошибка32"];
		ПоказатьОповещениеПользователя(
			"Нет доступных действий",
			,
			"",
			КартинкаСообщения);
			
		Отказ = Истина;
	КонецЕсли;	
	
	Если Отказ Тогда 
		Закрыть();
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВложенияТекущегоТипаОбъекта(ТипТекущегоОбъекта1С);
	
	//Вызов с клиента, тк всё храниться в переменных формы
	ПрочитатьВыборПФДляВидаДокумента(ТипТекущегоОбъекта1С, "Действие");
	//ЗаполнитьКоментарииДокументовКОтправке();
	ВложенияТипаДокументаПриИзменении(Неопределено);
КонецПроцедуры
// BSLLS:CognitiveComplexity-on

&НаКлиенте
Процедура ОтправитьВложения(Команда)
    Попытка
        ОтправитьВложенияНаКлиенте(context_params);
    Исключение
        ИнфОбОшибке = ИнформацияОбОшибке();
        СтруктураОшибки    = ExtExceptionAnalyse(ИнфОбОшибке);
        ПоказатьОповещениеПользователя(
            "Ошибка при передаче вложений.",
            ,
            СтруктураОшибки.message,
            КартинкаОшибка());
    КонецПопытки;
    ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция Сконвертироватьto_pdfa(context_params, ДвоичныеДанные, Имя, ИмяЗапроса)
	МодульОбработки = МодульОбъекта();
	Возврат МодульОбработки.local_helper_convert_to_pdfa_to_disk_x(context_params,ДвоичныеДанные, Имя);
КонецФункции

&НаКлиенте
Функция ЗаписатьВложенияНаСайт(context_params, ДокИВложения, ИмяЗапроса) 
	Возврат ТранспортИнтеграции.local_helper_write_attachment(context_params, ДокИВложения);	
КонецФункции

&НаСервере
Функция ПрочитатьДокумент(context_params, Документ)
	МодульОбработки = МодульОбъекта();
	Возврат МодульОбработки.local_helper_read_document(context_params, Документ);	
КонецФункции

&НаКлиенте
Процедура КомандаВыполнитьДействиеПослеОбновленияКэшаЛокальныхСертификатов(РезультатОбновленияКеша, Контекст) Экспорт
	
	Результат = ВыполнитьДействие("Документы_execute", Контекст.context_params, Контекст.ПараметрыДействия);
    	
	ОбработчикРезультата = SabyОписаниеОповещения("КомандаВыполнитьДействиеЗавершение", ЭтаФорма, Контекст);
	ПоказатьРезультатВыполнения(ОбработчикРезультата, Результат, Контекст.context_params, Контекст.ПараметрыДействия);
	
КонецПроцедуры

&НаКлиенте
Функция ОбработатьРезультатСобытия(Параметры)
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ЗаполнитьСтруктуруПечатныхФормДляПередачиНаСервере(ИмяЗапроса = "")
	МодульОбработки = МодульОбъекта();
	// ВложенияПоТипамОбъектов1С - Это имя реквизита формы
	Возврат МодульОбработки.ЗаполнитьСтруктуруПечатныхФормДляПередачи(ВложенияПоТипамОбъектов1С);
КонецФункции
