
&НаСервере
Процедура УстановитьЛокализацию(ЭлементыФормочки)
    // Видимость элементов
	ЭлементыФормочки.ГруппаПереотправка.Видимость = Параметры.МожноПереотправитьВСБИС;
	ЭлементыФормочки.ПереотправитьДокумент.Заголовок  = "Обновить в "+ЛокализацияНазваниеПродукта();
	ЭтаФорма.Команды.ПереотправитьДокумент.Подсказка  = "Обновить реквизиты документа в "+ЛокализацияНазваниеПродукта();
	ЭлементыФормочки.ОтправитьВложения.Заголовок  = "Загрузить вложения в "+ЛокализацияНазваниеПродукта();
	ЭтаФорма.Команды.ОтправитьВложения.Подсказка = "Загрузить вложения в "+ЛокализацияНазваниеПродукта();
КонецПроцедуры

