
// BSLLS:FunctionOutParameter-off

&НаСервере
Функция ТемаАккордеона(Знач МодульОбъекта = Неопределено) Экспорт
	Если МодульОбъекта = Неопределено Тогда
		МодульОбъекта = МодульОбъекта();
	КонецЕсли;
	Тема = МодульОбъекта.ТемаПриложения();
	Если Тема = "Темная" Тогда
		Возврат "dark";
	Иначе
		Возврат "light";
	КонецЕсли;
КонецФункции
// BSLLS:FunctionOutParameter-on	

&НаСервере
Процедура ПостроитьАккордеонНаСервере(Знач ДанныеАккордеона, Знач РезультатИни, Знач ДопПараметры) 
	МодульОбъекта = МодульОбъекта();
	ИдРаздела = get_prop(ДанныеАккордеона, "ВыбранныйРаздел");
	ИмяМакета = get_prop(ДанныеАккордеона, "ИмяМакета", "Аккордеон");
	Попытка
		СтруктураАккордеона = РезультатИни.Result;
		Если ИдРаздела = Неопределено Тогда
		    ИдРаздела = get_prop(context_params, "РазделПоУмолчанию");
		КонецЕсли;
		Если ИдРаздела = Неопределено Тогда
			Для Каждого ПунктАккордеона Из СтруктураАккордеона Цикл
				Если ПунктАккордеона["action"] = Истина Тогда
					ИдРаздела = ПунктАккордеона["id"];
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	
		АккордеонJSON = МодульОбъекта.local_helper_json_encode(СтруктураАккордеона);
		АккордеонJSON = "{""accordion"":" + АккордеонJSON;
		АккордеонJSON = АккордеонJSON + ", ""selectedItem"":""" + ИдРаздела + """";
		АккордеонJSON = АккордеонJSON + ", ""theme"":""" + ТемаАккордеона(МодульОбъекта) + """"; // тема: light или dark
		АккордеонJSON = АккордеонJSON + ", ""marginTop"":""26px""";      //высота блока с птичкой
		Если ДопПараметры <> Неопределено Тогда
			АккордеонJSON = АккордеонJSON + ", ""productVersionStatus"":{";      //версия продукта
			АккордеонJSON = АккордеонJSON + """currentVersionNumber"":""v. " + ДопПараметры.СтатусВерсии.НомерТекущейВерсии + """";
			АккордеонJSON = АккордеонJSON + ", ""clientVersionStatus"":""" + ДопПараметры.СтатусВерсии.Шаблон + """}";
		КонецЕсли;
		АккордеонJSON = АккордеонJSON + "}";
		ТекстHTML = МодульОбъекта().ПолучитьМакет(ИмяМакета).ПолучитьТекст(); 
		ТекстHTML = СтрЗаменить(ТекстHTML, "%accordion%", АккордеонJSON);
		УстановитьHTML("АккордеонHTML", ТекстHTML);
	
		ТекущийРаздел.Вставить("Идентификатор", ИдРаздела);
		ТекущийРаздел.Вставить("МножественныйВыбор", Истина); // Тут всегда множественный выбор
	Исключение
		Ошибка = ОписаниеОшибки();
		ВызватьИсключение "Ошибка: " + Символы.ПС + Ошибка;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьАккордеон(ДопПараметры = Неопределено)
	ДанныеАккордеона = get_prop(ДопПараметры, "СтруктураАккордеона");
	ini_name = get_prop(ДанныеАккордеона, "Ини", "Accordion");
	accordion = get_prop(ДанныеАккордеона, "Пункты");	
	EndpointArgs = Новый Структура;
	EndpointArgs.Вставить("AccordionEDO", accordion); 
	ПараметрыКоманды = Новый Структура("Algorithm, Endpoint, EndpointArgs", ini_name, , EndpointArgs);
	Попытка
		РезультатИни = BlocklyExecutor.LocalCalcIni(ПараметрыКоманды);
		Если РезультатИни["Status"] = "error" Тогда
			ВызватьИсключение NewExtExceptionСтрока(, "Ошибка выполнения ini: '" + ПараметрыКоманды["Algorithm"]
					+ "', endpoint: '" + ПараметрыКоманды["Endpoint"] + "'" + Символы.ПС + РезультатИни.Result.message,
				РезультатИни.Result.detail, РезультатИни.Result.action);
		КонецЕсли;
	Исключение
		//Ошибка = ОписаниеОшибки();
		ТекущийРаздел.Вставить("Шаблон", "СтраницаЗаглушка");
		Возврат;
	КонецПопытки; 
	ПостроитьАккордеонНаСервере(ДанныеАккордеона, РезультатИни, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура АккордеонOnClick(Элемент, ДанныеСобытия)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЭлементСобытия = ДанныеСобытия.srcElement;
	#Иначе
		ЭлементСобытия = ДанныеСобытия.Element;
	#КонецЕсли
	Если ЭлементСобытия["id"] = "toExtSys" Тогда
		Попытка
			ИмяДействия	= ЭлементСобытия.getAttribute("action");
			Параметр	= ЭлементСобытия.textContext; //Иногда можно брать из ЭлементСобытия.innerHTML;
			ОбработатьДействиеНаКлиенте(ИмяДействия, Параметр);
			//ВернутьРезультат(Результат);
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АккордеонОбновитьИнформациюОВерсии() Экспорт
	ЭлементыФормочки = ПолучитьЭлементыФормы();
	Попытка
		ЭлементыФормочки.АккордеонHTML.Документ[РеквизитОбъектаДокумента].updateFooter(ПолучитьИнформациюОВерсии());	
	Исключение
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюОВерсии()
	МодульОбъекта = МодульОбъекта();
	СтатусВерсии = МодульОбъекта.ПолучитьСтатусВерсии(Истина);
	СтатусВерсииПользователя = "";
	ВерсияПользователя = "";
	//СтатусВерсии = 5; //IE не воспринимает "0", поэтому нулевой статус, когда версия актуальна, заменяю на "5"
	Если СтатусВерсии.Шаблон = 1 Тогда
		СтатусВерсииПользователя = "Доступно обновление";
	ИначеЕсли СтатусВерсии.Шаблон = 2 Тогда
		СтатусВерсииПользователя = "Версия устарела";
	ИначеЕсли СтатусВерсии.Шаблон = 3 Или СтатусВерсии.Шаблон = 4 Тогда
		СтатусВерсииПользователя = "Версия сильно устарела!";
	Иначе
		СтатусВерсииПользователя = "";
	КонецЕсли;	
	ВерсияПользователя = "v. " + СтатусВерсии.НомерТекущейВерсии;
	Возврат СтатусВерсииПользователя+";"+ВерсияПользователя+";"+Строка(СтатусВерсии.Шаблон);	
КонецФункции

