Процедура ДобавитьКомандыНаПанельОпераций(ЭлемПанельОпераций, КомандыПанели, Лево) 
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	Для Каждого Команда Из КомандыПанели Цикл
		Элем = ЭлемФормы.Найти(Команда["Name"]);
		Если Элем = Неопределено Тогда
			Элем = ЭлемФормы.Добавить(Тип("Кнопка"), Команда["Name"], Истина, ЭлемПанельОпераций);	
		КонецЕсли;
		УстановитьДействиеНаЭлемент(Элем, "Нажатие", Команда["Action"]);
		Элем.Заголовок = Команда["Title"];
		Элем.Видимость = Истина;
		Элем.Шрифт = Новый Шрифт("Tahoma", 10);
		Если Команда["Type"] = "DefaultButton" Тогда
			Элем.ЦветФонаКнопки = Новый Цвет(255, 112, 51);
			Элем.ЦветТекстаКнопки = Новый Цвет(255, 255, 255);
			Элем.ЦветРамки = Новый Цвет(255, 112, 51);	
		Иначе
			Элем.ЦветФонаКнопки = Новый Цвет(255, 255, 255);
			Элем.ЦветТекстаКнопки = Новый Цвет(0, 0, 0);
			Элем.ЦветРамки = Новый Цвет(188, 188, 188);
		КонецЕсли;
		Элем.Лево = Лево;
		Элем.Верх = 2;
		Элем.Высота = 25;
		Элем.Ширина = Макс(СтрДлина(Команда["Title"])*7, 33);
		КартинкаПуть = get_prop(Команда, "Icon");
		Если КартинкаПуть <> Неопределено Тогда
			УстановитьКартинку(Элем, КартинкаПуть);
			Элем.Ширина = Элем.Ширина + 37;
		Конецесли;
		Лево = Лево + Элем.Ширина + 5;
		Если get_prop(Команда, "Properties") <> Неопределено Тогда
			Для Каждого СвойствоПоля Из Команда["Properties"] Цикл
				Элем[СвойствоПоля.Ключ] = СвойствоПоля.Значение;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

