
&НаКлиенте
Процедура ИерархическийСписокПриОткрытии(ПараметрыОтображения)
	ЭтаФорма.Страница = 0;
	ЭтаФорма.СтраницыПоРодителям = Неопределено;
	ОчиститьПанельОпераций(ТекущийРаздел.ПараметрыОтображения);
	ОчиститьКонтекстноеМеню();
	ОчиститьПанельФильтра(ТекущийРаздел.ПараметрыОтображения);
	ТекущийРаздел.Вставить("ПараметрыОтображения", ПараметрыОтображения);
			
	ЗаполнитьФильтр();
	ЗаполнитьКолонкиИерархическогоСписка();
	ОбновитьСписок(ДанныеФильтра.Значения);
	ДанныеФильтра.ПараметрыОтображения = get_prop(ПараметрыОтображения, "Filter", get_prop(ПараметрыОтображения, "FILTER", Новый Массив));
	УстановитьВидимостьФильтра();
	ОбновитьПанельФильтра();
	ОбновитьПанельОпераций();
	ОбновитьКонтекстноеМеню();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеИерархическогоСписка(Таблица, Данные) Экспорт
	МодульОбъекта = МодульОбъекта();
	Список = Данные["Rows"];
	Навигация = Данные["Pagination"];
	ПолеЭтоГруппа = ТекущийРаздел.ПараметрыОтображения["NODE_PROPERTY"];
	Для Каждого Стр Из Список Цикл
		СтрТ = Таблица.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТ, Стр);
		Колонки = get_prop(ТекущийРаздел.ПараметрыОтображения, "Columns", get_prop(ТекущийРаздел.ПараметрыОтображения, "COLUMNS"));
		Для Каждого Колонка Из Колонки Цикл
			ПутьКДанным = get_prop(Колонка, "Data", get_prop(Колонка, "PROPERTY"));
			ИмяКолонки = get_prop(Колонка, "Name", get_prop(Колонка, "NAME"));
			СтрТ[ИмяКолонки] = МодульОбъекта.block_obj_get_path_value(Стр,ПутьКДанным,"");
		КонецЦикла;
		Если СтрТ.Родитель <> Неопределено Тогда
			СтрТ.Отмечен = СтрТ.Родитель.Отмечен;	
		КонецЕсли;
		// Если полученная строка является группой, то создаем 
        // фиктивную подчиненную строку.
        Если get_prop(Стр, ПолеЭтоГруппа) = Истина Тогда
            ПерваяКолонка = Колонки[0]["NAME"];
            ПодстрокаДерева = СтрТ.Строки.Добавить();
            ПодстрокаДерева[ПерваяКолонка] = "Нет подчиненных";
			ПолеИд = ТекущийРаздел.ПараметрыОтображения["KEY_PROPERTY"];
			ИдСтроки = get_prop(СтрТ, ПолеИд);
			КлючРодителя = "id" + СтрЗаменить(ИдСтроки, "-", "_");
			Если Не ЭтаФорма.СтраницыПоРодителям = Неопределено И Не get_prop(ЭтаФорма.СтраницыПоРодителям, КлючРодителя) = Неопределено Тогда
				ЭтаФорма.СтраницыПоРодителям.Вставить(КлючРодителя, -1);
			КонецЕсли;
        КонецЕсли;
	КонецЦикла;
	ЕстьЕще = get_prop(Навигация, "HasMore");
	Если ЕстьЕще = Истина Или ЕстьЕще = "Да" Тогда
		СтрТ = Таблица.Строки.Добавить();
		СтрТ["ЗагрузитьЕще"] = "Загрузить еще";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИерархическийСписокПриИзмененииФлажка(Элемент, Колонка) Экспорт
	// Отмечает вложенные записи дерева значений при отметке группы
	ТекущиеДанные = ПолучитьЭлементыФормы().ИерархическийСписок.ТекущиеДанные;
	Если ТекущиеДанные.Отмечен = 2 Тогда
        ТекущиеДанные.Отмечен = 0;
    КонецЕсли;
	ПроставитьПометкиВниз(ТекущиеДанные);
	Родитель = РодительЭлементаДерева(ТекущиеДанные);
    Пока Родитель <> Неопределено Цикл
        Родитель.Отмечен = ?(УстановленноДляВсех(ТекущиеДанные),
            ТекущиеДанные.Отмечен, 2);
        ТекущиеДанные = Родитель;
        Родитель = РодительЭлементаДерева(Родитель);
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВниз(ТекущиеДанные)
	// Отмечает вложенные записи дерева значений при отметке группы
	Потомки = СтрокиЭлементаДереваНаКлиенте(ТекущиеДанные);
	Значение = ТекущиеДанные.Отмечен;
	Для каждого Потомок из Потомки Цикл
		Потомок.Отмечен = Значение;
		ПроставитьПометкиВниз(Потомок);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция УстановленноДляВсех(ЭлементКоллекции)

    СоседниеЭлементы =
        СтрокиЭлементаДереваНаКлиенте(РодительЭлементаДерева(ЭлементКоллекции));
    Для Каждого ТекЭлемент Из СоседниеЭлементы Цикл
        Если ТекЭлемент.Отмечен <> ЭлементКоллекции.Отмечен Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла;
    Возврат Истина;

КонецФункции

&НаКлиенте
Функция СписокОтмеченныхЗаписейИерархическийСписок()
	СписокОтмеченных = Новый Массив;

	Дерево = ИерархическийСписок;
	ОбходДерева(Дерево, СписокОтмеченных);
	
	Если СписокОтмеченных.Количество()=0 Тогда
		ЭлемФормы = ПолучитьЭлементыФормы();
		Если ЭлемФормы.ИерархическийСписок.ТекущаяСтрока<>Неопределено Тогда
			НоваяСтрока = Новый Структура(ТекущийРаздел.Колонки);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлемФормы.ИерархическийСписок.ТекущиеДанные);
			СписокОтмеченных.Добавить(НоваяСтрока);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокОтмеченных;
КонецФункции

// Обход дерева
//
// Параметры:
//  Дерево - ДеревоЗначений - дерево.
//  Отмеченные - массив - отмеченные элементы.
//
&НаСервере
// BSLLS:TransferringParametersBetweenClientAndServer-off
Процедура ОбходДерева(Дерево, Отмеченные)
	Строки = СтрокиЭлементаДерева(Дерево);
	Если Строки = Неопределено Тогда
        Возврат;
    КонецЕсли;
	Для Каждого Строка Из Строки Цикл
		Если Строка.Отмечен = 0 Тогда
			Продолжить;
		Иначе
			НоваяСтрока = Новый Структура(ТекущийРаздел.Колонки);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			Отмеченные.Добавить(НоваяСтрока);
		КонецЕсли;
		
		Подстроки = СтрокиЭлементаДерева(Строка);
		Если Подстроки <> Неопределено И Подстроки.Количество()>0 Тогда
			ОбходДерева(Строка, Отмеченные);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
// BSLLS:TransferringParametersBetweenClientAndServer-on

&НаКлиенте
Процедура ОтметитьВсеИерархическийСписокНажатие(Элемент)
	ОтмеченыВсе = Не ОтмеченыВсе;
	Потомки = СтрокиЭлементаДереваНаКлиенте(ИерархическийСписок);
	Для Каждого Потомок Из Потомки Цикл
		Потомок.Отмечен = ОтмеченыВсе;
		ПроставитьПометкиВниз(Потомок);
	КонецЦикла;
КонецПроцедуры

