
&НаСервере
Процедура ЗаполнитьКолонкиИерархическогоСписка() Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	
	ТабПоле = ЭлемФормы[ИмяТаблицы];
	Таблица = ДанныеФормыВЗначение(ЭтаФорма[ИмяТаблицы], Тип("ДеревоЗначений"));
	Таблица.Строки.Очистить();
	Таблица.Колонки.Очистить();
		
	СоздатьРеквизитыФормыИерархическийСписок(Таблица, ИмяТаблицы);
	
	Если ТекущийРаздел.Свойство("ЭлементыФормы") Тогда
		Для Каждого Элем Из ТекущийРаздел.ЭлементыФормы Цикл
			Если Не ЭлемФормы.Найти(Элем) = Неопределено Тогда
				ЭлемФормы.Удалить(ЭлемФормы.Найти(Элем));
			КонецЕсли;
		КонецЦикла;
		ТекущийРаздел.ЭлементыФормы.Очистить();
	Иначе
		ТекущийРаздел.Вставить("ЭлементыФормы", Новый Массив());
	КонецЕсли;
		
	ЭлемГруппа = ЭлемФормы.Добавить(ИмяТаблицы + "ГруппаОтмечен", Тип("ГруппаФормы"), ТабПоле);
	ЭлемГруппа.Вид = ВидГруппыФормы.ГруппаКолонок;
	ЭлемГруппа.Группировка = ГруппировкаКолонок.Горизонтальная;
	ЭлемГруппа.ОтображатьВШапке  = Ложь;
	
	ЭлемФормы.ИерархическийСписок.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
	ТекущийРаздел.ЭлементыФормы.Добавить(ИмяТаблицы + "ГруппаОтмечен");
	
	Элем = ЭлемФормы.Добавить(ИмяТаблицы + "Отмечен", Тип("ПолеФормы"), ЭлемГруппа);
	Элем.Вид = ВидПоляФормы.ПолеФлажка;
	// BSLLS:MissingCodeTryCatchEx-off
	Попытка
		Элем.ВидФлажка = ВидФлажка.Флажок;
		Элем.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
		Элем.ОтметкаОбязательногоЗаполнения = Ложь;
	Исключение
	КонецПопытки;
	// BSLLS:MissingCodeTryCatchEx-on	
	Элем.ПутьКДанным = ИмяТаблицы + "." + "Отмечен";
	Элем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элем.ТриСостояния = Истина;
	УстановитьДействиеНаЭлемент(Элем, "ПриИзменении", "ИерархическийСписокПриИзмененииФлажка");
	ЭтоПерваяКолонка = Истина;
	ТекущийРаздел.ЭлементыФормы.Добавить(ИмяТаблицы + "Отмечен");
	
	
	ТекущийРаздел.Вставить("Колонки", "");
	ЗаполнитьТекущийРазделКолонкиИерархическийСписок();
	
	Колонки = get_prop(ТекущийРаздел.ПараметрыОтображения, "Columns", get_prop(ТекущийРаздел.ПараметрыОтображения, "COLUMNS"));
	
	Для Каждого Колонка Из Колонки Цикл
		ЗаполнитьВидимостьКолонкиПлоскогоСписка(ТабПоле,Колонка,ЭлемФормы,ИмяТаблицы,ЭлемГруппа);		
	КонецЦикла;
	ЗначениеВДанныеФормы(Таблица, ЭтаФорма[ИмяТаблицы]);
	УстановитьУсловноеОформление(ИмяТаблицы, Колонки);
КонецПроцедуры

&НаКлиенте
Процедура ИерархическийСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Колонка.Имя = "ИерархическийСписокЗагрузитьЕще" Тогда
		ЭлементыДерева = ИерархическийСписок.ПолучитьЭлементы();
		Попытка
			ЭлементыДерева.Удалить(Элемент.ТекущиеДанные);
			ИдРодителя = Неопределено;
		Исключение
			Родитель = Элемент.ТекущиеДанные.ПолучитьРодителя();
			ИдРодителя = Родитель.ПолучитьИдентификатор(); 
			ЭлементыРодителя = Родитель.ПолучитьЭлементы();
			Для каждого ЭлементРодителя Из ЭлементыРодителя Цикл
				Если ЭлементРодителя.Свойство("ЗагрузитьЕще") И ЭлементРодителя.ЗагрузитьЕще = "Загрузить еще" Тогда
					Родитель.ПолучитьЭлементы().Удалить(ЭлементРодителя);
					Продолжить;
				КонецЕсли;
			КонецЦикла;
		КонецПопытки;
		ЗагрузитьЕщеИерархическийСписокНажатие(ИдРодителя);
		Возврат;	
	КонецЕсли;
	ОткрытьФорму1СПоСтрокеПлоскогоСписка(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЕщеИерархическийСписокНажатие(ИдРодителя = Неопределено)
	БылоСтрок = ИерархическийСписок.ПолучитьЭлементы().Количество(); 
	
	Если ИдРодителя = Неопределено Тогда
		ЭтаФорма.Страница = ЭтаФорма.Страница + 1;
		ОбновитьСписок(ДанныеФильтра.Значения);
		ПолучитьЭлементыФормы().ИерархическийСписок.ТекущаяСтрока = СтрокаТаблицыФормы(ИерархическийСписок.ПолучитьЭлементы(), БылоСтрок);	
	Иначе
		ИерархическийСписокПередРазворачиванием(ЭтаФорма.ТекущийЭлемент, ИдРодителя, Истина, Ложь);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИерархическийСписокПередРазворачиванием(Элемент, Строка, ЗагрузитьЕще = Ложь, Отказ = Ложь)
	ПерваяКолонка = ТекущийРаздел.ПараметрыОтображения["COLUMNS"][0]["NAME"];
	ТекДанные = ИерархическийСписок.НайтиПоИдентификатору(Строка);
	Отметка = ТекДанные.Отмечен;
	Строки = СтрокиЭлементаДереваНаКлиенте(ТекДанные);
	Если get_prop(Строки[0], ПерваяКолонка) = "Нет подчиненных" ИЛИ ЗагрузитьЕще Тогда
		Если Не ЗагрузитьЕще Тогда
			Строки.Очистить();
		КонецЕсли;	
		ПолеЭтоГруппа = ТекущийРаздел.ПараметрыОтображения["NODE_PROPERTY"];
		ПолеИд = ТекущийРаздел.ПараметрыОтображения["KEY_PROPERTY"];
		ИдСтроки = get_prop(ТекДанные, ПолеИд);
		Рез = ИерархическийСписокПередРазворачиваниемНаКлиенте(ИдСтроки);
		Для Каждого Стр Из Рез Цикл
			СтрТ = Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТ, Стр);
			// Если полученная строка является группой, то создаем 
			// фиктивную подчиненную строку.
			Если get_prop(Стр, ПолеЭтоГруппа) = Истина Тогда
				ПерваяКолонка = ТекущийРаздел.ПараметрыОтображения["COLUMNS"][0]["NAME"];
				Подстроки = СтрокиЭлементаДереваНаКлиенте(СтрТ);
				ПодстрокаДерева = Подстроки.Добавить();
				ПодстрокаДерева[ПерваяКолонка] = "Нет подчиненных";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ИерархическийСписокПередРазворачиваниемНаКлиенте(ИдСтроки)
	
	КлючРодителя = "id" + СтрЗаменить(ИдСтроки, "-", "_");
	Если ЭтаФорма.СтраницыПоРодителям = Неопределено Тогда
		ЭтаФорма.СтраницыПоРодителям = Новый Структура;
		ТекущаяСтраницаПоРодителю = 0;
		ЭтаФорма.СтраницыПоРодителям.Вставить(КлючРодителя, ТекущаяСтраницаПоРодителю);
	Иначе	
		ТекущаяСтраницаПоРодителю = get_prop(ЭтаФорма.СтраницыПоРодителям, КлючРодителя, -1);
		СтраницыПоРодителям.Вставить(КлючРодителя, ТекущаяСтраницаПоРодителю + 1);
	КонецЕсли;
		
	Фильтр = ДанныеФильтра.Значения;
	ПолеРодителя = ТекущийРаздел.ПараметрыОтображения["PARENT_PROPERTY"];
	Фильтр.Вставить(ПолеРодителя, ИдСтроки);
	Данные = ПолучитьДанныеСписка(Фильтр);
	Фильтр.Удалить(ПолеРодителя);
	
	Возврат ЗаполнитьДанныеПодчиненногоЭлемента(ИдСтроки, Данные);
КонецФункции

Функция ЗаполнитьДанныеПодчиненногоЭлемента(ИдСтроки, Данные)
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	Таблица = ДанныеФормыВЗначение(ЭтаФорма[ИмяТаблицы], Тип("ДеревоЗначений"));
	ПолеИд = ТекущийРаздел.ПараметрыОтображения["KEY_PROPERTY"];
	Строка = Таблица.Строки.НайтиСтроки(Новый Структура(ПолеИд, ИдСтроки), Истина);
	Строка[0].Строки.Очистить();
	ЗаполнитьДанныеИерархическогоСписка(Строка[0], Данные);
	
	Возврат СтрокиДереваВМассив(Строка[0].Строки, Таблица.Колонки);	
КонецФункции

Функция СтрокиДереваВМассив(Строки, Колонки) Экспорт
	
	Результат = Новый Массив;
	СтруктураКолонок = Новый Структура;
	Для каждого ТекущаяКолонка Из Колонки Цикл
		СтруктураКолонок.Вставить(ТекущаяКолонка.Имя);
	КонецЦикла;
	Для каждого ТекущаяСтрока Из Строки Цикл
		СтруктураТекущейСтроки = Новый Структура;
		Для каждого ТекущийКлюч Из СтруктураКолонок Цикл
			СтруктураТекущейСтроки.Вставить(ТекущийКлюч.Ключ);
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(СтруктураТекущейСтроки, ТекущаяСтрока);
		Результат.Добавить(СтруктураТекущейСтроки);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура СоздатьРеквизитыФормыИерархическийСписок(Таблица, ИмяТаблицы)
	РеквизитыУдалить = Новый Массив();
	Реквизиты = Новый Массив();
	СоздатьРеквизитыТаблицыФормы(Таблица, ИмяТаблицы, Реквизиты, РеквизитыУдалить);
	
	Рек = Новый РеквизитФормы("Отмечен", Новый ОписаниеТипов("Число"), ИмяТаблицы);
	Реквизиты.Добавить(Рек);
	Таблица.Колонки.Добавить("Отмечен", Новый ОписаниеТипов("Число"));
	
	ИзменитьРеквизиты(Реквизиты, РеквизитыУдалить);
КонецПроцедуры

&НаКлиенте
Функция РодительЭлементаДерева(Элемент)
	Возврат Элемент.ПолучитьРодителя();
КонецФункции

&НаКлиенте
Функция СтрокиЭлементаДереваНаКлиенте(Элемент)
	Возврат Элемент.ПолучитьЭлементы();
КонецФункции

Функция СтрокиЭлементаДерева(Элемент)
	Возврат Элемент.ПолучитьЭлементы();
КонецФункции

&НаСервере
Процедура ЗаполнитьТекущийРазделКолонкиИерархическийСписок()
	Дерево = ДанныеФормыВЗначение(ЭтаФорма.ИерархическийСписок, Тип("ДеревоЗначений"));
	Для Каждого Колонка Из Дерево.Колонки Цикл 
		ТекущийРаздел.Колонки = ТекущийРаздел.Колонки + Колонка.Имя + ",";	
	КонецЦикла;	
КонецПроцедуры

