
&НаСервере
Процедура ЗаполнитьКолонкиИерархическогоСписка() Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ИмяТаблицы = ТекущийРаздел["Шаблон"]; 
	
	ИконкиВДанных = Новый Соответствие;
	ИконкиВДанных.Очистить();
	ТабПоле = ЭлемФормы[ИмяТаблицы];
	ТабПоле.Значение.Строки.Очистить();
	ТабПоле.Колонки.Очистить();
	ТабПоле.Значение.Колонки.Очистить();
	Поле = ТабПоле.Колонки.Добавить(ИмяТаблицы + "Отмечен", " ");
	ТабПоле.Значение.Колонки.Добавить("Отмечен", Новый ОписаниеТипов("Булево"));
	Поле.УстановитьЭлементУправления(Тип("Флажок"));
	Поле.ДанныеФлажка = "Отмечен";
	Поле.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
	Поле.Ширина = 6;
	Поле.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
	Поле.ОтображатьИерархию = Истина;
	
	ЭлемФормы.ИерархическийСписок.РежимВыделения = РежимВыделенияТабличногоПоля.Одиночный;
	Если get_prop(ТекущийРаздел, "МножественныйВыбор") <> Истина Тогда
		Поле.Видимость = Ложь;
		ЭлемФормы.ОтметитьВсеИерархическийСписок.Видимость = Ложь;
		ЭлемФормы.ОтметитьВсеИерархическийСписок.Доступность = Ложь;
	КонецЕсли;
	
	ТекущийРаздел.Вставить("Колонки", "");
	КвалификаторыСтроки = Новый КвалификаторыСтроки();
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
	Колонки = get_prop(ТекущийРаздел.ПараметрыОтображения, "Columns", get_prop(ТекущийРаздел.ПараметрыОтображения, "COLUMNS"));
	Для Каждого Колонка Из Колонки Цикл
		ОписаниеТипа = ОписаниеТипаСтрока;
		ТипКолонки = get_prop(Колонка, "TYPE", get_prop(Колонка, "Type"));
		Если ТипКолонки <> Неопределено Тогда
			ОписаниеТипа = ОписаниеТипаКолонки(ТипКолонки);
		КонецЕсли;
		ЗаполнитьВидимостьКолонкиПлоскогоСписка(ТабПоле,Колонка,ЭлемФормы,ИмяТаблицы,ОписаниеТипа);
	КонецЦикла;
	// Принудительно добавляем в ТЗ колонку "ЗагрузитьЕще", если её нет
	Если ТабПоле.Колонки.Найти(ИмяТаблицы + "ЗагрузитьЕще") = Неопределено Тогда
		ДобавитьРеквизитыЗагрузитьЕще(ТабПоле, ИмяТаблицы, ОписаниеТипаСтрока);
	КонецЕсли;
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТипаПроизвольный = Новый ОписаниеТипов();	
	
	Колонка = Новый Структура("VISIBLE", Ложь);
		
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, "ИмяИС", ,ОписаниеТипаСтрока, "ИмяИС", Колонка);
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, "ИдИС", ,ОписаниеТипаСтрока, "ИдИС", Колонка);
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, "ТипИС", ,ОписаниеТипаСтрока, "ТипИС", Колонка);
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, "ИмяСБИС", ,ОписаниеТипаСтрока, "ИмяСБИС", Колонка);
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, "ИдСБИС", ,ОписаниеТипаСтрока, "ИдСБИС", Колонка);
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, "ДокументСБИС", ,ОписаниеТипаПроизвольный, "ДокументСБИС", Колонка);
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, "ОбъектИС", ,ОписаниеТипаПроизвольный, "ОбъектИС", Колонка);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИерархическийСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Колонка.Имя = "ИерархическийСписокЗагрузитьЕще" Тогда
		ЭлементыДерева = ИерархическийСписок;
		Попытка	
			ЭлементыДерева.Строки.Удалить(Элемент.ТекущиеДанные);
			Родитель = Неопределено;
		Исключение
			Родитель = Элемент.ТекущиеДанные.Родитель; 
			ЭлементыРодителя = Родитель.Строки;
			Для каждого ЭлементРодителя Из ЭлементыРодителя Цикл
				Если get_prop(ЭлементРодителя, "ЗагрузитьЕще") = "Загрузить еще" Тогда
					Родитель.Строки.Удалить(ЭлементРодителя);
					Продолжить;
				КонецЕсли;
			КонецЦикла;
		КонецПопытки;
		ЗагрузитьЕщеИерархическийСписокНажатие(Родитель);
		Возврат;	
	КонецЕсли;
	ОткрытьФорму1СПоСтрокеПлоскогоСписка(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЕщеИерархическийСписокНажатие(Родитель = Неопределено)
	Если Родитель = Неопределено Тогда
		ЭтаФорма.Страница = ЭтаФорма.Страница + 1;
		ОбновитьСписок(ДанныеФильтра.Значения);	
	Иначе
		ИерархическийСписокПередРазворачиванием(ЭтаФорма.ТекущийЭлемент, Родитель, Истина, Ложь);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИерархическийСписокПередРазворачиванием(Элемент, Строка, ЗагрузитьЕще = Ложь, Отказ = Ложь)
	ПерваяКолонка = ТекущийРаздел.ПараметрыОтображения["COLUMNS"][0]["NAME"];
	Если Строка.Строки[0][ПерваяКолонка] = "Нет подчиненных" ИЛИ ЗагрузитьЕще Тогда
		Если Не ЗагрузитьЕще Тогда
			Строка.Строки.Очистить();
		КонецЕсли;

		ПолеИд = ТекущийРаздел.ПараметрыОтображения["KEY_PROPERTY"];
		ИдСтроки = Строка[ПолеИд];		
		КлючРодителя = "id" + СтрЗаменить(ИдСтроки, "-", "_");
		Если ЭтаФорма.СтраницыПоРодителям = Неопределено Тогда
			ЭтаФорма.СтраницыПоРодителям = Новый Структура;
			ТекущаяСтраницаПоРодителю = 0;
			ЭтаФорма.СтраницыПоРодителям.Вставить(КлючРодителя, ТекущаяСтраницаПоРодителю);
		Иначе	
			ТекущаяСтраницаПоРодителю = get_prop(ЭтаФорма.СтраницыПоРодителям, КлючРодителя, -1);
			СтраницыПоРодителям.Вставить(КлючРодителя, ТекущаяСтраницаПоРодителю + 1);
		КонецЕсли;
		ПолеРодителя = ТекущийРаздел.ПараметрыОтображения["PARENT_PROPERTY"];
		Фильтр = ДанныеФильтра.Значения;
		Фильтр.Вставить(ПолеРодителя, ИдСтроки);
		Данные = ПолучитьДанныеСписка(Фильтр);
		Фильтр.Удалить(ПолеРодителя);
		ЗаполнитьДанныеИерархическогоСписка(Строка, Данные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция РодительЭлементаДерева(Элемент)
	Возврат Элемент.Родитель;
КонецФункции

&НаКлиенте
Функция СтрокиЭлементаДереваНаКлиенте(Элемент)
	Возврат Элемент.Строки;
КонецФункции

Функция СтрокиЭлементаДерева(Элемент)
	Возврат Элемент.Строки;
КонецФункции

