
&НаКлиенте
Процедура CALC_INI(Команда) Экспорт
	context_param = ПроверитьНаличиеПараметровПодключенияНаСервере();
	ПараметрыКоманды = ПараметрыКоманд[Команда.Имя];
	algorithm = ПараметрыКоманды["algorithm"];
	endpoint = ?(ПараметрыКоманды.Свойство("endpoint"), ПараметрыКоманды["endpoint"], "main");
	title_oper = ?(ПараметрыКоманды.Свойство("title"), ПараметрыКоманды["title"], "Операция выполняется");
	
	Filter = ФильтрДляКоманды();
	EndpointArgs = Новый Структура("Filter", Filter);
    params = Новый Структура("Endpoint, EndpointArgs", endpoint, EndpointArgs);
	ЗапуститьINIФоновымЗаданием(
		algorithm,
		params,
		context_param,
		ЭтаФорма, 
		title_oper);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВSABYНажатие(Элемент)
	СписокОтмеченных = СписокОтмеченныхЗаписей();
	Если СписокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТекущийДокументСБИС = СписокОтмеченных[0].ДокументСБИС;
	Если ТекущийДокументСБИС <> Неопределено Тогда
		АдресДокумента = ПолучитьПрямуюССылку(ТекущийДокументСБИС["СсылкаДляНашаОрганизация"]);
		#Если ТолстыйКлиентОбычноеПриложение Тогда 
// BSLLS:UsingSynchronousCalls-off
// Продолженное сонаром НачатьЗапускПриложения нам не подходит
 			ЗапуститьПриложение(АдресДокумента); 
// BSLLS:UsingSynchronousCalls-on
		#Иначе	
			ПерейтиПоНавигационнойСсылке(АдресДокумента);	
		#КонецЕсли		
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВСБИСНажатие(Команда) Экспорт
	СписокОтмеченных = СписокОтмеченныхЗаписей();
	МассивСсылокОтмеченных = МассивСсылокДокументыИС(СписокОтмеченных);
	Если МассивСсылокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	ПарамФормы = Новый Структура("ИмяИни", "");
	
	ОписаниеКоманды = Новый Структура("Представление,ПараметрыФормы", "Загрузить в SABY", ПарамФормы);
	
	ПараметрКоманды = Новый Структура();
	ПараметрКоманды.Вставить("Источник", МассивСсылокОтмеченных);
	ПараметрКоманды.Вставить("ОписаниеКоманды",ОписаниеКоманды);
	ПараметрКоманды.Вставить("ЭтоФормаОбъекта", Ложь);
	ПараметрКоманды.Вставить("Форма", ЭтаФорма);
    ЗагрузитьВСБИС( Команда, ПараметрКоманды );
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВСБИСНажатие(Элемент)
	СписокОтмеченных = СписокОтмеченныхЗаписей();
	МассивСсылокОтмеченных = МассивСсылокДокументыИС(СписокОтмеченных);
	Если МассивСсылокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	ОписаниеКоманды = Новый Структура("Представление", "Открыть в SABY");
	
	ПараметрКоманды = Новый Структура();
	ПараметрКоманды.Вставить("Источник", МассивСсылокОтмеченных);
	ПараметрКоманды.Вставить("ОписаниеКоманды",ОписаниеКоманды);
	ПараметрКоманды.Вставить("ЭтоФормаОбъекта", Ложь);
	ПараметрКоманды.Вставить("Форма", ЭтаФорма);

	ПриНажатииОткрытьВСБИСПолучитьUID( Элемент, ПараметрКоманды );
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыНажатие(Элемент)
	СписокОтмеченных = СписокОтмеченныхЗаписей();
	МассивСсылокОтмеченных = МассивСсылокДокументыИС(СписокОтмеченных);
	Если МассивСсылокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	ОписаниеКоманды = Новый Структура("Представление", "Обновить статусы");
	
	ПараметрКоманды = Новый Структура();
	ПараметрКоманды.Вставить("Источник", МассивСсылокОтмеченных);
	ПараметрКоманды.Вставить("ОписаниеКоманды",ОписаниеКоманды);
	ПараметрКоманды.Вставить("ЭтоФормаОбъекта", Ложь);
	ПараметрКоманды.Вставить("Форма", ЭтаФорма);

	ПриНажатииОбновитьСтатусы( Элемент, ПараметрКоманды );
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВложенияИзСБИСНажатие(Элемент)
	СписокОтмеченных = СписокОтмеченныхЗаписей();
	Если СписокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	МассивСсылокОтмеченных = МассивСсылокДокументыИС(СписокОтмеченных);
	Если МассивСсылокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 

	ОписаниеКоманды = Новый Структура("Представление", "Выгрузить вложения из SABY");
	
	ПараметрКоманды = Новый Структура();
	ПараметрКоманды.Вставить("Источник", МассивСсылокОтмеченных);
	ПараметрКоманды.Вставить("ОписаниеКоманды",ОписаниеКоманды);
	ПараметрКоманды.Вставить("ЭтоФормаОбъекта", Ложь);
	ПараметрКоманды.Вставить("Форма", ЭтаФорма);

	ПриНажатииВыгрузитьВложенияИзСБИС( Элемент, ПараметрКоманды );
КонецПроцедуры

&НаКлиенте
Функция МассивСсылокДокументыИС(Список)
	МассивСсылок = Новый Массив;
	Для Каждого Запись ИЗ Список Цикл
		МассивСсылок.Добавить(Запись.ДокументИС);		
	КонецЦикла;
	Возврат МассивСсылок; 
КонецФункции

&НаКлиенте
Функция СформироватьМассивВыгружаемыхДокументов() 
	СписокОтмеченныхЗаписей = СписокОтмеченныхЗаписей(Ложь);
	ВыгружаемыеДокументы = Новый Массив();
	Для Каждого Запись Из СписокОтмеченныхЗаписей Цикл
		ДокументСБИС = Запись["ДокументСБИС"]; 
		Если ДокументСБИС <> Неопределено Тогда
			ИмяСБИС = ДокументСБИС["Тип"];
			Если ИмяСБИС = Неопределено Тогда
				ИмяСБИС = ДокументСБИС["ИмяСБИС"];
			КонецЕсли;
			ПримечаниеСБИС = ДокументСБИС["Примечание"];
			ИдентификаторДокумента = ДокументСБИС["Идентификатор"];
			ИмяИзСБИСвАПИ3(ИмяСБИС, ПримечаниеСБИС, ИдентификаторДокумента);
			
			//Убрать после 24.2100 
			Если ДокументСБИС["ИдСБИС"] = Неопределено Тогда 
				ИдСБИС = ПолучитьИдСбисИзИдентификатора(ИдентификаторДокумента);
				Если ИдСБИС <> Неопределено Тогда 
					ДокументСБИС.Вставить("ИдСБИС", Формат(ИдСБИС,"ЧГ="));
				КонецЕсли;	
			КонецЕсли;		                                	
			//---
			
			API3_ref = Новый Структура; 
			API3_ref.Вставить("SbisId",		СтрЗаменить(ДокументСБИС["ИдСБИС"], Символы.НПП, ""));
			API3_ref.Вставить("SbisType",	ИмяСБИС);
			API3_ref.Вставить("Type",		ИмяСБИС);
			API3_ref.Вставить("Title",		ДокументСБИС["Название"]);
			ВыгружаемыеДокументы.Добавить(API3_ref);

		КонецЕсли;	
	КонецЦикла;
	Возврат ВыгружаемыеДокументы; 	
КонецФункции

&НаКлиенте
Функция ПолучитьОповещениеОбновлнияТаблицыФормы( Команда, ПараметрКоманды ) Экспорт 
	
    ДопПараметры = Новый Структура("Действие, ДополнительныеПараметры", Неопределено, ПараметрКоманды);
    ОповешениеОЗакрытии = Новый ОписаниеОповещения("ОбновитьТабличнуюЧастьФормы", ЭтаФорма, ДопПараметры);
    Возврат ОповешениеОЗакрытии; 
	
КонецФункции
