
&НаКлиенте
Процедура OPEN_FORM_IS(Команда) Экспорт
	ПараметрыКоманды = ПараметрыКоманд[Команда.Имя];
	ИмяФрм = ПараметрыКоманды["Name"];
	Filter = ФильтрДляКоманды();	
	ПараметрыФормы = Новый Структура("Filter", Filter);
	ОткрытьФормуОбработки(ИмяФрм, ПараметрыФормы, ЭтаФорма, Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура CALC_INI(Команда) Экспорт
	context_param = ПроверитьНаличиеПараметровПодключенияНаСервере();
	ПараметрыКоманды = ПараметрыКоманд[Команда.Имя];
	algorithm = ПараметрыКоманды["algorithm"];
	endpoint = ?(ПараметрыКоманды.Свойство("endpoint"), ПараметрыКоманды["endpoint"], "main");
	title_oper = ?(ПараметрыКоманды.Свойство("title"), ПараметрыКоманды["title"], "Операция выполняется");
	
	Filter = ФильтрДляКоманды();
    params = Новый Структура("endpoint, Filter", endpoint, Filter);
	ЗапуститьINIФоновымЗаданием(
		algorithm,
		params,
		context_param,
		ЭтаФорма, 
		title_oper);
КонецПроцедуры
	
&НаКлиенте
Процедура ЗагрузитьВСБИСНажатие(Команда) Экспорт
	СписокОтмеченных = СписокОтмеченныхЗаписей();
	МассивСсылокОтмеченных = МассивСсылокДокументыИС(СписокОтмеченных);
	Если МассивСсылокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	ПараметрыФормы = Новый Структура("ИмяИни","");
	
	ОписаниеКоманды = Новый Структура("Представление,ПараметрыФормы", "Загрузить в SABY", ПараметрыФормы);
	
	ПараметрКоманды = Новый Структура();
	ПараметрКоманды.Вставить("Источник", МассивСсылокОтмеченных);
	ПараметрКоманды.Вставить("ОписаниеКоманды",ОписаниеКоманды);
	ПараметрКоманды.Вставить("ЭтоФормаОбъекта", Ложь);
	ПараметрКоманды.Вставить("Форма", ЭтаФорма);
    ЗагрузитьВСБИС( Команда, ПараметрКоманды );
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВСБИСНажатие(Элемент)
	СписокОтмеченных = СписокОтмеченныхЗаписей();
	МассивСсылокОтмеченных = МассивСсылокДокументыИС(СписокОтмеченных);
	Если МассивСсылокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	ОписаниеКоманды = Новый Структура("Представление", "Открыть в SABY");
	
	ПараметрКоманды = Новый Структура();
	ПараметрКоманды.Вставить("Источник", МассивСсылокОтмеченных);
	ПараметрКоманды.Вставить("ОписаниеКоманды",ОписаниеКоманды);
	ПараметрКоманды.Вставить("ЭтоФормаОбъекта", Ложь);
	ПараметрКоманды.Вставить("Форма", ЭтаФорма);

	ПриНажатииОткрытьВСБИСПолучитьUID( Элемент, ПараметрКоманды );
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыНажатие(Элемент)
	СписокОтмеченных = СписокОтмеченныхЗаписей();
	МассивСсылокОтмеченных = МассивСсылокДокументыИС(СписокОтмеченных);
	Если МассивСсылокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	ОписаниеКоманды = Новый Структура("Представление", "Обновить статусы");
	
	ПараметрКоманды = Новый Структура();
	ПараметрКоманды.Вставить("Источник", МассивСсылокОтмеченных);
	ПараметрКоманды.Вставить("ОписаниеКоманды",ОписаниеКоманды);
	ПараметрКоманды.Вставить("ЭтоФормаОбъекта", Ложь);
	ПараметрКоманды.Вставить("Форма", ЭтаФорма);

	ПриНажатииОбновитьСтатусы( Элемент, ПараметрКоманды );
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВложенияИзСБИСНажатие(Элемент)
	СписокОтмеченных = СписокОтмеченныхЗаписей();
	Если СписокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	МассивСсылокОтмеченных = МассивСсылокДокументыИС(СписокОтмеченных);
	Если МассивСсылокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 

	ОписаниеКоманды = Новый Структура("Представление", "Выгрузить вложения из SABY");
	
	ПараметрКоманды = Новый Структура();
	ПараметрКоманды.Вставить("Источник", МассивСсылокОтмеченных);
	ПараметрКоманды.Вставить("ОписаниеКоманды",ОписаниеКоманды);
	ПараметрКоманды.Вставить("ЭтоФормаОбъекта", Ложь);
	ПараметрКоманды.Вставить("Форма", ЭтаФорма);

	ПриНажатииВыгрузитьВложенияИзСБИС( Элемент, ПараметрКоманды );
КонецПроцедуры

&НаКлиенте
Функция МассивСсылокДокументыИС(Список)
	МассивСсылок = Новый Массив;
	Для Каждого Запись ИЗ Список Цикл
		МассивСсылок.Добавить(Запись.ДокументИС);		
	КонецЦикла;
	Возврат МассивСсылок; 
КонецФункции

