
&НаКлиенте
Функция СоответствиеФормОбработки(ИмяФрм)
	СоответствиеФорм = Новый Соответствие;
	СоответствиеФорм.Вставить("importDocuments", "ЗагрузкаДокументов");
	СоответствиеФорм.Вставить("OperationImport", "ЗагрузкаДокументов");
	СоответствиеФорм.Вставить("OperationEdoAction", "ВыполнитьДействие");
	ИтоговаяФорма = СоответствиеФорм.Получить(ИмяФрм);
	Если ИтоговаяФорма <> Неопределено Тогда
		Возврат ИтоговаяФорма;
	КонецЕсли;
	Возврат ИмяФрм;
КонецФункции

&НаКлиенте
Процедура OPEN_FORM_MODULE(Команда) Экспорт
	ПараметрыКоманды = ПараметрыКоманд[Команда.Имя];
	ИмяФрм = ПараметрыКоманды["Template"]; 
	ИмяФрм = СоответствиеФормОбработки(ИмяФрм);
	Filter = ФильтрДляКоманды();
	ПарамФормы = Новый Структура("Filter", Filter);
	ПарамФормы.Вставить("ПараметрыКоманды", ПараметрыКоманды);
	Попытка 
		ОткрытьФормуОбработки(ИмяФрм, ПарамФормы, ЭтаФорма, Новый УникальныйИдентификатор());
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Если Ошибка.Описание = "Ошибка при вызове метода контекста (ОткрытьФорму)" Тогда
			Сообщить("Форма " + ИмяФрм + " не реализована в этой версии приложения");
		Иначе
			Сообщить(Ошибка.Описание);
		КонецЕсли;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСуществующего(ИмяФрм) 
	СписокОтмеченных = СписокОтмеченныхЗаписей();	
	Если СписокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ПервыйЭлемент = СписокОтмеченных[0]; 
	ОбъектИС = get_prop(ПервыйЭлемент, "ОбъектИС", Неопределено);	
	ТипИС = get_prop(ПервыйЭлемент, "ТипИС", "");
	ИмяИС = get_prop(ПервыйЭлемент, "ИмяИС", ""); 
	Если Не ЗначениеЗаполнено(ОбъектИС) Тогда
		Если ТипИС <> "" Тогда
			ИмяИС = ТипИС + "." + ИмяИС;
		КонецЕсли;
		ИдИС = get_prop(ПервыйЭлемент, "ИдИС", "");
		ОбъектИС = ПолучитьСсылкуПоИдИСНаСервере(ИмяИС, ИдИС);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОбъектИС) Тогда
		Сообщить("Не удалось определить объект 1С");
		Возврат;
	КонецЕсли;
	Если ИмяФрм = Неопределено Тогда
		Попытка
			ОткрытьПоказатьЗначение(ОбъектИС);
		Исключение
			Сообщить(ИнформацияОбОшибке().Описание);
		КонецПопытки;
		Возврат;
	КонецЕсли;  
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Ключ", ОбъектИС);
	ОткрытьФорму(ИмяФрм, ПараметрыОткрытияФормы);
КонецПроцедуры	


&НаКлиенте
Процедура OPEN_FORM_IS(Команда) Экспорт
	ПараметрыКоманды = ПараметрыКоманд[Команда.Имя];
	ИмяФрм = get_prop(ПараметрыКоманды, "Template", Неопределено);
	Args = get_prop(ПараметрыКоманды, "Args", Неопределено);
	CreateMode = get_prop(Args, "CreateMode", Неопределено);
	ClientType = get_prop(Args, "ClientType", Неопределено);
	Если CreateMode <> Истина Тогда 
		ОткрытьФормуСуществующего(ИмяФрм);
		Возврат;
	КонецЕсли;	
	Если ИмяФрм = Неопределено Тогда 
		ИмяФрм = ClientType + ".ФормаОбъекта";
	КонецЕсли;	
	ОткрытьФорму(ИмяФрм);  		
КонецПроцедуры

&НаКлиенте
Процедура REFRESH_ITEMS(Команда) Экспорт
	ОбновитьТабличнуюЧастьФормы(Неопределено, Неопределено);		
КонецПроцедуры

&НаКлиенте
Функция ВыделитьИдентификатор(ИдСБИС)
	МассивСтрокСРазделителем = СтрРазделить82(ИдСБИС, "_");	
	ИтоговаяСтрока = "";
	Для Каждого ВыбраннаяСтрока Из МассивСтрокСРазделителем Цикл  
		Если СтрДлина(ВыбраннаяСтрока) <> 36 Тогда	
			Прервать;
		КонецЕсли;	 
		Если ИтоговаяСтрока <> "" Тогда
			ИтоговаяСтрока = ИтоговаяСтрока + "_";
		КонецЕсли;
		ИтоговаяСтрока = ИтоговаяСтрока + ВыбраннаяСтрока;	
	КонецЦикла;
	Возврат ИтоговаяСтрока;
КонецФункции	

&НаКлиенте
Функция СсылкаSabyНаОбъект(ОбъектАнализа)  
	АдресОбъекта = "";
	ТекущийОбъектСБИС = get_prop(ОбъектАнализа, "ДокументСБИС", Неопределено);
	Если Не ЗначениеЗаполнено(ТекущийОбъектСБИС) Тогда
		ИдСБИС = get_prop(ОбъектАнализа, "ИдСБИС");
		ИдСБИС = ВыделитьИдентификатор(ИдСБИС);
		Если Не ЗначениеЗаполнено(ИдСБИС) Тогда 
			Сообщить("Документ отсутствует в SABY");
			Возврат "";
		КонецЕсли;	
		ОбъектАнализа.Вставить("UID", ИдСБИС);
		ОбъектАнализа.Вставить("Ссылка", ОбъектАнализа.ОбъектИС);
		МассивОбъектовИС = Новый Массив;
		МассивОбъектовИС.Добавить(ОбъектАнализа);
		СсылкиНаДокументыВИнтеграции = ТранспортИнтеграции.ПолучитьСсылкиНаДокументыВИнтеграции(МассивОбъектовИС); 
		Если СсылкиНаДокументыВИнтеграции.ОбработаноУспешно.Количество() > 0 Тогда
			АдресОбъекта = get_prop(СсылкиНаДокументыВИнтеграции.ОбработаноУспешно.Получить(0), "АдресСтраницы");
		Иначе
			СообщениеОбОшибке = get_prop(СсылкиНаДокументыВИнтеграции.ОбработаноСОшибкой.Получить(0), "Сообщение", "Неизвестная ошибка открытия формы SABY."); 
			Сообщить(СообщениеОбОшибке);
			Возврат "";
		КонецЕсли;	
	Иначе
		АдресОбъекта = ПолучитьПрямуюССылку(get_prop(ТекущийОбъектСБИС, "СсылкаДляНашаОрганизация"));	
	КонецЕсли;	
	Возврат АдресОбъекта;
КонецФункции	


&НаКлиенте
Процедура OPEN_FORM_SABY(Команда) Экспорт
	СписокОтмеченных = СписокОтмеченныхЗаписей();
	Если СписокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ПервыйЭлемент = СписокОтмеченных[0]; 
	АдресОбъекта = СсылкаSabyНаОбъект(ПервыйЭлемент);
	Если АдресОбъекта = "" Тогда
		Возврат;
	КонецЕсли;	
	#Если ТолстыйКлиентОбычноеПриложение Тогда 
		// BSLLS:UsingSynchronousCalls-off
		// Продолженное сонаром НачатьЗапускПриложения нам не подходит
		ЗапуститьПриложение(АдресОбъекта); 
		// BSLLS:UsingSynchronousCalls-on
	#Иначе	
		ПерейтиПоНавигационнойСсылке(АдресОбъекта);	
	#КонецЕсли		
	
КонецПроцедуры


&НаКлиенте
Процедура BLOCKLY_RUN_FOR_SELECTED_ITEMS(ПараметрыКоманды)
	context_param = ПроверитьНаличиеПараметровПодключенияНаСервере();
	Algorithm = ПараметрыКоманды["Algorithm"];
	Endpoint = ?(ПараметрыКоманды.Свойство("Endpoint"), ПараметрыКоманды["Endpoint"], "main");
	title_oper = "Операция выполняется";
	Filter = ФильтрДляКоманды();
	EndpointArgs = Новый Структура("Filter", Filter);
    params = Новый Структура("Endpoint, EndpointArgs", endpoint, EndpointArgs);
	ЗапуститьINIФоновымЗаданием(
		Algorithm,
		params,
		context_param,
		ЭтаФорма, 
		title_oper);
КонецПроцедуры


&НаКлиенте
Процедура BLOCKLY_RUN_FOR_SELECTED_ITEMS_IN_MODULE(Команда) Экспорт
	ПараметрыКоманды = ПараметрыКоманд[Команда.Имя];
	BLOCKLY_RUN_FOR_SELECTED_ITEMS(ПараметрыКоманды);
КонецПроцедуры

&НаКлиенте
Процедура BLOCKLY_RUN_FOR_SELECTED_ITEMS_IN_CONNECTOR(Команда) Экспорт
	ПараметрыКоманды = ПараметрыКоманд[Команда.Имя];
	BLOCKLY_RUN_FOR_SELECTED_ITEMS(ПараметрыКоманды);
КонецПроцедуры
