
&НаКлиенте
Функция ПолучитьОповещениеОбновлнияТаблицыФормы( Команда, ПараметрКоманды ) Экспорт 
	
    ДопПараметры = Новый Структура("Действие, ДополнительныеПараметры", Неопределено, ПараметрКоманды);
    ОповешениеОЗакрытии = Новый ОписаниеОповещения("ОбновитьТабличнуюЧастьФормы", ЭтаФорма, ДопПараметры);
    Возврат ОповешениеОЗакрытии; 
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТабличнуюЧастьФормы( Действие, ДополнительныеПараметры ) Экспорт 
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	ЭтаФорма[ИмяТаблицы].Очистить();
	ТекущаяСтраница = Страница;
	//Постраничный цикл необходим, т.к. некоторые списки строятся только порциями
	Для Страница = 0 По ТекущаяСтраница Цикл
		ОбновитьСписок(ДанныеФильтра.Значения);
		Если Страница <> ТекущаяСтраница Тогда 
			КоличествоСтрок = ЭтаФорма[ИмяТаблицы].Количество();
			ЭтаФорма[ИмяТаблицы].Удалить(КоличествоСтрок-1);
		КонецЕсли;	
	КонецЦикла;
	Страница = ТекущаяСтраница;

КонецПроцедуры
