
&НаКлиенте
Процедура ОбновитьТабличнуюЧастьФормы( Действие, ДополнительныеПараметры ) Экспорт 
	
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	Если ИмяТаблицы = "СтраницаЗаглушка" Тогда
		Возврат;
	КонецЕсли;
	Если ИмяТаблицы = "ПлоскийСписок" Тогда
		ЭтаФорма[ИмяТаблицы].Очистить();
	Иначе
		СтрокиЭлементаДереваНаКлиенте(ЭтаФорма[ИмяТаблицы]).Очистить();	
	КонецЕсли;
		
	ТекущаяСтраница = Страница;
	//Постраничный цикл необходим, т.к. некоторые списки строятся только порциями
	Для Страница = 0 По ТекущаяСтраница Цикл
		ОбновитьСписок(ДанныеФильтра.Значения);
		Если Страница <> ТекущаяСтраница Тогда 	
			Если ИмяТаблицы = "ПлоскийСписок" Тогда
				КоличествоСтрок = ЭтаФорма[ИмяТаблицы].Количество();
				ЭтаФорма[ИмяТаблицы].Удалить(КоличествоСтрок-1);
			Иначе
				КоличествоСтрок = СтрокиЭлементаДереваНаКлиенте(ЭтаФорма[ИмяТаблицы]).Количество();
				СтрокиЭлементаДереваНаКлиенте(ЭтаФорма[ИмяТаблицы]).Удалить(КоличествоСтрок-1);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	Страница = ТекущаяСтраница;

КонецПроцедуры
