
&НаКлиенте
Процедура ОбновитьТабличнуюЧастьФормы( Действие, ДополнительныеПараметры ) Экспорт 
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	Если ИмяТаблицы = "СтраницаЗаглушка" Тогда
		Возврат;
	КонецЕсли;
	ЭтаФорма[ИмяТаблицы].Очистить();
	ТекущаяСтраница = Страница;
	//Постраничный цикл необходим, т.к. некоторые списки строятся только порциями
	Для Страница = 0 По ТекущаяСтраница Цикл
		ОбновитьСписок(ДанныеФильтра.Значения);
		Если Страница <> ТекущаяСтраница Тогда 
			КоличествоСтрок = ЭтаФорма[ИмяТаблицы].Количество();
			ЭтаФорма[ИмяТаблицы].Удалить(КоличествоСтрок-1);
		КонецЕсли;	
	КонецЦикла;
	Страница = ТекущаяСтраница;

КонецПроцедуры
