
#Область include_core_base_ГлавноеОкно_СписокОФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ПанельОперацийОФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_АвторизацияОФ
#КонецОбласти

Процедура ПолучитьИмяФормы()
	ИмяФормы = "ГлавноеОкно";
КонецПроцедуры

&НаКлиенте
Функция ТекущийДокументИС() 
	Возврат ЭлементыФормы.ПлоскийСписок.ТекущиеДанные.ДокументИС;
КонецФункции

Функция СформироватьМассивВыгружаемыхДокументов() 
	СписокОтмеченныхЗаписей = СписокОтмеченныхЗаписей(Ложь);
	ВыгружаемыеДокументы = Новый Массив();
	Для Каждого Запись Из СписокОтмеченныхЗаписей Цикл
		ДокументСБИС = Запись["ДокументСБИС"]; 
		Если ДокументСБИС <> Неопределено Тогда
			ИмяСБИС = ДокументСБИС["Тип"];
			ПримечаниеСБИС = ДокументСБИС["Примечание"];
			ИдентификаторДокумента = ДокументСБИС["Идентификатор"];
			ИмяИзСБИСвАПИ3(ИмяСБИС, ПримечаниеСБИС, ИдентификаторДокумента);
			
			API3_ref = Новый Структура; 
			API3_ref.Вставить("SbisId",		 ДокументСБИС["ИдСБИС"]);
			API3_ref.Вставить("SbisType",	ИмяСБИС);
			API3_ref.Вставить("Type",		ИмяСБИС);
			API3_ref.Вставить("Title",		ДокументСБИС["Название"]);
			ВыгружаемыеДокументы.Добавить(API3_ref);

		КонецЕсли;	
	КонецЦикла;
	Возврат ВыгружаемыеДокументы; 	
КонецФункции

Функция СформироватьМассивВыгружаемыхДокументов1С()
	СписокОтмеченныхЗаписей = СписокОтмеченныхЗаписей(Ложь);
	ВыгружаемыеДокументы = Новый Массив();
	Для Каждого Запись Из СписокОтмеченныхЗаписей Цикл
		ДокументИССсылка = Запись.ДокументИС.Ссылка;
		Если Не ЗначениеЗаполнено(ДокументИССсылка) Тогда
			Продолжить; 
		КонецЕсли;
		ВыгружаемыеДокументы.Добавить(ДокументИССсылка);
	КонецЦикла;
	Возврат ВыгружаемыеДокументы;	
КонецФункции

Функция КнопкаВыгрузитьВ1С() 
	Возврат ЭлементыФормы["ВыгрузитьВ1С"];
КонецФункции	

Процедура ПоказатьМенюВыгрузитьВ1С(СписокЗначений)
	ЗначениеВыбора = ВыбратьИзМеню(СписокЗначений,КнопкаВыгрузитьВ1С());
	МенюВыгрузитьВ1СОбработкаОповещения(ЗначениеВыбора, Неопределено);
КонецПроцедуры



Процедура ОткрытьВSABYНажатие(Элемент)
	ТекущийДокументСБИС = ЭлементыФормы.ПлоскийСписок.ТекущиеДанные.ДокументСБИС;
	Если ТекущийДокументСБИС <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Заголовок, АдресСтраницы",
		ТекущийДокументСБИС["Название"],
		ПолучитьПрямуюССылку(ТекущийДокументСБИС["СсылкаДляНашаОрганизация"]));
		Уникальность = Новый УникальныйИдентификатор(ТекущийДокументСБИС["Идентификатор"]);
		ОткрытьФормуОбработки("Browser", ПараметрыФормы, ЭтаФорма, Уникальность);	
	КонецЕсли
КонецПроцедуры

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщиеОФ
#КонецОбласти

