
&НаКлиенте
Процедура ПередЗакрытиемГО(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(context_params) = Тип("Структура") И ТекущийРаздел <> Неопределено Тогда
		context_params.Вставить("РазделПоУмолчанию", ТекущийРаздел.Идентификатор);
		ЗаписатьНастройкиНаСервере();
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_ГлавноеОкно_СписокОФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ПанельОперацийОФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_АвторизацияОФ
#КонецОбласти

Процедура ПолучитьИмяФормы()
	ЭтаФорма.ИмяФормы = "ГлавноеОкно";
КонецПроцедуры

&НаКлиенте
Функция ТекущийДокументИС() 
	Возврат ЭлементыФормы.ПлоскийСписок.ТекущиеДанные.ДокументИС;
КонецФункции

Функция КнопкаВыгрузитьВ1С() 
	Возврат ЭлементыФормы["ВыгрузитьВ1С"];
КонецФункции	

Процедура ПоказатьМенюВыгрузитьВ1С(СписокЗначений)
	ЗначениеВыбора = ВыбратьИзМеню(СписокЗначений,КнопкаВыгрузитьВ1С());
	МенюВыгрузитьВ1СОбработкаОповещения(ЗначениеВыбора, Неопределено);
КонецПроцедуры

Процедура ОткрытьВSABYНажатие(Элемент)
	ПлоскийСписокТекущиеДанные = ЭлементыФормы.ПлоскийСписок.ТекущиеДанные;
	Если ПлоскийСписокТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущийДокументСБИС = ПлоскийСписокТекущиеДанные.ДокументСБИС;
	Если ТекущийДокументСБИС <> Неопределено Тогда
		АдресДокумента = ПолучитьПрямуюССылку(ТекущийДокументСБИС["СсылкаДляНашаОрганизация"]);
		#Если ТолстыйКлиентОбычноеПриложение Тогда 
// BSLLS:UsingSynchronousCalls-off
// Продолженное сонаром НачатьЗапускПриложения нам не подходит
 			ЗапуститьПриложение(АдресДокумента); 
// BSLLS:UsingSynchronousCalls-on
		#Иначе	
			ПерейтиПоНавигационнойСсылке(АдресДокумента);	
		#КонецЕсли		
	КонецЕсли
КонецПроцедуры

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщиеОФ
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаПоискНачалоВыбораНажатиеОФ
#КонецОбласти

