
&НаКлиенте
Процедура ПередЗакрытиемГО(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы = Истина Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если ТипЗнч(context_param) = Тип("Структура") И ТекущийРаздел <> Неопределено Тогда
		context_param.Вставить("РазделПоУмолчанию", ТекущийРаздел.Идентификатор);
		ЗаписатьНастройкиНаСервере();
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_core_base_ГлавноеОкно_СписокУФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ПанельОперацийУФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_АвторизацияУФ
#КонецОбласти

#Область include_core_base_Helpers_XDTO
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_ExtException //&НаСервереБезКонтекста
#КонецОбласти

Процедура ПолучитьИмяФормы()
	// Заглушка
КонецПроцедуры


&НаКлиенте
Функция ТекущийДокументИС()
	Возврат Элементы.ПлоскийСписок.ТекущиеДанные.ДокументИС;	
КонецФункции

&НаКлиенте
Функция КнопкаВыгрузитьВ1С()
	Возврат Элементы.МенюПриложенияПлоскийСписок.ПодчиненныеЭлементы.Найти("ВыгрузитьВ1С")
КонецФункции

&НаКлиенте
Процедура ПоказатьМенюВыгрузитьВ1С(СписокКнопок)
    ОписаниеОповещения = Новый ОписаниеОповещения("МенюВыгрузитьВ1СОбработкаОповещения", ЭтаФорма);
    ПоказатьВыборИзМеню(ОписаниеОповещения, СписокКнопок, КнопкаВыгрузитьВ1С());
КонецПроцедуры

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОсобенностиПродукта
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_ОберткаСерверныхКоманд
#КонецОбласти

&НаКлиенте
Процедура ОткрытьВSABYНажатие(Элемент)
	ТекущийДокументСБИС = Элементы.ПлоскийСписок.ТекущиеДанные.ДокументСБИС;
	Если ТекущийДокументСБИС <> Неопределено Тогда
		//ПараметрыФормы = Новый Структура("Заголовок, АдресСтраницы",
		//ТекущийДокументСБИС["Название"],
		//ПолучитьПрямуюССылку(ТекущийДокументСБИС["СсылкаДляНашаОрганизация"]));
		АдресДокумента = ПолучитьПрямуюССылку(ТекущийДокументСБИС["СсылкаДляНашаОрганизация"]);
		#Если ТолстыйКлиентОбычноеПриложение Тогда 
		ЗапуститьПриложение(АдресДокумента); 
		#Иначе	
		ПерейтиПоНавигационнойСсылке(АдресДокумента);	
		#КонецЕсли
	КонецЕсли
КонецПроцедуры

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОбщие
#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_КомандаПоискНачалоВыбораНажатие
#КонецОбласти

