
&НаКлиенте
Функция ShowForm(КэшФорм, ФормыПросмотраДокумента, ПутьКФормам, ДокуметИС, ДокументСБИС, ИмяФормыДокумента, ИмяФормыПоУмолчанию)
	Если ЗначениеЗаполнено(ДокументСБИС) Тогда
		Если get_prop(ДокументСБИС, "Регламент") = Неопределено Или get_prop(ДокументСБИС, "Этап") = Неопределено Тогда
			Док = Новый Структура("Идентификатор", get_prop(ДокументСБИС, "Идентификатор"));
			ДокументСБИС = ПрочитатьДокумент(Док); 
		КонецЕсли;
		Если ДокументСБИС.Получить("Этап") <> Неопределено Тогда
			Этап = ДокументСБИС["Этап"][0]["Название"];	
		Иначе
			Этап = "";
		КонецЕсли;
		ИмяФормыПросмотра = ИмяФормыДокументаСБИС(ФормыПросмотраДокумента, ДокументСБИС["Тип"], ДокументСБИС["Регламент"]["Название"], Этап, get_prop(ДокументСБИС, "ИмяФормы"))
	КонецЕсли;
	Если ИмяФормыПросмотра = Неопределено Тогда
		ИмяФормыПросмотра = ?(ИмяФормыДокумента <> Неопределено, ИмяФормыДокумента, ИмяФормыПоУмолчанию);
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяФормыПросмотра) Тогда
		Попытка
			Форма = КэшФорм.Получить(ИмяФормыПросмотра);
			Если Форма = Неопределено Тогда
				Форма = ПолучитьФормуОбработки(ИмяФормыПросмотра, ПутьКФормам, , ЭтаФорма);
				КэшФорм.Вставить(ИмяФормыПросмотра, Форма);
			КонецЕсли;
			Форма.Показать(ДокументСБИС, ДокуметИС, context_param, Новый Структура("КомандыПанели", ТекущийРаздел.ПараметрыОтображения["Toolbar"]));
		Исключение
			Ошибка = ИнформацияОбОшибке();
			Сообщить("Ошибка открытия формы '" + СокрЛП(ИмяФормыПросмотра) + "'!");
		КонецПопытки;
	Иначе
		Если ЗначениеЗаполнено(ДокуметИС) Тогда
			ОткрытьЗначение(ДокуметИС);	
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПрочитатьДокумент(Док)
	Возврат ПолучитьМодульОбъекта().local_helper_read_document(context_param, Док);
КонецФункции

&НаКлиенте
Функция ИмяФормыДокументаСБИС(ФормыПросмотраДокумента, Тип, Регламент, Этап, ИмяФормы)
	КлючиФормы = Новый Массив();
	КлючиФормы.Добавить(ИмяФормы);
	КлючиФормы.Добавить(Тип+"_"+Регламент+"_"+Этап);
	КлючиФормы.Добавить(Тип+"_"+Этап);
	КлючиФормы.Добавить(Тип);
	
	Для Каждого КлючФормы Из КлючиФормы Цикл
		ИмяФормыПросмотра = get_prop(ФормыПросмотраДокумента, КлючФормы);
		Если ИмяФормыПросмотра <> Неопределено Тогда
			Возврат ИмяФормыПросмотра;
		КонецЕсли;
	КонецЦикла;
КонецФункции

