// BSLLS:FunctionOutParameter-off

&НаКлиенте
Функция ПолучитьИмяФормыПросмотра(ДокументСБИС, ИмяФормыДокумента, ФормыПросмотраДокумента)
	ИмяФормыПросмотра = Неопределено;
	Если ЗначениеЗаполнено(ДокументСБИС) И ИмяФормыДокумента <> "Раздел_ЭПД" Тогда
		Если get_prop(ДокументСБИС, "Регламент") = Неопределено Или get_prop(ДокументСБИС, "Этап") = Неопределено Тогда
			Док = Новый Структура("Идентификатор", get_prop(ДокументСБИС, "Идентификатор"));
			ДокументСБИС = ПрочитатьДокумент(Док); 
		КонецЕсли;
		Если ДокументСБИС.Получить("Этап") <> Неопределено Тогда
			Этап = ДокументСБИС["Этап"][0]["Название"];	
		Иначе
			Этап = "";
		КонецЕсли;
		ИмяФормыПросмотра = ИмяФормыДокументаСБИС(ФормыПросмотраДокумента, ДокументСБИС["Тип"], ДокументСБИС["Регламент"]["Название"], Этап, get_prop(ДокументСБИС, "ИмяФормы"))
	КонецЕсли;
	Возврат ИмяФормыПросмотра;
КонецФункции
// BSLLS:FunctionOutParameter-on	

&НаКлиенте
Процедура ShowForm(КэшФорм, ФормыПросмотраДокумента, ПутьКФормам, ДокуметИС, ДокументСБИС, ИмяФормыДокумента, ИмяФормыПоУмолчанию)
	ИмяФормыПросмотра = ПолучитьИмяФормыПросмотра(ДокументСБИС, ИмяФормыДокумента, ФормыПросмотраДокумента);
	Если ИмяФормыПросмотра = Неопределено Тогда
		ИмяФормыПросмотра = ?(ИмяФормыДокумента <> Неопределено, ИмяФормыДокумента, ИмяФормыПоУмолчанию);
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяФормыПросмотра) Тогда
		Попытка
			Форма = КэшФорм.Получить(ИмяФормыПросмотра);
			Если Форма = Неопределено Тогда
				Форма = ПолучитьФормуОбработки(ИмяФормыПросмотра, ПутьКФормам, , ЭтаФорма);
				КэшФорм.Вставить(ИмяФормыПросмотра, Форма);
			КонецЕсли;
			Форма.Показать(ДокументСБИС, ДокуметИС, context_params, Новый Структура("КомандыПанели", ТекущийРаздел.ПараметрыОтображения["Toolbar"]));
		Исключение
			Ошибка = ИнформацияОбОшибке();
			Сообщить("Ошибка открытия формы '" + СокрЛП(ИмяФормыПросмотра) + "'! Описание:" + Ошибка.Описание);
		КонецПопытки;
	Иначе
		Если ЗначениеЗаполнено(ДокуметИС) Тогда
			// BSLLS:UsingSynchronousCalls-off
			ОткрытьЗначение(ДокуметИС);
			// BSLLS:UsingSynchronousCalls-on
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПрочитатьДокумент(Знач Док)
	Возврат МодульОбъекта().local_helper_read_document(context_params, Док);
КонецФункции

&НаКлиенте
Функция ИмяФормыДокументаСБИС(ФормыПросмотраДокумента, Тип, Регламент, Этап, ИмяФормы)
	
	КлючиФормы = Новый Массив();
	КлючиФормы.Добавить(ИмяФормы);
	КлючиФормы.Добавить(Тип + "_" + Регламент + "_" + Этап);
	КлючиФормы.Добавить(Тип + "_" + Этап);
	КлючиФормы.Добавить(Тип);
	
	Для Каждого КлючФормы Из КлючиФормы Цикл
		ИмяФормыПросмотра = get_prop(ФормыПросмотраДокумента, КлючФормы);
		Если ИмяФормыПросмотра <> Неопределено Тогда
			Возврат ИмяФормыПросмотра;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

