
&НаКлиенте
Функция ПараметрОтображенияПоИмени(ИмяПараметра)
	Результат = Неопределено;
	Если get_prop(ДанныеФильтра, "ПараметрыОтображения") = Неопределено Тогда
		// ДанныеФильтра.ПараметрыОтображения еще отсутствуют
		Возврат Результат;
	КонецЕсли;	
	
	Для Каждого ДанныеПараметрыОтображения Из ДанныеФильтра.ПараметрыОтображения Цикл
		Если  ДанныеПараметрыОтображения["NAME"] = ИмяПараметра Тогда
			Результат = ДанныеПараметрыОтображения;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции
