
&НаСервере
Процедура ОбновитьПанельОпераций() Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемПанельОпераций = ЭлемФормы["ПанельОпераций"+ТекущийРаздел["Шаблон"]];
	ДобавитьКомандыНаПанельОпераций(ЭлемПанельОпераций, ТекущийРаздел.ПараметрыОтображения["Toolbar"]);
КонецПроцедуры

#Область include_core_base_ГлавноеОкно_ДобавлениеКомандНаПанельОперацийУФ
#КонецОбласти

&НаСервере
Процедура ОчиститьКонтекстноеМеню()
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемКонтекстноеМеню = ЭлемФормы[ТекущийРаздел["Шаблон"]].КонтекстноеМеню;
	Если ТекущийРаздел.ПараметрыОтображения <> Неопределено Тогда
		ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
		Префикс = ТекущийРаздел["Шаблон"] + "КонтекстноеМеню";
		Для Каждого Команда Из ТекущийРаздел.ПараметрыОтображения["InlineActions"] Цикл
			Элем = ЭлемФормы.Найти(Префикс + Команда["Name"]);
			Если Элем <> Неопределено Тогда
				Элем.Видимость = Ложь;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтекстноеМеню()
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемКонтекстноеМеню = ЭлемФормы[ТекущийРаздел["Шаблон"]].КонтекстноеМеню;
	Префикс = ТекущийРаздел["Шаблон"] + "КонтекстноеМеню";
	Для Каждого Команда Из ТекущийРаздел.ПараметрыОтображения["InlineActions"] Цикл
		Элем = ЭлемФормы.Найти(Префикс + Команда["Name"]);
		Если Элем = Неопределено Тогда
			Элем = ДобавитьЭлементФормы(Префикс + Команда["Name"], Тип("КнопкаФормы"), ЭлемКонтекстноеМеню, Истина);
			КомандаКнопки = Команды.Найти(Команда["Name"]);
			Если КомандаКнопки = Неопределено Тогда
				КомандаКнопки = Команды.Добавить(Команда["Name"]);
				КомандаКнопки.Заголовок = Команда["Title"];
				КомандаКнопки.Действие  = Команда["Action"];
			КонецЕсли;
			Элем.ИмяКоманды = КомандаКнопки["Имя"];
		КонецЕсли;
		Элем.Заголовок = Команда["Title"];
		Элем.Видимость = Истина;
		КартинкаПуть = get_prop(Команда, "Icon");
		Если КартинкаПуть <> Неопределено Тогда
			УстановитьКартинку(Элем, КартинкаПуть);
			УстановитьОтображение(Элем, Команда["Title"]);
		Конецесли;
	КонецЦикла;	
КонецПроцедуры

