
Функция КомандыПанели()
	КомандыПанели = ЭтаФорма.ТекущийРаздел.ПараметрыОтображения["Toolbar"];
	Если КомандыПанели = Неопределено Тогда
		КомандыПанели = ЭтаФорма.ТекущийРаздел.ПараметрыОтображения["ACTIONS"];
	КонецЕсли;
	Возврат КомандыПанели;
КонецФункции

Процедура ОчиститьПанельОпераций(ПараметрыОтображения) Экспорт
	Если ПараметрыОтображения <> Неопределено Тогда
		СкрытьКомандыПанели(КомандыПанели())
	КонецЕсли;
КонецПроцедуры

Процедура СкрытьКомандыПанели(КомандыПанели) Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	Для Каждого Команда Из КомандыПанели Цикл
		Элем = ЭлемФормы.Найти(Команда["Name"]);
		Если Элем <> Неопределено Тогда
			Элем.Видимость = Ложь;	
		КонецЕсли;
	КонецЦикла;
	// Элемент поиска
	Элем = ЭлемФормы.Найти("ФильтрМаска");
	Если Элем <> Неопределено Тогда
		Элем.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры

