
&НаСервере
Процедура ОбновитьПанельОпераций() Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемПанельОпераций = ЭлемФормы["ПанельОпераций"+ТекущийРаздел["Шаблон"]];
	КомандыПанели = КомандыПанели();
	ДобавитьКомандыНаПанельОпераций(ЭлемПанельОпераций, КомандыПанели);
КонецПроцедуры

#Область include_core_base_ГлавноеОкно_ДобавлениеКомандНаПанельОперацийУФ
#КонецОбласти

&НаСервере
Процедура ОчиститьКонтекстноеМеню()
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	Если ТекущийРаздел.ПараметрыОтображения <> Неопределено Тогда
		Если ТекущийРаздел.ПараметрыОтображения["InlineActions"] = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
		Префикс = ТекущийРаздел["Шаблон"] + "КонтекстноеМеню";
		Для Каждого Команда Из ТекущийРаздел.ПараметрыОтображения["InlineActions"] Цикл
			Элем = ЭлемФормы.Найти(Префикс + Команда["NAME"]);
			Если Элем <> Неопределено Тогда
				Элем.Видимость = Ложь;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтекстноеМеню()
	Если ТекущийРаздел.ПараметрыОтображения["InlineActions"] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемКонтекстноеМеню = ЭлемФормы[ТекущийРаздел["Шаблон"]].КонтекстноеМеню;
	Префикс = ТекущийРаздел["Шаблон"] + "КонтекстноеМеню";
	Для Каждого Команда Из ТекущийРаздел.ПараметрыОтображения["InlineActions"] Цикл
		ИмяКоманды = Команда["NAME"];
		Элем = ЭлемФормы.Найти(Префикс + ИмяКоманды);
		Если Элем = Неопределено Тогда
			Элем = ДобавитьЭлементФормы(Префикс + ИмяКоманды, Тип("КнопкаФормы"), ЭлемКонтекстноеМеню, Истина);
			КомандаКнопки = Команды.Найти(ИмяКоманды);
			Если КомандаКнопки = Неопределено Тогда
				КомандаКнопки = Команды.Добавить(ИмяКоманды);
				КомандаКнопки.Заголовок = Команда["Title"];
				КомандаКнопки.Действие  = Команда["Action"];
			КонецЕсли;
			Элем.ИмяКоманды = КомандаКнопки["Имя"];
		КонецЕсли;
		Элем.Заголовок = Команда["Title"];
		Элем.Видимость = Истина;
		КартинкаПуть = get_prop(Команда, "Icon");
		Если КартинкаПуть <> Неопределено Тогда
			УстановитьКартинку(Элем, КартинкаПуть);
			УстановитьОтображение(Элем, Команда["Title"]);
		Конецесли;
	КонецЦикла;	
КонецПроцедуры

