
Функция КомандыПанели()
	КомандыПанели = ЭтаФорма.ТекущийРаздел.ПараметрыОтображения["Toolbar"];
	Если КомандыПанели = Неопределено Тогда
		Если ЭтаФорма.ТекущийРаздел.ПараметрыОтображения["ACTIONS"] <> Неопределено Тогда
			КомандыПанели = Новый Массив;
			Для Каждого Action Из ЭтаФорма.ТекущийРаздел.ПараметрыОтображения["ACTIONS"] Цикл
				Если Action["TEMPLATE"] = "search" Или Action["SHOW_IN_OPERATION_PANEL"] Или Action["SHOW_IN_MAIN_TOOLBAR"] Или Action["SHOW_IN_DEFAULT_TOOLBAR"] Тогда
					КомандыПанели.Добавить(Action);
				КонецЕсли;
			КонецЦикла
		КонецЕсли;
	КонецЕсли;
	Возврат КомандыПанели;
КонецФункции

Функция КомандыКонтекстногоМеню()
	КомандыКонтекстногоМеню = ЭтаФорма.ТекущийРаздел.ПараметрыОтображения["InlineActions"];
	Если КомандыКонтекстногоМеню = Неопределено Тогда
		Если ЭтаФорма.ТекущийРаздел.ПараметрыОтображения["ACTIONS"] <> Неопределено Тогда
			КомандыКонтекстногоМеню = Новый Массив;
			Для Каждого Action Из ЭтаФорма.ТекущийРаздел.ПараметрыОтображения["ACTIONS"] Цикл
				Если Action["SHOW_IN_ITEM_ACTION"] = Истина Тогда
					КомандыКонтекстногоМеню.Добавить(Action);
				КонецЕсли;
			КонецЦикла
		КонецЕсли;
	КонецЕсли;
	Возврат КомандыКонтекстногоМеню;
КонецФункции

Процедура ОчиститьПанельОпераций(ПараметрыОтображения) Экспорт
	Если ПараметрыОтображения <> Неопределено Тогда
		СкрытьКомандыПанели(КомандыПанели())
	КонецЕсли;
КонецПроцедуры

Процедура СкрытьКомандыПанели(КомандыПанели) Экспорт
	Если КомандыПанели = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	Для Каждого Команда Из КомандыПанели Цикл
		Элем = ЭлемФормы.Найти(Команда["NAME"]);
		Если Элем <> Неопределено Тогда
			Элем.Видимость = Ложь;	
		КонецЕсли;
	КонецЦикла;
	// Элемент поиска
	Элем = ЭлемФормы.Найти("ФильтрМаска");
	Если Элем <> Неопределено Тогда
		Элем.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры

