
&НаСервере
Процедура ОбновитьПанельОпераций() Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемПанельОпераций = ЭлемФормы["ПанельОпераций"+ТекущийРаздел["Шаблон"]];
	КомандыПанели = КомандыПанели();
	ДобавитьКомандыНаПанельОпераций(ЭлемПанельОпераций, КомандыПанели);
КонецПроцедуры

#Область include_core_base_ГлавноеОкно_ДобавлениеКомандНаПанельОперацийУФ
#КонецОбласти

&НаСервере
Процедура ОчиститьКонтекстноеМеню()
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	Если ТекущийРаздел.ПараметрыОтображения <> Неопределено Тогда
		КомандыКонтекстногоМеню = КомандыКонтекстногоМеню();
		Если КомандыКонтекстногоМеню = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
		Префикс = ТекущийРаздел["Шаблон"] + "КонтекстноеМеню";
		Для Каждого Команда Из КомандыКонтекстногоМеню Цикл
			Элем = ЭлемФормы.Найти(Префикс + Команда["NAME"]);
			Если Элем <> Неопределено Тогда
				Элем.Видимость = Ложь;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтекстноеМеню()
	КомандыКонтекстногоМеню = КомандыКонтекстногоМеню();
	Если КомандыКонтекстногоМеню = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемКонтекстноеМеню = ЭлемФормы[ТекущийРаздел["Шаблон"]].КонтекстноеМеню;
	Префикс = ТекущийРаздел["Шаблон"] + "КонтекстноеМеню";
	Для Каждого Команда Из КомандыКонтекстногоМеню Цикл
		ШаблонКоманды = Команда["TEMPLATE"];
		Если ШаблонКоманды = "menu" Тогда
			ИмяКоманды = Команда["NAME"];
			ЭлемРодитель = ЭлемФормы.Найти(Префикс + ИмяКоманды);
			Если ЭлемРодитель = Неопределено Тогда
				ЭлемРодитель = ДобавитьЭлементФормы(Префикс + ИмяКоманды, Тип("ГруппаФормы"), ЭлемКонтекстноеМеню, Истина);
				ЭлемРодитель.Вид = ВидГруппыФормы.Подменю;
				ЭлемРодитель.Заголовок = Команда["TITLE"];
				Для Каждого ВложеннаяКоманда Из Команда["COMMANDS"] Цикл
					ДобавитьКомандуКонтекстногоМеню(ВложеннаяКоманда, ЭлемРодитель, Префикс);	
				КонецЦикла;
			КонецЕсли;
		Иначе
			ДобавитьКомандуКонтекстногоМеню(Команда, ЭлемКонтекстноеМеню, Префикс);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандуКонтекстногоМеню(Команда, ЭлемКонтекстноеМеню, Префикс)
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ИмяКоманды = Команда["NAME"];
	ЗаголовокКоманды = Команда["TITLE"];
	Элем = ЭлемФормы.Найти(Префикс + ИмяКоманды);
	Если Элем = Неопределено Тогда
		Элем = ДобавитьЭлементФормы(Префикс + ИмяКоманды, Тип("КнопкаФормы"), ЭлемКонтекстноеМеню, Истина);
		КомандаКнопки = Команды.Найти(ИмяКоманды);
		Если КомандаКнопки = Неопределено Тогда
			КомандаКнопки = Команды.Добавить(ИмяКоманды);
			КомандаКнопки.Заголовок = ЗаголовокКоманды;
			КомандаКнопки.Действие  = Команда["ACTION"];
		КонецЕсли;
		Элем.ИмяКоманды = КомандаКнопки["Имя"];
	КонецЕсли;
	Элем.Заголовок = ЗаголовокКоманды;
	Элем.Видимость = Истина;
	КартинкаПуть = get_prop(Команда, "ICON");
	Если КартинкаПуть <> Неопределено Тогда
		УстановитьКартинку(Элем, КартинкаПуть);
		УстановитьОтображение(Элем, ЗаголовокКоманды);
	Конецесли;	
КонецПроцедуры

