
Процедура ОбновитьПанельОпераций() Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ИмяРаздела = ТекущийРаздел["Шаблон"];
	ЭлемПанельОпераций = ЭлемФормы["ПанельОпераций" + ИмяРаздела];
	ЭлемОтметитьВсе = ЭлемФормы["ОтметитьВсе" + ИмяРаздела];
	КомандыПанели = КомандыПанели();
	Если КомандыПанели.Количество() > 0 Тогда
		Лево = 33;
		ЭлемОтметитьВсе.Видимость = Истина;
	Иначе
		Лево = 1;
		ЭлемОтметитьВсе.Видимость = Ложь;
	КонецЕсли;
	ДобавитьКомандыНаПанельОпераций(ЭлемПанельОпераций, КомандыПанели, Лево);
КонецПроцедуры

#Область include_core_base_ГлавноеОкно_ДобавлениеКомандНаПанельОперацийОФ
#КонецОбласти

Процедура ОчиститьКонтекстноеМеню()
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемКонтекстноеМеню = ЭлемФормы[ТекущийРаздел["Шаблон"]+"КонтекстноеМеню"];
	ЭлемКонтекстноеМеню.Кнопки.Очистить();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтекстноеМеню()
	КомандыКонтекстногоМеню = КомандыКонтекстногоМеню();
	Если КомандыКонтекстногоМеню = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемКонтекстноеМеню = ЭлемФормы[ТекущийРаздел["Шаблон"]+"КонтекстноеМеню"];
	Префикс = ТекущийРаздел["Шаблон"] + "КонтекстноеМеню";
	Для Каждого Команда Из КомандыКонтекстногоМеню Цикл
		ШаблонКоманды = Команда["TEMPLATE"];
		Если ШаблонКоманды = "menu" Тогда
			ИмяКоманды = Команда["NAME"];
			ЭлемРодитель = ЭлемКонтекстноеМеню.Кнопки.Найти(Префикс + ИмяКоманды);
			Если ЭлемРодитель = Неопределено Тогда
				ЭлемРодитель = ЭлемКонтекстноеМеню.Кнопки.Добавить(Префикс + ИмяКоманды, ТипКнопкиКоманднойПанели.Подменю, Команда["TITLE"]);
				Для Каждого ВложеннаяКоманда Из Команда["COMMANDS"] Цикл
					ДобавитьКомандуКонтекстногоМеню(ВложеннаяКоманда, ЭлемРодитель, Префикс);	
				КонецЦикла;
			КонецЕсли;
		Иначе
			ДобавитьКомандуКонтекстногоМеню(Команда, ЭлемКонтекстноеМеню, Префикс);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ДобавитьКомандуКонтекстногоМеню(Команда, ЭлемКонтекстноеМеню, Префикс)
	ИмяКоманды = Команда["NAME"];
	ЗаголовокКоманды = Команда["TITLE"];
	Элем = ЭлемКонтекстноеМеню.Кнопки.Найти(Префикс + ИмяКоманды);
	Если Элем = Неопределено Тогда
		Элем = ЭлемКонтекстноеМеню.Кнопки.Добавить(Префикс + ИмяКоманды, ТипКнопкиКоманднойПанели.Действие, ЗаголовокКоманды, Новый Действие(Команда["ACTION"]));
	КонецЕсли;
	КартинкаПуть = get_prop(Команда, "ICON");
	Если КартинкаПуть <> Неопределено Тогда
		УстановитьКартинку(Элем, КартинкаПуть);
		Если ЗначениеЗаполнено(ЗаголовокКоманды) Тогда
			Элем.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
		Иначе
			Элем.Отображение = ОтображениеКнопкиКоманднойПанели.Картинка;
		КонецЕсли;
	Конецесли;	
КонецПроцедуры

