
Процедура ОбновитьПанельОпераций() Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ИмяРаздела = ТекущийРаздел["Шаблон"];
	ЭлемПанельОпераций = ЭлемФормы["ПанельОпераций" + ИмяРаздела];
	ЭлемОтметитьВсе = ЭлемФормы["ОтметитьВсе" + ИмяРаздела];
	Если ТекущийРаздел.ПараметрыОтображения["Toolbar"].Количество() > 0 Тогда
		Лево = 33;
		ЭлемОтметитьВсе.Видимость = Истина;
	Иначе
		Лево = 1;
		ЭлемОтметитьВсе.Видимость = Ложь;
	КонецЕсли;
	ДобавитьКомандыНаПанельОпераций(ЭлемПанельОпераций, ТекущийРаздел.ПараметрыОтображения["Toolbar"], Лево);
КонецПроцедуры

#Область include_core_base_ГлавноеОкно_ДобавлениеКомандНаПанельОперацийОФ
#КонецОбласти

Процедура ОчиститьКонтекстноеМеню()
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемКонтекстноеМеню = ЭлемФормы[ТекущийРаздел["Шаблон"]+"КонтекстноеМеню"];
	ЭлемКонтекстноеМеню.Кнопки.Очистить();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтекстноеМеню()
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемКонтекстноеМеню = ЭлемФормы[ТекущийРаздел["Шаблон"]+"КонтекстноеМеню"];
	Лево = 1;
	Префикс = ТекущийРаздел["Шаблон"] + "КонтекстноеМеню";
	Для Каждого Команда Из  ТекущийРаздел.ПараметрыОтображения["InlineActions"] Цикл
		Элем = ЭлемКонтекстноеМеню.Кнопки.Найти(Префикс + Команда["Name"]);
		Если Элем = Неопределено Тогда
			Элем = ЭлемКонтекстноеМеню.Кнопки.Добавить(Префикс + Команда["Name"], ТипКнопкиКоманднойПанели.Действие, Команда["Title"], Новый Действие(Команда["Action"]));
		КонецЕсли;
		КартинкаПуть = get_prop(Команда, "Icon");
		Если КартинкаПуть <> Неопределено Тогда
			УстановитьКартинку(Элем, КартинкаПуть);
			Если ЗначениеЗаполнено(Команда["Title"]) Тогда
				Элем.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
			Иначе
				Элем.Отображение = ОтображениеКнопкиКоманднойПанели.Картинка;
			КонецЕсли;
		Конецесли;
	КонецЦикла;	
КонецПроцедуры

