
&НаКлиенте
Процедура ПлоскийСписокПриОткрытии(ПараметрыОтображения)
	ЭтаФорма.Страница = 0;
	ОчиститьПанельОпераций(ТекущийРаздел.ПараметрыОтображения);
	ОчиститьКонтекстноеМеню();
	ОчиститьПанельФильтра(ТекущийРаздел.ПараметрыОтображения);
	ТекущийРаздел.Вставить("ПараметрыОтображения", ПараметрыОтображения);
			
	ЗаполнитьФильтр();
	ЗаполнитьКолонкиПлоскогоСписка();
	ЭтаФорма.ФильтрМаска = "";
	ДанныеФильтра.Значения.Вставить("ФильтрМаска", ЭтаФорма.ФильтрМаска);
	ДанныеФильтра.Значения.Вставить("Search", ЭтаФорма.ФильтрМаска);
	ОбновитьСписок(ДанныеФильтра.Значения);
	ДанныеФильтра.ПараметрыОтображения = ФильтрСписка();
	УстановитьВидимостьФильтра();
	ОбновитьПанельФильтра();
	ОбновитьПанельОпераций();
	ОбновитьКонтекстноеМеню();
КонецПроцедуры

&НаКлиенте
Функция КопияФильтраСНастроеннымПериодом(ИсходныйФильтр)
	
	ФильтрКопия = Новый ФиксированнаяСтруктура(ИсходныйФильтр);
	Фильтр = Новый Структура(ФильтрКопия);
	
	Попытка
		Если ТипЗнч(Фильтр.ДатаНач) = Тип("Дата") Тогда
			Фильтр.ДатаНач = Формат(Фильтр.ДатаНач, "ДФ=yyyy-MM-dd");
		КонецЕсли;
		Если ТипЗнч(Фильтр.ДатаКнц)   = Тип("Дата") Тогда
			Фильтр.ДатаКнц   = Формат(Фильтр.ДатаКнц,   "ДФ=yyyy-MM-dd");
		КонецЕсли;
	Исключение
		Возврат Фильтр;
	КонецПопытки;
	
	Возврат Фильтр;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДанныеСписка(Фильтр) Экспорт
	НовыйФильтр = КопияФильтраСНастроеннымПериодом(Фильтр);
	ПолеРодителя = get_prop(ТекущийРаздел.ПараметрыОтображения, "PARENT_PROPERTY");
	Pagination = Новый Структура();
	Pagination.Вставить("PageSize", КоличествоЭлементовСписка());
	Если ПолеРодителя = Неопределено Или get_prop(НовыйФильтр, ПолеРодителя) = Неопределено Тогда
		Pagination.Вставить("Page", Страница);
	Иначе
		ИдИС = get_prop(НовыйФильтр, ПолеРодителя);
		ИдИСВКлюч = "id" + СтрЗаменить(ИдИС, "-", "_");
		ТекущаяСтраницаПоРодителю = get_prop(СтраницыПоРодителям, ИдИСВКлюч, 0);		
		Pagination.Вставить("Page", ТекущаяСтраницаПоРодителю);		
	КонецЕсли; 
	EndpointArgs = Новый Структура;
	EndpointArgs.Вставить("Filter", НовыйФильтр);
	EndpointArgs.Вставить("Pagination", Pagination); 
	ПараметрыКоманды = Новый Структура("Algorithm, Endpoint,EndpointArgs", ТекущийРаздел["Идентификатор"], "main", EndpointArgs);
	РезультатИни = BlocklyExecutor.LocalCalcIni(ПараметрыКоманды);
	Если РезультатИни["Status"] = "error" Тогда
		СтруктураОшибки = NewExtExceptionСтруктура(, "Ошибка выполнения ini: '" + ПараметрыКоманды["Algorithm"]
				+ "', endpoint: '" + ПараметрыКоманды["Endpoint"] + "'" + Символы.ПС + РезультатИни.Result.message,
			РезультатИни.Result.detail, РезультатИни.Result.action);	
		ВызватьИсключение ExtExceptionToMessage(СтруктураОшибки);
	КонецЕсли;	
	Результат = РезультатИни.Result;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеПлоскогоСписка(Таблица, Данные) Экспорт
	МодульОбъекта = МодульОбъекта();
	Список = Данные["Rows"];
	Навигация = Данные["Pagination"];
	
	ЛесенкаПредЗначения = Новый Структура;
	ЛесенкаПредЗначения.Вставить("ПредДата",  Неопределено);
	ЛесенкаПредЗначения.Вставить("ПредНомер", Неопределено);
	КолонкиСписка = КолонкиСписка();
	
	Для Каждого Стр Из Список Цикл
		СтрТ = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТ, Стр);
		Для Каждого Колонка Из КолонкиСписка Цикл
			ШаблонКолонки = get_prop(Колонка, "TEMPLATE");
			Если ЗначениеЗаполнено(ШаблонКолонки) Тогда
				ДанныеПлоскогоСпискаПоШаблону(ШаблонКолонки, Таблица, Колонка, Стр, СтрТ, МодульОбъекта, ЛесенкаПредЗначения);
				Продолжить;
			КонецЕсли;
			ПутьКДанным = get_prop(Колонка, "Data", get_prop(Колонка, "PROPERTY"));
			ИмяКолонки = get_prop(Колонка, "Name", get_prop(Колонка, "NAME"));
			Если ЗначениеЗаполнено(ПутьКДанным) Тогда
				СтрТ[ИмяКолонки] = МодульОбъекта.block_obj_get_path_value(Стр, ПутьКДанным, "");
			Иначе
				СтрТ[ИмяКолонки] = "";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ЕстьЕще = get_prop(Навигация, "HasMore");
	Если ЕстьЕще = Истина Или ЕстьЕще = "Да" Тогда
		СтрТ = Таблица.Добавить();
		СтрТ["ЗагрузитьЕще"] = "Загрузить еще";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДанныеПлоскогоСпискаПоШаблону(ШаблонКолонки, Таблица, Колонка, Стр, СтрТ, МодульОбъекта, Лесенка)
	Если ШаблонКолонки = "column_date_number" Тогда
		ДанныеПлоскогоСпискаПоШаблонуДатаНомер(Таблица, Колонка, Стр, СтрТ, МодульОбъекта, Лесенка);
	ИначеЕсли ШаблонКолонки = "column_document_kedo" Тогда
		ДанныеПлоскогоСпискаПоШаблонуДокументКЭДО(Таблица, Колонка, Стр, СтрТ, МодульОбъекта, Лесенка);
	ИначеЕсли ШаблонКолонки = "column_default" Тогда
		ИмяКолонки = Колонка["NAME"];
		ПутьКДанным = Колонка["PROPERTY"];
		УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
	ИначеЕсли ШаблонКолонки = "column_icon" Тогда
		ИмяКолонки = Колонка["NAME"];
		ПутьКДанным = Колонка["PROPERTY"];
		УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
	ИначеЕсли ШаблонКолонки = "column_employee" Тогда
		ДанныеПлоскогоСпискаПоШаблонуСотрудник(Таблица, Колонка, Стр, СтрТ, МодульОбъекта, Лесенка);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеВКолонкуСЛесенкой(ИмяКолонки, ПутьКДанным, Таблица, Колонка, Стр, СтрТ, МодульОбъекта,
		Лесенка, ЛесенкаИмя)

	Если Таблица.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПутьКДанным) Тогда
		ТекДанные = МодульОбъекта.block_obj_get_path_value(Стр, ПутьКДанным, "");
		Если ЛесенкаИмя = "ПредДата" Тогда
			ТекДанные = Формат(ТекДанные, "ДФ=dd.MM.yy");
		КонецЕсли;
		Если get_prop(Колонка, "LADDER") = Истина Тогда
			Если Лесенка[ЛесенкаИмя] <> ТекДанные Тогда
				СтрТ[ИмяКолонки] = ТекДанные;
				Лесенка[ЛесенкаИмя] = ТекДанные;
			Иначе
				СтрТ[ИмяКолонки] = "";
			КонецЕсли;
		Иначе
			СтрТ[ИмяКолонки] = ТекДанные;
		КонецЕсли;
	Иначе
		СтрТ[ИмяКолонки] = "";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта)
	Если Таблица.Колонки.Найти(ИмяКолонки) <> Неопределено Тогда
		Если ЗначениеЗаполнено(ПутьКДанным) Тогда
			СтрТ[ИмяКолонки] = МодульОбъекта.block_obj_get_path_value(Стр, ПутьКДанным, "");
		Иначе
			СтрТ[ИмяКолонки] = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДанныеПлоскогоСпискаПоШаблонуДатаНомер(Таблица, Колонка, Стр, СтрТ, МодульОбъекта, Лесенка)
	// Дата
	ИмяКолонки = Колонка["NAME"] + "_Дата_";
	ПутьКДанным = Колонка["DATE_PROPERTY"];
	УстановитьЗначениеВКолонкуСЛесенкой(ИмяКолонки, ПутьКДанным, Таблица, Колонка, Стр, СтрТ, МодульОбъекта, Лесенка, "ПредДата");
	// Номер
	ИмяКолонки = Колонка["NAME"] + "_Номер_";
	ПутьКДанным = Колонка["NUMBER_PROPERTY"];
	УстановитьЗначениеВКолонкуСЛесенкой(ИмяКолонки, ПутьКДанным, Таблица, Колонка, Стр, СтрТ, МодульОбъекта, Лесенка, "ПредНомер");
КонецПроцедуры

&НаСервере
Процедура ДанныеПлоскогоСпискаПоШаблонуДокументКЭДО(Таблица, Колонка, Стр, СтрТ, МодульОбъекта, Лесенка)
	// Тип
	ИмяКолонки = Колонка["NAME"] + "_Тип_";
	ПутьКДанным = Колонка["TYPE_PROPERTY"];
	УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
	// ФИО
	ИмяКолонки = Колонка["NAME"] + "_ФИО_";
	ПутьКДанным = Колонка["PROPERTY"];
	УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
	// Должность
	ИмяКолонки = Колонка["NAME"] + "_Должность_";
	ПутьКДанным = Колонка["POSITION_PROPERTY"];
	УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
	// Организация
	ИмяКолонки = Колонка["NAME"] + "_Организация_";
	ПутьКДанным = Колонка["ORG_PROPERTY"];
	УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
	// Инфо
	ИмяКолонки = Колонка["NAME"] + "_Инфо_";
	ПутьКДанным = Колонка["INFO_PROPERTY"];
	УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
	// Вложения
	ИмяКолонки = Колонка["NAME"] + "_Вложения_";
	ПутьКДанным = Колонка["ATTACHMENTS_PROPERTY"];
	УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
	// Этап
	ИмяКолонки = Колонка["NAME"] + "_Этап_";
	ПутьКДанным = Колонка["STAGE_PROPERTY"];
	УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
КонецПроцедуры

&НаСервере
Процедура ДанныеПлоскогоСпискаПоШаблонуСотрудник(Таблица, Колонка, Стр, СтрТ, МодульОбъекта, Лесенка)
	// Организация
	ИмяКолонки = Колонка["NAME"] + "_Организация_";
	ПутьКДанным = Колонка["ORG_PROPERTY"];
	УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
	// Департамент
	ИмяКолонки = Колонка["NAME"] + "_Департамент_";
	ПутьКДанным = Колонка["DEPARTMENT_PROPERTY"];
	УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
	// ФИО
	ИмяКолонки = Колонка["NAME"] + "_ФИО_";
	ПутьКДанным = Колонка["PROPERTY"];
	УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
	// Телефон
	ИмяКолонки = Колонка["NAME"] + "_Телефон_";
	ПутьКДанным = Колонка["TEL_PROPERTY"];
	УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
	// Должность
	ИмяКолонки = Колонка["NAME"] + "_Должность_";
	ПутьКДанным = Колонка["POSITION_PROPERTY"];
	УстановитьЗначениеВКолонку(ИмяКолонки, ПутьКДанным, Таблица, Стр, СтрТ, МодульОбъекта);
КонецПроцедуры

&НаКлиенте
Процедура ПлоскийСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Колонка.Имя = "ПлоскийСписокЗагрузитьЕще" Тогда
		ПлоскийСписок.Удалить(Элемент.ТекущиеДанные);
		ЗагрузитьЕщеПлоскийСписокНажатие();
		Возврат;	
	КонецЕсли;
	ОткрытьФорму1СПоСтрокеПлоскогоСписка(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФорму1СПоСтрокеПлоскогоСписка(Элемент)
	// Обрабатываем эндпоинт "activate_row" в ini, если есть
	// https://link.saby.ru/article/e126fb97-5142-4158-9d38-92e099bc179b
	EndpointArgs = Новый Структура;
	ИмяЭндпоинтаПоСтроке = "activate_row";
	ПараметрыКоманды = Новый Структура("Algorithm, Endpoint, EndpointArgs", ТекущийРаздел["Идентификатор"],
												   ИмяЭндпоинтаПоСтроке, EndpointArgs);
	РезультатИни = BlocklyExecutor.LocalCalcIni(ПараметрыКоманды);
	Результат = РезультатИни.Result;
	Если РезультатИни["Status"] = "error" Тогда
		Если Найти(НРег(Результат["message"]), НРег("Не найден endpoint " + ИмяЭндпоинтаПоСтроке)) = 0 Тогда
			СтруктураОшибки = NewExtExceptionСтруктура(, "Ошибка выполнения ini: '" + ПараметрыКоманды["Algorithm"]
					+ "', endpoint: '" + ПараметрыКоманды["Endpoint"] + "'" + Символы.ПС + РезультатИни.Result.message,
				РезультатИни.Result.detail, РезультатИни.Result.action);	
			ВызватьИсключение ExtExceptionToMessage(СтруктураОшибки);
		КонецЕсли;
	Иначе
		// Если вернулась команда, выполняем
		ИмяКоманды = get_prop(Результат, "NAME");
		Действие = get_prop(Результат, "ACTION");
		Если get_prop(Результат, "TEMPLATE") = "command" И ИмяКоманды <> Неопределено И Действие <> Неопределено Тогда
			RUN_TOOLBAR_COMMAND(ИмяКоманды, get_prop(Результат, "ARGS", Новый Структура), Действие);
		КонецЕсли;
		Возврат; // Выполнили эндпоинт activate_row без ошибок, выходим
	КонецЕсли;	
	
	ВыбраннаяСтрокаДанные = Элемент.ТекущиеДанные;
	Попытка
		ИмяФормыДокумента = ВыбраннаяСтрокаДанные["ФормаПросмотра"];
	Исключение
		ИмяФормыДокумента = Неопределено;	
	КонецПопытки;
	ИмяФормыПоУмолчанию = get_prop(ТекущийРаздел.ПараметрыОтображения, "FORM", 
								get_prop(ТекущийРаздел.ПараметрыОтображения, "Form"));
	Попытка
		ДокументСБИС = ВыбраннаяСтрокаДанные["ДокументСБИС"];
	Исключение
		ДокументСБИС = Неопределено;
	КонецПопытки;
	Попытка
		ДокументИС = ВыбраннаяСтрокаДанные["ДокументИС"]; 
	Исключение
		ДокументИС = Неопределено;
	КонецПопытки;
	Если ДокументИС = Неопределено Тогда
		Попытка
			ДокументИС = ВыбраннаяСтрокаДанные["ОбъектИС"]; 
		Исключение
			ДокументИС = Неопределено;
		КонецПопытки;
	КонецЕсли;
	ShowForm(КэшФорм.Формы, КэшФорм.ИменаФорм, КэшФорм.ПутьКФормам, ДокументИС, ДокументСБИС, ИмяФормыДокумента, ИмяФормыПоУмолчанию);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЕщеПлоскийСписокНажатие()
	БылоСтрок = ПлоскийСписок.Количество(); 
	ЭтаФорма.Страница = ЭтаФорма.Страница + 1;
	ОбновитьСписок(ДанныеФильтра.Значения);
	// позиционируемся на первую из добавленных строк
	ПолучитьЭлементыФормы().ПлоскийСписок.ТекущаяСтрока = СтрокаТаблицыФормы(ПлоскийСписок, БылоСтрок);
КонецПроцедуры

&НаКлиенте
Функция СписокОтмеченныхЗаписей(ЭтоСписокСсылок = Ложь)
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	Если ИмяТаблицы = "ИерархическийСписок" Тогда 
		Возврат СписокОтмеченныхЗаписейИерархическийСписок();
	Иначе
		Возврат СписокОтмеченныхЗаписейПлоскийСписок();
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция СписокОтмеченныхЗаписейПлоскийСписок()
	
	СписокОтмеченных = Новый Массив;
	Для Каждого Строка Из ПлоскийСписок Цикл
		Если Строка.Отмечен Тогда
			НоваяСтрока = Новый Структура(ТекущийРаздел.Колонки);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			СписокОтмеченных.Добавить(НоваяСтрока);	
		КонецЕсли;
	КонецЦикла;
	Если СписокОтмеченных.Количество()=0 Тогда
		ЭлемФормы = ПолучитьЭлементыФормы();
		Если ЭлемФормы.ПлоскийСписок.ТекущаяСтрока<>Неопределено Тогда
			НоваяСтрока = Новый Структура(ТекущийРаздел.Колонки);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлемФормы.ПлоскийСписок.ТекущиеДанные);
			СписокОтмеченных.Добавить(НоваяСтрока);
		КонецЕсли;
	КонецЕсли;
	Возврат СписокОтмеченных;

КонецФункции

&НаКлиенте
Процедура ОтметитьВсеПлоскийСписокНажатие(Элемент)
	ОтмеченыВсе = Не ОтмеченыВсе;
	Для Каждого Строка Из ПлоскийСписок Цикл 
		Если ЗначениеЗаполнено(get_prop(Строка, "ЗагрузитьЕще")) Тогда
			Продолжить;
		КонецЕсли;	
		Строка.Отмечен = ОтмеченыВсе;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФорму1СПлоскогоСписка(Команда) Экспорт
	ЭлемФормы = ПолучитьЭлементыФормы();
	ОткрытьФорму1СПоСтрокеПлоскогоСписка(ЭлемФормы.ПлоскийСписок);		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТиповуюФормуОбъекта(Команда) Экспорт
	ЭлемФормы = ПолучитьЭлементыФормы();
	ВыбраннаяСтрокаДанные = ЭлемФормы.ПлоскийСписок.ТекущиеДанные;
	Если ВыбраннаяСтрокаДанные <>Неопределено Тогда 
		Попытка
			ДокументИС = ВыбраннаяСтрокаДанные["ДокументИС"]; 
		Исключение
			ДокументИС = Неопределено;
		КонецПопытки;
		Если НЕ ЗначениеЗаполнено(ДокументИС) Тогда
			Сообщить("Нет связанных документов 1С");
			Возврат;
		КонецЕсли;
		ОткрытьПоказатьЗначение(ДокументИС);
	КонецЕсли;
КонецПроцедуры
