
&НаСервере
Процедура ЗаполнитьВидимостьКолонкиПлоскогоСписка(ТабПоле,Колонка,ЭлемФормы,ИмяТаблицы,ГруппаКолонок) 
	ТекущийРаздел.Колонки = ТекущийРаздел.Колонки + Колонка["Name"] + ",";
	ВидимостьКолонки = get_prop(Колонка, "Visibility", get_prop(Колонка, "VISIBLE", Ложь));
	ИмяКолонки = get_prop(Колонка, "Name", get_prop(Колонка, "NAME"));
	Если ВидимостьКолонки = Ложь Тогда
		Возврат;
	КонецЕсли;	
	ШаблонКолонки = get_prop(Колонка, "TEMPLATE");
	Если ЗначениеЗаполнено(ШаблонКолонки) Тогда
		ЗаполнитьВидимостьКолонкиПлоскогоСпискаПоШаблону(ШаблонКолонки, ТабПоле, ИмяТаблицы, ИмяКолонки,
			Колонка, ЭлемФормы, ГруппаКолонок);
		Возврат;
	КонецЕсли;
	Если get_prop(Колонка, "More") = Истина Тогда
		Родитель = ЭлемФормы.Добавить(ИмяТаблицы + Колонка["Name"] + "ЗагрузитьЕще", Тип("ГруппаФормы"), ГруппаКолонок);
		Родитель.Вид = ВидГруппыФормы.ГруппаКолонок;
		ИмяЭлемента = Колонка["Name"];
		ДобавитьРеквизитыЗагрузитьЕщё(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, Колонка, Родитель);
		Элем = ЭлемФормы.Добавить(ИмяТаблицы + Колонка["Name"], Тип("ПолеФормы"), Родитель);
	Иначе	
		Элем = ЭлемФормы.Добавить(ИмяТаблицы + Колонка["Name"], Тип("ПолеФормы"), ГруппаКолонок);
		ТекущийРаздел.ЭлементыФормы.Добавить(ИмяТаблицы + Колонка["Name"]);
	КонецЕсли;
	Элем.Вид = ВидПоляФормы.ПолеНадписи;
	Элем.ПутьКДанным = ИмяТаблицы + "." + Колонка["Name"];
	Элем.Заголовок = Колонка["Title"];
	Если get_prop(Колонка, "Properties") <> Неопределено Тогда 
		Для Каждого СвойствоПоля Из Колонка["Properties"] Цикл
			КлючСвойства = СвойствоПоля.Ключ;
			Если КлючСвойства = "Ширина" Тогда  
				Продолжить;
			КонецЕсли;
			Элем[СвойствоПоля.Ключ] = СвойствоПоля.Значение;
		КонецЦикла;
	КонецЕсли;
	Картинка = get_prop(Колонка, "RowIcon");
	Если Картинка <> Неопределено Тогда
		Элем.Вид = ВидПоляФормы.ПолеКартинки;
		Элем.КартинкаЗначений = ЭлемФормы[Картинка].Картинка
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидимостьКолонкиПлоскогоСпискаПоШаблону(ШаблонКолонки, ТабПоле, ИмяТаблицы, ИмяКолонки,
		Колонка, ЭлемФормы, ГруппаКолонок)
		
	Если ШаблонКолонки = "column_icon" Тогда
		Элем = ЭлемФормы.Добавить(ИмяТаблицы + Колонка["NAME"], Тип("ПолеФормы"), ГруппаКолонок);
		ТекущийРаздел.ЭлементыФормы.Добавить(ИмяТаблицы + Колонка["NAME"]);
		Элем.ПутьКДанным = ИмяТаблицы + "." + Колонка["NAME"];
		Элем.Заголовок = Колонка["TITLE"];
		Элем.Вид = ВидПоляФормы.ПолеКартинки;
		Если ТипЗнч(get_prop(Колонка, "ICONS")) = Тип("Соответствие") Тогда
			Картинка = get_prop(Колонка["ICONS"], "VALUE");
			Если ЗначениеЗаполнено(Картинка) Тогда
				Элем.КартинкаЗначений = ЭлемФормы[Картинка].Картинка;
			КонецЕсли;
		КонецЕсли;
		ПрименитьОбщиеПараметрыКолонки(Элем, Колонка);
	ИначеЕсли ШаблонКолонки = "column_default" Тогда
		Родитель = ГруппаКолонок;
		Если get_prop(Колонка, "MORE_LOAD") = Истина Тогда
			ИмяЭлемента = Колонка["NAME"];
			Родитель = ЭлемФормы.Добавить(ИмяТаблицы + Колонка["NAME"] + "ЗагрузитьЕще", Тип("ГруппаФормы"), ГруппаКолонок);
			Родитель.Вид = ВидГруппыФормы.ГруппаКолонок;
			ДобавитьРеквизитыЗагрузитьЕщё(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, Колонка, Родитель);
		КонецЕсли;
		Элем = ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, Колонка["NAME"], Колонка["TITLE"], Колонка, Родитель);
	ИначеЕсли ШаблонКолонки = "сolumn_date_number" Тогда
		ЗаполнитьКолонкиДатаНомер(ЭлемФормы, ИмяТаблицы, Колонка, ГруппаКолонок);
	ИначеЕсли ШаблонКолонки = "column_document_kedo" Тогда
		ЗаполнитьКолонкиДокументКЭДО(ЭлемФормы, ИмяТаблицы, Колонка, ГруппаКолонок);
	ИначеЕсли ШаблонКолонки = "сolumn_employee" Тогда
		ЗаполнитьКолонкиСотрудник(ЭлемФормы, ИмяТаблицы, Колонка, ГруппаКолонок);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыЗагрузитьЕщё(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, Колонка, ГруппаКолонок)
	ТекущийРаздел.ЭлементыФормы.Добавить(ИмяТаблицы + ИмяЭлемента + "ЗагрузитьЕще");
	Попытка
		Элем = ЭлемФормы.Добавить(ИмяТаблицы + "ЗагрузитьЕще", Тип("ПолеФормы"), ГруппаКолонок);
		Элем.Вид = ВидПоляФормы.ПолеНадписи;
		Элем.ГиперссылкаЯчейки = Истина;
		Элем.ПутьКДанным = ИмяТаблицы + "." + "ЗагрузитьЕще";
		Элем.ОтображатьВШапке = Ложь;
		Элем.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	Исключение
		Элем = Неопределено;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПрименитьОбщиеПараметрыКолонки(Элем, Колонка, Ширина = Неопределено)
	// Видимость
	Если get_prop(Колонка, "VISIBLE") = Истина Тогда
		Элем.Видимость = Истина;
	Иначе
		Элем.Видимость = Ложь;
	КонецЕсли;
	// Выравнивание
	Выравнивание = get_prop(Колонка, "ALIGN", "1");
	Если Выравнивание = "1" Тогда
		Элем.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	ИначеЕсли Выравнивание = "2" Тогда
		Элем.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
	Иначе
		Элем.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	КонецЕсли;
	// Ширина
	Если Ширина = Неопределено Тогда
		Элем.Ширина = ШиринаКолонки(Колонка);
	Иначе
		Если Ширина <> Ложь Тогда
			Попытка
				Элем.Ширина = Ширина;
			Исключение
				Элем.Ширина = 0;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДобавитьГруппуКолонокВЭлементыФормы(ЭлемФормы, ИмяГруппы, Колонка, Родитель, Группировка = "-",
		Ширина = Неопределено)
		
	Группа = ЭлемФормы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Родитель);
	Группа.Вид = ВидГруппыФормы.ГруппаКолонок;
	Группа.ОтображатьВШапке = Ложь;
	// Группировка
	Если Группировка = "-" Тогда
		Группа.Группировка = ГруппировкаКолонок.Горизонтальная;
	ИначеЕсли Группировка = "|" Тогда
		Группа.Группировка = ГруппировкаКолонок.Вертикальная;
	Иначе
		Группа.Группировка = ГруппировкаКолонок.ВЯчейке;
	КонецЕсли;
	// Видимость
	Если get_prop(Колонка, "VISIBLE") = Истина Тогда
		Группа.Видимость = Истина;
	Иначе
		Группа.Видимость = Ложь;
	КонецЕсли;
	// Ширина
	Если Ширина = Неопределено Тогда
		Группа.Ширина = ШиринаКолонки(Колонка);
	Иначе
		Если Ширина <> Ложь Тогда
			Попытка
				Группа.Ширина = Ширина;
			Исключение
				Группа.Ширина = 0;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Возврат Группа;
КонецФункции

&НаСервере
Функция ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, Заголовок, Колонка, Родитель,
		Ширина = Неопределено)
		
	ТекущийРаздел.ЭлементыФормы.Добавить(ИмяТаблицы + ИмяЭлемента);
	Элем = ЭлемФормы.Добавить(ИмяТаблицы + ИмяЭлемента, Тип("ПолеФормы"), Родитель);
	Элем.ПутьКДанным = ИмяТаблицы + "." + ИмяЭлемента;
	Элем.Заголовок = Заголовок;
	Элем.Вид = ВидПоляФормы.ПолеНадписи;
	ПрименитьОбщиеПараметрыКолонки(Элем, Колонка, Ширина);
	Возврат Элем;
КонецФункции

&НаСервере
Процедура ЗаполнитьКолонкиДатаНомер(ЭлемФормы, ИмяТаблицы, Колонка, ГруппаКолонок)
	// Группа колонок
	ИмяГруппы = ИмяТаблицы + Колонка["NAME"] + "Группа";
	Группа = ДобавитьГруппуКолонокВЭлементыФормы(ЭлемФормы, ИмяГруппы, Колонка, ГруппаКолонок, "|");
	// Дата
	ИмяЭлемента = Колонка["NAME"] + "_Дата_";
	Элем = ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "Дата", Колонка, Группа);
	Элем.Формат = "ДФ=dd.MM.yy";
	//Элем.Шрифт = Новый Шрифт(Элем.Шрифт,,,Истина); // Жирный шрифт
	// Номер
	ИмяЭлемента = Колонка["NAME"] + "_Номер_";
	Элем = ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "Номер", Колонка, Группа);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкиДокументКЭДО(ЭлемФормы, ИмяТаблицы, Колонка, ГруппаКолонок)
	локШирина = ШиринаКолонки(Колонка);	
	
	// Столбец 1
	// Группа колонок 1
	ИмяГруппы = ИмяТаблицы + Колонка["NAME"] + "Группа1";
	Группа1 = ДобавитьГруппуКолонокВЭлементыФормы(ЭлемФормы, ИмяГруппы, Колонка, ГруппаКолонок, "|", локШирина*2/3);
	// Группа колонок 2
	ИмяГруппы = ИмяТаблицы + Колонка["NAME"] + "Группа2";
	Группа2 = ДобавитьГруппуКолонокВЭлементыФормы(ЭлемФормы, ИмяГруппы, Колонка, Группа1, "-", Ложь);
	// Группа колонок 3
	ИмяГруппы = ИмяТаблицы + Колонка["NAME"] + "Группа3";
	Группа3 = ДобавитьГруппуКолонокВЭлементыФормы(ЭлемФормы, ИмяГруппы, Колонка, Группа1, "-", Ложь);
	// Столбец 2
	// Группа колонок 4
	ИмяГруппы = ИмяТаблицы + Колонка["NAME"] + "Группа4";
	Группа4 = ДобавитьГруппуКолонокВЭлементыФормы(ЭлемФормы, ИмяГруппы, Колонка, ГруппаКолонок, "|", локШирина*1/3);
	
	// Тип
	ИмяЭлемента = Колонка["NAME"] + "_Тип_";
	ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "Тип", Колонка, Группа2, Ложь);
	// ФИО
	ИмяЭлемента = Колонка["NAME"] + "_ФИО_";
	ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "ФИО", Колонка, Группа3, Ложь);
	// Должность
	ИмяЭлемента = Колонка["NAME"] + "_Должность_";
	ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "Должность", Колонка, Группа3, Ложь);
	// Организация
	ИмяЭлемента = Колонка["NAME"] + "_Организация_";
	ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "Организация", Колонка, Группа4, Ложь);
	// Инфо
	ИмяЭлемента = Колонка["NAME"] + "_Инфо_";
	ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "Инфо", Колонка, Группа1, Ложь);
	// Вложения
	ИмяЭлемента = Колонка["NAME"] + "_Вложения_";
	ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "Вложения", Колонка, Группа1, Ложь);
	// Этап
	ИмяЭлемента = Колонка["NAME"] + "_Этап_";
	ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "Этап", Колонка, Группа4, Ложь);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкиСотрудник(ЭлемФормы, ИмяТаблицы, Колонка, ГруппаКолонок)
	// Столбец 1
	// Группа колонок 1
	ИмяГруппы = ИмяТаблицы + Колонка["NAME"] + "Группа1";
	Группа1 = ДобавитьГруппуКолонокВЭлементыФормы(ЭлемФормы, ИмяГруппы, Колонка, ГруппаКолонок, "|", Ложь);
	// Столбец 2
	// Группа колонок 2
	ИмяГруппы = ИмяТаблицы + Колонка["NAME"] + "Группа2";
	Группа2 = ДобавитьГруппуКолонокВЭлементыФормы(ЭлемФормы, ИмяГруппы, Колонка, ГруппаКолонок, "|", Ложь);
	
	// Организация
	ИмяЭлемента = Колонка["NAME"] + "_Организация_";
	ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "Организация", Колонка, Группа1, Ложь);
	// Департамент
	ИмяЭлемента = Колонка["NAME"] + "_Департамент_";
	ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "Департамент", Колонка, Группа2, Ложь);
	// ФИО
	ИмяЭлемента = Колонка["NAME"] + "_ФИО_";
	ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "ФИО", Колонка, Группа1, Ложь);
	// Телефон
	ИмяЭлемента = Колонка["NAME"] + "_Телефон_";
	ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "Телефон", Колонка, Группа2, Ложь);
	// Должность
	ИмяЭлемента = Колонка["NAME"] + "_Должность_";
	ДобавитьКолонкуВЭлементыФормы(ЭлемФормы, ИмяТаблицы, ИмяЭлемента, "Должность", Колонка, Группа1, Ложь);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкиПлоскогоСписка() Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	
	ТабПоле = ЭлемФормы[ИмяТаблицы];
	Таблица = ДанныеФормыВЗначение(ЭтаФорма[ИмяТаблицы], Тип("ТаблицаЗначений"));
	Таблица.Очистить();
	Таблица.Колонки.Очистить();
		
	СоздатьРеквизитыФормыПлоскийСписок(Таблица, ИмяТаблицы);
	
	Если ТекущийРаздел.Свойство("ЭлементыФормы") Тогда
		Для Каждого Элем Из ТекущийРаздел.ЭлементыФормы Цикл
			ЭлемФормы.Удалить(ЭлемФормы.Найти(Элем));
		КонецЦикла;
		ТекущийРаздел.ЭлементыФормы.Очистить();
	Иначе
		ТекущийРаздел.Вставить("ЭлементыФормы", Новый Массив());
	КонецЕсли;

	ГруппаКолонок = ЭлемФормы.Добавить(ИмяТаблицы + "ГруппаКолонок", Тип("ГруппаФормы"), ТабПоле);
	ГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;
	ГруппаКолонок.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
	ГруппаКолонок.Группировка = ГруппировкаКолонок.Горизонтальная;
	ГруппаКолонок.ОтображатьВШапке  = Ложь;
	ГруппаКолонок.РастягиватьПоГоризонтали = Ложь;
	
	Элем = ЭлемФормы.Добавить(ИмяТаблицы + "Отмечен", Тип("ПолеФормы"), ГруппаКолонок);
	Элем.Вид = ВидПоляФормы.ПолеФлажка;
	Элем.ПутьКДанным = ИмяТаблицы + "." + "Отмечен"; 
	ТекущийРаздел.ЭлементыФормы.Добавить(ИмяТаблицы + "Отмечен");
	
	ЭлемФормы.ПлоскийСписок.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
	Если get_prop(ТекущийРаздел, "МножественныйВыбор") <> Истина Тогда
		Элем.Видимость = Ложь;
		ЭлемФормы.ОтметитьВсеПлоскийСписок.Видимость = Ложь;
	КонецЕсли;
	
	ТекущийРаздел.Вставить("Колонки", "");
	Колонки = КолонкиСписка();
	Для Каждого Колонка Из Колонки Цикл
		ЗаполнитьВидимостьКолонкиПлоскогоСписка(ТабПоле,Колонка,ЭлемФормы,ИмяТаблицы,ГруппаКолонок);		
	КонецЦикла; 
	ТекущийРаздел.ЭлементыФормы.Добавить(ИмяТаблицы + "ГруппаКолонок");
	ЗначениеВДанныеФормы(Таблица, ЭтаФорма[ИмяТаблицы]);
	УстановитьУсловноеОформление(ТекущийРаздел.ПараметрыОтображения["Columns"]);
КонецПроцедуры

Процедура СоздатьРеквизитыФормыПлоскийСписок(Таблица, ИмяТаблицы)
	РеквизитыУдалить = Новый Массив();
	Реквизиты = Новый Массив();
	СоздатьРеквизитыТаблицыФормы(Таблица, ИмяТаблицы, Реквизиты, РеквизитыУдалить);
	
	Рек = Новый РеквизитФормы("Отмечен", Новый ОписаниеТипов("Булево"), ИмяТаблицы);
	Реквизиты.Добавить(Рек);
	Таблица.Колонки.Добавить("Отмечен", Новый ОписаниеТипов("Булево"));
	
	ИзменитьРеквизиты(Реквизиты, РеквизитыУдалить);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление(Колонки = Неопределено)
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = "СозданПрограммно";
	//Отбор
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПлоскийСписок.ЗагрузитьЕще");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	//Оформление
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//Поле оформления
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ПлоскийСписокЗагрузитьЕще");
	
	//
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = "СозданПрограммно";
	//Отбор
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПлоскийСписок.ЗагрузитьЕще");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	//Оформление
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//Поле оформления
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ПлоскийСписокОтмечен");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ПлоскийСписокСтатусСБИС");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ПлоскийСписокСтатус1С");
	
	Если Колонки <> Неопределено Тогда
		Для Каждого Колонка Из Колонки Цикл
			Если get_prop(Колонка, "TEMPLATE") = "column_icon" Тогда
				Попытка
					ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
					ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ПлоскийСписок" + Колонка["NAME"]);
				Исключение
					ПолеОформления = Неопределено;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

