
Процедура ЗаполнитьВидимостьКолонкиПлоскогоСписка(ТабПоле,Колонка,ЭлемФормы,ИмяТаблицы,ОписаниеТипа)
	ТекущийРаздел.Колонки = ТекущийРаздел.Колонки + Колонка["Name"] + ",";
	ВидимостьКолонки = get_prop(Колонка, "Visibility", get_prop(Колонка, "VISIBLE", Ложь));
	ИмяКолонки = get_prop(Колонка, "Name", get_prop(Колонка, "NAME"));
	Если ВидимостьКолонки = Ложь Тогда 
		ТабПоле.Значение.Колонки.Добавить(ИмяКолонки, ОписаниеТипа);
		Возврат;
	КонецЕсли;	
	ШаблонКолонки = get_prop(Колонка, "TEMPLATE");
	Если ШаблонКолонки = "column_icon" Тогда
		ЗаполнитьКолонкиИконка(ТабПоле, ИмяТаблицы, ИмяКолонки, Колонка, ЭлемФормы);
		Возврат;
	ИначеЕсли ШаблонКолонки = "column_default" Тогда
		ЗаполнитьКолонкиПоУмолчанию(ТабПоле, ИмяТаблицы, ИмяКолонки, Колонка, ЭлемФормы, ОписаниеТипа);
		Возврат;
	ИначеЕсли ШаблонКолонки = "сolumn_date_number" Тогда
		Колонка["NAME"] = ИмяТаблицы + "_ДатаНомер_";
		ЗаполнитьКолонкиДатаНомер(ТабПоле, ИмяТаблицы, Колонка);
		Возврат;
	ИначеЕсли ШаблонКолонки = "column_document_kedo" Тогда
		Колонка["NAME"] = ИмяТаблицы + "_ДокументКЕДО_";
		ЗаполнитьКолонкиДокументКЭДО(ТабПоле, ИмяТаблицы, Колонка);
		Возврат;
	ИначеЕсли ШаблонКолонки = "сolumn_employee" Тогда
		Колонка["NAME"] = ИмяТаблицы + "_Сотрудник_";
		ЗаполнитьКолонкиСотрудник(ТабПоле, ИмяТаблицы, Колонка);
		Возврат;
	Иначе
		ЗаполнитьКолонкиСтарогоФормата(ТабПоле, ИмяТаблицы, ИмяКолонки, Колонка, ЭлемФормы, ОписаниеТипа);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьКолонкиСтарогоФормата(ТабПоле, ИмяТаблицы, ИмяКолонки, Колонка, ЭлемФормы, ОписаниеТипа)
	Поле = ТабПоле.Колонки.Добавить(ИмяТаблицы + ИмяКолонки, Колонка["Title"]);
	Поле.Данные = ИмяКолонки;
	Если get_prop(Колонка, "Properties") <> Неопределено Тогда
		Для Каждого СвойствоПоля Из Колонка["Properties"] Цикл
			Поле[СвойствоПоля.Ключ] = СвойствоПоля.Значение;
		КонецЦикла;
	КонецЕсли;
	Если get_prop(Колонка, "More") = Истина Тогда
		ДобавитьРеквизитыЗагрузитьЕщё(ТабПоле, ИмяТаблицы, ОписаниеТипа);
	КонецЕсли;
	Картинка = get_prop(Колонка, "RowIcon");
	Если Картинка <> Неопределено Тогда
		//Поле.КартинкиСтрок = Новый Картинка(МодульОбъекта().ПолучитьМакет(Картинка), Истина);
		Поле.КартинкиСтрок = ЭлемФормы[Картинка].Картинка;
		Поле.ЭлементУправления.ТипЗначения = ОписаниеТипа;
		ИконкиВДанных.Вставить(ИмяТаблицы + ИмяКолонки, ИмяКолонки);
	КонецЕсли;
	ТабПоле.Значение.Колонки.Добавить(ИмяКолонки, ОписаниеТипа);
КонецПроцедуры	

Процедура ЗаполнитьКолонкиИконка(ТабПоле, ИмяТаблицы, ИмяКолонки, Колонка, ЭлемФормы)
	Поле = ТабПоле.Колонки.Добавить(ИмяТаблицы + ИмяКолонки, Колонка["TITLE"]);
	Поле.Данные = get_prop(Колонка, "PROPERTY");
	Если ТипЗнч(get_prop(Колонка, "ICONS")) = Тип("Соответствие") Тогда
		Картинка = get_prop(Колонка["ICONS"], "VALUE");
		Если ЗначениеЗаполнено(Картинка) Тогда
			Поле.КартинкиСтрок = ЭлемФормы[Картинка].Картинка;
		КонецЕсли;
	КонецЕсли;
	Поле.ЭлементУправления.ТипЗначения = Новый ОписаниеТипов("Число");
	Поле.Ширина = ШиринаКолонки(Колонка);
	ИконкиВДанных.Вставить(ИмяТаблицы + ИмяКолонки, Поле.Данные);
КонецПроцедуры

Процедура ЗаполнитьКолонкиПоУмолчанию(ТабПоле, ИмяТаблицы, ИмяКолонки, Колонка, ЭлемФормы, ОписаниеТипа)
	Поле = ТабПоле.Колонки.Добавить(ИмяТаблицы + ИмяКолонки, Колонка["TITLE"]);
	Поле.Данные = ИмяКолонки;
	Поле.ЭлементУправления.ТипЗначения = Новый ОписаниеТипов("Строка");
	Поле.Ширина = ШиринаКолонки(Колонка);
	ТабПоле.Значение.Колонки.Добавить(ИмяКолонки, ОписаниеТипа);
	// Добавляем 1 раз реквизит "ЗагрузитьЕще"
	Если get_prop(Колонка, "MORE_LOAD") = Истина Тогда
		ДобавитьРеквизитыЗагрузитьЕщё(ТабПоле, ИмяТаблицы, ОписаниеТипа);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьРеквизитыЗагрузитьЕщё(ТабПоле, ИмяТаблицы, ОписаниеТипа)
	Попытка
		Если ТабПоле.Колонки.Найти(ИмяТаблицы + "ЗагрузитьЕще") = Неопределено Тогда
			Поле = ТабПоле.Колонки.Добавить(ИмяТаблицы + "ЗагрузитьЕще", "Загрузить еще");
			Поле.Данные = "ЗагрузитьЕще";
			Поле.Положение = ПоложениеКолонки.НаСледующейСтроке;
			Поле.Гиперссылка = Истина;
			Поле.ОтображатьВШапке = Ложь;
			// BSLLS:StyleElementConstructors-off
			Поле.ЦветТекстаПоля = Новый Цвет(0, 85, 187);
			// BSLLS:StyleElementConstructors-on
			Если ТабПоле.Значение.Колонки.Найти(ИмяТаблицы + "ЗагрузитьЕще") = Неопределено Тогда
				ТабПоле.Значение.Колонки.Добавить("ЗагрузитьЕще", ОписаниеТипа);
			КонецЕсли;
		КонецЕсли;
	Исключение
		Поле = Неопределено;
	КонецПопытки;
КонецПроцедуры

Процедура ПрименитьОбщиеПараметрыКолонки(Элем, Колонка, Ширина = Неопределено)
	// Видимость
	Если get_prop(Колонка, "VISIBLE") = Истина Тогда
		Элем.Видимость = Истина;
	Иначе
		Элем.Видимость = Ложь;
	КонецЕсли;
	// Выравнивание
	Выравнивание = get_prop(Колонка, "ALIGN", "1");
	Если Выравнивание = "1" Тогда
		Элем.ГоризонтальноеПоложениеВКолонке = ГоризонтальноеПоложение.Право;
	ИначеЕсли Выравнивание = "2" Тогда
		Элем.ГоризонтальноеПоложениеВКолонке = ГоризонтальноеПоложение.Лево;
	Иначе
		Элем.ГоризонтальноеПоложениеВКолонке = ГоризонтальноеПоложение.Центр;
	КонецЕсли;
	// Ширина
	Если Ширина = Неопределено Тогда
		Элем.Ширина = ШиринаКолонки(Колонка);
	Иначе
		Если Ширина <> Ложь Тогда
			Попытка
				Элем.Ширина = Ширина;
			Исключение
				Элем.Ширина = 0;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, Заголовок, Колонка,
		Положение = "-", Ширина = Неопределено, ДобавитьВТЗ = Истина)
		
	Поле = ТабПоле.Колонки.Добавить(ИмяЭлемента, Заголовок);
	// Группировка
	Если Положение = "-" Тогда
		Поле.Положение = ПоложениеКолонки.НоваяКолонка;
	ИначеЕсли Положение = "|" Тогда
		Поле.Положение = ПоложениеКолонки.НаСледующейСтроке;
	Иначе
		Поле.Положение = ПоложениеКолонки.НоваяКолонка;
	КонецЕсли;
	Поле.Данные = ИмяЭлемента;
	Поле.ЭлементУправления.ТипЗначения = ТипДанных;
	ПрименитьОбщиеПараметрыКолонки(Поле, Колонка, Ширина);
	Если ДобавитьВТЗ Тогда
		ТабПоле.Значение.Колонки.Добавить(ИмяЭлемента, ТипДанных);
	КонецЕсли;
	Возврат Поле;
КонецФункции

Процедура ЗаполнитьКолонкиДатаНомер(ТабПоле, ИмяТаблицы, Колонка)
	ТипДанных = Новый ОписаниеТипов("Строка");
	// Дата
	ИмяЭлемента = Колонка["NAME"] + "_Дата_";
	ИмяДанные = get_prop(Колонка, "DATE_PROPERTY");
	Поле = ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "Дата", Колонка, "-");
	//Поле.ШрифтТекста = Новый Шрифт(Поле.ШрифтТекста,,,Истина); // Жирный шрифт
	Поле.Формат = "ДФ=dd.MM.yy";
	// Номер
	ИмяЭлемента = Колонка["NAME"] + "_Номер_";
	ИмяДанные = get_prop(Колонка, "NUMBER_PROPERTY");
	Поле = ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "Номер", Колонка, "|");
КонецПроцедуры

Процедура ЗаполнитьКолонкиДокументКЭДО(ТабПоле, ИмяТаблицы, Колонка)
	локШирина = ШиринаКолонки(Колонка);
	ТипДанных = Новый ОписаниеТипов("Строка");
	
	// Колонка 1
	// Тип
	ИмяЭлемента = Колонка["NAME"] + "_Тип_";
	ИмяДанные = get_prop(Колонка, "TYPE_PROPERTY");
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "Тип", Колонка, "-", локШирина*2/3);
	// ФИО
	ИмяЭлемента = Колонка["NAME"] + "_ФИО_";
	ИмяДанные = get_prop(Колонка, "PROPERTY");
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "ФИО", Колонка, "|", локШирина*2/3);
	// Инфо
	ИмяЭлемента = Колонка["NAME"] + "_Инфо_";
	ИмяДанные = get_prop(Колонка, "INFO_PROPERTY");
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "Инфо", Колонка, "|", локШирина*2/3);
	// Вложения
	ИмяЭлемента = Колонка["NAME"] + "_Вложения_";
	ИмяДанные = get_prop(Колонка, "ATTACHMENTS_PROPERTY");
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "Вложения", Колонка, "|", локШирина*2/3);
	
	// Колонка 2
	// Организация
	ИмяЭлемента = Колонка["NAME"] + "_Организация_";
	ИмяДанные = get_prop(Колонка, "ORG_PROPERTY");
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "Организация", Колонка, "-", локШирина*1/3);
	// Должность
	ИмяЭлемента = Колонка["NAME"] + "_Должность_";
	ИмяДанные = get_prop(Колонка, "POSITION_PROPERTY");
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "Должность", Колонка, "|", локШирина*1/3);
	// Этап
	ИмяЭлемента = Колонка["NAME"] + "_Этап_";
	ИмяДанные = get_prop(Колонка, "STAGE_PROPERTY");
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "Этап", Колонка, "|", локШирина*1/3);
КонецПроцедуры

Процедура ЗаполнитьКолонкиСотрудник(ТабПоле, ИмяТаблицы, Колонка)
	локШирина = ШиринаКолонки(Колонка);
	ТипДанных = Новый ОписаниеТипов("Строка");
	
	// Столбец 1
	// Организация
	ИмяЭлемента = Колонка["NAME"] + "_Организация_";
	ИмяДанные = get_prop(Колонка, "ORG_PROPERTY");
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "Организация", Колонка, "-", локШирина/2);
	// ФИО
	ИмяЭлемента = Колонка["NAME"] + "_ФИО_";
	ИмяДанные = get_prop(Колонка, "PROPERTY");
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "ФИО", Колонка, "|", локШирина/2);
	// Должность
	ИмяЭлемента = Колонка["NAME"] + "_Должность_";
	ИмяДанные = get_prop(Колонка, "POSITION_PROPERTY");
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "Должность", Колонка, "|", локШирина/2);
	
	// Столбец 2
	// Департамент
	ИмяЭлемента = Колонка["NAME"] + "_Департамент_";
	ИмяДанные = get_prop(Колонка, "DEPARTMENT_PROPERTY");
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "Департамент", Колонка, "-", локШирина/2);
	// Телефон
	ИмяЭлемента = Колонка["NAME"] + "_Телефон_";
	ИмяДанные = get_prop(Колонка, "TEL_PROPERTY");
	ДобавитьКолонкуВЭлементыФормы(ТабПоле, ИмяТаблицы, ИмяЭлемента, ИмяДанные, ТипДанных, "Телефон", Колонка, "|", локШирина/2);
КонецПроцедуры

Процедура ЗаполнитьКолонкиПлоскогоСписка() Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ИмяТаблицы = ТекущийРаздел["Шаблон"]; 
	
	ИконкиВДанных = Новый Соответствие;
	ИконкиВДанных.Очистить();
	ТабПоле = ЭлемФормы[ИмяТаблицы];
	ТабПоле.Значение.Очистить();
	ТабПоле.Колонки.Очистить();
	ТабПоле.Значение.Колонки.Очистить();
	Поле = ТабПоле.Колонки.Добавить(ИмяТаблицы + "Отмечен", "V");
	ТабПоле.Значение.Колонки.Добавить("Отмечен", Новый ОписаниеТипов("Булево"));
	Поле.УстановитьЭлементУправления(Тип("Флажок"));
	Поле.ДанныеФлажка = "Отмечен";
	Поле.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
	Поле.Ширина = 4;
	Поле.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
	Поле.ОтображатьИерархию = Истина;
	
	ЭлемФормы.ПлоскийСписок.РежимВыделения = РежимВыделенияТабличногоПоля.Одиночный;
	Если get_prop(ТекущийРаздел, "МножественныйВыбор") <> Истина Тогда
		Поле.Видимость = Ложь;
		ЭлемФормы.ОтметитьВсеПлоскийСписок.Видимость = Ложь;
		ЭлемФормы.ОтметитьВсеПлоскийСписок.Доступность = Ложь;
	КонецЕсли;
	
	ТекущийРаздел.Вставить("Колонки", "");
	КвалификаторыСтроки = Новый КвалификаторыСтроки();
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
	Колонки = КолонкиСписка();
	Для Каждого Колонка Из Колонки Цикл
		ОписаниеТипа = ОписаниеТипаСтрока;
		Если get_prop(Колонка, "Type") <> Неопределено Тогда
			ОписаниеТипа = ОписаниеТипаКолонки(Колонка["Type"]);
		КонецЕсли;
		ЗаполнитьВидимостьКолонкиПлоскогоСписка(ТабПоле,Колонка,ЭлемФормы,ИмяТаблицы,ОписаниеТипа);
	КонецЦикла;
КонецПроцедуры

Процедура ПлоскийСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ДанныеСтроки.ЗагрузитьЕще <> "" Тогда
		Для Каждого Ячейка Из ОформлениеСтроки.Ячейки Цикл
			Если Ячейка.Имя <> "ПлоскийСписокЗагрузитьЕще" Тогда
				Ячейка.Видимость = Ложь;	
			КонецЕсли;
		КонецЦикла;
		Возврат;
	КонецЕсли;	
	ОформлениеСтроки.Ячейки.ПлоскийСписокЗагрузитьЕще.Видимость = Ложь;
	Попытка
		Если ТипЗнч(ИконкиВДанных) <> Тип("Соответствие") Тогда
			Возврат;
		КонецЕсли;
		Для Каждого ИконкаВДанных Из ИконкиВДанных Цикл
			Если ОформлениеСтроки.Ячейки.Найти(ИконкаВДанных.Ключ) <> Неопределено Тогда
				Если ДанныеСтроки[ИконкаВДанных.Значение] >= 0 Тогда
					ОформлениеСтроки.Ячейки[ИконкаВДанных.Ключ].ОтображатьКартинку = Истина;
					ОформлениеСтроки.Ячейки[ИконкаВДанных.Ключ].ИндексКартинки = ДанныеСтроки[ИконкаВДанных.Значение];
				КонецЕсли;
				ОформлениеСтроки.Ячейки[ИконкаВДанных.Ключ].ОтображатьТекст = Ложь;
			КонецЕсли;
		КонецЦикла;
	Исключение
		Возврат;
	КонецПопытки;
КонецПроцедуры

