
&НаКлиенте
Функция ВидШаблона(ПараметрыОтображения) 
	Шаблон = ПараметрыОтображения["Template"];
	Если Шаблон = Неопределено Тогда 
		Шаблон = ПараметрыОтображения["TEMPLATE"];	
	КонецЕсли;  
	Если Шаблон = "list_flat" Тогда
		Шаблон = "ПлоскийСписок";
	КонецЕсли;	
	Если Шаблон = "list_hierarchical" Тогда
		Шаблон = "ИерархическийСписок";
	КонецЕсли;
	Возврат Шаблон;
КонецФункции

&НаКлиенте
Процедура ПоказатьШаблон()
	Попытка
		ЭлемФормы = ПолучитьЭлементыФормы();
		ЭтаФорма.ОтмеченыВсе = Ложь;
		ПанельКонтент = ЭлемФормы.ПанельКонтент;
		ПараметрыОтображения = ПараметрыОтображенияКонтента();
		Шаблон = ВидШаблона(ПараметрыОтображения);
		ТекущийРаздел.Вставить("Шаблон", Шаблон);
		ПанельКонтент.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ПанельКонтент, "Страница" + Шаблон);
		Если Шаблон = "ПлоскийСписок" Тогда
			ПлоскийСписокПриОткрытии(ПараметрыОтображения);
		ИначеЕсли Шаблон = "ИерархическийСписок" Тогда
	        ИерархическийСписокПриОткрытии(ПараметрыОтображения)
		Иначе
			Возврат;
		КонецЕсли;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
		Картинка = КартинкаОшибка();
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			СтруктураОшибки.message,
			Картинка);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Функция ПараметрыОтображенияКонтента()
	ИмяИни = ТекущийРаздел["Идентификатор"];
	ПараметрыКоманды = Новый Структура("Algorithm, Endpoint, EndpointArgs", ИмяИни, "view");
	РезультатИни = BlocklyExecutor.LocalCalcIni(ПараметрыКоманды);
	Если РезультатИни["Status"] = "error" Тогда
		ВызватьИсключение NewExtExceptionСтрока(, "Ошибка выполнения ini: '" + ПараметрыКоманды["Algorithm"]
				+ "', endpoint: '" + ПараметрыКоманды["Endpoint"] + "'" + Символы.ПС + РезультатИни.Result.message,
			РезультатИни.Result.detail, РезультатИни.Result.action);
	КонецЕсли;	
	ПараметрыОтображения = РезультатИни.Result;
	Возврат ПараметрыОтображения;
КонецФункции

