&НаКлиенте
Процедура ПоказатьШаблон()
	ЭлемФормы = ПолучитьЭлементыФормы();
	ПанельКонтент = ЭлемФормы.ПанельКонтент;
	ПараметрыОтображения = ПараметрыОтображенияКонтента();
	Шаблон = ПараметрыОтображения["Template"];
	ТекущийРаздел.Вставить("Шаблон", Шаблон);
	ПанельКонтент.ТекущаяСтраница = ПолучитьСтраницуНаКлиенте(ПанельКонтент, "Страница" + Шаблон);
	Если Шаблон = "ПлоскийСписок" Тогда
		ПлоскийСписокПриОткрытии(ПараметрыОтображения);
	ИначеЕсли Шаблон = "ИерархическийСписок" Тогда
        ИерархическийСписокПриОткрытии(ПараметрыОтображения)
	Иначе
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ПараметрыОтображенияКонтента()
	ИмяИни = ТекущийРаздел["Идентификатор"];
	ПараметрыКоманды = Новый Структура("algorithm, endpoint, params", ИмяИни, "view");
	РезультатИни = BlocklyExecutor.LocalCalcIni(ПараметрыКоманды);
	Если РезультатИни["status"] = "error" Тогда
		ВызватьИсключение NewExtExceptionСтрока(, "Ошибка выполнения ini: '" + ПараметрыКоманды["algorithm"]
				+ "', endpoint: '" + ПараметрыКоманды["endpoint"] + "'" + Символы.ПС + РезультатИни.data.message,
			РезультатИни.data.detail, РезультатИни.data.action);
	КонецЕсли;	
	ПараметрыОтображения = РезультатИни.data;
	Возврат ПараметрыОтображения;
КонецФункции

