&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьИмяФормы();
	МодульОбъекта = МодульОбъекта();
	ОбщиеПараметры = МодульОбъекта.ПриНачалеРаботы();	
	context_params = МодульОбъекта.НастройкиПодключенияПрочитать();
	ЭтаФорма.Тема = ?(context_params = Неопределено, МодульОбъекта.ТемаПоУмолчанию(), get_prop(context_params, "Тема"));
	ПубличныеОбщиеНастройки	= get_prop(ОбщиеПараметры, "public");
	ЭтаФорма.auto_update = get_prop(ПубличныеОбщиеНастройки, "auto_update", Ложь);
	ЭтаФорма.ДанныеФильтра = Новый Структура("ПараметрыОтображения, Значения");	
	ЭтаФорма.ТекущийРаздел = Новый Структура("Идентификатор, ПараметрыОтображения, Шаблон");
	ЭтаФорма.ПараметрыКоманд = Новый Структура;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии()
	// BSLLS:UnusedLocalVariable-off Переменные объявлены в другой области
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly(ЭтаФорма);
	// BSLLS:UnusedLocalVariable-on
	
	ПолучитьРеквизитОбъектаДокумента();
	Если auto_update Тогда
		СбисОбновитьОбработкуНаКлиенте();
	КонецЕсли;
	КэшФорм = Новый Структура("Формы, ИменаФорм", Новый Соответствие);
	КэшФорм.Вставить("ПутьКФормам", ПутьКФормамОбработки());
	Если Тема = "Saby" Тогда
		ФормаБраузера = ПолучитьФормуОбработки("Browser", КэшФорм.ПутьКФормам);
		ФормаБраузера.context_params = context_params;
		ФормаБраузера.Открыть();
		ЭтаФорма.Закрыть();
		Возврат;
	КонецЕсли;
	ЭтаФорма.ВладелецФормы = Неопределено;
	
	#Область include_base_ОбработчикиСобытий_ПриОткрытииЭДО
	#КонецОбласти
	#Область include_base_ОбработчикиСобытий_ПриОткрытии
	#КонецОбласти
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПослеАвторизации(Результат, ДопПараметры = Неопределено) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	context_params.Вставить("Тема", Тема);
	Попытка
		BlocklyExecutor.ПослеАутентификации(context_params);
	Исключение
		ТекущийРаздел.Вставить("Шаблон", "СтраницаЗаглушка");
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
		Картинка = КартинкаОшибка();
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			СтруктураОшибки.message,
			Картинка,
			СтатусОповещенияПользователя.Важное);
	КонецПопытки;
	
	ОбновитьЗаголовокФормы();
	ПостроитьАккордеон(ДопПараметры);

	КэшФорм.ИменаФорм = ФормыПросмотра();
	Если ЗначениеЗаполнено(ТекущийРаздел["Идентификатор"]) Тогда
		ПоказатьШаблон();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ФормыПросмотра()
	ПараметрыКоманды = Новый Структура("algorithm, endpoint, params", "Конфигурация", "СоответствиеФорм");
	Попытка
		РезультатИни = BlocklyExecutor.LocalCalcIni(ПараметрыКоманды);
		Если РезультатИни["status"] = "error" Тогда
			ВызватьИсключение NewExtExceptionСтрока(, "Ошибка выполнения ini: '" + ПараметрыКоманды["algorithm"]
				+ "', endpoint: '" + ПараметрыКоманды["endpoint"] + "'" + Символы.ПС + РезультатИни.data.message,
			РезультатИни.data.detail, РезультатИни.data.action);
		КонецЕсли;
		ФормыПросмотраДокумента = РезультатИни.data;
	Исключение
		ФормыПросмотраДокумента = Неопределено;
	КонецПопытки;
	
	Возврат	ФормыПросмотраДокумента;
КонецФункции

Функция ИзменитьНаПрямуюСсылку(СсылкаIE) 
	ПреобразованнаяСсылкаIE = СтрЗаменить(СсылкаIE, "://ie-1c.saby.", "://online.sbis.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://fix-ie-1c.saby.", "://fix-online.saby.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://test-ie-1c.saby.", "://test-online.saby.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://pre-test-ie-1c.saby.", "://pre-test-online.saby.");
	Возврат ПреобразованнаяСсылкаIE;
КонецФункции

Процедура ОбновитьЗаголовокФормы() 
	НовыйЗаголовок		= СтрЗаменить(СтрЗаменить(СокрЛП(ИзменитьНаПрямуюСсылку(context_params.api_url)), "https:", ""), "/", "");;
	ДобавитьКЗаголовку	= "";
	МодульОбъекта = МодульОбъекта();
	СтруктураСессии = МодульОбъекта.СтруктураСессии(context_params);
	Если ЗначениеЗаполнено(get_prop(СтруктураСессии, "user_fio")) Тогда
		ДобавитьКЗаголовку = СтруктураСессии.user_fio;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(context_params.DemoLicense) Тогда
		Если Не ПустаяСтрока(ДобавитьКЗаголовку) Тогда
			ДобавитьКЗаголовку = ДобавитьКЗаголовку + " ";
		КонецЕсли;
		DemoLicense = МодульОбъекта.ПреобразоватьСтрокуВДату("yyyy-MM-dd", context_params.DemoLicense);
		Если DemoLicense > ТекущаяДатаСеанса() Тогда
			ДобавитьКЗаголовку = ДобавитьКЗаголовку + "Демо-версия до " + Формат(DemoLicense, "ДФ=dd.MM.yyyy");
		Иначе
			ДобавитьКЗаголовку = ДобавитьКЗаголовку + "Пробный период истек";
		КонецЕсли;
	КонецЕсли;
	Если Не ПустаяСтрока(ДобавитьКЗаголовку) Тогда
		НовыйЗаголовок = НовыйЗаголовок + " (" + ДобавитьКЗаголовку + ")";
	КонецЕсли;
	ЭтаФорма.Заголовок = НовыйЗаголовок;
КонецПроцедуры
