
&НаСервере
Процедура ПриСозданииНаСервере(Отказ = Ложь, СтандартнаяОбработка = Истина)
	УстановитьРеквизитИмяФормы();
	МодульОбъекта = МодульОбъекта();
	ПараметрыФормы = МодульОбъекта.ПараметрыИнтерфейсныйМодулей();
	Попытка
		ОбщиеПараметры = МодульОбъекта.ПриНачалеРаботы();
		ПараметрыФормы.Вставить("ДоступностьВО3", Истина);
		context_params = МодульОбъекта.НастройкиПодключенияПрочитать();
		ЭтаФорма.Тема = ?(context_params = Неопределено, МодульОбъекта.ТемаПоУмолчанию(), get_prop(context_params, "Тема"));
		ПубличныеОбщиеНастройки	= get_prop(ОбщиеПараметры, "public");
		ЭтаФорма.auto_update = get_prop(ПубличныеОбщиеНастройки, "auto_update", Ложь);
		ЭтаФорма.ДанныеФильтра = Новый Структура("ПараметрыОтображения, Значения");	
		ЭтаФорма.ТекущийРаздел = Новый Структура("Идентификатор, ПараметрыОтображения, Шаблон");
		ЭтаФорма.ПараметрыКоманд = Новый Структура;
	Исключение
		ПараметрыФормы.Вставить("ДоступностьВО3", Ложь);
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии()
	// BSLLS:UnusedLocalVariable-off Переменные объявлены в другой области
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params, ЭтаФорма);
    ТранспортИнтеграции.УстановитьВариантВебИнтерфейса(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly(ЭтаФорма);
	BlocklyExecutor.ИнициироватьТранспорт(ТранспортИнтеграции);
	// BSLLS:UnusedLocalVariable-on
	
	КэшФорм = Новый Структура("Формы, ИменаФорм", Новый Соответствие);
	КэшФорм.Вставить("ПутьКФормам", ПутьКФормамОбработки());
	Если Тема = "Saby" Тогда
		ФормаБраузера = ФормаОсновнойОбработки("Browser", КэшФорм.ПутьКФормам);
		ФормаБраузера.context_params = context_params;
		ФормаБраузера.Открыть();
		ЭтаФорма.Закрыть();
		Возврат;
	КонецЕсли;
	ЭтаФорма.ВладелецФормы = Неопределено;
	
#Область include_base_ОбработчикиСобытий_ПриОткрытииЭДО
#КонецОбласти
#Область include_base_ОбработчикиСобытий_ПриОткрытии
#КонецОбласти
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПослеАвторизации(Результат, ДопПараметры = Неопределено) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	context_params.Вставить("Тема", Тема);
	Попытка
		ТранспортИнтеграции.ПослеАутентификации(context_params);
	Исключение
		ТекущийРаздел.Вставить("Шаблон", "СтраницаЗаглушка");
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфОбОшибке);
		Картинка = КартинкаОшибка();
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			СтруктураОшибки.message,
			Картинка);
	КонецПопытки;
		
	Если auto_update Тогда
		СбисОбновитьОбработкуНаКлиенте();
	КонецЕсли;
	
	ОбновитьЗаголовокФормы();
	ПолучитьРеквизитОбъектаДокумента();
	ПостроитьАккордеон(ДопПараметры);

	КэшФорм.ИменаФорм = ФормыПросмотра();
	Если ЗначениеЗаполнено(ТекущийРаздел["Идентификатор"]) Тогда
		ПоказатьШаблон();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ФормыПросмотра()
	ПараметрыКоманды = Новый Структура("Algorithm, Endpoint, EndpointArgs", "Конфигурация", "СоответствиеФорм");
	Попытка
		РезультатИни = BlocklyExecutor.LocalCalcIni(ПараметрыКоманды);
		Если РезультатИни["Status"] = "error" Тогда
			ВызватьИсключение NewExtExceptionСтрока(, "Ошибка выполнения ini: '" + ПараметрыКоманды["Algorithm"]
				+ "', endpoint: '" + ПараметрыКоманды["Endpoint"] + "'" + Символы.ПС + РезультатИни.Result.message,
			РезультатИни.Result.detail, РезультатИни.Result.action);
		КонецЕсли;
		ФормыПросмотраДокумента = РезультатИни.Result;
	Исключение
		ФормыПросмотраДокумента = Неопределено;
	КонецПопытки;
	
	Возврат	ФормыПросмотраДокумента;
КонецФункции

Функция ИзменитьНаПрямуюСсылку(СсылкаIE) 
	ПреобразованнаяСсылкаIE = СтрЗаменить(СсылкаIE, "://ie-1c.saby.", "://online.sbis.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://fix-ie-1c.saby.", "://fix-online.saby.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://test-ie-1c.saby.", "://test-online.saby.");
	ПреобразованнаяСсылкаIE = СтрЗаменить(ПреобразованнаяСсылкаIE, "://pre-test-ie-1c.saby.", "://pre-test-online.saby.");
	Возврат ПреобразованнаяСсылкаIE;
КонецФункции

Процедура ОбновитьЗаголовокФормы() 
	НовыйЗаголовок		= СтрЗаменить(СтрЗаменить(СокрЛП(ИзменитьНаПрямуюСсылку(context_params.ApiUrl)), "https:", ""), "/", "");
	ДобавитьКЗаголовку	= "";
	МодульОбъекта = МодульОбъекта();
	СтруктураСессии = МодульОбъекта.СтруктураСессии(context_params);
	Если ЗначениеЗаполнено(get_prop(СтруктураСессии, "UserFio")) Тогда
		ДобавитьКЗаголовку = СтруктураСессии.UserFio;
	КонецЕсли;
	DemoLicense = get_prop(context_params, "DemoLicense");
	Если ЗначениеЗаполнено(DemoLicense) Тогда
		Если Не ПустаяСтрока(ДобавитьКЗаголовку) Тогда
			ДобавитьКЗаголовку = ДобавитьКЗаголовку + " ";
		КонецЕсли;
		DemoLicense = МодульОбъекта.ПреобразоватьСтрокуВДату("yyyy-MM-dd", DemoLicense);
		Если DemoLicense > ТекущаяДатаСеанса() Тогда
			ДобавитьКЗаголовку = ДобавитьКЗаголовку + "Демо-версия до " + Формат(DemoLicense, "ДФ=dd.MM.yyyy");
		Иначе
			ДобавитьКЗаголовку = ДобавитьКЗаголовку + "Пробный период истек";
		КонецЕсли;
	КонецЕсли;
	Если Не ПустаяСтрока(ДобавитьКЗаголовку) Тогда
		НовыйЗаголовок = НовыйЗаголовок + " (" + ДобавитьКЗаголовку + ")";
	КонецЕсли;
	ЭтаФорма.Заголовок = НовыйЗаголовок;
КонецПроцедуры
