
Процедура СоздатьРеквизитыТаблицыФормы(Таблица, ИмяТаблицы, Реквизиты, РеквизитыУдалить)
	ТекущиеРеквизиты = ПолучитьРеквизиты(ИмяТаблицы);
	Для Каждого Рек Из ТекущиеРеквизиты Цикл
		РеквизитыУдалить.Добавить(Рек.Путь+"."+Рек.Имя);
	КонецЦикла;
	КвалификаторыСтроки = Новый КвалификаторыСтроки();
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
	ОписаниеТипаПроизвольный = Новый ОписаниеТипов();
	КолонкиСписка = КолонкиСписка();
	Для Каждого Колонка Из КолонкиСписка Цикл
		ШаблонКолонки = get_prop(Колонка, "TEMPLATE");
		Если ЗначениеЗаполнено(ШаблонКолонки) Тогда
			СоздатьРеквизитыТаблицыФормыПоШаблону(ШаблонКолонки, Таблица, Колонка, ИмяТаблицы, Реквизиты);
			Продолжить;
		КонецЕсли;
		ОписаниеТипа = ОписаниеТипаСтрока;
		Тип = get_prop(Колонка, "Type");
		Если Тип <> Неопределено Тогда
			Если Тип = "Соответствие" Тогда
				ОписаниеТипа = Новый ОписаниеТипов();
			Иначе
				ОписаниеТипа = ОписаниеТипаКолонки(Колонка["Type"]);
			КонецЕсли;
		КонецЕсли;
		Рек = Новый РеквизитФормы(Колонка["Name"], ОписаниеТипа, ИмяТаблицы);
		Реквизиты.Добавить(Рек);
		Таблица.Колонки.Добавить(Колонка["Name"], ОписаниеТипа);
		// Добавляем 1 раз реквизит "ЗагрузитьЕще"
		Если get_prop(Колонка, "More") = Истина Тогда
			СоздатьДополнительнуюКолонку(Таблица, ИмяТаблицы, "ЗагрузитьЕще", ОписаниеТипаСтрока, Реквизиты);
		КонецЕсли;
	КонецЦикла;
	// Принудительно добавляем в ТЗ колонку "ЗагрузитьЕще", если её нет
	СоздатьДополнительнуюКолонку(Таблица, ИмяТаблицы, "ЗагрузитьЕще", ОписаниеТипаСтрока, Реквизиты);
	СоздатьДополнительнуюКолонку(Таблица, ИмяТаблицы, "ИмяИС", ОписаниеТипаСтрока, Реквизиты);
	СоздатьДополнительнуюКолонку(Таблица, ИмяТаблицы, "ИдИС", ОписаниеТипаСтрока, Реквизиты);
	СоздатьДополнительнуюКолонку(Таблица, ИмяТаблицы, "ТипИС", ОписаниеТипаСтрока, Реквизиты);
	СоздатьДополнительнуюКолонку(Таблица, ИмяТаблицы, "ИмяСБИС", ОписаниеТипаСтрока, Реквизиты);
	СоздатьДополнительнуюКолонку(Таблица, ИмяТаблицы, "ИдСБИС", ОписаниеТипаСтрока, Реквизиты);
	СоздатьДополнительнуюКолонку(Таблица, ИмяТаблицы, "ДокументСБИС", ОписаниеТипаПроизвольный, Реквизиты);
	СоздатьДополнительнуюКолонку(Таблица, ИмяТаблицы, "ОбъектИС", ОписаниеТипаПроизвольный, Реквизиты);
	Если ИмяТаблицы = "ИерархическийСписок" Тогда
		ПолеЭтоГруппа = ТекущийРаздел.ПараметрыОтображения["NODE_PROPERTY"];
		ОписаниеТипаБулево = Новый ОписаниеТипов("Булево", ,КвалификаторыСтроки);
		СоздатьДополнительнуюКолонку(Таблица, ИмяТаблицы, ПолеЭтоГруппа, ОписаниеТипаБулево, Реквизиты);
	КонецЕсли;	

КонецПроцедуры

Процедура СоздатьДополнительнуюКолонку(Таблица, ИмяТаблицы, ИмяКолонки, ТипКолонки, Реквизиты) 
	НадоДобавитьКолонку = Истина;
	Для Каждого Рек Из Реквизиты Цикл
		Если Рек.Имя = ИмяКолонки Тогда
			НадоДобавитьКолонку = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НадоДобавитьКолонку Тогда
		Рек = Новый РеквизитФормы(ИмяКолонки, ТипКолонки, ИмяТаблицы);
		Реквизиты.Добавить(Рек);
		Таблица.Колонки.Добавить(ИмяКолонки, ТипКолонки);
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты)
	Рек = Новый РеквизитФормы(ИмяКолонки, ТипКолонки, ИмяТаблицы);
	Реквизиты.Добавить(Рек);
	Таблица.Колонки.Добавить(ИмяКолонки, ТипКолонки); 
КонецПроцедуры

Процедура СоздатьРеквизитТаблицыФормыЗагрузитьЕще(Таблица, ИмяТаблицы, Реквизиты)
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки());
	НадоДобавитьЗагрузитьЕще = Истина;
	Для Каждого Рек Из Реквизиты Цикл
		Если Рек.Имя = "ЗагрузитьЕще" Тогда
			НадоДобавитьЗагрузитьЕще = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НадоДобавитьЗагрузитьЕще Тогда
		Рек = Новый РеквизитФормы("ЗагрузитьЕще", ОписаниеТипаСтрока, ИмяТаблицы);
		Реквизиты.Добавить(Рек);
		Таблица.Колонки.Добавить("ЗагрузитьЕще", ОписаниеТипаСтрока);
	КонецЕсли;
КонецПроцедуры


Процедура СоздатьРеквизитыТаблицыФормыПоШаблону(ШаблонКолонки, Таблица, Колонка, ИмяТаблицы, Реквизиты)
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки());
	// Столбец. Иконка
	Если ШаблонКолонки = "column_icon" Тогда
		ТипКолонки = Новый ОписаниеТипов("Число");
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, Колонка["NAME"], ТипКолонки, ИмяТаблицы, Реквизиты);
	// Столбец.
	ИначеЕсли ШаблонКолонки = "column_default" Тогда
		ОписаниеТипа = ОписаниеТипаСтрока;
		Тип = get_prop(Колонка, "TYPE");
		Если Тип <> Неопределено Тогда
			Если Тип = "Соответствие" Тогда
				ОписаниеТипа = Новый ОписаниеТипов();
			Иначе
				ОписаниеТипа = ОписаниеТипаКолонки(Тип);
			КонецЕсли;
		КонецЕсли;
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, Колонка["NAME"], ОписаниеТипа, ИмяТаблицы, Реквизиты);
		// Добавляем 1 раз реквизит "ЗагрузитьЕще"
		Если get_prop(Колонка, "MORE_LOAD") = Истина Тогда
			СоздатьРеквизитТаблицыФормыЗагрузитьЕще(Таблица, ИмяТаблицы, Реквизиты);
		КонецЕсли;
	// Столбец. Дата и номер
	ИначеЕсли ШаблонКолонки = "column_date_number" Тогда
		ТипКолонки = ОписаниеТипаСтрока;
		Колонка["NAME"] = "_ДатаНомер_";
		ИмяКолонки = Колонка["NAME"] + "_Дата_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		ИмяКолонки = Колонка["NAME"] + "_Номер_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
	// Столбец. Документ КЭДО
	ИначеЕсли ШаблонКолонки = "column_document_kedo" Тогда
		СоздатьРеквизитыТаблицыФормыПоШаблонуДокументКЭДО(Таблица, Колонка, ИмяТаблицы, Реквизиты);
	// Столбец. Сотрудник
	ИначеЕсли ШаблонКолонки = "column_employee" Тогда
		ТипКолонки = ОписаниеТипаСтрока;
		Колонка["NAME"] = "_Сотрудник_";
		// Организация
		ИмяКолонки = Колонка["NAME"] + "_Организация_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		// Департамент
		ИмяКолонки = Колонка["NAME"] + "_Департамент_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		// ФИО
		ИмяКолонки = Колонка["NAME"] + "_ФИО_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		// Телефон
		ИмяКолонки = Колонка["NAME"] + "_Телефон_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		// Должность
		ИмяКолонки = Колонка["NAME"] + "_Должность_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьРеквизитыТаблицыФормыПоШаблонуДокументКЭДО(Таблица, Колонка, ИмяТаблицы, Реквизиты)
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки());
	
	ТипКолонки = ОписаниеТипаСтрока;
	Колонка["NAME"] = "_ДокументКЕДО_";
	Если ЗначениеЗаполнено(Колонка["TYPE_PROPERTY"]) Тогда
		ИмяКолонки = Колонка["NAME"] + "_Тип_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
	КонецЕсли;
	ИмяКолонки = Колонка["NAME"] + "_ФИО_";
	СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
	ИмяКолонки = Колонка["NAME"] + "_Должность_";
	СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
	ИмяКолонки = Колонка["NAME"] + "_Организация_";
	СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
	ИмяКолонки = Колонка["NAME"] + "_Инфо_";
	СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
	Если ЗначениеЗаполнено(Колонка["ATTACHMENTS_PROPERTY"]) Тогда
		ИмяКолонки = Колонка["NAME"] + "_Вложения_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
	КонецЕсли;
	ИмяКолонки = Колонка["NAME"] + "_Этап_";
	СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
КонецПроцедуры

Процедура ОбновитьСписокНаСервере(Данные)
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	ТабПоле = ЭлемФормы[ИмяТаблицы];
	Если ИмяТаблицы = "ПлоскийСписок" Тогда
		Таблица = ДанныеФормыВЗначение(ЭтаФорма[ИмяТаблицы], Тип("ТаблицаЗначений"));
		ЗаполнитьДанныеПлоскогоСписка(Таблица, Данные);
	Иначе
		Таблица = ДанныеФормыВЗначение(ЭтаФорма[ИмяТаблицы], Тип("ДеревоЗначений"));
		ЗаполнитьДанныеИерархическогоСписка(Таблица, Данные);	
	КонецЕсли;
	ЗначениеВДанныеФормы(Таблица, ЭтаФорма[ИмяТаблицы]);
	ТабПоле.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Фильтр) Экспорт
	Данные = ПолучитьДанныеСписка(Фильтр);
	ОбновитьСписокНаСервере(Данные);	
КонецПроцедуры

&НаСервере
Функция ШиринаКолонки(Колонка)
	ТипПоля = Новый ОписаниеТипов("Число");
	ШиринаКол = get_prop(Колонка, "WIDTH", 0);
	Делитель = 1;
	Если Найти(ШиринаКол, "%") = 0 Тогда
		Делитель = 10;
	КонецЕсли;
	ШиринаКол = СтрЗаменить(ШиринаКол, "px", "");
    ШиринаКол = СтрЗаменить(ШиринаКол, "%", "");
	ШиринаКол = ТипПоля.ПривестиЗначение(ШиринаКол);
	Возврат ШиринаКол / Делитель;
КонецФункции

#Область include_core_base_ГлавноеОкно_ПлоскийСписокУФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ИерархическийСписокУФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_Список
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_РаботаСоСтроками //&НаКлиенте
#КонецОбласти

&НаКлиенте
Процедура ОткрытьПоказатьЗначение(Значение)
	ПоказатьЗначение(, Значение); 
КонецПроцедуры

