
&НаСервере
Процедура ОбновитьСписок(Фильтр) Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	
	ТабПоле = ЭлемФормы[ИмяТаблицы];
	Таблица = ТабПоле.Значение;
	Данные = ПолучитьДанныеСписка(Фильтр);
	Если ИмяТаблицы = "ПлоскийСписок" Тогда
		ЗаполнитьДанныеПлоскогоСписка(Таблица, Данные);
	Иначе
		ЗаполнитьДанныеИерархическогоСписка(Таблица, Данные);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ШиринаКолонки(Колонка)
	ТипПоля = Новый ОписаниеТипов("Число");
	ШиринаКол = get_prop(Колонка, "WIDTH", 0);
	Делитель = 1;
	Если Найти(ШиринаКол, "%") = 0 Тогда
		Делитель = 5;
	КонецЕсли;
	ШиринаКол = СтрЗаменить(ШиринаКол, "px", "");
    ШиринаКол = СтрЗаменить(ШиринаКол, "%", "");
	ШиринаКол = ТипПоля.ПривестиЗначение(ШиринаКол);
	Возврат ШиринаКол / Делитель;
КонецФункции

#Область include_core_base_ГлавноеОкно_ПлоскийСписокОФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ИерархическийСписокОФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_Список
#КонецОбласти

&НаКлиенте
Процедура ОткрытьПоказатьЗначение(Значение)
	// BSLLS:UsingSynchronousCalls-off
	ОткрытьЗначение(Значение);
	// BSLLS:UsingSynchronousCalls-on 
КонецПроцедуры

