
&НаСервере
Функция КоличествоЭлементовСписка()
	Лимит = get_prop(ТекущийРаздел["ПараметрыОтображения"], "Limit", Неопределено);
	Если Лимит = Неопределено Тогда
		Лимит = get_prop(ТекущийРаздел["ПараметрыОтображения"], "PAGE_SIZE", 25);	
	КонецЕсли;
	Возврат Лимит;
КонецФункции

&НаСервере
Функция ОписаниеТипаКолонки(Тип)
	Если Тип = "ДокументСсылка" Тогда
		Возврат Документы.ТипВсеСсылки();
	ИначеЕсли Тип = "СправочникСсылка" Тогда
		Возврат Справочники.ТипВсеСсылки();
	Иначе
		Возврат Новый ОписаниеТипов(Тип);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаСервереБезКонтекста
Функция ДокументИССсылкаНаСервере(Знач ДокументИС)
	Возврат get_prop(ДокументИС,"Ссылка",Неопределено);
КонецФункции

&НаКлиенте
Функция СформироватьМассивВыгружаемыхДокументов1С()
	СписокОтмеченныхЗаписей = СписокОтмеченныхЗаписей(Ложь);
	ВыгружаемыеДокументы = Новый Массив();
	Для Каждого Запись Из СписокОтмеченныхЗаписей Цикл
		ДокументИССсылка = ДокументИССсылкаНаСервере(Запись.ДокументИС);
		Если Не ЗначениеЗаполнено(ДокументИССсылка) Тогда
			Продолжить; 
		КонецЕсли;
		ВыгружаемыеДокументы.Добавить(ДокументИССсылка);
	КонецЦикла;
	Возврат ВыгружаемыеДокументы;	
КонецФункции

&НаКлиенте
Процедура СформироватьМассивыДокументов(СписокДокументовСБИС, СписокДокументов1С) 
	СписокОтмеченных = СписокОтмеченныхЗаписей(Ложь);
	Если СписокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
    Если СписокОтмеченных.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя(
			"Не выбрано ни одного документа.",,"",
			БиблиотекаКартинок["Ошибка32"],
			СтатусОповещенияПользователя.Важное, Новый УникальныйИдентификатор);
		Возврат;
	КонецЕсли; 
	
	Для Каждого Запись ИЗ СписокОтмеченных Цикл
		ДокСбис = Запись["ДокументСБИС"];
		Если ТипЗнч(ДокСбис) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;	
		ДокументСБИС = Новый Структура("Идентификатор, ПервичныйКлюч, Документ1С", 
		ДокСбис["Идентификатор"],ДокСбис["ИдСБИС"], Запись["ДокументИС"]);	
		СписокДокументовСБИС.Добавить(ДокументСБИС);
		Если НЕ ЗначениеЗаполнено(Запись["ДокументИС"]) Тогда
			Продолжить;
		КонецЕсли;	
		Если ТипЗнч(Запись["ДокументИС"]) <> Тип("Массив") Тогда	
			СписокДокументов1С.Добавить(Запись["ДокументИС"]);   
			Продолжить;
		КонецЕсли;	                                          
		Для Каждого ЗаписьМассива Из Запись["ДокументИС"] Цикл 
			СписокДокументов1С.Добавить(ЗаписьМассива);	
		КонецЦикла;	
	КонецЦикла;		
КонецПроцедуры

&НаСервере
Функция КолонкиСписка()
	КолонкиСписка = ТекущийРаздел.ПараметрыОтображения["Columns"];
	Если КолонкиСписка = Неопределено Тогда
		КолонкиСписка = ТекущийРаздел.ПараметрыОтображения["COLUMNS"];
	КонецЕсли;	
	Возврат КолонкиСписка;
КонецФункции

&НаСервере
Функция ШиринаКолонки(Колонка)
	ТипПоля = Новый ОписаниеТипов("Число");
	ШиринаКол = get_prop(Колонка, "WIDTH", 0);
	ШиринаКол = СтрЗаменить(ШиринаКол, "px", "");
    ШиринаКол = СтрЗаменить(ШиринаКол, "%", "");
	ШиринаКол = ТипПоля.ПривестиЗначение(ШиринаКол);
	Возврат ШиринаКол;
КонецФункции
