
&НаСервере
Процедура ОбновитьСписок(Фильтр) Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	
	ТабПоле = ЭлемФормы[ИмяТаблицы];
	Таблица = ТабПоле.Значение;
	Данные = ПолучитьДанныеСписка(Фильтр);
	Если ИмяТаблицы = "ПлоскийСписок" Тогда
		ЗаполнитьДанныеПлоскогоСписка(Таблица, Данные);
	Иначе
		ЗаполнитьДанныеИерархическогоСписка(Таблица, Данные);	
	КонецЕсли;
КонецПроцедуры

#Область include_core_base_ГлавноеОкно_ПлоскийСписокОФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ИерархическийСписокОФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_Список
#КонецОбласти
