
&НаСервере
Функция ОписаниеТипаКолонки(Тип)
	Если Тип = "ДокументСсылка" Тогда
		Возврат Документы.ТипВсеСсылки();
	ИначеЕсли Тип = "СправочникСсылка" Тогда
		Возврат Справочники.ТипВсеСсылки();
	Иначе
		Возврат Новый ОписаниеТипов(Тип);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Функция СформироватьМассивВыгружаемыхДокументов() 
	СписокОтмеченныхЗаписей = СписокОтмеченныхЗаписей(Ложь);
	ВыгружаемыеДокументы = Новый Массив();
	Для Каждого Запись Из СписокОтмеченныхЗаписей Цикл
		ДокументСБИС = Запись["ДокументСБИС"]; 
		Если ДокументСБИС <> Неопределено Тогда
			ИмяСБИС = ДокументСБИС["Тип"];
			Если ИмяСБИС = Неопределено Тогда
				ИмяСБИС = ДокументСБИС["ИмяСБИС"];
			КонецЕсли;
			ПримечаниеСБИС = ДокументСБИС["Примечание"];
			ИдентификаторДокумента = ДокументСБИС["Идентификатор"];
			ИмяИзСБИСвАПИ3(ИмяСБИС, ПримечаниеСБИС, ИдентификаторДокумента);
			
			//Убрать после 24.2100 
			Если ДокументСБИС["ИдСБИС"] = Неопределено Тогда 
				ИдСБИС = ПолучитьИдСбисИзИдентификатора(ИдентификаторДокумента);
				Если ИдСБИС <> Неопределено Тогда 
					ДокументСБИС.Вставить("ИдСБИС", Формат(ИдСБИС,"ЧГ="));
				КонецЕсли;	
			КонецЕсли;		                                	
			//---
			
			API3_ref = Новый Структура; 
			API3_ref.Вставить("SbisId",		ДокументСБИС["ИдСБИС"]);
			API3_ref.Вставить("SbisType",	ИмяСБИС);
			API3_ref.Вставить("Type",		ИмяСБИС);
			API3_ref.Вставить("Title",		ДокументСБИС["Название"]);
			ВыгружаемыеДокументы.Добавить(API3_ref);

		КонецЕсли;	
	КонецЦикла;
	Возврат ВыгружаемыеДокументы; 	
КонецФункции

&НаКлиенте
Функция СформироватьМассивВыгружаемыхДокументов1С()
	СписокОтмеченныхЗаписей = СписокОтмеченныхЗаписей(Ложь);
	ВыгружаемыеДокументы = Новый Массив();
	Для Каждого Запись Из СписокОтмеченныхЗаписей Цикл
		ДокументИССсылка = get_prop(Запись.ДокументИС,"Ссылка",Неопределено);
		Если Не ЗначениеЗаполнено(ДокументИССсылка) Тогда
			Продолжить; 
		КонецЕсли;
		ВыгружаемыеДокументы.Добавить(ДокументИССсылка);
	КонецЦикла;
	Возврат ВыгружаемыеДокументы;	
КонецФункции

&НаКлиенте
Процедура СформироватьМассивыДокументов(СписокДокументовСБИС, СписокДокументов1С) 
	СписокОтмеченных = СписокОтмеченныхЗаписей(Ложь);
	Если СписокОтмеченных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
    Если СписокОтмеченных.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя(
			"Не выбрано ни одного документа.",,"",
			БиблиотекаКартинок["Ошибка32"],
			СтатусОповещенияПользователя.Важное, Новый УникальныйИдентификатор);
		Возврат;
	КонецЕсли; 
	
	Для Каждого Запись ИЗ СписокОтмеченных Цикл
		ДокСбис = Запись["ДокументСБИС"];
		Если ТипЗнч(ДокСбис) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;	
		ДокументСБИС = Новый Структура("Идентификатор, ПервичныйКлюч, Документ1С", 
		ДокСбис["Идентификатор"],ДокСбис["ИдСБИС"], Запись["ДокументИС"]);	
		СписокДокументовСБИС.Добавить(ДокументСБИС);
		Если НЕ ЗначениеЗаполнено(Запись["ДокументИС"]) Тогда
			Продолжить;
		КонецЕсли;	
		Если ТипЗнч(Запись["ДокументИС"]) <> Тип("Массив") Тогда	
			СписокДокументов1С.Добавить(Запись["ДокументИС"]);   
			Продолжить;
		КонецЕсли;	                                          
		Для Каждого ЗаписьМассива Из Запись["ДокументИС"] Цикл 
			СписокДокументов1С.Добавить(ЗаписьМассива);	
		КонецЦикла;	
	КонецЦикла;		
КонецПроцедуры

