
Процедура СоздатьРеквизитыТаблицыФормы(Таблица, ИмяТаблицы, Реквизиты, РеквизитыУдалить)
	ТекущиеРеквизиты = ПолучитьРеквизиты(ИмяТаблицы);
	Для Каждого Рек Из ТекущиеРеквизиты Цикл
		РеквизитыУдалить.Добавить(Рек.Путь+"."+Рек.Имя);
	КонецЦикла;
	КвалификаторыСтроки = Новый КвалификаторыСтроки();
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
	Для Каждого Колонка Из ТекущийРаздел.ПараметрыОтображения["Columns"] Цикл
		ШаблонКолонки = get_prop(Колонка, "TEMPLATE");
		Если ЗначениеЗаполнено(ШаблонКолонки) Тогда
			СоздатьРеквизитыТаблицыФормыПоШаблону(ШаблонКолонки, Таблица, Колонка, ИмяТаблицы, Реквизиты);
			Продолжить;
		КонецЕсли;
		ОписаниеТипа = ОписаниеТипаСтрока;
		Тип = get_prop(Колонка, "Type");
		Если Тип <> Неопределено Тогда
			Если Тип = "Соответствие" Тогда
				ОписаниеТипа = Новый ОписаниеТипов();
			Иначе
				ОписаниеТипа = ОписаниеТипаКолонки(Колонка["Type"]);
			КонецЕсли;
		КонецЕсли;
		Рек = Новый РеквизитФормы(Колонка["Name"], ОписаниеТипа, ИмяТаблицы);
		Реквизиты.Добавить(Рек);
		Таблица.Колонки.Добавить(Колонка["Name"], ОписаниеТипа);
		// Добавляем 1 раз реквизит "ЗагрузитьЕще"
		Если get_prop(Колонка, "More") = Истина Тогда
			СоздатьРеквизитТаблицыФормыЗагрузитьЕще(Таблица, ИмяТаблицы, Реквизиты);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты)
	Рек = Новый РеквизитФормы(ИмяКолонки, ТипКолонки, ИмяТаблицы);
	Реквизиты.Добавить(Рек);
	Таблица.Колонки.Добавить(ИмяКолонки, ТипКолонки); 
КонецПроцедуры

Процедура СоздатьРеквизитТаблицыФормыЗагрузитьЕще(Таблица, ИмяТаблицы, Реквизиты)
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки());
	НадоДобавитьЗагрузитьЕще = Истина;
	Для Каждого Рек Из Реквизиты Цикл
		Если Рек.Имя = "ЗагрузитьЕще" Тогда
			НадоДобавитьЗагрузитьЕще = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НадоДобавитьЗагрузитьЕще Тогда
		Рек = Новый РеквизитФормы("ЗагрузитьЕще", ОписаниеТипаСтрока, ИмяТаблицы);
		Реквизиты.Добавить(Рек);
		Таблица.Колонки.Добавить("ЗагрузитьЕще", ОписаниеТипаСтрока);
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьРеквизитыТаблицыФормыПоШаблону(ШаблонКолонки, Таблица, Колонка, ИмяТаблицы, Реквизиты)
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки());
	// Столбец. Иконка
	Если ШаблонКолонки = "column_icon" Тогда
		ТипКолонки = Новый ОписаниеТипов("Число");
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, Колонка["NAME"], ТипКолонки, ИмяТаблицы, Реквизиты);
	// Столбец.
	ИначеЕсли ШаблонКолонки = "column_default" Тогда
		ТипКолонки = ОписаниеТипаСтрока;
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, Колонка["NAME"], ТипКолонки, ИмяТаблицы, Реквизиты);
		// Добавляем 1 раз реквизит "ЗагрузитьЕще"
		Если get_prop(Колонка, "MORE_LOAD") = Истина Тогда
			СоздатьРеквизитТаблицыФормыЗагрузитьЕще(Таблица, ИмяТаблицы, Реквизиты);
		КонецЕсли;
	// Столбец. Дата и номер
	ИначеЕсли ШаблонКолонки = "сolumn_date_number" Тогда
		ТипКолонки = ОписаниеТипаСтрока;
		Колонка["NAME"] = "_ДатаНомер_";
		ИмяКолонки = Колонка["NAME"] + "_Дата_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		ИмяКолонки = Колонка["NAME"] + "_Номер_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
	// Столбец. Документ КЭДО
	ИначеЕсли ШаблонКолонки = "column_document_kedo" Тогда
		ТипКолонки = ОписаниеТипаСтрока;
		Колонка["NAME"] = "_ДокументКЕДО_";
		ИмяКолонки = Колонка["NAME"] + "_Тип_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		ИмяКолонки = Колонка["NAME"] + "_ФИО_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		ИмяКолонки = Колонка["NAME"] + "_Должность_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		ИмяКолонки = Колонка["NAME"] + "_Организация_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		ИмяКолонки = Колонка["NAME"] + "_Инфо_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		ИмяКолонки = Колонка["NAME"] + "_Вложения_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		ИмяКолонки = Колонка["NAME"] + "_Этап_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
	// Столбец. Сотрудник
	ИначеЕсли ШаблонКолонки = "сolumn_employee" Тогда
		ТипКолонки = ОписаниеТипаСтрока;
		Колонка["NAME"] = "_Сотрудник_";
		// Организация
		ИмяКолонки = Колонка["NAME"] + "_Организация_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		// Департамент
		ИмяКолонки = Колонка["NAME"] + "_Департамент_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		// ФИО
		ИмяКолонки = Колонка["NAME"] + "_ФИО_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		// Телефон
		ИмяКолонки = Колонка["NAME"] + "_Телефон_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
		// Должность
		ИмяКолонки = Колонка["NAME"] + "_Должность_";
		СоздатьРеквизитТаблицыФормыИКолонку(Таблица, ИмяКолонки, ТипКолонки, ИмяТаблицы, Реквизиты);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьСписокНаСервере(Данные)
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	ТабПоле = ЭлемФормы[ИмяТаблицы];
	Если ИмяТаблицы = "ПлоскийСписок" Тогда
		Таблица = ДанныеФормыВЗначение(ЭтаФорма[ИмяТаблицы], Тип("ТаблицаЗначений"));
		ЗаполнитьДанныеПлоскогоСписка(Таблица, Данные);
	Иначе
		Таблица = ДанныеФормыВЗначение(ЭтаФорма[ИмяТаблицы], Тип("ДеревоЗначений"));
		ЗаполнитьДанныеИерархическогоСписка(Таблица, Данные);	
	КонецЕсли;
	ЗначениеВДанныеФормы(Таблица, ЭтаФорма[ИмяТаблицы]);
	ТабПоле.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Фильтр) Экспорт
	Данные = ПолучитьДанныеСписка(Фильтр);
	ОбновитьСписокНаСервере(Данные);	
КонецПроцедуры

#Область include_core_base_ГлавноеОкно_ПлоскийСписокУФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_ИерархическийСписокУФ
#КонецОбласти

#Область include_core_base_ГлавноеОкно_Список
#КонецОбласти

