
Процедура ЗаполнитьФильтрЧипсы(ЭлемФильтр)
	Лево = 1;
	Для Каждого BUTTON Из ЭлемФильтр["BUTTONS"] Цикл
		ИмяЭлемента = ЭлемФильтр["NAME"] + "_" + BUTTON["KEY"];
		Если Не ДанныеФильтра.Значения.Свойство(ИмяЭлемента) Тогда 
			ДанныеФильтра.Значения.Вставить(ИмяЭлемента, BUTTON["DEFAULT_VALUE"]);
		КонецЕсли;
				
		ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
		ЭлемПанельЧипсы = ЭлемФормы["Чипсы"+ТекущийРаздел["Шаблон"]];
		Элем = ЭлемФормы.Найти(ИмяЭлемента);
		Если Элем = Неопределено Тогда
			Элем = ЭлемФормы.Добавить(Тип("Кнопка"), ИмяЭлемента, Истина, ЭлемПанельЧипсы);
		КонецЕсли;
		УстановитьДействиеНаЭлемент(Элем, "Нажатие", "ЧипсНажатие");
		Элем.Заголовок = BUTTON["TITLE"];
		Элем.Видимость = Истина;
		УстановитьЦветЧипса(Элем, ДанныеФильтра.Значения[ИмяЭлемента]);
		Элем.Ширина = Макс(СтрДлина(BUTTON["TITLE"]), 10);
		Элем.Лево = Лево;
		Элем.Верх = 2;
		Элем.Высота = 25;
		Элем.Ширина = Макс(СтрДлина(BUTTON["TITLE"])*9, 33);
		Лево = Лево + Элем.Ширина + 5;
	КонецЦикла;
	СтараяШирина = ЭлемПанельЧипсы.Ширина;
	ЭлемПанельЧипсы.Ширина = Лево-2;
	ЭлемПанельЧипсы.Лево = ЭлемПанельЧипсы.Лево + СтараяШирина - Лево+2;
КонецПроцедуры

Процедура УстановитьЦветЧипса(ЭлемЧипс, ЗначениеФильтра)
	Если ЗначениеФильтра = Истина Тогда
		ЭлемЧипс.ЦветФонаКнопки = Новый Цвет(225, 225, 225);
		ЭлемЧипс.ЦветТекстаКнопки = Новый Цвет(0, 0, 0);
		ЭлемЧипс.ЦветРамки = Новый Цвет(225, 225, 225);	
		ЭлемЧипс.Шрифт = Новый Шрифт("Tahoma", 10, Истина,, Ложь);
	Иначе
		ЭлемЧипс.ЦветФонаКнопки = Новый Цвет(245, 245, 245);
		ЭлемЧипс.ЦветТекстаКнопки = Новый Цвет(101, 108, 135);
		ЭлемЧипс.ЦветРамки = Новый Цвет(245, 245, 245);
		ЭлемЧипс.Шрифт = Новый Шрифт("Tahoma", 10, Ложь,, Ложь);
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьВидимостьПанелиЧипсы(ПоказыватьЧипсы)
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемПанельЧипсы = ЭлемФормы["Чипсы"+ТекущийРаздел["Шаблон"]];
	ЭлемСписка = ЭлемФормы[ТекущийРаздел["Шаблон"]];
	Если ПоказыватьЧипсы Тогда
		ЭлемПанельЧипсы.Видимость = Истина;
		ЭлемСписка.Верх = 79;
	Иначе
		ЭлемПанельЧипсы.Видимость = Ложь;
		ЭлемСписка.Верх = 50;
	КонецЕсли;
КонецПроцедуры

