
Процедура ЗаполнитьФильтрЧипсы(ЭлемФильтр)
	Для Каждого BUTTON Из ЭлемФильтр["BUTTONS"] Цикл
		ИмяЭлемента = ЭлемФильтр["NAME"] + "_" + BUTTON["KEY"];
		Если Не ДанныеФильтра.Значения.Свойство(ИмяЭлемента) Тогда 
			ДанныеФильтра.Значения.Вставить(ИмяЭлемента, BUTTON["DEFAULT_VALUE"]);
		КонецЕсли;
				
		ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
		ЭлемПанельЧипсы = ЭлемФормы["Чипсы"+ТекущийРаздел["Шаблон"]];
		Элем = ЭлемФормы.Найти(ИмяЭлемента);
		Если Элем = Неопределено Тогда
			Элем = ДобавитьЭлементФормы(ИмяЭлемента, Тип("КнопкаФормы"), ЭлемПанельЧипсы, Истина);
			Элем.Фигура = ФигураКнопки.Овал;
			КомандаКнопки = Команды.Найти(ИмяЭлемента);
			Если КомандаКнопки = Неопределено Тогда
				КомандаКнопки = Команды.Добавить(ИмяЭлемента);
				КомандаКнопки.Заголовок = BUTTON["TITLE"];
				КомандаКнопки.Действие  = "ЧипсНажатие";
			КонецЕсли;
			Элем.ИмяКоманды = КомандаКнопки["Имя"];
		КонецЕсли;
		Элем.Заголовок = BUTTON["TITLE"];
		Элем.Видимость = Истина;
		УстановитьЦветЧипса(Элем, ДанныеФильтра.Значения[ИмяЭлемента]);
		Элем.Ширина = Макс(СтрДлина(BUTTON["TITLE"])+2, 10);
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьЦветЧипса(ЭлемЧипс, ЗначениеФильтра)
	Если ЗначениеФильтра = Истина Тогда
		ЭлемЧипс.ЦветФона = Новый Цвет(225, 225, 225);
		ЭлемЧипс.ЦветТекста = Новый Цвет(0, 0, 0);
		ЭлемЧипс.ЦветРамки = Новый Цвет(225, 225, 225);	
		ЭлемЧипс.Шрифт = Новый Шрифт("Tahoma", 10, Истина,, Ложь);
	Иначе
		ЭлемЧипс.ЦветФона = Новый Цвет(245, 245, 245);
		ЭлемЧипс.ЦветТекста = Новый Цвет(101, 108, 135);
		ЭлемЧипс.ЦветРамки = Новый Цвет(245, 245, 245);
		ЭлемЧипс.Шрифт = Новый Шрифт("Tahoma", 10, Ложь,, Ложь);
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьВидимостьПанелиЧипсы(ПоказыватьЧипсы)
КонецПроцедуры

