
Процедура ЗаполнитьЭлементФильтра(ЭлемОткуда, Куда, ТолькоНезаполненные = Ложь)
	// Обновляем всегда, либо только незаполненные
	Если НЕ ТолькоНезаполненные ИЛИ НЕ ЗначениеЗаполнено(Куда[ЭлемОткуда.Ключ]) Тогда
		Если ТипЗнч(Куда[ЭлемОткуда.Ключ]) = Тип("СписокЗначений") Тогда
			Если ТипЗнч(ЭлемОткуда.Значение) = Тип("СписокЗначений") Тогда
				Куда[ЭлемОткуда.Ключ].ЗагрузитьЗначения(ЭлемОткуда.Значение.ВыгрузитьЗначения());
			ИначеЕсли ТипЗнч(ЭлемОткуда.Значение) = Тип("Массив") Тогда
				Куда[ЭлемОткуда.Ключ].ЗагрузитьЗначения(ЭлемОткуда.Значение);
			Иначе
				Куда[ЭлемОткуда.Ключ].Добавить(ЭлемОткуда.Значение);
			КонецЕсли;
		Иначе
			Куда.Вставить(ЭлемОткуда.Ключ, ЭлемОткуда.Значение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьЭлементыФильтра(Откуда, Раздел, Куда, ТолькоНезаполненные = Ложь)
	Если get_prop(Откуда, Раздел) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Попытка
		Если НЕ ЗначениеЗаполнено(Откуда[Раздел]) Тогда
			Возврат;
		КонецЕсли;
		Для Каждого ЭлемОткуда Из Откуда[Раздел] Цикл
			Если get_prop(Куда, ЭлемОткуда.Ключ) <> Неопределено Тогда
				// Обновляем всегда, либо только незаполненные
				ЗаполнитьЭлементФильтра(ЭлемОткуда, Куда, ТолькоНезаполненные);
			КонецЕсли;
		КонецЦикла;
	Исключение
		Сообщить("Ошибка! Не удалось заполнить элементы фильтра из " + Раздел + ". " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Функция ЧислоЗначениеФильтраПоУмолчанию(ЭлемФильтр)
	ТипПоля = Новый ОписаниеТипов("Число");
	DEFAULT_VALUE = get_prop(ЭлемФильтр, "DEFAULT_VALUE", 0);
	ЗначениеПоУмолчанию = ТипПоля.ПривестиЗначение(DEFAULT_VALUE);
	Возврат ЗначениеПоУмолчанию; 
КонецФункции

&НаКлиенте
Функция СтрокаЗначениеФильтраПоУмолчанию(ЭлемФильтр)
	ТипПоля = Новый ОписаниеТипов("Строка");
	DEFAULT_VALUE = get_prop(ЭлемФильтр, "DEFAULT_VALUE", "");
	ЗначениеПоУмолчанию = ТипПоля.ПривестиЗначение(DEFAULT_VALUE);
	Возврат ЗначениеПоУмолчанию;	
КонецФункции

&НаКлиенте
Функция ПериодЗначениеФильтраПоУмолчанию(ЭлемФильтр)
	// BSLLS:DeprecatedCurrentDate-off
	ТекущаяДата = ТекущаяДата();
	// BSLLS:DeprecatedCurrentDate-on
	DEFAULT_VALUE = get_prop(ЭлемФильтр, "DEFAULT_VALUE", Неопределено);
	Если DEFAULT_VALUE = 10 Тогда
	 	НачалоПериода = НачалоГода(ТекущаяДата);
		КонецПериода = КонецГода(ТекущаяДата);
	ИначеЕсли DEFAULT_VALUE = 20 Тогда
	 	НачалоПериода = НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -6));
		КонецПериода = КонецМесяца(ТекущаяДата);
	ИначеЕсли DEFAULT_VALUE = 40 Тогда
		НачалоПериода = НачалоДня(ТекущаяДата);
		КонецПериода = КонецДня(ТекущаяДата);
	ИначеЕсли DEFAULT_VALUE = 0 Тогда	
		НачалоПериода = Дата(1,1,1,0,0,0);
		КонецПериода = Дата(1,1,1,0,0,0); 
	Иначе
		НачалоПериода = НачалоМесяца(ТекущаяДата);
		КонецПериода = КонецМесяца(ТекущаяДата);
	КонецЕсли;
	Возврат Новый Структура("НачалоПериода,КонецПериода", НачалоПериода, КонецПериода);
		
КонецФункции 

&НаКлиенте
Функция ПеречислениеЗначениеФильтраПоУмолчанию(ЭлемФильтр)
	DEFAULT_VALUE = get_prop(ЭлемФильтр, "DEFAULT_VALUE", Неопределено);
	Возврат DEFAULT_VALUE;		
КонецФункции  

Функция ПолучитьСсылкуПоИдИСНаСервере(Знач ИмяИС, Знач ИдИС) 
	Возврат МодульОбъекта().ПолучитьСсылкуПоИдИС(ИмяИС, ИдИС); 
КонецФункции


&НаКлиенте
Функция СформироватьИмяМетаданных(Тип, Имя)
	
	Если Тип = "Документы" Тогда 
		ТипМетаданных = "ДокументСсылка";
	ИначеЕсли Тип = "Справочники" Тогда
		ТипМетаданных = "СправочникСсылка";
	ИначеЕсли Тип = "Перечисления" Тогда
		ТипМетаданных = "ПеречислениеСсылка";
	Иначе
		ТипМетаданных = "";
	КонецЕсли;	
	
	ИмяТипа = ТипМетаданных + "." + Имя;
	
	Возврат ИмяТипа;
	
КонецФункции


&НаКлиенте
Функция ПолеСвязиЗначениеФильтраПоУмолчанию(ЭлемФильтр)
	DEFAULT_VALUE = get_prop(ЭлемФильтр, "DEFAULT_VALUE", Неопределено);
	ИмяИС = get_prop(DEFAULT_VALUE, "ИмяИС", Неопределено);		
	ИдИС = get_prop(DEFAULT_VALUE, "ИмяИС", Неопределено); 
	Попытка 
		ЗначениеПоУмолчанию = ПолучитьСсылкуПоИдИСНаСервере(ИмяИС, ИдИС);
	Исключение
		ЗначениеПоУмолчанию = Неопределено;
	КонецПопытки;	
	Если ЗначениеЗаполнено(ЗначениеПоУмолчанию) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;   
	ALGORITHM = get_prop(ЭлемФильтр, "ALGORITHM", Неопределено);
	Если ALGORITHM = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	
	ПараметрыКоманды = Новый Структура("algorithm, endpoint, params", ALGORITHM, "info");
	РезультатИни = BlocklyExecutor.LocalCalcIni(ПараметрыКоманды);
	Если РезультатИни["status"] = "error" Тогда
		Возврат Неопределено;
	КонецЕсли;
	Data = РезультатИни.data;
	ТипИс = get_prop(Data, "ext_sys_obj_type", "");
	ИмяИС = get_prop(Data, "ext_sys_obj_title", ""); 
	ИмяМетаданных = СформироватьИмяМетаданных(ТипИс, ИмяИС); 
	Попытка 
		ТипПоля = Новый ОписаниеТипов(ИмяМетаданных);
	   	ЗначениеПоУмолчанию = ТипПоля.ПривестиЗначение();
	Исключение 
		ЗначениеПоУмолчанию = Неопределено;
	КонецПопытки;	
	Возврат ЗначениеПоУмолчанию;	
КонецФункции

&НаКлиенте
Функция ЗначениеФильтраПоУмолчанию(ЭлемФильтр)
	TEMPLATE = get_prop(ЭлемФильтр, "TEMPLATE", Неопределено);
	ЗначениеПоУмолчанию = Неопределено;
	Если TEMPLATE = "filter_number" Тогда  
		ЗначениеПоУмолчанию = ЧислоЗначениеФильтраПоУмолчанию(ЭлемФильтр);			
	ИначеЕсли TEMPLATE = "filter_string" Тогда 
		ЗначениеПоУмолчанию = СтрокаЗначениеФильтраПоУмолчанию(ЭлемФильтр);			
	ИначеЕсли TEMPLATE = "filter_period" Тогда
		ЗначениеПоУмолчанию = ПериодЗначениеФильтраПоУмолчанию(ЭлемФильтр);			
	ИначеЕсли TEMPLATE = "filter_enumeration" Тогда
		ЗначениеПоУмолчанию = ПеречислениеЗначениеФильтраПоУмолчанию(ЭлемФильтр);			
	ИначеЕсли TEMPLATE = "filter_link" Тогда
		ЗначениеПоУмолчанию = ПолеСвязиЗначениеФильтраПоУмолчанию(ЭлемФильтр);			
	Иначе 
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;
КонецФункции

&НаСервере
Функция ФильтрСписка()
	Фильтр = ТекущийРаздел.ПараметрыОтображения["Filter"];
	Если Фильтр = Неопределено Тогда
		Фильтр = ТекущийРаздел.ПараметрыОтображения["FILTER"];
	КонецЕсли;	
	Возврат Фильтр;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьФильтр() Экспорт
	НастройкиРеестров = get_prop(context_params, "НастройкиРеестров");
	НастройкиТекущегоРеестра = get_prop(НастройкиРеестров, ТекущийРаздел["Идентификатор"]);
	ДанныеФильтра.Значения = Новый Структура;
	Если НастройкиТекущегоРеестра <> Неопределено Тогда 
		ДанныеФильтра.Значения = НастройкиТекущегоРеестра["Фильтр"];
	КонецЕсли;
	ПоказыватьЧипсы = Ложь;
	Фильтр = ФильтрСписка();
	Для Каждого ЭлемФильтр Из Фильтр Цикл
		ИмяФильтра = get_prop(ЭлемФильтр, "NAME", get_prop(ЭлемФильтр, "Name"));		
		ШаблонФильтра = get_prop(ЭлемФильтр, "TEMPLATE");
		Если ШаблонФильтра = "filter_chips" Тогда
			ЗаполнитьФильтрЧипсы(ЭлемФильтр);
			ПоказыватьЧипсы = Истина;
			Продолжить;
		КонецЕсли;
		Если ДанныеФильтра.Значения.Свойство(ИмяФильтра) Тогда 
			Продолжить;
		КонецЕсли;  
		Если ШаблонФильтра = Неопределено Тогда 
			//Заполним фильтр по старому шаблону
			ТипПоля = Новый ОписаниеТипов(ЭлемФильтр["ValueType"]);
			ДанныеФильтра.Значения.Вставить(ИмяФильтра, ТипПоля.ПривестиЗначение());
			Продолжить;
		КонецЕсли;	
		ЗначениеФильтраПоУмолчанию = ЗначениеФильтраПоУмолчанию(ЭлемФильтр);
		ДанныеФильтра.Значения.Вставить(ИмяФильтра, ЗначениеФильтраПоУмолчанию);

	КонецЦикла;
	УстановитьВидимостьПанелиЧипсы(ПоказыватьЧипсы);
	// Постоянный фильтр
	ЗаполнитьЭлементыФильтра(ТекущийРаздел, "CONST_FILTER", ДанныеФильтра.Значения);
	// Значения по-умолчанию
	Если НастройкиТекущегоРеестра = Неопределено Тогда 
		ЗаполнитьЭлементыФильтра(ТекущийРаздел, "FILTER", ДанныеФильтра.Значения);
		Если Найти(ЭтаФорма.ИмяФормы, "ДиалогВыбораИзСписка") > 0 Тогда
			ТекущийРаздел["FILTER"] = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ИзменитьЦветЧипса(ИмяЭлемента)
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ЭлемЧипс = ЭлемФормы[ИмяЭлемента];
	УстановитьЦветЧипса(ЭлемЧипс, ДанныеФильтра.Значения[ИмяЭлемента]);
КонецПроцедуры

&НаКлиенте
Процедура ЧипсНажатие(Элемент)
	ДанныеФильтра.Значения[Элемент.Имя] = Не ДанныеФильтра.Значения[Элемент.Имя];
	ИзменитьЦветЧипса(Элемент.Имя);
	ПрименитьФильтр();
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьФильтр() Экспорт
	НастройкиРеестров = get_prop(context_params, "НастройкиРеестров");
	Если НастройкиРеестров = Неопределено Тогда
		context_params.Вставить("НастройкиРеестров", Новый Соответствие());	
	КонецЕсли;
	НастройкиТекущегоРеестра = get_prop(context_params["НастройкиРеестров"],  ТекущийРаздел["Идентификатор"]);
	Если НастройкиТекущегоРеестра = Неопределено Тогда
		НастройкиТекущегоРеестра = Новый Соответствие();	
	КонецЕсли;
	НастройкиТекущегоРеестра.Вставить("Фильтр", ДанныеФильтра.Значения);
	context_params["НастройкиРеестров"].Вставить( ТекущийРаздел["Идентификатор"], НастройкиТекущегоРеестра);
	ЗаписатьНастройкиНаСервере();
	ИмяТаблицы = ТекущийРаздел["Шаблон"];
	ЭтаФорма[ИмяТаблицы].Очистить();
	ЭтаФорма.Страница = 0;
	ОбновитьСписок(ДанныеФильтра.Значения);
	ОбновитьПанельФильтра();
КонецПроцедуры

Функция ПредставлениПериода(ИмяФильтра, ИмяДатНач, ИмяДатКнц)
	ТипПериода = get_prop(ДанныеФильтра.Значения, ИмяФильтра, "");
	Если ТипПериода = "За период" Тогда  
		Возврат ПериодПрописью(ДанныеФильтра.Значения[ИмяДатНач], ДанныеФильтра.Значения[ИмяДатКнц]); 
	КонецЕсли;
	Возврат ТипПериода;	
КонецФункции

Функция ПредставлениеПеречисленияНаДату(ПараметрОтображения, ИмяФильтра);
	Для каждого Пункт Из ПараметрОтображения["ITEMS"] Цикл
		Если Пункт["VALUE"] = get_prop(ДанныеФильтра.Значения, ИмяФильтра) Тогда
			Возврат Пункт["TITLE"] + " " + Формат(get_prop(ДанныеФильтра.Значения, ИмяФильтра + "_Date"), "ДФ=""д ММММ гггг""");
		КонецЕсли;
	КонецЦикла;
	Возврат "";
КонецФункции

Функция ПредставлениеФильтраБезШаблона(ИмяФильтра, ФильтрыПериода)
	Если ИмяФильтра = "ФильтрПериод" Тогда
		Значение = ПредставлениПериода(ИмяФильтра, "ФильтрДатаНач", "ФильтрДатаКнц");
	ИначеЕсли ФильтрыПериода.Найти(ИмяФильтра) <> Неопределено Тогда 
		Возврат "";
	Иначе	
		Значение = get_prop(ДанныеФильтра.Значения, ИмяФильтра);
	КонецЕсли;
	Возврат Значение;
КонецФункции

Процедура ОбновитьПанельФильтра() Экспорт
	// Формирует строковое представление по всем установленным параметрам фильтра	
	ТекущееЗначениеФильтра="";
	ФильтрыПериода = Новый Массив;
	ФильтрыПериода.Добавить("ФильтрДатаНач");
	ФильтрыПериода.Добавить("ФильтрДатаКнц");
	
	Для Каждого ПараметрОтображения Из ДанныеФильтра.ПараметрыОтображения Цикл 
		Значение = "";
		TEMPLATE = get_prop(ПараметрОтображения, "TEMPLATE"); 
		ИмяФильтра = get_prop(ПараметрОтображения, "NAME");
		
		Если TEMPLATE = "filter_period" Тогда
			Значение = ПредставлениПериода(ИмяФильтра + "_Период", ИмяФильтра + "_From", ИмяФильтра + "_To");
		ИначеЕсли TEMPLATE = "filter_chips" Тогда
			Продолжить;
		ИначеЕсли TEMPLATE = "filter_enumeration_with_date" Тогда
			Значение = ПредставлениеПеречисленияНаДату(ПараметрОтображения, ИмяФильтра);
		ИначеЕсли ЗначениеЗаполнено(TEMPLATE) Тогда
			Значение = get_prop(ДанныеФильтра.Значения, ИмяФильтра);
		Иначе // старые фильтры, удалить после изменения инишек
			ИмяФильтра = get_prop(ПараметрОтображения, "Name");
			Значение = ПредставлениеФильтраБезШаблона(ИмяФильтра, ФильтрыПериода);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Продолжить;
		КонецЕсли;
		ТекущееЗначениеФильтра = ТекущееЗначениеФильтра + ", " + Значение;	
	КонецЦикла;
	
	Если Лев(ТекущееЗначениеФильтра, 2) = ", " Тогда
		ТекущееЗначениеФильтра = Сред(ТекущееЗначениеФильтра,3);
	КонецЕсли;
	
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	ИмяКнопкиОчисткиФильтра = "КнопкаОчиститьФильтр" + ТекущийРаздел["Шаблон"];
	Если ТекущееЗначениеФильтра="" тогда
		ЭлемФормы[ИмяКнопкиОчисткиФильтра].Видимость = Ложь;		
	Иначе
		ЭлемФормы[ИмяКнопкиОчисткиФильтра].Видимость = Истина;		
	КонецЕсли;
КонецПроцедуры

Функция ПериодПрописью(ДатНач, ДатКнц)
	Если Год(ДатНач)<>Год(ДатКнц) Тогда
		Возврат Формат(ДатНач, "ДФ=""д ММММ гггг""") + " - " + Формат(ДатКнц, "ДФ=""д ММММ гггг""");
	Иначе
		Если Месяц(ДатНач)<>Месяц(ДатКнц) Тогда
			Возврат Формат(ДатНач, "ДФ=""д ММММ""") + " - " + Формат(ДатКнц, "ДФ=""д ММММ""") + " " + Формат(Год(ДатКнц),"ЧГ=0");	
		Иначе
			Если ДатНач=ДатКнц Тогда
				Возврат Формат(ДатКнц, "ДФ=""д ММММ гггг""")
			Иначе
				Возврат строка(День(ДатНач)) + " - " + Формат(ДатКнц, "ДФ=""д ММММ""") + " "+ Формат(Год(ДатКнц),"ЧГ=0");	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОчиститьФильтр(Элемент)
	// Устанавливает фильтр по умолчанию для текущего раздела	
	Если ДанныеФильтра.Значения.Свойство("ФильтрПериод") Тогда
		ДанныеФильтра.Значения.ФильтрПериод = "За весь период";
	КонецЕсли;
	Для Каждого ЭлемФильтр Из ДанныеФильтра.Значения Цикл
		Если ЭлемФильтр.Ключ = "ФильтрПериод" Тогда
			Продолжить;
		Иначе
			Если ЗначениеЗаполнено(ЭлемФильтр.Значение) Тогда	
				Типы = Новый Массив;
				Типы.Добавить(ТипЗнч(ЭлемФильтр.Значение));
				ОписаниеТипа = Новый ОписаниеТипов(Типы);
				ДанныеФильтра.Значения[ЭлемФильтр.Ключ] = ОписаниеТипа.ПривестиЗначение();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ОчиститьЧипсы();
	
	ПрименитьФильтр();
КонецПроцедуры

Процедура ОчиститьЧипсы()
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	Фильтры = ФильтрСписка();
	Для Каждого ЭлемФильтр Из Фильтры Цикл
		ШаблонФильтра = get_prop(ЭлемФильтр, "TEMPLATE");
		Если ШаблонФильтра = "filter_chips" Тогда
			Для Каждого BUTTON Из ЭлемФильтр["BUTTONS"] Цикл
				ИмяЭлемента = ЭлемФильтр["NAME"] + "_" + BUTTON["KEY"];
				ДанныеФильтра.Значения.Вставить(ИмяЭлемента, BUTTON["DEFAULT_VALUE"]);
				Элем = ЭлемФормы.Найти(ИмяЭлемента);
				УстановитьЦветЧипса(Элем, ДанныеФильтра.Значения[ИмяЭлемента]);
			КонецЦикла;	
			Продолжить;
		КонецЕсли;
    КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОткрыть(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Форма = ФормаОсновнойОбработки("Фильтр", КэшФорм.ПутьКФормам, , ЭтаФорма);
	Форма.ДанныеФильтра = ДанныеФильтра; 
	Если НЕ Форма.Открыта() Тогда
		Форма.Открыть();
	Иначе
		Форма.Активизировать();	
	КонецЕсли;
КонецПроцедуры


Процедура ОчиститьПанельФильтра(ПараметрыОтображения) Экспорт
	Если ПараметрыОтображения <> Неопределено Тогда
		СкрытьКнопкиФильтра(ПараметрыОтображения["Filter"])
	КонецЕсли;
КонецПроцедуры

Процедура СкрытьКнопкиФильтра(Фильтры) Экспорт
	ЭлемФормы = ПолучитьЭлементыФормыНаСервере();
	Фильтры = ФильтрСписка();
	Для Каждого ЭлемФильтр Из Фильтры Цикл
		ШаблонФильтра = get_prop(ЭлемФильтр, "TEMPLATE");
		Если ШаблонФильтра = "filter_chips" Тогда
			Для Каждого BUTTON Из ЭлемФильтр["BUTTONS"] Цикл
				ИмяЭлемента = ЭлемФильтр["NAME"] + "_" + BUTTON["KEY"];
				Элем = ЭлемФормы.Найти(ИмяЭлемента);
				Если Элем <> Неопределено Тогда
					ЭлемФормы.Удалить(Элем);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

