//DynamicDirective

// Функция - Проверка типа в упрощенном виде. Если объект не SABY, то должен совпадать тип и ТипПроверитьВх.
//
// Параметры:
//  ОбъектSABY		 - ОбъектSABY	 - Структура, с преопределенными полями
//  ТипПроверитьВх	 - Строка, ОбъектSABY	 - Имя типа SABY/ ОбъектSABY для сравнения
// 
// Возвращаемое значение:
//   - 
//

Функция ОбъектSABY_ЭтоТип(ОбъектSABY, ТипПроверитьВх) Экспорт 
	
	ЭтоОбъектSABY1 = яОбъектSABY_ЭтоОбъект(ОбъектSABY);
	ЭтоОбъектSABY2 = яОбъектSABY_ЭтоОбъект(ТипПроверитьВх);
	
	Если ЭтоОбъектSABY1 Тогда
		
		Если ЭтоОбъектSABY2 Тогда
		
			ТипПроверитьЗначение = ОбъектSABY_Получить(ТипПроверитьВх, "Тип");
			
		Иначе
			
			ТипПроверитьЗначение = НРег(ТипПроверитьВх);
			
		КонецЕсли;
		
		Возврат яОбъектSABY_СравнитьТипСтрокой(ОбъектSABY, ТипПроверитьЗначение);
			
	ИначеЕсли ЭтоОбъектSABY2 Тогда
		
		// Объект сравнения - тип SABY, но основной - нет.
		Возврат Ложь;
		
	Иначе
		
		Возврат ТипЗнч(ОбъектSABY) = ТипПроверитьВх;
		
	КонецЕсли;
	
КонецФункции

//DynamicDirective

Процедура ОбъектSABY_Установить(ОбъектSABY, КлючДобавить = Неопределено, ЗначениеДобавить = Неопределено) Экспорт 
	
	Если КлючДобавить = "Тип" Тогда
		
		Если	ЗначениеДобавить = Неопределено
			Или	ОбъектSABY_ЭтоТип(ОбъектSABY, ЗначениеДобавить) Тогда
			
			Возврат;
			
		КонецЕсли;
		ТипУстановить = ЗначениеДобавить;
		Если ОбъектSABY_ЭтоТип(ЗначениеДобавить, "ОбъектSaby") Тогда
			
			ТипУстановить = ОбъектSABY_Получить(ЗначениеДобавить, "Тип");
			
		КонецЕсли;
		ОбъектSABY._тип = НРег(ТипУстановить) + Символы.ПС + ОбъектSABY._тип;
		Возврат;
		
	ИначеЕсли	ОбъектSABY.Свойство(КлючДобавить) Тогда
		
		// Установить свойство, если такое есть на экземпляре. Типы не проверяем.
		ОбъектSABY[КлючДобавить] = ЗначениеДобавить;

	Иначе

		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

//DynamicDirective

// Функция - Базовый get-метод
//
// Параметры:
//  ОбъектSABY	 		 - ОбъектSABY	 - Структура, с преопределенными полями
//  КлючПолучить		 - Строка				 - Ключ свойства
// 
// Возвращаемое значение:
//  Произвольный - свойство класса
//
Функция ОбъектSABY_Получить(ОбъектSABY, КлючПолучить) Экспорт 
    Перем РезультатПолучить;
	
	ТипПроверить = НРег(КлючПолучить);
	Если ТипПроверить = "тип" Тогда
		
		РезультатПолучить = СтрПолучитьСтроку(ОбъектSABY._тип, 1);
		
	ИначеЕсли ТипПроверить = "ид" Тогда
		
		РезультатПолучить = ОбъектSABY._ид;
		
	ИначеЕсли ТипПроверить = "свойства" Тогда
		
		РезультатПолучить = яОбъектSABY_СтатичныйМетод_Свойства();
		
	ИначеЕсли Лев(ТипПроверить, 1) = "_" Тогда
		
		ВызватьИсключение "Запрещено обращение к приватным свойствам объекта!";
		
	Иначе
		
		ОбъектSABY.Свойство(КлючПолучить, РезультатПолучить);
		
	КонецЕсли;
	
	Возврат РезультатПолучить;
	
КонецФункции	
