
//DynamicDirective

// Функция - базовая выгрузка объекта.
//
// Параметры:
//  ОбъектSABY				 - ОбъектSABY			 - Структура, с преопределенными полями
//  ФорматВыгрузкиОбъекта	 - Неопределено, Строка	 - варианты выгрузки
// 
// Возвращаемое значение:
//  Структура - выгруженный объект
//
Функция ОбъектSABY_Выгрузить(ОбъектSABY, ФорматВыгрузкиОбъекта = Неопределено) Экспорт
	
	Если ФорматВыгрузкиОбъекта = Неопределено Тогда
		
		КопияДляВыгрузки = НовыйКопияОбъекта(ОбъектSABY);
		КопияДляВыгрузки.Удалить("_ид");
		КопияДляВыгрузки.Удалить("_тип");
		Возврат КопияДляВыгрузки;
		
	Иначе
		
		// Поверхностная копия объекта
		Возврат НовыйКопияОбъекта(ОбъектSABY);
		
	КонецЕсли;
	
КонецФункции	

//DynamicDirective

// Функция - Объект SABY скопировать
//
// Параметры:
//  ОбъектSABY		 - ОбъектSABY				 - текущий объект
//  ДопПараметры	 - Неопределено, Структура	 - расширение
// 
// Возвращаемое значение:
//  Структура - поверхностная копия объекта Saby
//
Функция ОбъектSABY_Скопировать(ОбъектSABY, ДопПараметры = Неопределено) Экспорт 
	
	НовыйОбъектSABY = НовыйКопияОбъекта(ОбъектSABY);
	ОбъектSABY_Установить(НовыйОбъектSABY, "Идентификатор");
	Возврат НовыйОбъектSABY;
	
КонецФункции

//DynamicDirective

// Функция - Проверка типа в упрощенном виде. Если объект не SABY, то должен совпадать тип и ТипПроверитьВх.
//
// Параметры:
//  ОбъектSABY		 - ОбъектSABY			 - Структура, с преопределенными полями
//  ТипПроверитьВх	 - Строка, ОбъектSABY	 - Имя типа SABY/ ОбъектSABY для сравнения
// 
// Возвращаемое значение:
//  Булево - результат проверки того, является ли текущий объект типом проверки
//
Функция ОбъектSABY_ЭтоТип(ОбъектSABY, ТипПроверитьВх) Экспорт 
	
	ЭтоОбъектSABY1 = яОбъектSABY_ЭтоОбъект(ОбъектSABY);
	
	Если ЭтоОбъектSABY1 Тогда
		
		Если яОбъектSABY_ЭтоОбъект(ТипПроверитьВх) Тогда
		
			ТипПроверитьЗначение = ОбъектSABY_Получить(ТипПроверитьВх, "Тип");
			
		Иначе
			
			ТипПроверитьЗначение = НРег(ТипПроверитьВх);
			
		КонецЕсли;
		
		Возврат яОбъектSABY_СравнитьТипСтрокой(ОбъектSABY, ТипПроверитьЗначение);
			
	Иначе
		
		// Объект сравнения - не тип SABY.
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

//DynamicDirective

// Процедура - Объект SABY установить
//
// Параметры:
//  ОбъектSABY		 - ОбъектSABY			 - текущий объект
//  КлючДобавить	 - Неопределено, Строка	 - ключ устанавливаемого свойства. Если Строка, то должен быть оформлен по формату ключа Структуры
//  ЗначениеДобавить - Произвольный			 - устанавливаемое значение
//
Процедура ОбъектSABY_Установить(ОбъектSABY, КлючДобавить = Неопределено, ЗначениеДобавить = Неопределено) Экспорт 
	
	Если КлючДобавить = "Тип" Тогда
		
		Если	ЗначениеДобавить = Неопределено
			Или	ОбъектSABY_ЭтоТип(ОбъектSABY, ЗначениеДобавить) Тогда
			
			Возврат;
			
		КонецЕсли;
		ТипУстановить = ЗначениеДобавить;
		Если ОбъектSABY_ЭтоТип(ЗначениеДобавить, "ОбъектSaby") Тогда
			
			ТипУстановить = ОбъектSABY_Получить(ЗначениеДобавить, "Тип");
			
		КонецЕсли;
		ОбъектSABY._тип = НРег(ТипУстановить) + Символы.ПС + ОбъектSABY._тип;
		Возврат;
		
	ИначеЕсли	КлючДобавить = "Идентификатор" Тогда
		
		Если ЗначениеДобавить = Неопределено Тогда
			
			ОбъектSABY._ид = Новый УникальныйИдентификатор;
			
		Иначе
			
			ОбъектSABY._ид = Новый УникальныйИдентификатор(ЗначениеДобавить);
			
		КонецЕсли;
		
	ИначеЕсли	ОбъектSABY.Свойство(КлючДобавить) Тогда
		
		// Установить свойство, если такое есть на экземпляре. Типы не проверяем.
		ОбъектSABY[КлючДобавить] = ЗначениеДобавить;

	Иначе

		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

//DynamicDirective

// Функция - Базовый get-метод
//
// Параметры:
//  ОбъектSABY	 		 - ОбъектSABY	 - Структура, с преопределенными полями
//  КлючПолучить		 - Строка				 - Ключ свойства
// 
// Возвращаемое значение:
//  Произвольный - свойство класса
//
Функция ОбъектSABY_Получить(ОбъектSABY, КлючПолучить) Экспорт 
    Перем РезультатПолучить;
	
	ТипПроверить = НРег(КлючПолучить);
	Если ТипПроверить = "тип" Тогда
		
		РезультатПолучить = СтрПолучитьСтроку(ОбъектSABY._тип, 1);
		
	ИначеЕсли ТипПроверить = "ид" Тогда
		
		РезультатПолучить = ОбъектSABY._ид;
		
	ИначеЕсли ТипПроверить = "свойства" Тогда
		
		РезультатПолучить = яОбъектSABY_СтатичныйМетод_Свойства();
		
	ИначеЕсли Лев(ТипПроверить, 1) = "_" Тогда
		
		ВызватьИсключение "Запрещено обращение к приватным свойствам объекта!";
		
	Иначе
		
		ОбъектSABY.Свойство(КлючПолучить, РезультатПолучить);
		
	КонецЕсли;
	
	Возврат РезультатПолучить;
	
КонецФункции	

