
//DynamicDirective

// Функция - конструктор прикладного объекта SABY
//
// Параметры:
//  ВходящиеПараметры	 - Строка	 - тип наследника от базового объекта
//  ДопПараметры	 - Структура	 - дополнительные параметры
// 
// Возвращаемое значение:
//  ПрикладнойОбъектSABY - Структура с предопределенными свойствами
//
Функция НовыйОбъектSABY(ВходящиеПараметры = Неопределено, ДопПараметры = Неопределено) Экспорт 
	Перем ТипНовогоОбъекта, НаборСвойствОбъекта;
	
	ОбъектSABY = Новый Структура("_тип,_ид", "ОбъектSABY", Новый УникальныйИдентификатор);
	
	Если ОбъектSABY_ЭтоТип(ВходящиеПараметры, ОбъектSABY._тип) Тогда
		
		// Создание от другого объекта
		НаборСвойствОбъекта	= ВходящиеПараметры;
		ОбъектSABY._тип		= ВходящиеПараметры._тип;
	
	ИначеЕсли ТипЗнч(ВходящиеПараметры) = Тип("ФиксированнаяСтруктура") Тогда
		
		ВходящиеПараметры.Свойство("Тип", 		ТипНовогоОбъекта);
		ВходящиеПараметры.Свойство("Свойства",	НаборСвойствОбъекта);
		
	Иначе
		
		ТипНовогоОбъекта = ВходящиеПараметры;
		
	КонецЕсли;
	
	Если Не ТипНовогоОбъекта = Неопределено Тогда
		
		ОбъектSABY_Установить(ОбъектSABY, "Тип", ТипНовогоОбъекта);
		
	КонецЕсли;

	Если НаборСвойствОбъекта = Неопределено Тогда
		Возврат ОбъектSABY;
	КонецЕсли;
	
	Если ТипЗнч(НаборСвойствОбъекта) = Тип("Строка") Тогда

		НаборСвойствОбъекта = СтрЗаменить(НаборСвойствОбъекта, ",", Символы.ПС);
		
		Для СчетчикСтрокСвойств = 1 по СтрЧислоСтрок(НаборСвойствОбъекта) Цикл
			
			Свойство = СтрПолучитьСтроку(НаборСвойствОбъекта, СчетчикСтрокСвойств);
			Если Лев(Свойство, 1) = "_" Тогда

				Продолжить;

			КонецЕсли;
			
			ОбъектSABY.Вставить(Свойство);
			
		КонецЦикла;

		Возврат ОбъектSABY;
		
	КонецЕсли;
		
	Для Каждого Свойство Из НаборСвойствОбъекта Цикл
		
		Если Лев(Свойство.Ключ, 1) = "_" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ОбъектSABY.Вставить(Свойство.Ключ);
		
	КонецЦикла;
	
	Возврат ОбъектSABY;
	
КонецФункции

Функция ОбъектSABY_УстановитьТип(ОбъектSABY, Тип)

	ОбъектSABY._тип	= ОбъектSABY._тип + Символы.ПС + Тип;
	Возврат ОбъектSABY;
	
КонецФункции

Процедура ОбъектSABY_ЗарегистрироватьМетоды(ОбъектSABY, Методы)

	методы_класса = Неопределено;

	Если Не ОбъектSABY.Свойство("_методы", методы_класса) Тогда
		ОбъектSABY.Вставить("_методы", Методы);
		Возврат;
	КонецЕсли;

	Для Каждого новый_метод Из Методы Цикл

		Если методы_класса.Свойство(новый_метод.Ключ) Тогда
			ОбъектSABY._методы[новый_метод.Ключ] = новый_метод.Значение;
		Иначе
			ОбъектSABY._методы.Вставить(новый_метод.Ключ, новый_метод.Значение);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ОбъектSABY_ПолучитьРеализациюПотомка(ОбъектSABY, метод)

	Значение = Неопределено;

	Если ОбъектSABY.Свойство("_методы") И ОбъектSABY._методы.Свойство(метод, Значение) Тогда
		Возврат Значение + "_" + метод;
	КонецЕсли;

	Возврат Значение;

КонецФункции

#Область include_core_base_Классы_ОбъектSABY_АПИ
#КонецОбласти

#Область include_core_base_Классы_ОбъектSABY_ПриватныеМетоды
#КонецОбласти
